{
  "method_name": "describe_limits",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/dynamodb/client/describe_limits.html",
  "description": "Returns the current provisioned-capacity quotas for your Amazon Web Services account in a Region, both for the Region as a whole and for any one DynamoDB table that you create there. When you establish an Amazon Web Services account, the account has initial quotas on the maximum read capacity units and write capacity units that you can provision across all of your DynamoDB tables in a given Region. Also, there are per-table quotas that apply when you create a table there. For more information, see Service, Account, and Table Quotas page in the Amazon DynamoDB Developer Guide. Although you can increase these quotas by filing a case at Amazon Web Services Support Center, obtaining the increase is not instantaneous. The DescribeLimits action lets you write code to compare the capacity you are currently using to those quotas imposed by your account so that you have enough time to apply for an increase before you hit a quota. For example, you could use one of the Amazon Web Services SDKs to do the following: This will let you see whether you are getting close to your account-level quotas. The per-table quotas apply only when you are creating a new table. They restrict the sum of the provisioned capacity of the new table itself and all its global secondary indexes. For existing tables and their GSIs, DynamoDB doesn't let you increase provisioned capacity extremely rapidly, but the only quota that applies is that the aggregate provisioned capacity over all your tables and GSIs cannot exceed either of the per-account quotas. The DescribeLimits Request element has no content.",
  "parameters": [],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "AccountMaxReadCapacityUnits",
          "type": "integer",
          "description": "The maximum total read capacity units that your account allows you to provision across all of your tables in this Region.",
          "nested_items": []
        },
        {
          "name": "AccountMaxWriteCapacityUnits",
          "type": "integer",
          "description": "The maximum total write capacity units that your account allows you to provision across all of your tables in this Region.",
          "nested_items": []
        },
        {
          "name": "TableMaxReadCapacityUnits",
          "type": "integer",
          "description": "The maximum read capacity units that your account allows you to provision for a new table that you are creating in this Region, including the read capacity units provisioned for its global secondary indexes (GSIs).",
          "nested_items": []
        },
        {
          "name": "TableMaxWriteCapacityUnits",
          "type": "integer",
          "description": "The maximum write capacity units that your account allows you to provision for a new table that you are creating in this Region, including the write capacity units provisioned for its global secondary indexes (GSIs).",
          "nested_items": []
        }
      ]
    }
  ]
}