{
  "method_name": "describe_continuous_backups",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/dynamodb/client/describe_continuous_backups.html",
  "description": "Checks the status of continuous backups and point in time recovery on the specified table. Continuous backups are ENABLED on all tables at table creation. If point in time recovery is enabled, PointInTimeRecoveryStatus will be set to ENABLED. After continuous backups and point in time recovery are enabled, you can restore to any point in time within EarliestRestorableDateTime and LatestRestorableDateTime. LatestRestorableDateTime is typically 5 minutes before the current time. You can restore your table to any point in time in the last 35 days. You can set the recovery period to any value between 1 and 35 days. You can call DescribeContinuousBackups at a maximum rate of 10 times per second.",
  "parameters": [
    {
      "name": "TableName",
      "type": "string",
      "required": true,
      "description": "Name of the table for which the customer wants to check the continuous backups and point in time recovery settings. You can also provide the Amazon Resource Name (ARN) of the table in this parameter.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ContinuousBackupsDescription",
          "type": "dict",
          "description": "Represents the continuous backups and point in time recovery settings on the table.",
          "nested_items": [
            {
              "name": "ContinuousBackupsStatus",
              "type": "string",
              "description": "ContinuousBackupsStatus can be one of the following states: ENABLED, DISABLED.",
              "nested_items": []
            },
            {
              "name": "PointInTimeRecoveryDescription",
              "type": "dict",
              "description": "The description of the point in time recovery settings applied to the table.",
              "nested_items": [
                {
                  "name": "PointInTimeRecoveryStatus",
                  "type": "string",
                  "description": "The current state of point in time recovery:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "ENABLED - Point in time recovery is enabled.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "DISABLED - Point in time recovery is disabled.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "RecoveryPeriodInDays",
                  "type": "integer",
                  "description": "The number of preceding days for which continuous backups are taken and maintained. Your table data is only recoverable to any point-in-time from within the configured recovery period. This parameter is optional.",
                  "nested_items": []
                },
                {
                  "name": "EarliestRestorableDateTime",
                  "type": "datetime",
                  "description": "Specifies the earliest point in time you can restore your table to. You can restore your table to any point in time during the last 35 days.",
                  "nested_items": []
                },
                {
                  "name": "LatestRestorableDateTime",
                  "type": "datetime",
                  "description": "LatestRestorableDateTime is typically 5 minutes before the current time.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}