{
  "method_name": "update_time_to_live",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/dynamodb/client/update_time_to_live.html",
  "description": "The UpdateTimeToLive method enables or disables Time to Live (TTL) for the specified table. A successful UpdateTimeToLive call returns the current TimeToLiveSpecification. It can take up to one hour for the change to fully process. Any additional UpdateTimeToLive calls for the same table during this one hour duration result in a ValidationException. TTL compares the current time in epoch time format to the time stored in the TTL attribute of an item. If the epoch time value stored in the attribute is less than the current time, the item is marked as expired and subsequently deleted. DynamoDB deletes expired items on a best-effort basis to ensure availability of throughput for other data operations. As items are deleted, they are removed from any local secondary index and global secondary index immediately in the same eventually consistent way as a standard delete operation. For more information, see Time To Live in the Amazon DynamoDB Developer Guide.",
  "parameters": [
    {
      "name": "TableName",
      "type": "string",
      "required": true,
      "description": "The name of the table to be configured. You can also provide the Amazon Resource Name (ARN) of the table in this parameter.",
      "nested_params": []
    },
    {
      "name": "TimeToLiveSpecification",
      "type": "dict",
      "required": true,
      "description": "Represents the settings used to enable or disable Time to Live for the specified table. Indicates whether TTL is to be enabled (true) or disabled (false) on the table. The name of the TTL attribute used to store the expiration time for items in the table.",
      "nested_params": [
        {
          "name": "Enabled",
          "type": "boolean",
          "required": false,
          "description": "Indicates whether TTL is to be enabled (true) or disabled (false) on the table.",
          "nested_params": []
        },
        {
          "name": "AttributeName",
          "type": "string",
          "required": false,
          "description": "The name of the TTL attribute used to store the expiration time for items in the table.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "TimeToLiveSpecification",
          "type": "dict",
          "description": "Represents the output of an UpdateTimeToLive operation.",
          "nested_items": [
            {
              "name": "Enabled",
              "type": "boolean",
              "description": "Indicates whether TTL is to be enabled (true) or disabled (false) on the table.",
              "nested_items": []
            },
            {
              "name": "AttributeName",
              "type": "string",
              "description": "The name of the TTL attribute used to store the expiration time for items in the table.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}