{
  "method_name": "associate_resource_types",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/config/client/associate_resource_types.html",
  "description": "Adds all resource types specified in the ResourceTypes list to the RecordingGroup of specified configuration recorder and includes those resource types when recording. For this operation, the specified configuration recorder must use a RecordingStrategy that is either INCLUSION_BY_RESOURCE_TYPES or EXCLUSION_BY_RESOURCE_TYPES.",
  "parameters": [
    {
      "name": "ConfigurationRecorderArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the specified configuration recorder.",
      "nested_params": []
    },
    {
      "name": "ResourceTypes",
      "type": "list",
      "required": true,
      "description": "The list of resource types you want to add to the recording group of the specified configuration recorder. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ConfigurationRecorder",
          "type": "dict",
          "description": "Records configuration changes to the resource types in scope.",
          "nested_items": [
            {
              "name": "arn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the specified configuration recorder.",
              "nested_items": []
            },
            {
              "name": "name",
              "type": "string",
              "description": "The name of the configuration recorder.",
              "nested_items": []
            },
            {
              "name": "roleARN",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the IAM role assumed by Config and used by the specified configuration recorder.",
              "nested_items": []
            },
            {
              "name": "recordingGroup",
              "type": "dict",
              "description": "Specifies which resource types are in scope for the configuration recorder to record.",
              "nested_items": [
                {
                  "name": "allSupported",
                  "type": "boolean",
                  "description": "Specifies whether Config records configuration changes for all supported resource types, excluding the global IAM resource types.",
                  "nested_items": []
                },
                {
                  "name": "includeGlobalResourceTypes",
                  "type": "boolean",
                  "description": "This option is a bundle which only applies to the global IAM resource types: IAM users, groups, roles, and customer managed policies. These global IAM resource types can only be recorded by Config in Regions where Config was available before February 2022. You cannot be record the global IAM resouce types in Regions supported by Config after February 2022. For a list of those Regions, see Recording Amazon Web Services Resources | Global Resources.",
                  "nested_items": []
                },
                {
                  "name": "resourceTypes",
                  "type": "list",
                  "description": "A comma-separated list that specifies which resource types Config records.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "exclusionByResourceTypes",
                  "type": "dict",
                  "description": "An object that specifies how Config excludes resource types from being recorded by the configuration recorder.",
                  "nested_items": [
                    {
                      "name": "resourceTypes",
                      "type": "list",
                      "description": "A comma-separated list of resource types to exclude from recording by the configuration recorder.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "recordingStrategy",
                  "type": "dict",
                  "description": "An object that specifies the recording strategy for the configuration recorder.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "If you set the useOnly field of RecordingStrategy to ALL_SUPPORTED_RESOURCE_TYPES, Config records configuration changes for all supported resource types, excluding the global IAM resource types. You also must set the allSupported field of RecordingGroup to true. When Config adds support for a new resource type, Config automatically starts recording resources of that type.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "If you set the useOnly field of RecordingStrategy to INCLUSION_BY_RESOURCE_TYPES, Config records configuration changes for only the resource types you specify in the resourceTypes field of RecordingGroup.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "If you set the useOnly field of RecordingStrategy to EXCLUSION_BY_RESOURCE_TYPES, Config records configuration changes for all supported resource types except the resource types that you specify to exclude from being recorded in the resourceTypes field of ExclusionByResourceTypes.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "recordingMode",
              "type": "dict",
              "description": "Specifies the default recording frequency for the configuration recorder. Config supports Continuous recording and Daily recording.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "Continuous recording allows you to record configuration changes continuously whenever a change occurs.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "CI",
                  "description": "Daily recording allows you to receive a configuration item (CI) representing the most recent state of your resources over the last 24-hour period, only if it's different from the previous CI recorded.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "recordingScope",
              "type": "string",
              "description": "Specifies whether the ConfigurationItems in scope for the specified configuration recorder are recorded for free ( INTERNAL) or if it impacts the costs to your bill ( PAID).",
              "nested_items": []
            },
            {
              "name": "servicePrincipal",
              "type": "string",
              "description": "For service-linked configuration recorders, specifies the linked Amazon Web Services service for the configuration recorder.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}