{
  "method_name": "describe_config_rules",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/config/client/describe_config_rules.html",
  "description": "Returns details about your Config rules.",
  "parameters": [
    {
      "name": "ConfigRuleNames",
      "type": "list",
      "required": false,
      "description": "The names of the Config rules for which you want details. If you do not specify any names, Config returns details for all your rules. (string) ---",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "dict",
      "required": false,
      "description": "Returns a list of Detective or Proactive Config rules. By default, this API returns an unfiltered list. For more information on Detective or Proactive Config rules, see **Evaluation Mode** in the Config Developer Guide. EvaluationMode (string) --- The mode of an evaluation. The valid values are Detective or Proactive.",
      "nested_params": [
        {
          "name": "EvaluationMode",
          "type": "string",
          "required": false,
          "description": "The mode of an evaluation. The valid values are Detective or Proactive.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ConfigRules",
          "type": "list",
          "description": "The details about your Config rules.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ConfigRuleName",
                  "type": "string",
                  "description": "The name that you assign to the Config rule. The name is required if you are adding a new rule.",
                  "nested_items": []
                },
                {
                  "name": "ConfigRuleArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the Config rule.",
                  "nested_items": []
                },
                {
                  "name": "ConfigRuleId",
                  "type": "string",
                  "description": "The ID of the Config rule.",
                  "nested_items": []
                },
                {
                  "name": "Description",
                  "type": "string",
                  "description": "The description that you provide for the Config rule.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "ComplianceResourceTypes",
                      "type": "list",
                      "description": "The resource types of only those Amazon Web Services resources that you want to trigger an evaluation for the rule. You can only specify one type if you also specify a resource ID for ComplianceResourceId.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "TagKey",
                      "type": "string",
                      "description": "The tag key that is applied to only those Amazon Web Services resources that you want to trigger an evaluation for the rule.",
                      "nested_items": []
                    },
                    {
                      "name": "TagValue",
                      "type": "string",
                      "description": "The tag value applied to only those Amazon Web Services resources that you want to trigger an evaluation for the rule. If you specify a value for TagValue, you must also specify a value for TagKey.",
                      "nested_items": []
                    },
                    {
                      "name": "ComplianceResourceId",
                      "type": "string",
                      "description": "The ID of the only Amazon Web Services resource that you want to trigger an evaluation for the rule. If you specify a resource ID, you must specify one resource type for ComplianceResourceTypes.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Owner",
                      "type": "string",
                      "description": "Indicates whether Amazon Web Services or the customer owns and manages the Config rule.",
                      "nested_items": []
                    },
                    {
                      "name": "SourceIdentifier",
                      "type": "string",
                      "description": "For Config Managed rules, a predefined identifier from a list. For example, IAM_PASSWORD_POLICY is a managed rule. To reference a managed rule, see List of Config Managed Rules.",
                      "nested_items": []
                    },
                    {
                      "name": "SourceDetails",
                      "type": "list",
                      "description": "Provides the source and the message types that cause Config to evaluate your Amazon Web Services resources against a rule. It also provides the frequency with which you want Config to run evaluations for the rule if the trigger type is periodic.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "EventSource",
                              "type": "string",
                              "description": "The source of the event, such as an Amazon Web Services service, that triggers Config to evaluate your Amazon Web Services resources.",
                              "nested_items": []
                            },
                            {
                              "name": "MessageType",
                              "type": "string",
                              "description": "The type of notification that triggers Config to run an evaluation for a rule. You can specify the following notification types:",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "ConfigurationItemChangeNotification - Triggers an evaluation when Config delivers a configuration item as a result of a resource change.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "OversizedConfigurationItemChangeNotification - Triggers an evaluation when Config delivers an oversized configuration item. Config may generate this notification type when a resource changes and the notification exceeds the maximum size allowed by Amazon SNS.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "ScheduledNotification - Triggers a periodic evaluation at the frequency specified for MaximumExecutionFrequency.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "ConfigurationSnapshotDeliveryCompleted - Triggers a periodic evaluation when Config delivers a configuration snapshot.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "MaximumExecutionFrequency",
                              "type": "string",
                              "description": "The frequency at which you want Config to run evaluations for a custom rule with a periodic trigger. If you specify a value for MaximumExecutionFrequency, then MessageType must use the ScheduledNotification value.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "CustomPolicyDetails",
                      "type": "dict",
                      "description": "Provides the runtime system, policy definition, and whether debug logging is enabled. Required when owner is set to CUSTOM_POLICY.",
                      "nested_items": [
                        {
                          "name": "PolicyRuntime",
                          "type": "string",
                          "description": "The runtime system for your Config Custom Policy rule. Guard is a policy-as-code language that allows you to write policies that are enforced by Config Custom Policy rules. For more information about Guard, see the Guard GitHub Repository.",
                          "nested_items": []
                        },
                        {
                          "name": "PolicyText",
                          "type": "string",
                          "description": "The policy definition containing the logic for your Config Custom Policy rule.",
                          "nested_items": []
                        },
                        {
                          "name": "EnableDebugLogDelivery",
                          "type": "boolean",
                          "description": "The boolean expression for enabling debug logging for your Config Custom Policy rule. The default value is false.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "InputParameters",
                  "type": "string",
                  "description": "A string, in JSON format, that is passed to the Config rule Lambda function.",
                  "nested_items": []
                },
                {
                  "name": "MaximumExecutionFrequency",
                  "type": "string",
                  "description": "The maximum frequency with which Config runs evaluations for a rule. You can specify a value for MaximumExecutionFrequency when:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "This is for an Config managed rule that is triggered at a periodic frequency.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Your custom rule is triggered when Config delivers the configuration snapshot. For more information, see  ConfigSnapshotDeliveryProperties.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "ConfigRuleState",
                  "type": "string",
                  "description": "Indicates whether the Config rule is active or is currently being deleted by Config. It can also indicate the evaluation status for the Config rule.",
                  "nested_items": []
                },
                {
                  "name": "CreatedBy",
                  "type": "string",
                  "description": "Service principal name of the service that created the rule.",
                  "nested_items": []
                },
                {
                  "name": "EvaluationModes",
                  "type": "list",
                  "description": "The modes the Config rule can be evaluated in. The valid values are distinct objects. By default, the value is Detective evaluation mode only.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Mode",
                          "type": "string",
                          "description": "The mode of an evaluation. The valid values are Detective or Proactive.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The string that you use in a subsequent request to get the next page of results in a paginated response.",
          "nested_items": []
        }
      ]
    }
  ]
}