{
  "method_name": "describe_delivery_channels",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/config/client/describe_delivery_channels.html",
  "description": "Returns details about the specified delivery channel. If a delivery channel is not specified, this operation returns the details of all delivery channels associated with the account.",
  "parameters": [],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "DeliveryChannels",
          "type": "list",
          "description": "A list that contains the descriptions of the specified delivery channel.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "name",
                  "type": "string",
                  "description": "The name of the delivery channel. By default, Config assigns the name 'default' when creating the delivery channel. To change the delivery channel name, you must use the DeleteDeliveryChannel action to delete your current delivery channel, and then you must use the PutDeliveryChannel command to create a delivery channel that has the desired name.",
                  "nested_items": []
                },
                {
                  "name": "s3BucketName",
                  "type": "string",
                  "description": "The name of the Amazon S3 bucket to which Config delivers configuration snapshots and configuration history files.",
                  "nested_items": []
                },
                {
                  "name": "s3KeyPrefix",
                  "type": "string",
                  "description": "The prefix for the specified Amazon S3 bucket.",
                  "nested_items": []
                },
                {
                  "name": "s3KmsKeyArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the Key Management Service (KMS ) KMS key (KMS key) used to encrypt objects delivered by Config. Must belong to the same Region as the destination S3 bucket.",
                  "nested_items": []
                },
                {
                  "name": "snsTopicARN",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the Amazon SNS topic to which Config sends notifications about configuration changes.",
                  "nested_items": []
                },
                {
                  "name": "configSnapshotDeliveryProperties",
                  "type": "dict",
                  "description": "The options for how often Config delivers configuration snapshots to the Amazon S3 bucket.",
                  "nested_items": [
                    {
                      "name": "deliveryFrequency",
                      "type": "string",
                      "description": "The frequency with which Config delivers configuration snapshots.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}