{
  "method_name": "list_conformance_pack_compliance_scores",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/config/client/list_conformance_pack_compliance_scores.html",
  "description": "Returns a list of conformance pack compliance scores. A compliance score is the percentage of the number of compliant rule-resource combinations in a conformance pack compared to the number of total possible rule-resource combinations in the conformance pack. This metric provides you with a high-level view of the compliance state of your conformance packs. You can use it to identify, investigate, and understand the level of compliance in your conformance packs.",
  "parameters": [
    {
      "name": "Filters",
      "type": "dict",
      "required": true,
      "description": "Filters the results based on the ConformancePackComplianceScoresFilters. The names of the conformance packs whose compliance scores you want to include in the conformance pack compliance score result set. You can include up to 25 conformance packs in the ConformancePackNames array of strings, each with a character limit of 256 characters for the conformance pack name. (string) ---",
      "nested_params": [
        {
          "name": "ConformancePackNames",
          "type": "list",
          "required": false,
          "description": "The names of the conformance packs whose compliance scores you want to include in the conformance pack compliance score result set. You can include up to 25 conformance packs in the ConformancePackNames array of strings, each with a character limit of 256 characters for the conformance pack name.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "SortOrder",
      "type": "string",
      "required": false,
      "description": "Determines the order in which conformance pack compliance scores are sorted. Either in ascending or descending order. By default, conformance pack compliance scores are sorted in alphabetical order by name of the conformance pack. Conformance pack compliance scores are sorted in reverse alphabetical order if you enter DESCENDING. You can sort conformance pack compliance scores by the numerical value of the compliance score by entering SCORE in the SortBy action. When compliance scores are sorted by SCORE, conformance packs with a compliance score of INSUFFICIENT_DATA will be last when sorting by ascending order and first when sorting by descending order.",
      "nested_params": []
    },
    {
      "name": "SortBy",
      "type": "string",
      "required": false,
      "description": "Sorts your conformance pack compliance scores in either ascending or descending order, depending on SortOrder. By default, conformance pack compliance scores are sorted in alphabetical order by name of the conformance pack. Enter SCORE, to sort conformance pack compliance scores by the numerical value of the compliance score.",
      "nested_params": []
    },
    {
      "name": "Limit",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "NextToken",
          "type": "string",
          "description": "The nextToken string that you can use to get the next page of results in a paginated response.",
          "nested_items": []
        },
        {
          "name": "ConformancePackComplianceScores",
          "type": "list",
          "description": "A list of ConformancePackComplianceScore objects.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Score",
                  "type": "string",
                  "description": "Compliance score for the conformance pack. Conformance packs with no evaluation results will have a compliance score of INSUFFICIENT_DATA.",
                  "nested_items": []
                },
                {
                  "name": "ConformancePackName",
                  "type": "string",
                  "description": "The name of the conformance pack.",
                  "nested_items": []
                },
                {
                  "name": "LastUpdatedTime",
                  "type": "datetime",
                  "description": "The time that the conformance pack compliance score was last updated.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}