{
  "method_name": "put_conformance_pack",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/config/client/put_conformance_pack.html",
  "description": "Creates or updates a conformance pack. A conformance pack is a collection of Config rules that can be easily deployed in an account and a region and across an organization. For information on how many conformance packs you can have per account, see **Service Limits** in the Config Developer Guide. This API creates a service-linked role AWSServiceRoleForConfigConforms in your account. The service-linked role is created only when the role does not exist in your account.",
  "parameters": [
    {
      "name": "ConformancePackName",
      "type": "string",
      "required": true,
      "description": "The unique name of the conformance pack you want to deploy.",
      "nested_params": []
    },
    {
      "name": "TemplateS3Uri",
      "type": "string",
      "required": false,
      "description": "The location of the file containing the template body ( s3://bucketname/prefix). The uri must point to a conformance pack template (max size: 300 KB) that is located in an Amazon S3 bucket in the same Region as the conformance pack.",
      "nested_params": []
    },
    {
      "name": "TemplateBody",
      "type": "string",
      "required": false,
      "description": "A string containing the full conformance pack template body. The structure containing the template body has a minimum length of 1 byte and a maximum length of 51,200 bytes.",
      "nested_params": []
    },
    {
      "name": "DeliveryS3Bucket",
      "type": "string",
      "required": false,
      "description": "The name of the Amazon S3 bucket where Config stores conformance pack templates.",
      "nested_params": []
    },
    {
      "name": "DeliveryS3KeyPrefix",
      "type": "string",
      "required": false,
      "description": "The prefix for the Amazon S3 bucket.",
      "nested_params": []
    },
    {
      "name": "ConformancePackInputParameters",
      "type": "list",
      "required": true,
      "description": "A list of ConformancePackInputParameter objects. (dict) --- Input parameters in the form of key-value pairs for the conformance pack, both of which you define. Keys can have a maximum character length of 255 characters, and values can have a maximum length of 4096 characters. One part of a key-value pair. Another part of the key-value pair.",
      "nested_params": [
        {
          "name": "ParameterName",
          "type": "string",
          "required": false,
          "description": "One part of a key-value pair.",
          "nested_params": []
        },
        {
          "name": "ParameterValue",
          "type": "string",
          "required": false,
          "description": "Another part of the key-value pair.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "TemplateSSMDocumentDetails",
      "type": "dict",
      "required": true,
      "description": "An object of type TemplateSSMDocumentDetails, which contains the name or the Amazon Resource Name (ARN) of the Amazon Web Services Systems Manager document (SSM document) and the version of the SSM document that is used to create a conformance pack. The name or Amazon Resource Name (ARN) of the SSM document to use to create a conformance pack. If you use the document name, Config checks only your account and Amazon Web Services Region for the SSM document. DocumentVersion (string) --- The version of the SSM document to use to create a conformance pack. By default, Config uses the latest version.",
      "nested_params": [
        {
          "name": "DocumentName",
          "type": "string",
          "required": false,
          "description": "The name or Amazon Resource Name (ARN) of the SSM document to use to create a conformance pack. If you use the document name, Config checks only your account and Amazon Web Services Region for the SSM document.",
          "nested_params": []
        },
        {
          "name": "DocumentVersion",
          "type": "string",
          "required": false,
          "description": "The version of the SSM document to use to create a conformance pack. By default, Config uses the latest version.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ConformancePackArn",
          "type": "string",
          "description": "ARN of the conformance pack.",
          "nested_items": []
        }
      ]
    }
  ]
}