{
  "method_name": "put_config_rule",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/config/client/put_config_rule.html",
  "description": "Adds or updates an Config rule to evaluate if your Amazon Web Services resources comply with your desired configurations. For information on how many Config rules you can have per account, see **Service Limits** in the Config Developer Guide. There are two types of rules: Config Managed Rules and Config Custom Rules. You can use PutConfigRule to create both Config Managed Rules and Config Custom Rules. Config Managed Rules are predefined, customizable rules created by Config. For a list of managed rules, see List of Config Managed Rules. If you are adding an Config managed rule, you must specify the rule's identifier for the SourceIdentifier key. Config Custom Rules are rules that you create from scratch. There are two ways to create Config custom rules: with Lambda functions ( Lambda Developer Guide) and with Guard ( Guard GitHub Repository), a policy-as-code language. Config custom rules created with Lambda are called Config Custom Lambda Rules and Config custom rules created with Guard are called Config Custom Policy Rules. If you are adding a new Config Custom Lambda rule, you first need to create an Lambda function that the rule invokes to evaluate your resources. When you use PutConfigRule to add a Custom Lambda rule to Config, you must specify the Amazon Resource Name (ARN) that Lambda assigns to the function. You specify the ARN in the SourceIdentifier key. This key is part of the Source object, which is part of the ConfigRule object. For any new Config rule that you add, specify the ConfigRuleName in the ConfigRule object. Do not specify the ConfigRuleArn or the ConfigRuleId. These values are generated by Config for new rules. If you are updating a rule that you added previously, you can specify the rule by ConfigRuleName, ConfigRuleId, or ConfigRuleArn in the ConfigRule data type that you use in this request. For more information about developing and using Config rules, see Evaluating Resources with Config Rules in the Config Developer Guide.",
  "parameters": [
    {
      "name": "ConfigRule",
      "type": "dict",
      "required": true,
      "description": "The rule that you want to add to your account. ConfigRuleName (string) --- The name that you assign to the Config rule. The name is required if you are adding a new rule. ConfigRuleArn (string) --- The Amazon Resource Name (ARN) of the Config rule. ConfigRuleId (string) --- The ID of the Config rule. Description (string) --- The description that you provide for the Config rule. Scope (dict) --- Defines which resources can trigger an evaluation for the rule. The scope can include one or more resource types, a combination of one resource type and one resource ID, or a combination of a tag key and value. Specify a scope to constrain the resources that can trigger an evaluation for the rule. If you do not specify a scope, evaluations are triggered when any resource in the recording group changes. ComplianceResourceTypes (list) --- The resource types of only those Amazon Web Services resources that you want to trigger an evaluation for the rule. You can only specify one type if you also specify a resource ID for ComplianceResourceId. (string) --- TagKey (string) --- The tag key that is applied to only those Amazon Web Services resources that you want to trigger an evaluation for the rule. TagValue (string) --- The tag value applied to only those Amazon Web Services resources that you want to trigger an evaluation for the rule. If you specify a value for TagValue, you must also specify a value for TagKey. ComplianceResourceId (string) --- The ID of the only Amazon Web Services resource that you want to trigger an evaluation for the rule. If you specify a resource ID, you must specify one resource type for ComplianceResourceTypes. Provides the rule owner ( Amazon Web Services for managed rules, CUSTOM_POLICY for Custom Policy rules, and CUSTOM_LAMBDA for Custom Lambda rules), the rule identifier, and the notifications that cause the function to evaluate your Amazon Web Services resources. Indicates whether Amazon Web Services or the customer owns and manages the Config rule. Config Managed Rules are predefined rules owned by Amazon Web Services. For more information, see Config Managed Rules in the Config developer guide. Config Custom Rules are rules that you can develop either with Guard ( CUSTOM_POLICY) or Lambda ( CUSTOM_LAMBDA). For more information, see Config Custom Rules in the Config developer guide. SourceIdentifier (string) --- For Config Managed rules, a predefined identifier from a list. For example, IAM_PASSWORD_POLICY is a managed rule. To reference a managed rule, see List of Config Managed Rules. For Config Custom Lambda rules, the identifier is the Amazon Resource Name (ARN) of the rule's Lambda function, such as arn:aws:lambda:us-east-2:123456789012:function:custom_rule_name. For Config Custom Policy rules, this field will be ignored. SourceDetails (list) --- Provides the source and the message types that cause Config to evaluate your Amazon Web Services resources against a rule. It also provides the frequency with which you want Config to run evaluations for the rule if the trigger type is periodic. If the owner is set to CUSTOM_POLICY, the only acceptable values for the Config rule trigger message type are ConfigurationItemChangeNotification and OversizedConfigurationItemChangeNotification. (dict) --- Provides the source and the message types that trigger Config to evaluate your Amazon Web Services resources against a rule. You can specify the parameter values for SourceDetail only for custom rules. EventSource (string) --- The source of the event, such as an Amazon Web Services service, that triggers Config to evaluate your Amazon Web Services resources. MessageType (string) --- The type of notification that triggers Config to run an evaluation for a rule. You can specify the following notification types: ConfigurationItemChangeNotification - Triggers an evaluation when Config delivers a configuration item as a result of a resource change. OversizedConfigurationItemChangeNotification - Triggers an evaluation when Config delivers an oversized configuration item. Config may generate this notification type when a resource changes and the notification exceeds the maximum size allowed by Amazon SNS. ScheduledNotification - Triggers a periodic evaluation at the frequency specified for MaximumExecutionFrequency. ConfigurationSnapshotDeliveryCompleted - Triggers a periodic evaluation when Config delivers a configuration snapshot. If you want your custom rule to be triggered by configuration changes, specify two SourceDetail objects, one for ConfigurationItemChangeNotification and one for OversizedConfigurationItemChangeNotification. MaximumExecutionFrequency (string) --- The frequency at which you want Config to run evaluations for a custom rule with a periodic trigger. If you specify a value for MaximumExecutionFrequency, then MessageType must use the ScheduledNotification value. CustomPolicyDetails (dict) --- Provides the runtime system, policy definition, and whether debug logging is enabled. Required when owner is set to CUSTOM_POLICY. The runtime system for your Config Custom Policy rule. Guard is a policy-as-code language that allows you to write policies that are enforced by Config Custom Policy rules. For more information about Guard, see the Guard GitHub Repository. The policy definition containing the logic for your Config Custom Policy rule. EnableDebugLogDelivery (boolean) --- The boolean expression for enabling debug logging for your Config Custom Policy rule. The default value is false. InputParameters (string) --- A string, in JSON format, that is passed to the Config rule Lambda function. MaximumExecutionFrequency (string) --- The maximum frequency with which Config runs evaluations for a rule. You can specify a value for MaximumExecutionFrequency when: This is for an Config managed rule that is triggered at a periodic frequency. Your custom rule is triggered when Config delivers the configuration snapshot. For more information, see  ConfigSnapshotDeliveryProperties. ConfigRuleState (string) --- Indicates whether the Config rule is active or is currently being deleted by Config. It can also indicate the evaluation status for the Config rule. Config sets the state of the rule to EVALUATING temporarily after you use the StartConfigRulesEvaluation request to evaluate your resources against the Config rule. Config sets the state of the rule to DELETING_RESULTS temporarily after you use the DeleteEvaluationResults request to delete the current evaluation results for the Config rule. Config temporarily sets the state of a rule to DELETING after you use the DeleteConfigRule request to delete the rule. After Config deletes the rule, the rule and all of its evaluations are erased and are no longer available. CreatedBy (string) --- Service principal name of the service that created the rule. EvaluationModes (list) --- The modes the Config rule can be evaluated in. The valid values are distinct objects. By default, the value is Detective evaluation mode only. (dict) --- The configuration object for Config rule evaluation mode. The supported valid values are Detective or Proactive. Mode (string) --- The mode of an evaluation. The valid values are Detective or Proactive.",
      "nested_params": [
        {
          "name": "ConfigRuleName",
          "type": "string",
          "required": false,
          "description": "The name that you assign to the Config rule. The name is required if you are adding a new rule.",
          "nested_params": []
        },
        {
          "name": "ConfigRuleArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the Config rule.",
          "nested_params": []
        },
        {
          "name": "ConfigRuleId",
          "type": "string",
          "required": false,
          "description": "The ID of the Config rule.",
          "nested_params": []
        },
        {
          "name": "Description",
          "type": "string",
          "required": false,
          "description": "The description that you provide for the Config rule.",
          "nested_params": []
        },
        {
          "name": "Scope",
          "type": "dict",
          "required": false,
          "description": "Defines which resources can trigger an evaluation for the rule. The scope can include one or more resource types, a combination of one resource type and one resource ID, or a combination of a tag key and value. Specify a scope to constrain the resources that can trigger an evaluation for the rule. If you do not specify a scope, evaluations are triggered when any resource in the recording group changes.",
          "nested_params": [
            {
              "name": "ComplianceResourceTypes",
              "type": "list",
              "required": false,
              "description": "The resource types of only those Amazon Web Services resources that you want to trigger an evaluation for the rule. You can only specify one type if you also specify a resource ID for ComplianceResourceId.",
              "nested_params": []
            },
            {
              "name": "TagKey",
              "type": "string",
              "required": false,
              "description": "The tag key that is applied to only those Amazon Web Services resources that you want to trigger an evaluation for the rule.",
              "nested_params": []
            },
            {
              "name": "TagValue",
              "type": "string",
              "required": false,
              "description": "The tag value applied to only those Amazon Web Services resources that you want to trigger an evaluation for the rule. If you specify a value for TagValue, you must also specify a value for TagKey.",
              "nested_params": []
            },
            {
              "name": "ComplianceResourceId",
              "type": "string",
              "required": false,
              "description": "The ID of the only Amazon Web Services resource that you want to trigger an evaluation for the rule. If you specify a resource ID, you must specify one resource type for ComplianceResourceTypes.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Source",
          "type": "dict",
          "required": false,
          "description": "Provides the rule owner ( Amazon Web Services for managed rules, CUSTOM_POLICY for Custom Policy rules, and CUSTOM_LAMBDA for Custom Lambda rules), the rule identifier, and the notifications that cause the function to evaluate your Amazon Web Services resources.",
          "nested_params": [
            {
              "name": "Owner",
              "type": "string",
              "required": false,
              "description": "Indicates whether Amazon Web Services or the customer owns and manages the Config rule. Config Managed Rules are predefined rules owned by Amazon Web Services. For more information, see Config Managed Rules in the Config developer guide. Config Custom Rules are rules that you can develop either with Guard ( CUSTOM_POLICY) or Lambda ( CUSTOM_LAMBDA). For more information, see Config Custom Rules in the Config developer guide.",
              "nested_params": []
            },
            {
              "name": "SourceIdentifier",
              "type": "string",
              "required": false,
              "description": "For Config Managed rules, a predefined identifier from a list. For example, IAM_PASSWORD_POLICY is a managed rule. To reference a managed rule, see List of Config Managed Rules. For Config Custom Lambda rules, the identifier is the Amazon Resource Name (ARN) of the rule's Lambda function, such as arn:aws:lambda:us-east-2:123456789012:function:custom_rule_name. For Config Custom Policy rules, this field will be ignored.",
              "nested_params": []
            },
            {
              "name": "SourceDetails",
              "type": "list",
              "required": false,
              "description": "Provides the source and the message types that cause Config to evaluate your Amazon Web Services resources against a rule. It also provides the frequency with which you want Config to run evaluations for the rule if the trigger type is periodic. If the owner is set to CUSTOM_POLICY, the only acceptable values for the Config rule trigger message type are ConfigurationItemChangeNotification and OversizedConfigurationItemChangeNotification.",
              "nested_params": [
                {
                  "name": "EventSource",
                  "type": "string",
                  "required": false,
                  "description": "The source of the event, such as an Amazon Web Services service, that triggers Config to evaluate your Amazon Web Services resources.",
                  "nested_params": []
                },
                {
                  "name": "MessageType",
                  "type": "string",
                  "required": false,
                  "description": "The type of notification that triggers Config to run an evaluation for a rule. You can specify the following notification types:",
                  "nested_params": []
                },
                {
                  "name": "MaximumExecutionFrequency",
                  "type": "string",
                  "required": false,
                  "description": "The frequency at which you want Config to run evaluations for a custom rule with a periodic trigger. If you specify a value for MaximumExecutionFrequency, then MessageType must use the ScheduledNotification value.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "CustomPolicyDetails",
              "type": "dict",
              "required": false,
              "description": "Provides the runtime system, policy definition, and whether debug logging is enabled. Required when owner is set to CUSTOM_POLICY.",
              "nested_params": [
                {
                  "name": "PolicyRuntime",
                  "type": "string",
                  "required": false,
                  "description": "The runtime system for your Config Custom Policy rule. Guard is a policy-as-code language that allows you to write policies that are enforced by Config Custom Policy rules. For more information about Guard, see the Guard GitHub Repository.",
                  "nested_params": []
                },
                {
                  "name": "PolicyText",
                  "type": "string",
                  "required": false,
                  "description": "The policy definition containing the logic for your Config Custom Policy rule.",
                  "nested_params": []
                },
                {
                  "name": "EnableDebugLogDelivery",
                  "type": "boolean",
                  "required": false,
                  "description": "The boolean expression for enabling debug logging for your Config Custom Policy rule. The default value is false.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "InputParameters",
          "type": "string",
          "required": false,
          "description": "A string, in JSON format, that is passed to the Config rule Lambda function.",
          "nested_params": []
        },
        {
          "name": "MaximumExecutionFrequency",
          "type": "string",
          "required": false,
          "description": "The maximum frequency with which Config runs evaluations for a rule. You can specify a value for MaximumExecutionFrequency when:",
          "nested_params": []
        },
        {
          "name": "ConfigRuleState",
          "type": "string",
          "required": false,
          "description": "Indicates whether the Config rule is active or is currently being deleted by Config. It can also indicate the evaluation status for the Config rule. Config sets the state of the rule to EVALUATING temporarily after you use the StartConfigRulesEvaluation request to evaluate your resources against the Config rule. Config sets the state of the rule to DELETING_RESULTS temporarily after you use the DeleteEvaluationResults request to delete the current evaluation results for the Config rule. Config temporarily sets the state of a rule to DELETING after you use the DeleteConfigRule request to delete the rule. After Config deletes the rule, the rule and all of its evaluations are erased and are no longer available.",
          "nested_params": []
        },
        {
          "name": "CreatedBy",
          "type": "string",
          "required": false,
          "description": "Service principal name of the service that created the rule.",
          "nested_params": []
        },
        {
          "name": "EvaluationModes",
          "type": "list",
          "required": false,
          "description": "The modes the Config rule can be evaluated in. The valid values are distinct objects. By default, the value is Detective evaluation mode only.",
          "nested_params": [
            {
              "name": "Mode",
              "type": "string",
              "required": false,
              "description": "The mode of an evaluation. The valid values are Detective or Proactive.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": false,
      "description": "An array of tag object. (dict) --- The tags for the resource. The metadata that you apply to a resource to help you categorize and organize them. Each tag consists of a key and an optional value, both of which you define. Tag keys can have a maximum character length of 128 characters, and tag values can have a maximum length of 256 characters. Key (string) --- One part of a key-value pair that make up a tag. A key is a general label that acts like a category for more specific tag values. Value (string) --- The optional part of a key-value pair that make up a tag. A value acts as a descriptor within a tag category (key).",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "One part of a key-value pair that make up a tag. A key is a general label that acts like a category for more specific tag values.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The optional part of a key-value pair that make up a tag. A value acts as a descriptor within a tag category (key).",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}