{
  "method_name": "put_organization_conformance_pack",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/config/client/put_organization_conformance_pack.html",
  "description": "Deploys conformance packs across member accounts in an Amazon Web Services Organization. For information on how many organization conformance packs and how many Config rules you can have per account, see **Service Limits** in the Config Developer Guide. Only a management account and a delegated administrator can call this API. When calling this API with a delegated administrator, you must ensure Organizations ListDelegatedAdministrator permissions are added. An organization can have up to 3 delegated administrators. This API enables organization service access for config-multiaccountsetup.amazonaws.com through the EnableAWSServiceAccess action and creates a service-linked role AWSServiceRoleForConfigMultiAccountSetup in the management or delegated administrator account of your organization. The service-linked role is created only when the role does not exist in the caller account. To use this API with delegated administrator, register a delegated administrator by calling Amazon Web Services Organization register-delegate-admin for config-multiaccountsetup.amazonaws.com.",
  "parameters": [
    {
      "name": "OrganizationConformancePackName",
      "type": "string",
      "required": true,
      "description": "Name of the organization conformance pack you want to create.",
      "nested_params": []
    },
    {
      "name": "TemplateS3Uri",
      "type": "string",
      "required": false,
      "description": "Location of file containing the template body. The uri must point to the conformance pack template (max size: 300 KB).",
      "nested_params": []
    },
    {
      "name": "TemplateBody",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DeliveryS3Bucket",
      "type": "string",
      "required": false,
      "description": "The name of the Amazon S3 bucket where Config stores conformance pack templates.",
      "nested_params": []
    },
    {
      "name": "DeliveryS3KeyPrefix",
      "type": "string",
      "required": false,
      "description": "The prefix for the Amazon S3 bucket.",
      "nested_params": []
    },
    {
      "name": "ConformancePackInputParameters",
      "type": "list",
      "required": true,
      "description": "A list of ConformancePackInputParameter objects. (dict) --- Input parameters in the form of key-value pairs for the conformance pack, both of which you define. Keys can have a maximum character length of 255 characters, and values can have a maximum length of 4096 characters. One part of a key-value pair. Another part of the key-value pair.",
      "nested_params": [
        {
          "name": "ParameterName",
          "type": "string",
          "required": false,
          "description": "One part of a key-value pair.",
          "nested_params": []
        },
        {
          "name": "ParameterValue",
          "type": "string",
          "required": false,
          "description": "Another part of the key-value pair.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ExcludedAccounts",
      "type": "list",
      "required": false,
      "description": "A list of Amazon Web Services accounts to be excluded from an organization conformance pack while deploying a conformance pack. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "OrganizationConformancePackArn",
          "type": "string",
          "description": "ARN of the organization conformance pack.",
          "nested_items": []
        }
      ]
    }
  ]
}