{
  "method_name": "invoke_endpoint_async",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sagemaker-runtime/client/invoke_endpoint_async.html",
  "description": "After you deploy a model into production using Amazon SageMaker hosting services, your client applications use this API to get inferences from the model hosted at the specified endpoint in an asynchronous manner. Inference requests sent to this API are enqueued for asynchronous processing. The processing of the inference request may or may not complete before you receive a response from this API. The response from this API will not contain the result of the inference request but contain information about where you can locate it. Amazon SageMaker strips all POST headers except those supported by the API. Amazon SageMaker might add additional headers. You should not rely on the behavior of headers outside those enumerated in the request syntax. Calls to InvokeEndpointAsync are authenticated by using Amazon Web Services Signature Version 4. For information, see Authenticating Requests (Amazon Web Services Signature Version 4) in the Amazon S3 API Reference.",
  "parameters": [
    {
      "name": "EndpointName",
      "type": "string",
      "required": true,
      "description": "The name of the endpoint that you specified when you created the endpoint using the CreateEndpoint API.",
      "nested_params": []
    },
    {
      "name": "ContentType",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Accept",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "CustomAttributes",
      "type": "string",
      "required": false,
      "description": "Provides additional information about a request for an inference submitted to a model hosted at an Amazon SageMaker endpoint. The information is an opaque value that is forwarded verbatim. You could use this value, for example, to provide an ID that you can use to track a request or to provide other metadata that a service endpoint was programmed to process. The value must consist of no more than 1024 visible US-ASCII characters as specified in Section 3.3.6. Field Value Components of the Hypertext Transfer Protocol (HTTP/1.1). The code in your model is responsible for setting or updating any custom attributes in the response. If your code does not set this value in the response, an empty value is returned. For example, if a custom attribute represents the trace ID, your model can prepend the custom attribute with Trace ID: in your post-processing function. This feature is currently supported in the Amazon Web Services SDKs but not in the Amazon SageMaker Python SDK.",
      "nested_params": []
    },
    {
      "name": "InferenceId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "InputLocation",
      "type": "string",
      "required": true,
      "description": "The Amazon S3 URI where the inference request payload is stored.",
      "nested_params": []
    },
    {
      "name": "RequestTTLSeconds",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "InvocationTimeoutSeconds",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "InferenceId",
          "type": "string",
          "description": "Identifier for an inference request. This will be the same as the InferenceId specified in the input. Amazon SageMaker will generate an identifier for you if you do not specify one.",
          "nested_items": []
        },
        {
          "name": "OutputLocation",
          "type": "string",
          "description": "The Amazon S3 URI where the inference response payload is stored.",
          "nested_items": []
        },
        {
          "name": "FailureLocation",
          "type": "string",
          "description": "The Amazon S3 URI where the inference failure response payload is stored.",
          "nested_items": []
        }
      ]
    }
  ]
}