{
  "method_name": "invoke_endpoint",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sagemaker-runtime/client/invoke_endpoint.html",
  "description": "After you deploy a model into production using Amazon SageMaker hosting services, your client applications use this API to get inferences from the model hosted at the specified endpoint. For an overview of Amazon SageMaker, see How It Works. Amazon SageMaker strips all POST headers except those supported by the API. Amazon SageMaker might add additional headers. You should not rely on the behavior of headers outside those enumerated in the request syntax. Calls to InvokeEndpoint are authenticated by using Amazon Web Services Signature Version 4. For information, see Authenticating Requests (Amazon Web Services Signature Version 4) in the Amazon S3 API Reference. A customer's model containers must respond to requests within 60 seconds. The model itself can have a maximum processing time of 60 seconds before responding to invocations. If your model is going to take 50-60 seconds of processing time, the SDK socket timeout should be set to be 70 seconds.",
  "parameters": [
    {
      "name": "EndpointName",
      "type": "string",
      "required": true,
      "description": "The name of the endpoint that you specified when you created the endpoint using the CreateEndpoint API.",
      "nested_params": []
    },
    {
      "name": "Body",
      "type": "bytes or seekable file-like object",
      "required": true,
      "description": "Provides input data, in the format specified in the ContentType request header. Amazon SageMaker passes all of the data in the body to the model. For information about the format of the request body, see Common Data Formats-Inference.",
      "nested_params": []
    },
    {
      "name": "ContentType",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Accept",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "CustomAttributes",
      "type": "string",
      "required": false,
      "description": "Provides additional information about a request for an inference submitted to a model hosted at an Amazon SageMaker endpoint. The information is an opaque value that is forwarded verbatim. You could use this value, for example, to provide an ID that you can use to track a request or to provide other metadata that a service endpoint was programmed to process. The value must consist of no more than 1024 visible US-ASCII characters as specified in Section 3.3.6. Field Value Components of the Hypertext Transfer Protocol (HTTP/1.1). The code in your model is responsible for setting or updating any custom attributes in the response. If your code does not set this value in the response, an empty value is returned. For example, if a custom attribute represents the trace ID, your model can prepend the custom attribute with Trace ID: in your post-processing function. This feature is currently supported in the Amazon Web Services SDKs but not in the Amazon SageMaker Python SDK.",
      "nested_params": []
    },
    {
      "name": "TargetModel",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "TargetVariant",
      "type": "string",
      "required": false,
      "description": "Specify the production variant to send the inference request to when invoking an endpoint that is running two or more variants. Note that this parameter overrides the default behavior for the endpoint, which is to distribute the invocation traffic based on the variant weights. For information about how to use variant targeting to perform a/b testing, see Test models in production.",
      "nested_params": []
    },
    {
      "name": "TargetContainerHostname",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "InferenceId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "EnableExplanations",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "InferenceComponentName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "SessionId",
      "type": "string",
      "required": false,
      "description": "Creates a stateful session or identifies an existing one. You can do one of the following: Create a stateful session by specifying the value NEW_SESSION. Send your request to an existing stateful session by specifying the ID of that session. With a stateful session, you can send multiple requests to a stateful model. When you create a session with a stateful model, the model must create the session ID and set the expiration time. The model must also provide that information in the response to your request. You can get the ID and timestamp from the NewSessionId response parameter. For any subsequent request where you specify that session ID, SageMaker routes the request to the same instance that supports the session.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Body",
          "type": "StreamingBody",
          "description": "Includes the inference provided by the model.",
          "nested_items": []
        },
        {
          "name": "ContentType",
          "type": "string",
          "description": "The MIME type of the inference returned from the model container.",
          "nested_items": []
        },
        {
          "name": "InvokedProductionVariant",
          "type": "string",
          "description": "Identifies the production variant that was invoked.",
          "nested_items": []
        },
        {
          "name": "CustomAttributes",
          "type": "string",
          "description": "Provides additional information in the response about the inference returned by a model hosted at an Amazon SageMaker endpoint. The information is an opaque value that is forwarded verbatim. You could use this value, for example, to return an ID received in the CustomAttributes header of a request or other metadata that a service endpoint was programmed to produce. The value must consist of no more than 1024 visible US-ASCII characters as specified in Section 3.3.6. Field Value Components of the Hypertext Transfer Protocol (HTTP/1.1). If the customer wants the custom attribute returned, the model must set the custom attribute to be included on the way back.",
          "nested_items": []
        },
        {
          "name": "NewSessionId",
          "type": "string",
          "description": "If you created a stateful session with your request, the ID and expiration time that the model assigns to that session.",
          "nested_items": []
        },
        {
          "name": "ClosedSessionId",
          "type": "string",
          "description": "If you closed a stateful session with your request, the ID of that session.",
          "nested_items": []
        }
      ]
    }
  ]
}