{
  "method_name": "get_products",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/pricing/client/get_products.html",
  "description": "Returns a list of all products that match the filter criteria.",
  "parameters": [
    {
      "name": "ServiceCode",
      "type": "string",
      "required": true,
      "description": "The code for the service whose products you want to retrieve.",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": true,
      "description": "The list of filters that limit the returned products. only products that match all filters are returned. (dict) --- The constraints that you want all returned products to match. The type of filter that you want to use. Valid values are: TERM_MATCH. TERM_MATCH returns only products that match both the given filter field and the given value. The product metadata field that you want to filter on. You can filter by just the service code to see all products for a specific service, filter by just the attribute name to see a specific attribute for multiple services, or use both a service code and an attribute name to retrieve only products that match both fields. Valid values include: ServiceCode, and all attribute names For example, you can filter by the AmazonEC2 service code and the volumeType attribute name to get the prices for only Amazon EC2 volumes. The service code or attribute value that you want to filter by. If you're filtering by service code this is the actual service code, such as AmazonEC2. If you're filtering by attribute name, this is the attribute value that you want the returned products to match, such as a Provisioned IOPS volume.",
      "nested_params": [
        {
          "name": "Type",
          "type": "string",
          "required": false,
          "description": "The type of filter that you want to use. Valid values are: TERM_MATCH. TERM_MATCH returns only products that match both the given filter field and the given value.",
          "nested_params": []
        },
        {
          "name": "Field",
          "type": "string",
          "required": false,
          "description": "The product metadata field that you want to filter on. You can filter by just the service code to see all products for a specific service, filter by just the attribute name to see a specific attribute for multiple services, or use both a service code and an attribute name to retrieve only products that match both fields. Valid values include: ServiceCode, and all attribute names For example, you can filter by the AmazonEC2 service code and the volumeType attribute name to get the prices for only Amazon EC2 volumes.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The service code or attribute value that you want to filter by. If you're filtering by service code this is the actual service code, such as AmazonEC2. If you're filtering by attribute name, this is the attribute value that you want the returned products to match, such as a Provisioned IOPS volume.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "FormatVersion",
      "type": "string",
      "required": false,
      "description": "The format version that you want the response to be in. Valid values are: aws_v1",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "FormatVersion",
          "type": "string",
          "description": "The format version of the response. For example, aws_v1.",
          "nested_items": []
        },
        {
          "name": "PriceList",
          "type": "list",
          "description": "The list of products that match your filters. The list contains both the product metadata and the price information.",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": []
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The pagination token that indicates the next set of results to retrieve.",
          "nested_items": []
        }
      ]
    }
  ]
}