{
  "method_name": "list_price_lists",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/pricing/client/list_price_lists.html",
  "description": "This feature is in preview release and is subject to change. Your use of Amazon Web Services Price List API is subject to the Beta Service Participation terms of the Amazon Web Services Service Terms (Section 1.10). This returns a list of Price List references that the requester if authorized to view, given a ServiceCode, CurrencyCode, and an EffectiveDate. Use without a RegionCode filter to list Price List references from all available Amazon Web Services Regions. Use with a RegionCode filter to get the Price List reference that's specific to a specific Amazon Web Services Region. You can use the PriceListArn from the response to get your preferred Price List files through the GetPriceListFileUrl API.",
  "parameters": [
    {
      "name": "ServiceCode",
      "type": "string",
      "required": true,
      "description": "The service code or the Savings Plan service code for the attributes that you want to retrieve. For example, to get the list of applicable Amazon EC2 price lists, use AmazonEC2. For a full list of service codes containing On-Demand and Reserved Instance (RI) pricing, use the DescribeServices API. To retrieve the Reserved Instance and Compute Savings Plan price lists, use ComputeSavingsPlans. To retrieve Machine Learning Savings Plans price lists, use MachineLearningSavingsPlans.",
      "nested_params": []
    },
    {
      "name": "EffectiveDate",
      "type": "datetime",
      "required": true,
      "description": "The date that the Price List file prices are effective from.",
      "nested_params": []
    },
    {
      "name": "RegionCode",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "CurrencyCode",
      "type": "string",
      "required": true,
      "description": "The three alphabetical character ISO-4217 currency code that the Price List files are denominated in.",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "PriceLists",
          "type": "list",
          "description": "The type of price list references that match your request.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "PriceListArn",
                  "type": "string",
                  "description": "The unique identifier that maps to where your Price List files are located. PriceListArn can be obtained from the ListPriceList response.",
                  "nested_items": []
                },
                {
                  "name": "RegionCode",
                  "type": "string",
                  "description": "This is used to filter the Price List by Amazon Web Services Region. For example, to get the price list only for the US East (N. Virginia) Region, use us-east-1. If nothing is specified, you retrieve price lists for all applicable Regions. The available RegionCode list can be retrieved from GetAttributeValues API.",
                  "nested_items": []
                },
                {
                  "name": "CurrencyCode",
                  "type": "string",
                  "description": "The three alphabetical character ISO-4217 currency code the Price List files are denominated in.",
                  "nested_items": []
                },
                {
                  "name": "FileFormats",
                  "type": "list",
                  "description": "The format you want to retrieve your Price List files. The FileFormat can be obtained from the ListPriceList response.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The pagination token that indicates the next set of results to retrieve.",
          "nested_items": []
        }
      ]
    }
  ]
}