{
  "method_name": "accept_match",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/gamelift/client/accept_match.html",
  "description": "Registers a player's acceptance or rejection of a proposed FlexMatch match. A matchmaking configuration may require player acceptance; if so, then matches built with that configuration cannot be completed unless all players accept the proposed match within a specified time limit. When FlexMatch builds a match, all the matchmaking tickets involved in the proposed match are placed into status REQUIRES_ACCEPTANCE. This is a trigger for your game to get acceptance from all players in each ticket. Calls to this action are only valid for tickets that are in this status; calls for tickets not in this status result in an error. To register acceptance, specify the ticket ID, one or more players, and an acceptance response. When all players have accepted, Amazon GameLift advances the matchmaking tickets to status PLACING, and attempts to create a new game session for the match. If any player rejects the match, or if acceptances are not received before a specified timeout, the proposed match is dropped. Each matchmaking ticket in the failed match is handled as follows: Add FlexMatch to a game client. FlexMatch events (reference)",
  "parameters": [
    {
      "name": "TicketId",
      "type": "string",
      "required": true,
      "description": "A unique identifier for a matchmaking ticket. The ticket must be in status REQUIRES_ACCEPTANCE; otherwise this request will fail.",
      "nested_params": []
    },
    {
      "name": "PlayerIds",
      "type": "list",
      "required": true,
      "description": "A unique identifier for a player delivering the response. This parameter can include one or multiple player IDs. (string) ---",
      "nested_params": []
    },
    {
      "name": "AcceptanceType",
      "type": "string",
      "required": true,
      "description": "Player response to the proposed match.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}