{
  "method_name": "create_fleet_locations",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/gamelift/client/create_fleet_locations.html",
  "description": "Adds remote locations to an EC2 and begins populating the new locations with instances. The new instances conform to the fleet's instance type, auto-scaling, and other configuration settings. To add fleet locations, specify the fleet to be updated and provide a list of one or more locations. If successful, this operation returns the list of added locations with their status set to NEW. Amazon GameLift initiates the process of starting an instance in each added location. You can track the status of each new location by monitoring location creation events using DescribeFleetEvents. Setting up fleets. Update fleet locations. Amazon GameLift service locations for managed hosting.",
  "parameters": [
    {
      "name": "FleetId",
      "type": "string",
      "required": true,
      "description": "A unique identifier for the fleet to add locations to. You can use either the fleet ID or ARN value.",
      "nested_params": []
    },
    {
      "name": "Locations",
      "type": "list",
      "required": true,
      "description": "A list of locations to deploy additional instances to and manage as part of the fleet. You can add any Amazon GameLift-supported Amazon Web Services Region as a remote location, in the form of an Amazon Web Services Region code such as us-west-2. (dict) --- A remote location where a multi-location fleet can deploy game servers for game hosting. An Amazon Web Services Region code, such as us-west-2. For a list of supported Regions and Local Zones, see Amazon GameLift service locations for managed hosting.",
      "nested_params": [
        {
          "name": "Location",
          "type": "string",
          "required": false,
          "description": "An Amazon Web Services Region code, such as us-west-2. For a list of supported Regions and Local Zones, see Amazon GameLift service locations for managed hosting.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "FleetId",
          "type": "string",
          "description": "A unique identifier for the fleet that was updated with new locations.",
          "nested_items": []
        },
        {
          "name": "FleetArn",
          "type": "string",
          "description": "The Amazon Resource Name ( ARN) that is assigned to a Amazon GameLift fleet resource and uniquely identifies it. ARNs are unique across all Regions. Format is arn:aws:gamelift:<region>::fleet/fleet-a1234567-b8c9-0d1e-2fa3-b45c6d7e8912.",
          "nested_items": []
        },
        {
          "name": "LocationStates",
          "type": "list",
          "description": "The remote locations that are being added to the fleet, and the life-cycle status of each location. For new locations, the status is set to NEW. During location creation, Amazon GameLift updates each location's status as instances are deployed there and prepared for game hosting. This list does not include the fleet home Region or any remote locations that were already added to the fleet.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "NEW",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "DOWNLOADING/VALIDATING/BUILDING/ACTIVATING",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "ACTIVE",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "ERROR",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "DELETING",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "TERMINATED",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "NOT_FOUND",
                  "type": "",
                  "description": "",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}