{
  "method_name": "create_game_session_queue",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/gamelift/client/create_game_session_queue.html",
  "description": "Creates a placement queue that processes requests for new game sessions. A queue uses FleetIQ algorithms to locate the best available placement locations for a new game session, and then prompts the game server process to start a new game session. A game session queue is configured with a set of destinations (Amazon GameLift fleets or aliases) that determine where the queue can place new game sessions. These destinations can span multiple Amazon Web Services Regions, can use different instance types, and can include both Spot and On-Demand fleets. If the queue includes multi-location fleets, the queue can place game sessions in any of a fleet's remote locations. You can configure a queue to determine how it selects the best available placement for a new game session. Queues can prioritize placement decisions based on a combination of location, hosting cost, and player latency. You can set up the queue to use the default prioritization or provide alternate instructions using PriorityConfiguration. Use this operation to make these common types of requests. If successful, this operation returns a new GameSessionQueue object with an assigned queue ARN. Use the queue's name or ARN when submitting new game session requests with StartGameSessionPlacement or StartMatchmaking. Design a game session queue. Create a game session queue. CreateGameSessionQueue | DescribeGameSessionQueues | UpdateGameSessionQueue | DeleteGameSessionQueue | All APIs by task.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "A descriptive label that is associated with game session queue. Queue names must be unique within each Region.",
      "nested_params": []
    },
    {
      "name": "TimeoutInSeconds",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "PlayerLatencyPolicies",
      "type": "list",
      "required": false,
      "description": "A set of policies that enforce a sliding cap on player latency when processing game sessions placement requests. Use multiple policies to gradually relax the cap over time if Amazon GameLift can't make a placement. Policies are evaluated in order starting with the lowest maximum latency value. (dict) --- Sets a latency cap for individual players when placing a game session. With a latency policy in force, a game session cannot be placed in a fleet location where a player reports latency higher than the cap. Latency policies are used only with placement request that provide player latency information. Player latency policies can be stacked to gradually relax latency requirements over time. MaximumIndividualPlayerLatencyMilliseconds (integer) --- The maximum latency value that is allowed for any player, in milliseconds. All policies must have a value set for this property. PolicyDurationSeconds (integer) --- The length of time, in seconds, that the policy is enforced while placing a new game session. A null value for this property means that the policy is enforced until the queue times out.",
      "nested_params": [
        {
          "name": "MaximumIndividualPlayerLatencyMilliseconds",
          "type": "integer",
          "required": false,
          "description": "The maximum latency value that is allowed for any player, in milliseconds. All policies must have a value set for this property.",
          "nested_params": []
        },
        {
          "name": "PolicyDurationSeconds",
          "type": "integer",
          "required": false,
          "description": "The length of time, in seconds, that the policy is enforced while placing a new game session. A null value for this property means that the policy is enforced until the queue times out.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Destinations",
      "type": "list",
      "required": false,
      "description": "A list of fleets and/or fleet aliases that can be used to fulfill game session placement requests in the queue. Destinations are identified by either a fleet ARN or a fleet alias ARN, and are listed in order of placement preference. (dict) --- A fleet or alias designated in a game session queue. Queues fulfill requests for new game sessions by placing a new game session on any of the queue's destinations. DestinationArn (string) --- The Amazon Resource Name (ARN) that is assigned to fleet or fleet alias. ARNs, which include a fleet ID or alias ID and a Region name, provide a unique identifier across all Regions.",
      "nested_params": [
        {
          "name": "DestinationArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) that is assigned to fleet or fleet alias. ARNs, which include a fleet ID or alias ID and a Region name, provide a unique identifier across all Regions.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "FilterConfiguration",
      "type": "dict",
      "required": false,
      "description": "A list of locations where a queue is allowed to place new game sessions. Locations are specified in the form of Amazon Web Services Region codes, such as us-west-2. If this parameter is not set, game sessions can be placed in any queue location. AllowedLocations (list) --- A list of locations to allow game session placement in, in the form of Amazon Web Services Region codes such as us-west-2. (string) ---",
      "nested_params": [
        {
          "name": "AllowedLocations",
          "type": "list",
          "required": false,
          "description": "A list of locations to allow game session placement in, in the form of Amazon Web Services Region codes such as us-west-2.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "PriorityConfiguration",
      "type": "dict",
      "required": false,
      "description": "Custom settings to use when prioritizing destinations and locations for game session placements. This configuration replaces the FleetIQ default prioritization process. Priority types that are not explicitly named will be automatically applied at the end of the prioritization process. PriorityOrder (list) --- A custom sequence to use when prioritizing where to place new game sessions. Each priority type is listed once. LATENCY --- Amazon GameLift prioritizes locations where the average player latency is lowest. Player latency data is provided in each game session placement request. COST --- Amazon GameLift prioritizes queue destinations with the lowest current hosting costs. Cost is evaluated based on the destination's location, instance type, and fleet type (Spot or On-Demand). DESTINATION --- Amazon GameLift prioritizes based on the list order of destinations in the queue configuration. LOCATION --- Amazon GameLift prioritizes based on the provided order of locations, as defined in LocationOrder. (string) --- LocationOrder (list) --- The prioritization order to use for fleet locations, when the PriorityOrder property includes LOCATION. Locations can include Amazon Web Services Region codes (such as us-west-2), local zones, and custom locations (for Anywhere fleets). Each location must be listed only once. For details, see Amazon GameLift service locations. (string) ---",
      "nested_params": [
        {
          "name": "PriorityOrder",
          "type": "list",
          "required": false,
          "description": "A custom sequence to use when prioritizing where to place new game sessions. Each priority type is listed once.",
          "nested_params": []
        },
        {
          "name": "LocationOrder",
          "type": "list",
          "required": false,
          "description": "The prioritization order to use for fleet locations, when the PriorityOrder property includes LOCATION. Locations can include Amazon Web Services Region codes (such as us-west-2), local zones, and custom locations (for Anywhere fleets). Each location must be listed only once. For details, see Amazon GameLift service locations.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "CustomEventData",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NotificationTarget",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "A list of labels to assign to the new game session queue resource. Tags are developer-defined key-value pairs. Tagging Amazon Web Services resources are useful for resource management, access management and cost allocation. For more information, see Tagging Amazon Web Services Resources in the Amazon Web Services General Reference. (dict) --- A label that you can assign to a Amazon GameLift resource. Tagging Amazon Web Services Resources in the Amazon Web Services General Reference Amazon Web Services Tagging Strategies All APIs by task The key for a developer-defined key value pair for tagging an Amazon Web Services resource. The value for a developer-defined key value pair for tagging an Amazon Web Services resource.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key for a developer-defined key value pair for tagging an Amazon Web Services resource.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value for a developer-defined key value pair for tagging an Amazon Web Services resource.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "GameSessionQueue",
          "type": "dict",
          "description": "An object that describes the newly created game session queue.",
          "nested_items": [
            {
              "name": "Name",
              "type": "string",
              "description": "A descriptive label that is associated with game session queue. Queue names must be unique within each Region.",
              "nested_items": []
            },
            {
              "name": "GameSessionQueueArn",
              "type": "string",
              "description": "The Amazon Resource Name ( ARN) that is assigned to a Amazon GameLift game session queue resource and uniquely identifies it. ARNs are unique across all Regions. Format is arn:aws:gamelift:<region>::gamesessionqueue/<queue name>. In a Amazon GameLift game session queue ARN, the resource ID matches the Name value.",
              "nested_items": []
            },
            {
              "name": "TimeoutInSeconds",
              "type": "integer",
              "description": "The maximum time, in seconds, that a new game session placement request remains in the queue. When a request exceeds this time, the game session placement changes to a TIMED_OUT status.",
              "nested_items": []
            },
            {
              "name": "PlayerLatencyPolicies",
              "type": "list",
              "description": "A set of policies that enforce a sliding cap on player latency when processing game sessions placement requests. Use multiple policies to gradually relax the cap over time if Amazon GameLift can't make a placement. Policies are evaluated in order starting with the lowest maximum latency value.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "MaximumIndividualPlayerLatencyMilliseconds",
                      "type": "integer",
                      "description": "The maximum latency value that is allowed for any player, in milliseconds. All policies must have a value set for this property.",
                      "nested_items": []
                    },
                    {
                      "name": "PolicyDurationSeconds",
                      "type": "integer",
                      "description": "The length of time, in seconds, that the policy is enforced while placing a new game session. A null value for this property means that the policy is enforced until the queue times out.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "Destinations",
              "type": "list",
              "description": "A list of fleets and/or fleet aliases that can be used to fulfill game session placement requests in the queue. Destinations are identified by either a fleet ARN or a fleet alias ARN, and are listed in order of placement preference.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "DestinationArn",
                      "type": "string",
                      "description": "The Amazon Resource Name (ARN) that is assigned to fleet or fleet alias. ARNs, which include a fleet ID or alias ID and a Region name, provide a unique identifier across all Regions.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "FilterConfiguration",
              "type": "dict",
              "description": "A list of locations where a queue is allowed to place new game sessions. Locations are specified in the form of Amazon Web Services Region codes, such as us-west-2. If this parameter is not set, game sessions can be placed in any queue location.",
              "nested_items": [
                {
                  "name": "AllowedLocations",
                  "type": "list",
                  "description": "A list of locations to allow game session placement in, in the form of Amazon Web Services Region codes such as us-west-2.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "PriorityConfiguration",
              "type": "dict",
              "description": "Custom settings to use when prioritizing destinations and locations for game session placements. This configuration replaces the FleetIQ default prioritization process. Priority types that are not explicitly named will be automatically applied at the end of the prioritization process.",
              "nested_items": [
                {
                  "name": "PriorityOrder",
                  "type": "list",
                  "description": "A custom sequence to use when prioritizing where to place new game sessions. Each priority type is listed once.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "LATENCY --- Amazon GameLift prioritizes locations where the average player latency is lowest. Player latency data is provided in each game session placement request.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "Spot or On-Demand",
                      "description": "COST --- Amazon GameLift prioritizes queue destinations with the lowest current hosting costs. Cost is evaluated based on the destination's location, instance type, and fleet type (Spot or On-Demand).",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "DESTINATION --- Amazon GameLift prioritizes based on the list order of destinations in the queue configuration.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "LOCATION --- Amazon GameLift prioritizes based on the provided order of locations, as defined in LocationOrder.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "LocationOrder",
                  "type": "list",
                  "description": "The prioritization order to use for fleet locations, when the PriorityOrder property includes LOCATION. Locations can include Amazon Web Services Region codes (such as us-west-2), local zones, and custom locations (for Anywhere fleets). Each location must be listed only once. For details, see Amazon GameLift service locations.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "CustomEventData",
              "type": "string",
              "description": "Information that is added to all events that are related to this game session queue.",
              "nested_items": []
            },
            {
              "name": "NotificationTarget",
              "type": "string",
              "description": "An SNS topic ARN that is set up to receive game session placement notifications. See Setting up notifications for game session placement.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}