{
  "method_name": "create_matchmaking_rule_set",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/gamelift/client/create_matchmaking_rule_set.html",
  "description": "Creates a new rule set for FlexMatch matchmaking. A rule set describes the type of match to create, such as the number and size of teams. It also sets the parameters for acceptable player matches, such as minimum skill level or character type. To create a matchmaking rule set, provide unique rule set name and the rule set body in JSON format. Rule sets must be defined in the same Region as the matchmaking configuration they are used with. Since matchmaking rule sets cannot be edited, it is a good idea to check the rule set syntax using ValidateMatchmakingRuleSet before creating a new rule set.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "A unique identifier for the matchmaking rule set. A matchmaking configuration identifies the rule set it uses by this name value. Note that the rule set name is different from the optional name field in the rule set body.",
      "nested_params": []
    },
    {
      "name": "RuleSetBody",
      "type": "string",
      "required": true,
      "description": "A collection of matchmaking rules, formatted as a JSON string. Comments are not allowed in JSON, but most elements support a description field.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "A list of labels to assign to the new matchmaking rule set resource. Tags are developer-defined key-value pairs. Tagging Amazon Web Services resources are useful for resource management, access management and cost allocation. For more information, see Tagging Amazon Web Services Resources in the Amazon Web Services General Reference. (dict) --- A label that you can assign to a Amazon GameLift resource. Tagging Amazon Web Services Resources in the Amazon Web Services General Reference Amazon Web Services Tagging Strategies All APIs by task The key for a developer-defined key value pair for tagging an Amazon Web Services resource. The value for a developer-defined key value pair for tagging an Amazon Web Services resource.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key for a developer-defined key value pair for tagging an Amazon Web Services resource.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value for a developer-defined key value pair for tagging an Amazon Web Services resource.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "RuleSetName",
              "type": "string",
              "description": "A unique identifier for the matchmaking rule set.",
              "nested_items": []
            },
            {
              "name": "RuleSetArn",
              "type": "string",
              "description": "The Amazon Resource Name ( ARN) that is assigned to a Amazon GameLift matchmaking rule set resource and uniquely identifies it. ARNs are unique across all Regions. Format is arn:aws:gamelift:<region>::matchmakingruleset/<ruleset name>. In a GameLift rule set ARN, the resource ID matches the RuleSetName value.",
              "nested_items": []
            },
            {
              "name": "RuleSetBody",
              "type": "string",
              "description": "A collection of matchmaking rules, formatted as a JSON string. Comments are not allowed in JSON, but most elements support a description field.",
              "nested_items": []
            },
            {
              "name": "CreationTime",
              "type": "datetime",
              "description": "A time stamp indicating when this data object was created. Format is a number expressed in Unix time as milliseconds (for example \"1469498468.057\").",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}