{
  "method_name": "create_game_session",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/gamelift/client/create_game_session.html",
  "description": "Creates a multiplayer game session for players in a specific fleet location. This operation prompts an available server process to start a game session and retrieves connection information for the new game session. As an alternative, consider using the Amazon GameLift game session placement feature with StartGameSessionPlacement, which uses the FleetIQ algorithm and queues to optimize the placement process. When creating a game session, you specify exactly where you want to place it and provide a set of game session configuration settings. The target fleet must be in ACTIVE status. You can use this operation in the following ways: If successful, Amazon GameLift initiates a workflow to start a new game session and returns a GameSession object containing the game session configuration and status. When the game session status is ACTIVE, it is updated with connection information and you can create player sessions for the game session. By default, newly created game sessions are open to new players. You can restrict new player access by using UpdateGameSession to change the game session's player session creation policy. Amazon GameLift retains logs for active for 14 days. To access the logs, call GetGameSessionLogUrl to download the log files. Available in Amazon GameLift Local. Start a game session. All APIs by task.",
  "parameters": [
    {
      "name": "FleetId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "AliasId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaximumPlayerSessionCount",
      "type": "integer",
      "required": true,
      "description": "The maximum number of players that can be connected simultaneously to the game session.",
      "nested_params": []
    },
    {
      "name": "Name",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "GameProperties",
      "type": "list",
      "required": true,
      "description": "A set of key-value pairs that can store custom data in a game session. For example: {\"Key\": \"difficulty\", \"Value\": \"novice\"}. For an example, see Create a game session with custom properties. (dict) --- This key-value pair can store custom data about a game session. For example, you might use a GameProperty to track a game session's map, level of difficulty, or remaining time. The difficulty level could be specified like this: {\"Key\": \"difficulty\", \"Value\":\"Novice\"}. You can set game properties when creating a game session. You can also modify game properties of an active game session. When searching for game sessions, you can filter on game property keys and values. You can't delete game properties from a game session. For examples of working with game properties, see Create a game session with properties. The game property identifier. The game property value.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The game property identifier.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The game property value.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "CreatorId",
      "type": "string",
      "required": false,
      "description": "A unique identifier for a player or entity creating the game session. If you add a resource creation limit policy to a fleet, the CreateGameSession operation requires a CreatorId. Amazon GameLift limits the number of game session creation requests with the same CreatorId in a specified time period. If you your fleet doesn't have a resource creation limit policy and you provide a CreatorId in your CreateGameSession requests, Amazon GameLift limits requests to one request per CreatorId per second. To not limit CreateGameSession requests with the same CreatorId, don't provide a CreatorId in your CreateGameSession request.",
      "nested_params": []
    },
    {
      "name": "GameSessionId",
      "type": "string",
      "required": false,
      "description": "This parameter is deprecated. Use IdempotencyToken instead. Custom string that uniquely identifies a request for a new game session. Maximum token length is 48 characters. If provided, this string is included in the new game session's ID.",
      "nested_params": []
    },
    {
      "name": "IdempotencyToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "GameSessionData",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Location",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "GameSession",
          "type": "dict",
          "description": "Object that describes the newly created game session record.",
          "nested_items": [
            {
              "name": "GameSessionId",
              "type": "string",
              "description": "A unique identifier for the game session. A game session ARN has the following format: arn:aws:gamelift:<location>::gamesession/<fleet ID>/<custom ID string or idempotency token>.",
              "nested_items": []
            },
            {
              "name": "Name",
              "type": "string",
              "description": "A descriptive label that is associated with a game session. Session names do not need to be unique.",
              "nested_items": []
            },
            {
              "name": "FleetId",
              "type": "string",
              "description": "A unique identifier for the fleet that the game session is running on.",
              "nested_items": []
            },
            {
              "name": "FleetArn",
              "type": "string",
              "description": "The Amazon Resource Name ( ARN) associated with the GameLift fleet that this game session is running on.",
              "nested_items": []
            },
            {
              "name": "CreationTime",
              "type": "datetime",
              "description": "A time stamp indicating when this data object was created. Format is a number expressed in Unix time as milliseconds (for example \"1469498468.057\").",
              "nested_items": []
            },
            {
              "name": "TerminationTime",
              "type": "datetime",
              "description": "A time stamp indicating when this data object was terminated. Format is a number expressed in Unix time as milliseconds (for example \"1469498468.057\").",
              "nested_items": []
            },
            {
              "name": "CurrentPlayerSessionCount",
              "type": "integer",
              "description": "Number of players currently in the game session.",
              "nested_items": []
            },
            {
              "name": "MaximumPlayerSessionCount",
              "type": "integer",
              "description": "The maximum number of players that can be connected simultaneously to the game session.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "Current status of the game session. A game session must have an ACTIVE status to have player sessions.",
              "nested_items": []
            },
            {
              "name": "StatusReason",
              "type": "string",
              "description": "Provides additional information about game session status.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "INTERRUPTED --- The game session was hosted on an EC2 Spot instance that was reclaimed, causing the active game session to be stopped.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "TRIGGERED_ON_PROCESS_TERMINATE --- The game session was stopped by calling TerminateGameSession with the termination mode TRIGGER_ON_PROCESS_TERMINATE.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "FORCE_TERMINATED --- The game session was stopped by calling TerminateGameSession with the termination mode FORCE_TERMINATE.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "GameProperties",
              "type": "list",
              "description": "A set of key-value pairs that can store custom data in a game session. For example: {\"Key\": \"difficulty\", \"Value\": \"novice\"}.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Key",
                      "type": "string",
                      "description": "The game property identifier.",
                      "nested_items": []
                    },
                    {
                      "name": "Value",
                      "type": "string",
                      "description": "The game property value.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "IpAddress",
              "type": "string",
              "description": "The IP address of the game session. To connect to a Amazon GameLift game server, an app needs both the IP address and port number.",
              "nested_items": []
            },
            {
              "name": "DnsName",
              "type": "string",
              "description": "The DNS identifier assigned to the instance that is running the game session. Values have the following format:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "TLS-enabled fleets: <unique identifier>.<region identifier>.amazongamelift.com.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "See Amazon EC2 Instance IP Addressing.",
                  "description": "Non-TLS-enabled fleets: ec2-<unique identifier>.compute.amazonaws.com. (See Amazon EC2 Instance IP Addressing.)",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Port",
              "type": "integer",
              "description": "The port number for the game session. To connect to a Amazon GameLift game server, an app needs both the IP address and port number.",
              "nested_items": []
            },
            {
              "name": "PlayerSessionCreationPolicy",
              "type": "string",
              "description": "Indicates whether the game session is accepting new players.",
              "nested_items": []
            },
            {
              "name": "CreatorId",
              "type": "string",
              "description": "A unique identifier for a player. This ID is used to enforce a resource protection policy (if one exists), that limits the number of game sessions a player can create.",
              "nested_items": []
            },
            {
              "name": "GameSessionData",
              "type": "string",
              "description": "A set of custom game session properties, formatted as a single string value. This data is passed to a game server process with a request to start a new game session. For more information, see Start a game session.",
              "nested_items": []
            },
            {
              "name": "MatchmakerData",
              "type": "string",
              "description": "Information about the matchmaking process that resulted in the game session, if matchmaking was used. Data is in JSON syntax, formatted as a string. Information includes the matchmaker ID as well as player attributes and team assignments. For more details on matchmaker data, see Match Data. Matchmaker data is updated whenever new players are added during a successful backfill (see StartMatchBackfill).",
              "nested_items": []
            },
            {
              "name": "Location",
              "type": "string",
              "description": "The fleet location where the game session is running. This value might specify the fleet's home Region or a remote location. Location is expressed as an Amazon Web Services Region code such as us-west-2.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}