{
  "method_name": "create_player_sessions",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/gamelift/client/create_player_sessions.html",
  "description": "Reserves open slots in a game session for a group of players. New player sessions can be created in any game session with an open slot that is in ACTIVE status and has a player creation policy of ACCEPT_ALL. To add a single player to a game session, use CreatePlayerSession. To create player sessions, specify a game session ID and a list of player IDs. Optionally, provide a set of player data for each player ID. If successful, a slot is reserved in the game session for each player, and new PlayerSession objects are returned with player session IDs. Each player references their player session ID when sending a connection request to the game session, and the game server can use it to validate the player reservation with the Amazon GameLift service. Player sessions cannot be updated. The maximum number of players per game session is 200. It is not adjustable. All APIs by task.",
  "parameters": [
    {
      "name": "GameSessionId",
      "type": "string",
      "required": true,
      "description": "A unique identifier for the game session to add players to.",
      "nested_params": []
    },
    {
      "name": "PlayerIds",
      "type": "list",
      "required": true,
      "description": "List of unique identifiers for the players to be added. (string) ---",
      "nested_params": []
    },
    {
      "name": "PlayerDataMap",
      "type": "dict",
      "required": false,
      "description": "Map of string pairs, each specifying a player ID and a set of developer-defined information related to the player. Amazon GameLift does not use this data, so it can be formatted as needed for use in the game. Any player data strings for player IDs that are not included in the PlayerIds parameter are ignored. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "PlayerSessions",
          "type": "list",
          "description": "A collection of player session objects created for the added players.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "PlayerSessionId",
                  "type": "string",
                  "description": "A unique identifier for a player session.",
                  "nested_items": []
                },
                {
                  "name": "PlayerId",
                  "type": "string",
                  "description": "A unique identifier for a player that is associated with this player session.",
                  "nested_items": []
                },
                {
                  "name": "GameSessionId",
                  "type": "string",
                  "description": "A unique identifier for the game session that the player session is connected to.",
                  "nested_items": []
                },
                {
                  "name": "FleetId",
                  "type": "string",
                  "description": "A unique identifier for the fleet that the player's game session is running on.",
                  "nested_items": []
                },
                {
                  "name": "FleetArn",
                  "type": "string",
                  "description": "The Amazon Resource Name ( ARN) associated with the GameLift fleet that the player's game session is running on.",
                  "nested_items": []
                },
                {
                  "name": "CreationTime",
                  "type": "datetime",
                  "description": "A time stamp indicating when this data object was created. Format is a number expressed in Unix time as milliseconds (for example \"1469498468.057\").",
                  "nested_items": []
                },
                {
                  "name": "TerminationTime",
                  "type": "datetime",
                  "description": "A time stamp indicating when this data object was terminated. Format is a number expressed in Unix time as milliseconds (for example \"1469498468.057\").",
                  "nested_items": []
                },
                {
                  "name": "Status",
                  "type": "string",
                  "description": "Current status of the player session.",
                  "nested_items": [
                    {
                      "name": "RESERVED",
                      "type": "",
                      "description": "",
                      "nested_items": []
                    },
                    {
                      "name": "ACTIVE",
                      "type": "",
                      "description": "",
                      "nested_items": []
                    },
                    {
                      "name": "COMPLETED",
                      "type": "",
                      "description": "",
                      "nested_items": []
                    },
                    {
                      "name": "TIMEDOUT",
                      "type": "60 seconds",
                      "description": "",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "IpAddress",
                  "type": "string",
                  "description": "The IP address of the game session. To connect to a Amazon GameLift game server, an app needs both the IP address and port number.",
                  "nested_items": []
                },
                {
                  "name": "DnsName",
                  "type": "string",
                  "description": "The DNS identifier assigned to the instance that is running the game session. Values have the following format:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "TLS-enabled fleets: <unique identifier>.<region identifier>.amazongamelift.com.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "See Amazon EC2 Instance IP Addressing.",
                      "description": "Non-TLS-enabled fleets: ec2-<unique identifier>.compute.amazonaws.com. (See Amazon EC2 Instance IP Addressing.)",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Port",
                  "type": "integer",
                  "description": "Port number for the game session. To connect to a Amazon GameLift server process, an app needs both the IP address and port number.",
                  "nested_items": []
                },
                {
                  "name": "PlayerData",
                  "type": "string",
                  "description": "Developer-defined information related to a player. Amazon GameLift does not use this data, so it can be formatted as needed for use in the game.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}