{
  "method_name": "describe_fleet_capacity",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/gamelift/client/describe_fleet_capacity.html",
  "description": "Retrieves the resource capacity settings for one or more fleets. For a container fleet, this operation also returns counts for game server container groups. With multi-location fleets, this operation retrieves data for the fleet's home Region only. To retrieve capacity for remote locations, see https://docs.aws.amazon.com/gamelift/latest/apireference/API_DescribeFleetLocationCapacity.html. This operation can be used in the following ways: When requesting multiple fleets, use the pagination parameters to retrieve results as a set of sequential pages. If successful, a FleetCapacity object is returned for each requested fleet ID. Each FleetCapacity object includes a Location property, which is set to the fleet's home Region. Capacity values are returned only for fleets that currently exist. Setting up Amazon GameLift fleets. GameLift metrics for fleets.",
  "parameters": [
    {
      "name": "FleetIds",
      "type": "list",
      "required": false,
      "description": "A unique identifier for the fleet to retrieve capacity information for. You can use either the fleet ID or ARN value. Leave this parameter empty to retrieve capacity information for all fleets. (string) ---",
      "nested_params": []
    },
    {
      "name": "Limit",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "FleetCapacity",
          "type": "list",
          "description": "A collection of objects that contains capacity information for each requested fleet ID. Capacity objects are returned only for fleets that currently exist. Changes in desired instance value can take up to 1 minute to be reflected.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "FleetId",
                  "type": "string",
                  "description": "A unique identifier for the fleet associated with the location.",
                  "nested_items": []
                },
                {
                  "name": "FleetArn",
                  "type": "string",
                  "description": "The Amazon Resource Name ( ARN) that is assigned to a Amazon GameLift fleet resource and uniquely identifies it. ARNs are unique across all Regions. Format is arn:aws:gamelift:<region>::fleet/fleet-a1234567-b8c9-0d1e-2fa3-b45c6d7e8912.",
                  "nested_items": []
                },
                {
                  "name": "InstanceType",
                  "type": "string",
                  "description": "The Amazon EC2 instance type that is used for instances in a fleet. Instance type determines the computing resources in use, including CPU, memory, storage, and networking capacity. See Amazon Elastic Compute Cloud Instance Types for detailed descriptions.",
                  "nested_items": []
                },
                {
                  "name": "InstanceCounts",
                  "type": "dict",
                  "description": "The current number of instances in the fleet, listed by instance status. Counts for pending and terminating instances might be non-zero if the fleet is adjusting to a scaling event or if access to resources is temporarily affected.",
                  "nested_items": [
                    {
                      "name": "DESIRED",
                      "type": "integer",
                      "description": "Requested number of active instances. Amazon GameLift takes action as needed to maintain the desired number of instances. Capacity is scaled up or down by changing the desired instances. A change in the desired instances value can take up to 1 minute to be reflected when viewing a fleet's capacity settings.",
                      "nested_items": []
                    },
                    {
                      "name": "MINIMUM",
                      "type": "integer",
                      "description": "The minimum instance count value allowed.",
                      "nested_items": []
                    },
                    {
                      "name": "MAXIMUM",
                      "type": "integer",
                      "description": "The maximum instance count value allowed.",
                      "nested_items": []
                    },
                    {
                      "name": "PENDING",
                      "type": "integer",
                      "description": "Number of instances that are starting but not yet active.",
                      "nested_items": []
                    },
                    {
                      "name": "ACTIVE",
                      "type": "integer",
                      "description": "Actual number of instances that are ready to host game sessions.",
                      "nested_items": []
                    },
                    {
                      "name": "IDLE",
                      "type": "integer",
                      "description": "Number of active instances that are not currently hosting a game session.",
                      "nested_items": []
                    },
                    {
                      "name": "TERMINATING",
                      "type": "integer",
                      "description": "Number of instances that are no longer active but haven't yet been terminated.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Location",
                  "type": "string",
                  "description": "The fleet location for the instance count information, expressed as an Amazon Web Services Region code, such as us-west-2.",
                  "nested_items": []
                },
                {
                  "name": "GameServerContainerGroupCounts",
                  "type": "dict",
                  "description": "The number and status of game server container groups deployed in a container fleet.",
                  "nested_items": [
                    {
                      "name": "PENDING",
                      "type": "integer",
                      "description": "The number of container groups that are starting up but haven't yet registered.",
                      "nested_items": []
                    },
                    {
                      "name": "ACTIVE",
                      "type": "integer",
                      "description": "The number of container groups that have active game sessions.",
                      "nested_items": []
                    },
                    {
                      "name": "IDLE",
                      "type": "integer",
                      "description": "The number of container groups that have no active game sessions.",
                      "nested_items": []
                    },
                    {
                      "name": "TERMINATING",
                      "type": "integer",
                      "description": "The number of container groups that are in the process of shutting down.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "A token that indicates where to resume retrieving results on the next call to this operation. If no token is returned, these results represent the end of the list.",
          "nested_items": []
        }
      ]
    }
  ]
}