{
  "method_name": "describe_fleet_location_attributes",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/gamelift/client/describe_fleet_location_attributes.html",
  "description": "Retrieves information on a fleet's remote locations, including life-cycle status and any suspended fleet activity. This operation can be used in the following ways: When requesting attributes for multiple locations, use the pagination parameters to retrieve results as a set of sequential pages. If successful, a LocationAttributes object is returned for each requested location. If the fleet does not have a requested location, no information is returned. This operation does not return the home Region. To get information on a fleet's home Region, call DescribeFleetAttributes. Setting up Amazon GameLift fleets. Amazon GameLift service locations for managed hosting.",
  "parameters": [
    {
      "name": "FleetId",
      "type": "string",
      "required": true,
      "description": "A unique identifier for the fleet to retrieve remote locations for. You can use either the fleet ID or ARN value.",
      "nested_params": []
    },
    {
      "name": "Locations",
      "type": "list",
      "required": false,
      "description": "A list of fleet locations to retrieve information for. Specify locations in the form of an Amazon Web Services Region code, such as us-west-2. (string) ---",
      "nested_params": []
    },
    {
      "name": "Limit",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "FleetId",
          "type": "string",
          "description": "A unique identifier for the fleet that location attributes were requested for.",
          "nested_items": []
        },
        {
          "name": "FleetArn",
          "type": "string",
          "description": "The Amazon Resource Name ( ARN) that is assigned to a Amazon GameLift fleet resource and uniquely identifies it. ARNs are unique across all Regions. Format is arn:aws:gamelift:<region>::fleet/fleet-a1234567-b8c9-0d1e-2fa3-b45c6d7e8912.",
          "nested_items": []
        },
        {
          "name": "LocationAttributes",
          "type": "list",
          "description": "Location-specific information on the requested fleet's remote locations.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "LocationState",
                  "type": "dict",
                  "description": "A fleet location and its current life-cycle state.",
                  "nested_items": [
                    {
                      "name": "Location",
                      "type": "string",
                      "description": "The fleet location, expressed as an Amazon Web Services Region code such as us-west-2.",
                      "nested_items": []
                    },
                    {
                      "name": "Status",
                      "type": "string",
                      "description": "The life-cycle status of a fleet location.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "StoppedActions",
                  "type": "list",
                  "description": "A list of fleet actions that have been suspended in the fleet location.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "UpdateStatus",
                  "type": "string",
                  "description": "The status of fleet activity updates to the location. The status PENDING_UPDATE indicates that StopFleetActions or StartFleetActions has been requested but the update has not yet been completed for the location.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "A token that indicates where to resume retrieving results on the next call to this operation. If no token is returned, these results represent the end of the list.",
          "nested_items": []
        }
      ]
    }
  ]
}