{
  "method_name": "describe_vpc_peering_connections",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/gamelift/client/describe_vpc_peering_connections.html",
  "description": "Retrieves information on VPC peering connections. Use this operation to get peering information for all fleets or for one specific fleet ID. To retrieve connection information, call this operation from the Amazon Web Services account that is used to manage the Amazon GameLift fleets. Specify a fleet ID or leave the parameter empty to retrieve all connection records. If successful, the retrieved information includes both active and pending connections. Active connections identify the IpV4 CIDR block that the VPC uses to connect. All APIs by task.",
  "parameters": [
    {
      "name": "FleetId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "VpcPeeringConnections",
          "type": "list",
          "description": "A collection of VPC peering connection records that match the request.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "FleetId",
                  "type": "string",
                  "description": "A unique identifier for the fleet. This ID determines the ID of the Amazon GameLift VPC for your fleet.",
                  "nested_items": []
                },
                {
                  "name": "FleetArn",
                  "type": "string",
                  "description": "The Amazon Resource Name ( ARN) associated with the GameLift fleet resource for this connection.",
                  "nested_items": []
                },
                {
                  "name": "IpV4CidrBlock",
                  "type": "string",
                  "description": "CIDR block of IPv4 addresses assigned to the VPC peering connection for the GameLift VPC. The peered VPC also has an IPv4 CIDR block associated with it; these blocks cannot overlap or the peering connection cannot be created.",
                  "nested_items": []
                },
                {
                  "name": "VpcPeeringConnectionId",
                  "type": "string",
                  "description": "A unique identifier that is automatically assigned to the connection record. This ID is referenced in VPC peering connection events, and is used when deleting a connection.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Code",
                      "type": "string",
                      "description": "Code indicating the status of a VPC peering connection.",
                      "nested_items": []
                    },
                    {
                      "name": "Message",
                      "type": "string",
                      "description": "Additional messaging associated with the connection status.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "PeerVpcId",
                  "type": "string",
                  "description": "A unique identifier for a VPC with resources to be accessed by your Amazon GameLift fleet. The VPC must be in the same Region as your fleet. To look up a VPC ID, use the VPC Dashboard in the Amazon Web Services Management Console. Learn more about VPC peering in VPC Peering with Amazon GameLift Fleets.",
                  "nested_items": []
                },
                {
                  "name": "GameLiftVpcId",
                  "type": "string",
                  "description": "A unique identifier for the VPC that contains the Amazon GameLift fleet for this connection. This VPC is managed by Amazon GameLift and does not appear in your Amazon Web Services account.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}