{
  "method_name": "describe_fleet_location_utilization",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/gamelift/client/describe_fleet_location_utilization.html",
  "description": "Retrieves current usage data for a fleet location. Utilization data provides a snapshot of current game hosting activity at the requested location. Use this operation to retrieve utilization information for a fleet's remote location or home Region (you can also retrieve home Region utilization by calling DescribeFleetUtilization). To retrieve utilization data, identify a fleet and location. If successful, a FleetUtilization object is returned for the requested fleet location. Setting up Amazon GameLift fleets. Amazon GameLift service locations for managed hosting. GameLift metrics for fleets.",
  "parameters": [
    {
      "name": "FleetId",
      "type": "string",
      "required": true,
      "description": "A unique identifier for the fleet to request location utilization for. You can use either the fleet ID or ARN value.",
      "nested_params": []
    },
    {
      "name": "Location",
      "type": "string",
      "required": true,
      "description": "The fleet location to retrieve utilization information for. Specify a location in the form of an Amazon Web Services Region code, such as us-west-2.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "FleetUtilization",
          "type": "dict",
          "description": "Utilization information for the requested fleet location. Utilization objects are returned only for fleets and locations that currently exist.",
          "nested_items": [
            {
              "name": "FleetId",
              "type": "string",
              "description": "A unique identifier for the fleet associated with the location.",
              "nested_items": []
            },
            {
              "name": "FleetArn",
              "type": "string",
              "description": "The Amazon Resource Name ( ARN) that is assigned to a Amazon GameLift fleet resource and uniquely identifies it. ARNs are unique across all Regions. Format is arn:aws:gamelift:<region>::fleet/fleet-a1234567-b8c9-0d1e-2fa3-b45c6d7e8912.",
              "nested_items": []
            },
            {
              "name": "ActiveServerProcessCount",
              "type": "integer",
              "description": "The number of server processes in ACTIVE status that are currently running across all instances in the fleet location.",
              "nested_items": []
            },
            {
              "name": "ActiveGameSessionCount",
              "type": "integer",
              "description": "The number of active game sessions that are currently being hosted across all instances in the fleet location.",
              "nested_items": []
            },
            {
              "name": "CurrentPlayerSessionCount",
              "type": "integer",
              "description": "The number of active player sessions that are currently being hosted across all instances in the fleet location.",
              "nested_items": []
            },
            {
              "name": "MaximumPlayerSessionCount",
              "type": "integer",
              "description": "The maximum number of players allowed across all game sessions that are currently being hosted across all instances in the fleet location.",
              "nested_items": []
            },
            {
              "name": "Location",
              "type": "string",
              "description": "The fleet location for the fleet utilization information, expressed as an Amazon Web Services Region code, such as us-west-2.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}