{
  "method_name": "describe_ec2_instance_limits",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/gamelift/client/describe_ec2_instance_limits.html",
  "description": "Retrieves the instance limits and current utilization for an Amazon Web Services Region or location. Instance limits control the number of instances, per instance type, per location, that your Amazon Web Services account can use. Learn more at Amazon EC2 Instance Types. The information returned includes the maximum number of instances allowed and your account's current usage across all fleets. This information can affect your ability to scale your Amazon GameLift fleets. You can request a limit increase for your account by using the Service limits page in the Amazon GameLift console. Instance limits differ based on whether the instances are deployed in a fleet's home Region or in a remote location. For remote locations, limits also differ based on the combination of home Region and remote location. All requests must specify an Amazon Web Services Region (either explicitly or as your default settings). To get the limit for a remote location, you must also specify the location. For example, the following requests all return different results: This operation can be used in the following ways: If successful, an EC2InstanceLimits object is returned with limits and usage data for each requested instance type. Setting up Amazon GameLift fleets.",
  "parameters": [
    {
      "name": "EC2InstanceType",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Location",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "EC2InstanceLimits",
          "type": "list",
          "description": "The maximum number of instances for the specified instance type.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "EC2InstanceType",
                  "type": "string",
                  "description": "The name of an Amazon EC2 instance type. See Amazon Elastic Compute Cloud Instance Types for detailed descriptions.",
                  "nested_items": []
                },
                {
                  "name": "CurrentInstances",
                  "type": "integer",
                  "description": "The number of instances for the specified type and location that are currently being used by the Amazon Web Services account.",
                  "nested_items": []
                },
                {
                  "name": "InstanceLimit",
                  "type": "integer",
                  "description": "The number of instances that is allowed for the specified instance type and location.",
                  "nested_items": []
                },
                {
                  "name": "Location",
                  "type": "string",
                  "description": "An Amazon Web Services Region code, such as us-west-2.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}