{
  "method_name": "describe_vpc_peering_authorizations",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/gamelift/client/describe_vpc_peering_authorizations.html",
  "description": "Retrieves valid VPC peering authorizations that are pending for the Amazon Web Services account. This operation returns all VPC peering authorizations and requests for peering. This includes those initiated and received by this account. All APIs by task.",
  "parameters": [],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "VpcPeeringAuthorizations",
          "type": "list",
          "description": "A collection of objects that describe all valid VPC peering operations for the current Amazon Web Services account.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "GameLiftAwsAccountId",
                  "type": "string",
                  "description": "A unique identifier for the Amazon Web Services account that you use to manage your Amazon GameLift fleet. You can find your Account ID in the Amazon Web Services Management Console under account settings.",
                  "nested_items": []
                },
                {
                  "name": "PeerVpcAwsAccountId",
                  "type": "string",
                  "description": "The authorization's peer VPC Amazon Web Services account ID.",
                  "nested_items": []
                },
                {
                  "name": "PeerVpcId",
                  "type": "string",
                  "description": "A unique identifier for a VPC with resources to be accessed by your Amazon GameLift fleet. The VPC must be in the same Region as your fleet. To look up a VPC ID, use the VPC Dashboard in the Amazon Web Services Management Console. Learn more about VPC peering in VPC Peering with Amazon GameLift Fleets.",
                  "nested_items": []
                },
                {
                  "name": "CreationTime",
                  "type": "datetime",
                  "description": "Time stamp indicating when this authorization was issued. Format is a number expressed in Unix time as milliseconds (for example \"1469498468.057\").",
                  "nested_items": []
                },
                {
                  "name": "ExpirationTime",
                  "type": "datetime",
                  "description": "Time stamp indicating when this authorization expires (24 hours after issuance). Format is a number expressed in Unix time as milliseconds (for example \"1469498468.057\").",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}