{
  "method_name": "get_compute_access",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/gamelift/client/get_compute_access.html",
  "description": "Requests authorization to remotely connect to a hosting resource in a Amazon GameLift managed fleet. This operation is not used with Amazon GameLift Anywhere fleets. Provide the fleet ID and compute name. The compute name varies depending on the type of fleet. If successful, this operation returns a set of temporary Amazon Web Services credentials, including a two-part access key and a session token.",
  "parameters": [
    {
      "name": "FleetId",
      "type": "string",
      "required": true,
      "description": "A unique identifier for the fleet that holds the compute resource that you want to connect to. You can use either the fleet ID or ARN value.",
      "nested_params": []
    },
    {
      "name": "ComputeName",
      "type": "string",
      "required": true,
      "description": "A unique identifier for the compute resource that you want to connect to. For an EC2 fleet, use an instance ID. For a managed container fleet, use a compute name. You can retrieve a fleet's compute names by calling ListCompute.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "FleetId",
          "type": "string",
          "description": "The ID of the fleet that holds the compute resource to be accessed.",
          "nested_items": []
        },
        {
          "name": "FleetArn",
          "type": "string",
          "description": "The Amazon Resource Name ( ARN) that is assigned to a Amazon GameLift fleet resource and uniquely identifies it. ARNs are unique across all Regions. Format is arn:aws:gamelift:<region>::fleet/fleet-a1234567-b8c9-0d1e-2fa3-b45c6d7e8912.",
          "nested_items": []
        },
        {
          "name": "ComputeName",
          "type": "string",
          "description": "The identifier of the compute resource to be accessed. This value might be either a compute name or an instance ID.",
          "nested_items": []
        },
        {
          "name": "ComputeArn",
          "type": "string",
          "description": "The Amazon Resource Name ( ARN) that is assigned to an Amazon GameLift compute resource and uniquely identifies it. ARNs are unique across all Regions. Format is arn:aws:gamelift:<region>::compute/compute-a1234567-b8c9-0d1e-2fa3-b45c6d7e8912.",
          "nested_items": []
        },
        {
          "name": "Credentials",
          "type": "dict",
          "description": "A set of temporary Amazon Web Services credentials for use when connecting to the compute resource with Amazon EC2 Systems Manager (SSM).",
          "nested_items": [
            {
              "name": "AccessKeyId",
              "type": "string",
              "description": "The access key ID that identifies the temporary security credentials.",
              "nested_items": []
            },
            {
              "name": "SecretAccessKey",
              "type": "string",
              "description": "The secret access key that can be used to sign requests.",
              "nested_items": []
            },
            {
              "name": "SessionToken",
              "type": "string",
              "description": "The token that users must pass to the service API to use the temporary credentials.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "Target",
          "type": "string",
          "description": "The instance ID where the compute resource is running.",
          "nested_items": []
        },
        {
          "name": "ContainerIdentifiers",
          "type": "list",
          "description": "For a managed container fleet, a list of containers on the compute. Use the container runtime ID with Docker commands to connect to a specific container.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ContainerName",
                  "type": "string",
                  "description": "The identifier for a container that's running in a compute.",
                  "nested_items": []
                },
                {
                  "name": "ContainerRuntimeId",
                  "type": "string",
                  "description": "The runtime ID for the container that's running in a compute. This value is unique within the compute. It is returned as a ContainerAttribute value in a Compute object.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}