{
  "method_name": "register_compute",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/gamelift/client/register_compute.html",
  "description": "Registers a compute resource in an Amazon GameLift Anywhere fleet. For an Anywhere fleet that's running the Amazon GameLift Agent, the Agent handles all compute registry tasks for you. For an Anywhere fleet that doesn't use the Agent, call this operation to register fleet computes. To register a compute, give the compute a name (must be unique within the fleet) and specify the compute resource's DNS name or IP address. Provide a fleet ID and a fleet location to associate with the compute being registered. You can optionally include the path to a TLS certificate on the compute resource. If successful, this operation returns compute details, including an Amazon GameLift SDK endpoint or Agent endpoint. Game server processes running on the compute can use this endpoint to communicate with the Amazon GameLift service. Each server process includes the SDK endpoint in its call to the Amazon GameLift server SDK action InitSDK(). To view compute details, call DescribeCompute with the compute name.",
  "parameters": [
    {
      "name": "FleetId",
      "type": "string",
      "required": true,
      "description": "A unique identifier for the fleet to register the compute to. You can use either the fleet ID or ARN value.",
      "nested_params": []
    },
    {
      "name": "ComputeName",
      "type": "string",
      "required": true,
      "description": "A descriptive label for the compute resource.",
      "nested_params": []
    },
    {
      "name": "CertificatePath",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DnsName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "IpAddress",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Location",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "FleetId",
              "type": "string",
              "description": "A unique identifier for the fleet that the compute belongs to.",
              "nested_items": []
            },
            {
              "name": "FleetArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the fleet that the compute belongs to.",
              "nested_items": []
            },
            {
              "name": "ComputeName",
              "type": "string",
              "description": "A descriptive label for the compute resource. For instances in a managed EC2 fleet, the compute name is the same value as the InstanceId ID.",
              "nested_items": []
            },
            {
              "name": "ComputeArn",
              "type": "string",
              "description": "The ARN that is assigned to a compute resource and uniquely identifies it. ARNs are unique across locations. Instances in managed EC2 fleets are not assigned a Compute ARN.",
              "nested_items": []
            },
            {
              "name": "IpAddress",
              "type": "string",
              "description": "The IP address of a compute resource. Amazon GameLift requires a DNS name or IP address for a compute.",
              "nested_items": []
            },
            {
              "name": "DnsName",
              "type": "string",
              "description": "The DNS name of a compute resource. Amazon GameLift requires a DNS name or IP address for a compute.",
              "nested_items": []
            },
            {
              "name": "ComputeStatus",
              "type": "string",
              "description": "Current status of the compute. A compute must have an ACTIVE status to host game sessions.",
              "nested_items": []
            },
            {
              "name": "Location",
              "type": "string",
              "description": "The name of the custom location you added to the fleet that this compute resource resides in.",
              "nested_items": []
            },
            {
              "name": "CreationTime",
              "type": "datetime",
              "description": "A time stamp indicating when this data object was created. Format is a number expressed in Unix time as milliseconds (for example \"1469498468.057\").",
              "nested_items": []
            },
            {
              "name": "OperatingSystem",
              "type": "string",
              "description": "The type of operating system on the compute resource.",
              "nested_items": []
            },
            {
              "name": "Type",
              "type": "string",
              "description": "The Amazon EC2 instance type that the fleet uses. For registered computes in an Amazon GameLift Anywhere fleet, this property is empty.",
              "nested_items": []
            },
            {
              "name": "GameLiftServiceSdkEndpoint",
              "type": "string",
              "description": "The Amazon GameLift SDK endpoint connection for a registered compute resource in an Anywhere fleet. The game servers on the compute use this endpoint to connect to the Amazon GameLift service.",
              "nested_items": []
            },
            {
              "name": "GameLiftAgentEndpoint",
              "type": "string",
              "description": "The endpoint of the Amazon GameLift Agent.",
              "nested_items": []
            },
            {
              "name": "InstanceId",
              "type": "string",
              "description": "The InstanceID of the EC2 instance that is hosting the compute.",
              "nested_items": []
            },
            {
              "name": "ContainerAttributes",
              "type": "list",
              "description": "A set of attributes for each container in the compute.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "ContainerName",
                      "type": "string",
                      "description": "The identifier for a container that's running in a compute.",
                      "nested_items": []
                    },
                    {
                      "name": "ContainerRuntimeId",
                      "type": "string",
                      "description": "The runtime ID for the container that's running in a compute. This value is unique within the compute.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "GameServerContainerGroupDefinitionArn",
              "type": "string",
              "description": "The game server container group definition for the compute.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}