{
  "method_name": "start_game_session_placement",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/gamelift/client/start_game_session_placement.html",
  "description": "Makes a request to start a new game session using a game session queue. When processing a placement request, Amazon GameLift looks for the best possible available resource to host the game session, based on how the queue is configured to prioritize factors such as resource cost, latency, and location. After selecting an available resource, Amazon GameLift prompts the resource to start a game session. A placement request can include a list of players to create a set of player sessions. The request can also include information to pass to the new game session, such as to specify a game map or other options. Use this operation to make the following types of requests. If successful, this operation generates a new game session placement request and adds it to the game session queue for processing. You can track the status of individual placement requests by calling DescribeGameSessionPlacement or by monitoring queue notifications. When the request status is FULFILLED, a new game session has started and the placement request is updated with connection information for the game session (IP address and port). If the request included player session data, Amazon GameLift creates a player session for each player ID in the request. The request results in a InvalidRequestException in the following situations: Amazon GameLift continues to retry each placement request until it reaches the queue's timeout setting. If a request times out, you can resubmit the request to the same queue or try a different queue.",
  "parameters": [
    {
      "name": "PlacementId",
      "type": "string",
      "required": true,
      "description": "A unique identifier to assign to the new game session placement. This value is developer-defined. The value must be unique across all Regions and cannot be reused.",
      "nested_params": []
    },
    {
      "name": "GameSessionQueueName",
      "type": "string",
      "required": true,
      "description": "Name of the queue to use to place the new game session. You can use either the queue name or ARN value.",
      "nested_params": []
    },
    {
      "name": "GameProperties",
      "type": "list",
      "required": true,
      "description": "A set of key-value pairs that can store custom data in a game session. For example: {\"Key\": \"difficulty\", \"Value\": \"novice\"}. (dict) --- This key-value pair can store custom data about a game session. For example, you might use a GameProperty to track a game session's map, level of difficulty, or remaining time. The difficulty level could be specified like this: {\"Key\": \"difficulty\", \"Value\":\"Novice\"}. You can set game properties when creating a game session. You can also modify game properties of an active game session. When searching for game sessions, you can filter on game property keys and values. You can't delete game properties from a game session. For examples of working with game properties, see Create a game session with properties. The game property identifier. The game property value.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The game property identifier.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The game property value.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "MaximumPlayerSessionCount",
      "type": "integer",
      "required": true,
      "description": "The maximum number of players that can be connected simultaneously to the game session.",
      "nested_params": []
    },
    {
      "name": "GameSessionName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "PlayerLatencies",
      "type": "list",
      "required": false,
      "description": "A set of values, expressed in milliseconds, that indicates the amount of latency that a player experiences when connected to Amazon Web Services Regions. This information is used to try to place the new game session where it can offer the best possible gameplay experience for the players. (dict) --- Regional latency information for a player, used when requesting a new game session. This value indicates the amount of time lag that exists when the player is connected to a fleet in the specified Region. The relative difference between a player's latency values for multiple Regions are used to determine which fleets are best suited to place a new game session for the player. PlayerId (string) --- A unique identifier for a player associated with the latency data. RegionIdentifier (string) --- Name of the Region that is associated with the latency value. LatencyInMilliseconds (float) --- Amount of time that represents the time lag experienced by the player when connected to the specified Region.",
      "nested_params": [
        {
          "name": "PlayerId",
          "type": "string",
          "required": false,
          "description": "A unique identifier for a player associated with the latency data.",
          "nested_params": []
        },
        {
          "name": "RegionIdentifier",
          "type": "string",
          "required": false,
          "description": "Name of the Region that is associated with the latency value.",
          "nested_params": []
        },
        {
          "name": "LatencyInMilliseconds",
          "type": "float",
          "required": false,
          "description": "Amount of time that represents the time lag experienced by the player when connected to the specified Region.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "DesiredPlayerSessions",
      "type": "list",
      "required": false,
      "description": "Set of information on each player to create a player session for. (dict) --- Player information for use when creating player sessions using a game session placement request. PlayerId (string) --- A unique identifier for a player to associate with the player session. PlayerData (string) --- Developer-defined information related to a player. Amazon GameLift does not use this data, so it can be formatted as needed for use in the game.",
      "nested_params": [
        {
          "name": "PlayerId",
          "type": "string",
          "required": false,
          "description": "A unique identifier for a player to associate with the player session.",
          "nested_params": []
        },
        {
          "name": "PlayerData",
          "type": "string",
          "required": false,
          "description": "Developer-defined information related to a player. Amazon GameLift does not use this data, so it can be formatted as needed for use in the game.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "GameSessionData",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "PriorityConfigurationOverride",
      "type": "dict",
      "required": true,
      "description": "A prioritized list of locations to use for the game session placement and instructions on how to use it. This list overrides a queue's prioritized location list for this game session placement request only. You can include Amazon Web Services Regions, local zones, and custom locations (for Anywhere fleets). You can choose to limit placements to locations on the override list only, or you can prioritize locations on the override list first and then fall back to the queue's other locations if needed. Choose a fallback strategy to use in the event that Amazon GameLift fails to place a game session in any of the locations on the priority override list. PlacementFallbackStrategy (string) --- Instructions for how to proceed if placement fails in every location on the priority override list. Valid strategies include: DEFAULT_AFTER_SINGLE_PASS --- After attempting to place a new game session in every location on the priority override list, try to place a game session in queue's other locations. This is the default behavior. NONE --- Limit placements to locations on the priority override list only. A prioritized list of hosting locations. The list can include Amazon Web Services Regions (such as us-west-2), local zones, and custom locations (for Anywhere fleets). Each location must be listed only once. For details, see Amazon GameLift service locations. (string) ---",
      "nested_params": [
        {
          "name": "PlacementFallbackStrategy",
          "type": "string",
          "required": false,
          "description": "Instructions for how to proceed if placement fails in every location on the priority override list. Valid strategies include:",
          "nested_params": []
        },
        {
          "name": "LocationOrder",
          "type": "list",
          "required": false,
          "description": "A prioritized list of hosting locations. The list can include Amazon Web Services Regions (such as us-west-2), local zones, and custom locations (for Anywhere fleets). Each location must be listed only once. For details, see Amazon GameLift service locations.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "GameSessionPlacement",
          "type": "dict",
          "description": "Object that describes the newly created game session placement. This object includes all the information provided in the request, as well as start/end time stamps and placement status.",
          "nested_items": [
            {
              "name": "PlacementId",
              "type": "string",
              "description": "A unique identifier for a game session placement.",
              "nested_items": []
            },
            {
              "name": "GameSessionQueueName",
              "type": "string",
              "description": "A descriptive label that is associated with game session queue. Queue names must be unique within each Region.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "Current status of the game session placement request.",
              "nested_items": [
                {
                  "name": "PENDING",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "FULFILLED",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "CANCELLED",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "TIMED_OUT",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "FAILED",
                  "type": "",
                  "description": "",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "GameProperties",
              "type": "list",
              "description": "A set of key-value pairs that can store custom data in a game session. For example: {\"Key\": \"difficulty\", \"Value\": \"novice\"}.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Key",
                      "type": "string",
                      "description": "The game property identifier.",
                      "nested_items": []
                    },
                    {
                      "name": "Value",
                      "type": "string",
                      "description": "The game property value.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "MaximumPlayerSessionCount",
              "type": "integer",
              "description": "The maximum number of players that can be connected simultaneously to the game session.",
              "nested_items": []
            },
            {
              "name": "GameSessionName",
              "type": "string",
              "description": "A descriptive label that is associated with a game session. Session names do not need to be unique.",
              "nested_items": []
            },
            {
              "name": "GameSessionId",
              "type": "string",
              "description": "A unique identifier for the game session. This value isn't final until placement status is FULFILLED.",
              "nested_items": []
            },
            {
              "name": "GameSessionArn",
              "type": "string",
              "description": "Identifier for the game session created by this placement request. This identifier is unique across all Regions. This value isn't final until placement status is FULFILLED.",
              "nested_items": []
            },
            {
              "name": "GameSessionRegion",
              "type": "string",
              "description": "Name of the Region where the game session created by this placement request is running. This value isn't final until placement status is FULFILLED.",
              "nested_items": []
            },
            {
              "name": "PlayerLatencies",
              "type": "list",
              "description": "A set of values, expressed in milliseconds, that indicates the amount of latency that a player experiences when connected to Amazon Web Services Regions.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "PlayerId",
                      "type": "string",
                      "description": "A unique identifier for a player associated with the latency data.",
                      "nested_items": []
                    },
                    {
                      "name": "RegionIdentifier",
                      "type": "string",
                      "description": "Name of the Region that is associated with the latency value.",
                      "nested_items": []
                    },
                    {
                      "name": "LatencyInMilliseconds",
                      "type": "float",
                      "description": "Amount of time that represents the time lag experienced by the player when connected to the specified Region.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "StartTime",
              "type": "datetime",
              "description": "Time stamp indicating when this request was placed in the queue. Format is a number expressed in Unix time as milliseconds (for example \"1469498468.057\").",
              "nested_items": []
            },
            {
              "name": "EndTime",
              "type": "datetime",
              "description": "Time stamp indicating when this request was completed, canceled, or timed out.",
              "nested_items": []
            },
            {
              "name": "IpAddress",
              "type": "string",
              "description": "The IP address of the game session. To connect to a Amazon GameLift game server, an app needs both the IP address and port number. This value isn't final until placement status is FULFILLED.",
              "nested_items": []
            },
            {
              "name": "DnsName",
              "type": "string",
              "description": "The DNS identifier assigned to the instance that is running the game session. Values have the following format:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "TLS-enabled fleets: <unique identifier>.<region identifier>.amazongamelift.com.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "See Amazon EC2 Instance IP Addressing.",
                  "description": "Non-TLS-enabled fleets: ec2-<unique identifier>.compute.amazonaws.com. (See Amazon EC2 Instance IP Addressing.)",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Port",
              "type": "integer",
              "description": "The port number for the game session. To connect to a Amazon GameLift game server, an app needs both the IP address and port number. This value isn't final until placement status is FULFILLED.",
              "nested_items": []
            },
            {
              "name": "PlacedPlayerSessions",
              "type": "list",
              "description": "A collection of information on player sessions created in response to the game session placement request. These player sessions are created only after a new game session is successfully placed (placement status is FULFILLED). This information includes the player ID, provided in the placement request, and a corresponding player session ID.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "PlayerId",
                      "type": "string",
                      "description": "A unique identifier for a player that is associated with this player session.",
                      "nested_items": []
                    },
                    {
                      "name": "PlayerSessionId",
                      "type": "string",
                      "description": "A unique identifier for a player session.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "GameSessionData",
              "type": "string",
              "description": "A set of custom game session properties, formatted as a single string value. This data is passed to a game server process with a request to start a new game session. For more information, see Start a game session.",
              "nested_items": []
            },
            {
              "name": "MatchmakerData",
              "type": "string",
              "description": "Information on the matchmaking process for this game. Data is in JSON syntax, formatted as a string. It identifies the matchmaking configuration used to create the match, and contains data on all players assigned to the match, including player attributes and team assignments. For more details on matchmaker data, see Match Data.",
              "nested_items": []
            },
            {
              "name": "PriorityConfigurationOverride",
              "type": "dict",
              "description": "An alternative priority list of locations that's included with a game session placement request. When provided, the list overrides a queue's location order list for this game session placement request only. The list might include Amazon Web Services Regions, local zones, and custom locations (for Anywhere fleets). The fallback strategy tells Amazon GameLift what action to take (if any) in the event that it failed to place a new game session.",
              "nested_items": [
                {
                  "name": "PlacementFallbackStrategy",
                  "type": "string",
                  "description": "Instructions for how to proceed if placement fails in every location on the priority override list. Valid strategies include:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "DEFAULT_AFTER_SINGLE_PASS --- After attempting to place a new game session in every location on the priority override list, try to place a game session in queue's other locations. This is the default behavior.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "NONE --- Limit placements to locations on the priority override list only.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "LocationOrder",
                  "type": "list",
                  "description": "A prioritized list of hosting locations. The list can include Amazon Web Services Regions (such as us-west-2), local zones, and custom locations (for Anywhere fleets). Each location must be listed only once. For details, see Amazon GameLift service locations.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}