{
  "method_name": "stop_game_session_placement",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/gamelift/client/stop_game_session_placement.html",
  "description": "Cancels a game session placement that's in PENDING status. To stop a placement, provide the placement ID value. Results. If successful, this operation removes the placement request from the queue and moves the GameSessionPlacement to CANCELLED status. This operation results in an InvalidRequestExecption (400) error if a game session has already been created for this placement. You can clean up an unneeded game session by calling TerminateGameSession.",
  "parameters": [
    {
      "name": "PlacementId",
      "type": "string",
      "required": true,
      "description": "A unique identifier for a game session placement to stop.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "GameSessionPlacement",
          "type": "dict",
          "description": "Object that describes the canceled game session placement, with CANCELLED status and an end time stamp.",
          "nested_items": [
            {
              "name": "PlacementId",
              "type": "string",
              "description": "A unique identifier for a game session placement.",
              "nested_items": []
            },
            {
              "name": "GameSessionQueueName",
              "type": "string",
              "description": "A descriptive label that is associated with game session queue. Queue names must be unique within each Region.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "Current status of the game session placement request.",
              "nested_items": [
                {
                  "name": "PENDING",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "FULFILLED",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "CANCELLED",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "TIMED_OUT",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "FAILED",
                  "type": "",
                  "description": "",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "GameProperties",
              "type": "list",
              "description": "A set of key-value pairs that can store custom data in a game session. For example: {\"Key\": \"difficulty\", \"Value\": \"novice\"}.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Key",
                      "type": "string",
                      "description": "The game property identifier.",
                      "nested_items": []
                    },
                    {
                      "name": "Value",
                      "type": "string",
                      "description": "The game property value.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "MaximumPlayerSessionCount",
              "type": "integer",
              "description": "The maximum number of players that can be connected simultaneously to the game session.",
              "nested_items": []
            },
            {
              "name": "GameSessionName",
              "type": "string",
              "description": "A descriptive label that is associated with a game session. Session names do not need to be unique.",
              "nested_items": []
            },
            {
              "name": "GameSessionId",
              "type": "string",
              "description": "A unique identifier for the game session. This value isn't final until placement status is FULFILLED.",
              "nested_items": []
            },
            {
              "name": "GameSessionArn",
              "type": "string",
              "description": "Identifier for the game session created by this placement request. This identifier is unique across all Regions. This value isn't final until placement status is FULFILLED.",
              "nested_items": []
            },
            {
              "name": "GameSessionRegion",
              "type": "string",
              "description": "Name of the Region where the game session created by this placement request is running. This value isn't final until placement status is FULFILLED.",
              "nested_items": []
            },
            {
              "name": "PlayerLatencies",
              "type": "list",
              "description": "A set of values, expressed in milliseconds, that indicates the amount of latency that a player experiences when connected to Amazon Web Services Regions.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "PlayerId",
                      "type": "string",
                      "description": "A unique identifier for a player associated with the latency data.",
                      "nested_items": []
                    },
                    {
                      "name": "RegionIdentifier",
                      "type": "string",
                      "description": "Name of the Region that is associated with the latency value.",
                      "nested_items": []
                    },
                    {
                      "name": "LatencyInMilliseconds",
                      "type": "float",
                      "description": "Amount of time that represents the time lag experienced by the player when connected to the specified Region.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "StartTime",
              "type": "datetime",
              "description": "Time stamp indicating when this request was placed in the queue. Format is a number expressed in Unix time as milliseconds (for example \"1469498468.057\").",
              "nested_items": []
            },
            {
              "name": "EndTime",
              "type": "datetime",
              "description": "Time stamp indicating when this request was completed, canceled, or timed out.",
              "nested_items": []
            },
            {
              "name": "IpAddress",
              "type": "string",
              "description": "The IP address of the game session. To connect to a Amazon GameLift game server, an app needs both the IP address and port number. This value isn't final until placement status is FULFILLED.",
              "nested_items": []
            },
            {
              "name": "DnsName",
              "type": "string",
              "description": "The DNS identifier assigned to the instance that is running the game session. Values have the following format:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "TLS-enabled fleets: <unique identifier>.<region identifier>.amazongamelift.com.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "See Amazon EC2 Instance IP Addressing.",
                  "description": "Non-TLS-enabled fleets: ec2-<unique identifier>.compute.amazonaws.com. (See Amazon EC2 Instance IP Addressing.)",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Port",
              "type": "integer",
              "description": "The port number for the game session. To connect to a Amazon GameLift game server, an app needs both the IP address and port number. This value isn't final until placement status is FULFILLED.",
              "nested_items": []
            },
            {
              "name": "PlacedPlayerSessions",
              "type": "list",
              "description": "A collection of information on player sessions created in response to the game session placement request. These player sessions are created only after a new game session is successfully placed (placement status is FULFILLED). This information includes the player ID, provided in the placement request, and a corresponding player session ID.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "PlayerId",
                      "type": "string",
                      "description": "A unique identifier for a player that is associated with this player session.",
                      "nested_items": []
                    },
                    {
                      "name": "PlayerSessionId",
                      "type": "string",
                      "description": "A unique identifier for a player session.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "GameSessionData",
              "type": "string",
              "description": "A set of custom game session properties, formatted as a single string value. This data is passed to a game server process with a request to start a new game session. For more information, see Start a game session.",
              "nested_items": []
            },
            {
              "name": "MatchmakerData",
              "type": "string",
              "description": "Information on the matchmaking process for this game. Data is in JSON syntax, formatted as a string. It identifies the matchmaking configuration used to create the match, and contains data on all players assigned to the match, including player attributes and team assignments. For more details on matchmaker data, see Match Data.",
              "nested_items": []
            },
            {
              "name": "PriorityConfigurationOverride",
              "type": "dict",
              "description": "An alternative priority list of locations that's included with a game session placement request. When provided, the list overrides a queue's location order list for this game session placement request only. The list might include Amazon Web Services Regions, local zones, and custom locations (for Anywhere fleets). The fallback strategy tells Amazon GameLift what action to take (if any) in the event that it failed to place a new game session.",
              "nested_items": [
                {
                  "name": "PlacementFallbackStrategy",
                  "type": "string",
                  "description": "Instructions for how to proceed if placement fails in every location on the priority override list. Valid strategies include:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "DEFAULT_AFTER_SINGLE_PASS --- After attempting to place a new game session in every location on the priority override list, try to place a game session in queue's other locations. This is the default behavior.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "NONE --- Limit placements to locations on the priority override list only.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "LocationOrder",
                  "type": "list",
                  "description": "A prioritized list of hosting locations. The list can include Amazon Web Services Regions (such as us-west-2), local zones, and custom locations (for Anywhere fleets). Each location must be listed only once. For details, see Amazon GameLift service locations.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}