{
  "method_name": "update_fleet_attributes",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/gamelift/client/update_fleet_attributes.html",
  "description": "Updates a fleet's mutable attributes, such as game session protection and resource creation limits. To update fleet attributes, specify the fleet ID and the property values that you want to change. If successful, Amazon GameLift returns the identifiers for the updated fleet. Setting up Amazon GameLift fleets.",
  "parameters": [
    {
      "name": "FleetId",
      "type": "string",
      "required": true,
      "description": "A unique identifier for the fleet to update attribute metadata for. You can use either the fleet ID or ARN value.",
      "nested_params": []
    },
    {
      "name": "Name",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NewGameSessionProtectionPolicy",
      "type": "string",
      "required": false,
      "description": "The game session protection policy to apply to all new game sessions created in this fleet. Game sessions that already exist are not affected. You can set protection for individual game sessions using UpdateGameSession . NoProtection --- The game session can be terminated during a scale-down event. FullProtection --- If the game session is in an ACTIVE status, it cannot be terminated during a scale-down event.",
      "nested_params": [
        {
          "name": "NoProtection",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "FullProtection",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ResourceCreationLimitPolicy",
      "type": "dict",
      "required": false,
      "description": "Policy settings that limit the number of game sessions an individual player can create over a span of time. NewGameSessionsPerCreator (integer) --- A policy that puts limits on the number of game sessions that a player can create within a specified span of time. With this policy, you can control players' ability to consume available resources. The policy is evaluated when a player tries to create a new game session. On receiving a CreateGameSession request, Amazon GameLift checks that the player (identified by CreatorId) has created fewer than game session limit in the specified time period. PolicyPeriodInMinutes (integer) --- The time span used in evaluating the resource creation limit policy.",
      "nested_params": [
        {
          "name": "NewGameSessionsPerCreator",
          "type": "integer",
          "required": false,
          "description": "A policy that puts limits on the number of game sessions that a player can create within a specified span of time. With this policy, you can control players' ability to consume available resources. The policy is evaluated when a player tries to create a new game session. On receiving a CreateGameSession request, Amazon GameLift checks that the player (identified by CreatorId) has created fewer than game session limit in the specified time period.",
          "nested_params": []
        },
        {
          "name": "PolicyPeriodInMinutes",
          "type": "integer",
          "required": false,
          "description": "The time span used in evaluating the resource creation limit policy.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "MetricGroups",
      "type": "list",
      "required": false,
      "description": "The name of a metric group to add this fleet to. Use a metric group in Amazon CloudWatch to aggregate the metrics from multiple fleets. Provide an existing metric group name, or create a new metric group by providing a new name. A fleet can only be in one metric group at a time. (string) ---",
      "nested_params": []
    },
    {
      "name": "AnywhereConfiguration",
      "type": "dict",
      "required": true,
      "description": "Amazon GameLift Anywhere configuration options. The cost to run your fleet per hour. Amazon GameLift uses the provided cost of your fleet to balance usage in queues. For more information about queues, see Setting up queues in the Amazon GameLift Developer Guide.",
      "nested_params": [
        {
          "name": "Cost",
          "type": "string",
          "required": false,
          "description": "The cost to run your fleet per hour. Amazon GameLift uses the provided cost of your fleet to balance usage in queues. For more information about queues, see Setting up queues in the Amazon GameLift Developer Guide.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "FleetId",
          "type": "string",
          "description": "A unique identifier for the fleet that was updated.",
          "nested_items": []
        },
        {
          "name": "FleetArn",
          "type": "string",
          "description": "The Amazon Resource Name ( ARN) that is assigned to a Amazon GameLift fleet resource and uniquely identifies it. ARNs are unique across all Regions. Format is arn:aws:gamelift:<region>::fleet/fleet-a1234567-b8c9-0d1e-2fa3-b45c6d7e8912.",
          "nested_items": []
        }
      ]
    }
  ]
}