{
  "method_name": "create_trained_model",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cleanroomsml/client/create_trained_model.html",
  "description": "Creates a trained model from an associated configured model algorithm using data from any member of the collaboration.",
  "parameters": [
    {
      "name": "membershipIdentifier",
      "type": "string",
      "required": true,
      "description": "The membership ID of the member that is creating the trained model.",
      "nested_params": []
    },
    {
      "name": "name",
      "type": "string",
      "required": true,
      "description": "The name of the trained model.",
      "nested_params": []
    },
    {
      "name": "configuredModelAlgorithmAssociationArn",
      "type": "string",
      "required": true,
      "description": "The associated configured model algorithm used to train this model.",
      "nested_params": []
    },
    {
      "name": "hyperparameters",
      "type": "dict",
      "required": false,
      "description": "Algorithm-specific parameters that influence the quality of the model. You set hyperparameters before you start the learning process. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "environment",
      "type": "dict",
      "required": false,
      "description": "The environment variables to set in the Docker container. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "resourceConfig",
      "type": "dict",
      "required": true,
      "description": "Information about the EC2 resources that are used to train this model. instanceCount (integer) --- The number of resources that are used to train the model. The instance type that is used to train the model. The maximum size of the instance that is used to train the model.",
      "nested_params": [
        {
          "name": "instanceCount",
          "type": "integer",
          "required": false,
          "description": "The number of resources that are used to train the model.",
          "nested_params": []
        },
        {
          "name": "instanceType",
          "type": "string",
          "required": false,
          "description": "The instance type that is used to train the model.",
          "nested_params": []
        },
        {
          "name": "volumeSizeInGB",
          "type": "integer",
          "required": false,
          "description": "The maximum size of the instance that is used to train the model.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "stoppingCondition",
      "type": "dict",
      "required": false,
      "description": "The criteria that is used to stop model training. maxRuntimeInSeconds (integer) --- The maximum amount of time, in seconds, that model training can run before it is terminated.",
      "nested_params": [
        {
          "name": "maxRuntimeInSeconds",
          "type": "integer",
          "required": false,
          "description": "The maximum amount of time, in seconds, that model training can run before it is terminated.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "dataChannels",
      "type": "list",
      "required": true,
      "description": "Defines the data channels that are used as input for the trained model request. (dict) --- Information about the model training data channel. A training data channel is a named data source that the training algorithms can consume. The Amazon Resource Name (ARN) of the ML input channel for this model training data channel. The name of the training data channel.",
      "nested_params": [
        {
          "name": "mlInputChannelArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the ML input channel for this model training data channel.",
          "nested_params": []
        },
        {
          "name": "channelName",
          "type": "string",
          "required": false,
          "description": "The name of the training data channel.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "kmsKeyArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "dict",
      "required": false,
      "description": "The optional metadata that you apply to the resource to help you categorize and organize them. Each tag consists of a key and an optional value, both of which you define. The following basic restrictions apply to tags: Maximum number of tags per resource - 50. For each resource, each tag key must be unique, and each tag key can have only one value. Maximum key length - 128 Unicode characters in UTF-8. Maximum value length - 256 Unicode characters in UTF-8. If your tagging schema is used across multiple services and resources, remember that other services may have restrictions on allowed characters. Generally allowed characters are: letters, numbers, and spaces representable in UTF-8, and the following characters: + - = . _ : / @. Tag keys and values are case sensitive. Do not use aws:, AWS:, or any upper or lowercase combination of such as a prefix for keys as it is reserved for AWS use. You cannot edit or delete tag keys with this prefix. Values can have this prefix. If a tag value has aws as its prefix but the key does not, then Clean Rooms ML considers it to be a user tag and will count against the limit of 50 tags. Tags with only the key prefix of aws do not count against your tags per resource limit. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "trainedModelArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the trained model.",
          "nested_items": []
        }
      ]
    }
  ]
}