{
  "method_name": "create_configured_model_algorithm_association",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cleanroomsml/client/create_configured_model_algorithm_association.html",
  "description": "Associates a configured model algorithm to a collaboration for use by any member of the collaboration.",
  "parameters": [
    {
      "name": "membershipIdentifier",
      "type": "string",
      "required": true,
      "description": "The membership ID of the member who is associating this configured model algorithm.",
      "nested_params": []
    },
    {
      "name": "configuredModelAlgorithmArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the configured model algorithm that you want to associate.",
      "nested_params": []
    },
    {
      "name": "name",
      "type": "string",
      "required": true,
      "description": "The name of the configured model algorithm association.",
      "nested_params": []
    },
    {
      "name": "description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "privacyConfiguration",
      "type": "dict",
      "required": true,
      "description": "Specifies the privacy configuration information for the configured model algorithm association. This information includes the maximum data size that can be exported. The privacy configuration policies for a configured model algorithm association. trainedModels (dict) --- Specifies who will receive the trained models. containerLogs (list) --- The container for the logs of the trained model. (dict) --- Provides the information necessary for a user to access the logs. A list of account IDs that are allowed to access the logs. (string) --- filterPattern (string) --- A regular expression pattern that is used to parse the logs and return information that matches the pattern. containerMetrics (dict) --- The container for the metrics of the trained model. The noise level for the generated metrics. trainedModelExports (dict) --- Specifies who will receive the trained model export. The maximum size of the data that can be exported. The unit of measurement for the data size. The maximum size of the dataset to export. The files that are exported during the trained model export job. (string) --- trainedModelInferenceJobs (dict) --- Specifies who will receive the trained model inference jobs. containerLogs (list) --- The logs container for the trained model inference job. maxOutputSize (dict) --- The maximum allowed size of the output of the trained model inference job. The measurement unit to use. The maximum output size value.",
      "nested_params": [
        {
          "name": "policies",
          "type": "dict",
          "required": false,
          "description": "The privacy configuration policies for a configured model algorithm association.",
          "nested_params": [
            {
              "name": "trainedModels",
              "type": "dict",
              "required": false,
              "description": "Specifies who will receive the trained models.",
              "nested_params": [
                {
                  "name": "containerLogs",
                  "type": "list",
                  "required": false,
                  "description": "The container for the logs of the trained model.",
                  "nested_params": [
                    {
                      "name": "allowedAccountIds",
                      "type": "list",
                      "required": false,
                      "description": "A list of account IDs that are allowed to access the logs.",
                      "nested_params": []
                    },
                    {
                      "name": "filterPattern",
                      "type": "string",
                      "required": false,
                      "description": "A regular expression pattern that is used to parse the logs and return information that matches the pattern.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "containerMetrics",
                  "type": "dict",
                  "required": false,
                  "description": "The container for the metrics of the trained model.",
                  "nested_params": [
                    {
                      "name": "noiseLevel",
                      "type": "string",
                      "required": false,
                      "description": "The noise level for the generated metrics.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "trainedModelExports",
              "type": "dict",
              "required": false,
              "description": "Specifies who will receive the trained model export.",
              "nested_params": [
                {
                  "name": "maxSize",
                  "type": "dict",
                  "required": false,
                  "description": "The maximum size of the data that can be exported.",
                  "nested_params": [
                    {
                      "name": "unit",
                      "type": "string",
                      "required": false,
                      "description": "The unit of measurement for the data size.",
                      "nested_params": []
                    },
                    {
                      "name": "value",
                      "type": "float",
                      "required": false,
                      "description": "The maximum size of the dataset to export.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "filesToExport",
                  "type": "list",
                  "required": false,
                  "description": "The files that are exported during the trained model export job.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "trainedModelInferenceJobs",
              "type": "dict",
              "required": false,
              "description": "Specifies who will receive the trained model inference jobs.",
              "nested_params": [
                {
                  "name": "containerLogs",
                  "type": "list",
                  "required": false,
                  "description": "The logs container for the trained model inference job.",
                  "nested_params": [
                    {
                      "name": "allowedAccountIds",
                      "type": "list",
                      "required": false,
                      "description": "A list of account IDs that are allowed to access the logs.",
                      "nested_params": []
                    },
                    {
                      "name": "filterPattern",
                      "type": "string",
                      "required": false,
                      "description": "A regular expression pattern that is used to parse the logs and return information that matches the pattern.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "maxOutputSize",
                  "type": "dict",
                  "required": false,
                  "description": "The maximum allowed size of the output of the trained model inference job.",
                  "nested_params": [
                    {
                      "name": "unit",
                      "type": "string",
                      "required": false,
                      "description": "The measurement unit to use.",
                      "nested_params": []
                    },
                    {
                      "name": "value",
                      "type": "float",
                      "required": false,
                      "description": "The maximum output size value.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "tags",
      "type": "dict",
      "required": false,
      "description": "The optional metadata that you apply to the resource to help you categorize and organize them. Each tag consists of a key and an optional value, both of which you define. The following basic restrictions apply to tags: Maximum number of tags per resource - 50. For each resource, each tag key must be unique, and each tag key can have only one value. Maximum key length - 128 Unicode characters in UTF-8. Maximum value length - 256 Unicode characters in UTF-8. If your tagging schema is used across multiple services and resources, remember that other services may have restrictions on allowed characters. Generally allowed characters are: letters, numbers, and spaces representable in UTF-8, and the following characters: + - = . _ : / @. Tag keys and values are case sensitive. Do not use aws:, AWS:, or any upper or lowercase combination of such as a prefix for keys as it is reserved for AWS use. You cannot edit or delete tag keys with this prefix. Values can have this prefix. If a tag value has aws as its prefix but the key does not, then Clean Rooms ML considers it to be a user tag and will count against the limit of 50 tags. Tags with only the key prefix of aws do not count against your tags per resource limit. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "configuredModelAlgorithmAssociationArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the configured model algorithm association.",
          "nested_items": []
        }
      ]
    }
  ]
}