{
  "method_name": "get_access_preview",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/accessanalyzer/client/get_access_preview.html",
  "description": "Retrieves information about an access preview for the specified analyzer.",
  "parameters": [
    {
      "name": "accessPreviewId",
      "type": "string",
      "required": true,
      "description": "The unique ID for the access preview. The unique ID for the access preview.",
      "nested_params": []
    },
    {
      "name": "analyzerArn",
      "type": "string",
      "required": true,
      "description": "The ARN of the analyzer used to generate the access preview. The ARN of the analyzer used to generate the access preview.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "accessPreview",
          "type": "dict",
          "description": "An object that contains information about the access preview.",
          "nested_items": [
            {
              "name": "id",
              "type": "string",
              "description": "The unique ID for the access preview.",
              "nested_items": []
            },
            {
              "name": "analyzerArn",
              "type": "string",
              "description": "The ARN of the analyzer used to generate the access preview.",
              "nested_items": []
            },
            {
              "name": "configurations",
              "type": "dict",
              "description": "A map of resource ARNs for the proposed resource configuration.",
              "nested_items": [
                {
                  "name": "ebsSnapshot",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "ebsSnapshot",
                          "type": "dict",
                          "description": "The access control configuration is for an Amazon EBS volume snapshot.",
                          "nested_items": [
                            {
                              "name": "userIds",
                              "type": "list",
                              "description": "The IDs of the Amazon Web Services accounts that have access to the Amazon EBS volume snapshot.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "If the configuration is for an existing Amazon EBS volume snapshot and you do not specify the userIds, then the access preview uses the existing shared userIds for the snapshot.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "If the access preview is for a new resource and you do not specify the userIds, then the access preview considers the snapshot without any userIds.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "To propose deletion of existing shared accountIds, you can specify an empty list for userIds.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "groups",
                              "type": "list",
                              "description": "The groups that have access to the Amazon EBS volume snapshot. If the value all is specified, then the Amazon EBS volume snapshot is public.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "If the configuration is for an existing Amazon EBS volume snapshot and you do not specify the groups, then the access preview uses the existing shared groups for the snapshot.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "If the access preview is for a new resource and you do not specify the groups, then the access preview considers the snapshot without any groups.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "To propose deletion of existing shared groups, you can specify an empty list for groups.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "kmsKeyId",
                              "type": "string",
                              "description": "The KMS key identifier for an encrypted Amazon EBS volume snapshot. The KMS key identifier is the key ARN, key ID, alias ARN, or alias name for the KMS key.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "If the configuration is for an existing Amazon EBS volume snapshot and you do not specify the kmsKeyId, or you specify an empty string, then the access preview uses the existing kmsKeyId of the snapshot.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "If the access preview is for a new resource and you do not specify the kmsKeyId, the access preview considers the snapshot as unencrypted.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "name": "ecrRepository",
                          "type": "dict",
                          "description": "The access control configuration is for an Amazon ECR repository.",
                          "nested_items": [
                            {
                              "name": "repositoryPolicy",
                              "type": "string",
                              "description": "The JSON repository policy text to apply to the Amazon ECR repository. For more information, see Private repository policy examples in the Amazon ECR User Guide.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "trustPolicy",
                              "type": "string",
                              "description": "The proposed trust policy for the IAM role.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "efsFileSystem",
                          "type": "dict",
                          "description": "The access control configuration is for an Amazon EFS file system.",
                          "nested_items": [
                            {
                              "name": "fileSystemPolicy",
                              "type": "string",
                              "description": "The JSON policy definition to apply to the Amazon EFS file system. For more information on the elements that make up a file system policy, see Amazon EFS Resource-based policies.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "keyPolicies",
                              "type": "dict",
                              "description": "Resource policy configuration for the KMS key. The only valid value for the name of the key policy is default. For more information, see Default key policy.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "string",
                                  "description": "(string) ---",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "string",
                                      "description": "(string) ---",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "grants",
                              "type": "list",
                              "description": "A list of proposed grant configurations for the KMS key. If the proposed grant configuration is for an existing key, the access preview uses the proposed list of grant configurations in place of the existing grants. Otherwise, the access preview uses the existing grants for the key.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "operations",
                                      "type": "list",
                                      "description": "A list of operations that the grant permits.",
                                      "nested_items": [
                                        {
                                          "name": "",
                                          "type": "string",
                                          "description": "(string) ---",
                                          "nested_items": []
                                        }
                                      ]
                                    },
                                    {
                                      "name": "granteePrincipal",
                                      "type": "string",
                                      "description": "The principal that is given permission to perform the operations that the grant permits.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "retiringPrincipal",
                                      "type": "string",
                                      "description": "The principal that is given permission to retire the grant by using RetireGrant operation.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "constraints",
                                      "type": "dict",
                                      "description": "Use this structure to propose allowing cryptographic operations in the grant only when the operation request includes the specified encryption context.",
                                      "nested_items": [
                                        {
                                          "name": "encryptionContextEquals",
                                          "type": "dict",
                                          "description": "A list of key-value pairs that must match the encryption context in the cryptographic operation request. The grant allows the operation only when the encryption context in the request is the same as the encryption context specified in this constraint.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "string",
                                              "description": "(string) ---",
                                              "nested_items": [
                                                {
                                                  "name": "",
                                                  "type": "string",
                                                  "description": "(string) ---",
                                                  "nested_items": []
                                                }
                                              ]
                                            }
                                          ]
                                        },
                                        {
                                          "name": "encryptionContextSubset",
                                          "type": "dict",
                                          "description": "A list of key-value pairs that must be included in the encryption context of the cryptographic operation request. The grant allows the cryptographic operation only when the encryption context in the request includes the key-value pairs specified in this constraint, although it can include additional key-value pairs.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "string",
                                              "description": "(string) ---",
                                              "nested_items": [
                                                {
                                                  "name": "",
                                                  "type": "string",
                                                  "description": "(string) ---",
                                                  "nested_items": []
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "name": "issuingAccount",
                                      "type": "string",
                                      "description": "The Amazon Web Services account under which the grant was issued. The account is used to propose KMS grants issued by accounts other than the owner of the key.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "name": "rdsDbClusterSnapshot",
                          "type": "dict",
                          "description": "The access control configuration is for an Amazon RDS DB cluster snapshot.",
                          "nested_items": [
                            {
                              "name": "attributes",
                              "type": "dict",
                              "description": "The names and values of manual DB cluster snapshot attributes. Manual DB cluster snapshot attributes are used to authorize other Amazon Web Services accounts to restore a manual DB cluster snapshot. The only valid value for AttributeName for the attribute map is restore.",
                              "nested_items": [
                                {
                                  "name": "accountIds",
                                  "type": "string",
                                  "description": "(string) ---",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "dict",
                                      "description": "",
                                      "nested_items": [
                                        {
                                          "name": "accountIds",
                                          "type": "list",
                                          "description": "The Amazon Web Services account IDs that have access to the manual Amazon RDS DB cluster snapshot. If the value all is specified, then the Amazon RDS DB cluster snapshot is public and can be copied or restored by all Amazon Web Services accounts.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "If the configuration is for an existing Amazon RDS DB cluster snapshot and you do not specify the accountIds in RdsDbClusterSnapshotAttributeValue, then the access preview uses the existing shared accountIds for the snapshot.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "If the access preview is for a new resource and you do not specify the specify the accountIds in RdsDbClusterSnapshotAttributeValue, then the access preview considers the snapshot without any attributes.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "To propose deletion of existing shared accountIds, you can specify an empty list for accountIds in the RdsDbClusterSnapshotAttributeValue.",
                                              "nested_items": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "kmsKeyId",
                              "type": "string",
                              "description": "The KMS key identifier for an encrypted Amazon RDS DB cluster snapshot. The KMS key identifier is the key ARN, key ID, alias ARN, or alias name for the KMS key.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "If the configuration is for an existing Amazon RDS DB cluster snapshot and you do not specify the kmsKeyId, or you specify an empty string, then the access preview uses the existing kmsKeyId of the snapshot.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "If the access preview is for a new resource and you do not specify the specify the kmsKeyId, then the access preview considers the snapshot as unencrypted.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "name": "rdsDbSnapshot",
                          "type": "dict",
                          "description": "The access control configuration is for an Amazon RDS DB snapshot.",
                          "nested_items": [
                            {
                              "name": "attributes",
                              "type": "dict",
                              "description": "The names and values of manual DB snapshot attributes. Manual DB snapshot attributes are used to authorize other Amazon Web Services accounts to restore a manual DB snapshot. The only valid value for attributeName for the attribute map is restore.",
                              "nested_items": [
                                {
                                  "name": "accountIds",
                                  "type": "string",
                                  "description": "(string) ---",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "dict",
                                      "description": "",
                                      "nested_items": [
                                        {
                                          "name": "accountIds",
                                          "type": "list",
                                          "description": "The Amazon Web Services account IDs that have access to the manual Amazon RDS DB snapshot. If the value all is specified, then the Amazon RDS DB snapshot is public and can be copied or restored by all Amazon Web Services accounts.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "If the configuration is for an existing Amazon RDS DB snapshot and you do not specify the accountIds in RdsDbSnapshotAttributeValue, then the access preview uses the existing shared accountIds for the snapshot.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "If the access preview is for a new resource and you do not specify the specify the accountIds in RdsDbSnapshotAttributeValue, then the access preview considers the snapshot without any attributes.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "To propose deletion of an existing shared accountIds, you can specify an empty list for accountIds in the RdsDbSnapshotAttributeValue.",
                                              "nested_items": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "kmsKeyId",
                              "type": "string",
                              "description": "The KMS key identifier for an encrypted Amazon RDS DB snapshot. The KMS key identifier is the key ARN, key ID, alias ARN, or alias name for the KMS key.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "If the configuration is for an existing Amazon RDS DB snapshot and you do not specify the kmsKeyId, or you specify an empty string, then the access preview uses the existing kmsKeyId of the snapshot.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "If the access preview is for a new resource and you do not specify the specify the kmsKeyId, then the access preview considers the snapshot as unencrypted.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "name": "secretsManagerSecret",
                          "type": "dict",
                          "description": "The access control configuration is for a Secrets Manager secret.",
                          "nested_items": [
                            {
                              "name": "kmsKeyId",
                              "type": "string",
                              "description": "The proposed ARN, key ID, or alias of the KMS key.",
                              "nested_items": []
                            },
                            {
                              "name": "secretPolicy",
                              "type": "string",
                              "description": "The proposed resource policy defining who can access or manage the secret.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "bucketPolicy",
                              "type": "string",
                              "description": "The proposed bucket policy for the Amazon S3 bucket.",
                              "nested_items": []
                            },
                            {
                              "name": "bucketAclGrants",
                              "type": "list",
                              "description": "The proposed list of ACL grants for the Amazon S3 bucket. You can propose up to 100 ACL grants per bucket. If the proposed grant configuration is for an existing bucket, the access preview uses the proposed list of grant configurations in place of the existing grants. Otherwise, the access preview uses the existing grants for the bucket.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "permission",
                                      "type": "string",
                                      "description": "The permissions being granted.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "dict",
                                      "description": "",
                                      "nested_items": [
                                        {
                                          "name": "id",
                                          "type": "string",
                                          "description": "The value specified is the canonical user ID of an Amazon Web Services account.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "uri",
                                          "type": "string",
                                          "description": "Used for granting permissions to a predefined group.",
                                          "nested_items": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "bucketPublicAccessBlock",
                              "type": "dict",
                              "description": "The proposed block public access configuration for the Amazon S3 bucket.",
                              "nested_items": [
                                {
                                  "name": "ignorePublicAcls",
                                  "type": "boolean",
                                  "description": "Specifies whether Amazon S3 should ignore public ACLs for this bucket and objects in this bucket.",
                                  "nested_items": []
                                },
                                {
                                  "name": "restrictPublicBuckets",
                                  "type": "boolean",
                                  "description": "Specifies whether Amazon S3 should restrict public bucket policies for this bucket.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "accessPoints",
                              "type": "dict",
                              "description": "The configuration of Amazon S3 access points or multi-region access points for the bucket. You can propose up to 10 new access points per bucket.",
                              "nested_items": [
                                {
                                  "name": "accessPointPolicy",
                                  "type": "string",
                                  "description": "(string) ---",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "dict",
                                      "description": "",
                                      "nested_items": [
                                        {
                                          "name": "accessPointPolicy",
                                          "type": "string",
                                          "description": "The access point or multi-region access point policy.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "publicAccessBlock",
                                          "type": "dict",
                                          "description": "The proposed S3PublicAccessBlock configuration to apply to this Amazon S3 access point or multi-region access point.",
                                          "nested_items": [
                                            {
                                              "name": "ignorePublicAcls",
                                              "type": "boolean",
                                              "description": "Specifies whether Amazon S3 should ignore public ACLs for this bucket and objects in this bucket.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "restrictPublicBuckets",
                                              "type": "boolean",
                                              "description": "Specifies whether Amazon S3 should restrict public bucket policies for this bucket.",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "networkOrigin",
                                          "type": "dict",
                                          "description": "The proposed Internet and VpcConfiguration to apply to this Amazon S3 access point. VpcConfiguration does not apply to multi-region access points. If the access preview is for a new resource and neither is specified, the access preview uses Internet for the network origin. If the access preview is for an existing resource and neither is specified, the access preview uses the exiting network origin.",
                                          "nested_items": [
                                            {
                                              "name": "vpcConfiguration",
                                              "type": "dict",
                                              "description": "The proposed virtual private cloud (VPC) configuration for the Amazon S3 access point. VPC configuration does not apply to multi-region access points. For more information, see VpcConfiguration.",
                                              "nested_items": [
                                                {
                                                  "name": "vpcId",
                                                  "type": "string",
                                                  "description": "If this field is specified, this access point will only allow connections from the specified VPC ID.",
                                                  "nested_items": []
                                                }
                                              ]
                                            },
                                            {
                                              "name": "internetConfiguration",
                                              "type": "dict",
                                              "description": "The configuration for the Amazon S3 access point or multi-region access point with an Internet origin.",
                                              "nested_items": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "topicPolicy",
                              "type": "string",
                              "description": "The JSON policy text that defines who can access an Amazon SNS topic. For more information, see Example cases for Amazon SNS access control in the Amazon SNS Developer Guide.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "queuePolicy",
                              "type": "string",
                              "description": "The proposed resource policy for the Amazon SQS queue.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "s3ExpressDirectoryBucket",
                          "type": "dict",
                          "description": "The access control configuration is for an Amazon S3 directory bucket.",
                          "nested_items": [
                            {
                              "name": "bucketPolicy",
                              "type": "string",
                              "description": "The proposed bucket policy for the Amazon S3 directory bucket.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "dynamodbStream",
                          "type": "dict",
                          "description": "The access control configuration is for a DynamoDB stream.",
                          "nested_items": [
                            {
                              "name": "streamPolicy",
                              "type": "string",
                              "description": "The proposed resource policy defining who can access or manage the DynamoDB stream.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "dynamodbTable",
                          "type": "dict",
                          "description": "The access control configuration is for a DynamoDB table or index.",
                          "nested_items": [
                            {
                              "name": "tablePolicy",
                              "type": "string",
                              "description": "The proposed resource policy defining who can access or manage the DynamoDB table.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "createdAt",
              "type": "datetime",
              "description": "The time at which the access preview was created.",
              "nested_items": []
            },
            {
              "name": "status",
              "type": "string",
              "description": "The status of the access preview.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "Creating - The access preview creation is in progress.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Completed - The access preview is complete. You can preview findings for external access to the resource.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Failed - The access preview creation has failed.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "statusReason",
              "type": "dict",
              "description": "Provides more details about the current status of the access preview.",
              "nested_items": [
                {
                  "name": "code",
                  "type": "string",
                  "description": "The reason code for the current status of the access preview.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}