{
  "method_name": "describe_anomaly_detectors",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudwatch/client/describe_anomaly_detectors.html",
  "description": "Lists the anomaly detection models that you have created in your account. For single metric anomaly detectors, you can list all of the models in your account or filter the results to only the models that are related to a certain namespace, metric name, or metric dimension. For metric math anomaly detectors, you can list them by adding METRIC_MATH to the AnomalyDetectorTypes array. This will return all metric math anomaly detectors in your account.",
  "parameters": [
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "The maximum number of results to return in one operation. The maximum value that you can specify is 100. To retrieve the remaining results, make another call with the returned NextToken value.",
      "nested_params": []
    },
    {
      "name": "Namespace",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MetricName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Dimensions",
      "type": "list",
      "required": true,
      "description": "Limits the results to only the anomaly detection models that are associated with the specified metric dimensions. If there are multiple metrics that have these dimensions and have anomaly detection models associated, they're all returned. (dict) --- A dimension is a name/value pair that is part of the identity of a metric. Because dimensions are part of the unique identifier for a metric, whenever you add a unique name/value pair to one of your metrics, you are creating a new variation of that metric. For example, many Amazon EC2 metrics publish InstanceId as a dimension name, and the actual instance ID as the value for that dimension. You can assign up to 30 dimensions to a metric. The name of the dimension. Dimension names must contain only ASCII characters, must include at least one non-whitespace character, and cannot start with a colon ( :). ASCII control characters are not supported as part of dimension names. The value of the dimension. Dimension values must contain only ASCII characters and must include at least one non-whitespace character. ASCII control characters are not supported as part of dimension values.",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name of the dimension. Dimension names must contain only ASCII characters, must include at least one non-whitespace character, and cannot start with a colon ( :). ASCII control characters are not supported as part of dimension names.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value of the dimension. Dimension values must contain only ASCII characters and must include at least one non-whitespace character. ASCII control characters are not supported as part of dimension values.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "AnomalyDetectorTypes",
      "type": "list",
      "required": false,
      "description": "The anomaly detector types to request when using DescribeAnomalyDetectorsInput. If empty, defaults to SINGLE_METRIC. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "AnomalyDetectors",
          "type": "list",
          "description": "The list of anomaly detection models returned by the operation.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Namespace",
                  "type": "string",
                  "description": "The namespace of the metric associated with the anomaly detection model.",
                  "nested_items": []
                },
                {
                  "name": "MetricName",
                  "type": "string",
                  "description": "The name of the metric associated with the anomaly detection model.",
                  "nested_items": []
                },
                {
                  "name": "Dimensions",
                  "type": "list",
                  "description": "The metric dimensions associated with the anomaly detection model.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Name",
                          "type": "string",
                          "description": "The name of the dimension. Dimension names must contain only ASCII characters, must include at least one non-whitespace character, and cannot start with a colon ( :). ASCII control characters are not supported as part of dimension names.",
                          "nested_items": []
                        },
                        {
                          "name": "Value",
                          "type": "string",
                          "description": "The value of the dimension. Dimension values must contain only ASCII characters and must include at least one non-whitespace character. ASCII control characters are not supported as part of dimension values.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "Stat",
                  "type": "string",
                  "description": "The statistic associated with the anomaly detection model.",
                  "nested_items": []
                },
                {
                  "name": "Configuration",
                  "type": "dict",
                  "description": "The configuration specifies details about how the anomaly detection model is to be trained, including time ranges to exclude from use for training the model, and the time zone to use for the metric.",
                  "nested_items": [
                    {
                      "name": "ExcludedTimeRanges",
                      "type": "list",
                      "description": "An array of time ranges to exclude from use when the anomaly detection model is trained. Use this to make sure that events that could cause unusual values for the metric, such as deployments, aren't used when CloudWatch creates the model.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "StartTime",
                              "type": "datetime",
                              "description": "The start time of the range to exclude. The format is yyyy-MM-dd'T'HH:mm:ss. For example, 2019-07-01T23:59:59.",
                              "nested_items": []
                            },
                            {
                              "name": "EndTime",
                              "type": "datetime",
                              "description": "The end time of the range to exclude. The format is yyyy-MM-dd'T'HH:mm:ss. For example, 2019-07-01T23:59:59.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "MetricTimezone",
                      "type": "string",
                      "description": "The time zone to use for the metric. This is useful to enable the model to automatically account for daylight savings time changes if the metric is sensitive to such time changes.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "StateValue",
                  "type": "string",
                  "description": "The current status of the anomaly detector's training.",
                  "nested_items": []
                },
                {
                  "name": "MetricCharacteristics",
                  "type": "dict",
                  "description": "This object includes parameters that you can use to provide information about your metric to CloudWatch to help it build more accurate anomaly detection models. Currently, it includes the PeriodicSpikes parameter.",
                  "nested_items": [
                    {
                      "name": "PeriodicSpikes",
                      "type": "boolean",
                      "description": "Set this parameter to true if values for this metric consistently include spikes that should not be considered to be anomalies. With this set to true, CloudWatch will expect to see spikes that occurred consistently during the model training period, and won't flag future similar spikes as anomalies.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "SingleMetricAnomalyDetector",
                  "type": "dict",
                  "description": "The CloudWatch metric and statistic for this anomaly detector.",
                  "nested_items": [
                    {
                      "name": "AccountId",
                      "type": "string",
                      "description": "If the CloudWatch metric that provides the time series that the anomaly detector uses as input is in another account, specify that account ID here. If you omit this parameter, the current account is used.",
                      "nested_items": []
                    },
                    {
                      "name": "Namespace",
                      "type": "string",
                      "description": "The namespace of the metric to create the anomaly detection model for.",
                      "nested_items": []
                    },
                    {
                      "name": "MetricName",
                      "type": "string",
                      "description": "The name of the metric to create the anomaly detection model for.",
                      "nested_items": []
                    },
                    {
                      "name": "Dimensions",
                      "type": "list",
                      "description": "The metric dimensions to create the anomaly detection model for.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "Name",
                              "type": "string",
                              "description": "The name of the dimension. Dimension names must contain only ASCII characters, must include at least one non-whitespace character, and cannot start with a colon ( :). ASCII control characters are not supported as part of dimension names.",
                              "nested_items": []
                            },
                            {
                              "name": "Value",
                              "type": "string",
                              "description": "The value of the dimension. Dimension values must contain only ASCII characters and must include at least one non-whitespace character. ASCII control characters are not supported as part of dimension values.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "Stat",
                      "type": "string",
                      "description": "The statistic to use for the metric and anomaly detection model.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "MetricMathAnomalyDetector",
                  "type": "dict",
                  "description": "The CloudWatch metric math expression for this anomaly detector.",
                  "nested_items": [
                    {
                      "name": "MetricDataQueries",
                      "type": "list",
                      "description": "An array of metric data query structures that enables you to create an anomaly detector based on the result of a metric math expression. Each item in MetricDataQueries gets a metric or performs a math expression. One item in MetricDataQueries is the expression that provides the time series that the anomaly detector uses as input. Designate the expression by setting ReturnData to true for this object in the array. For all other expressions and metrics, set ReturnData to false. The designated expression must return a single time series.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "Id",
                              "type": "string",
                              "description": "A short name used to tie this object to the results in the response. This name must be unique within a single call to GetMetricData. If you are performing math expressions on this set of data, this name represents that data and can serve as a variable in the mathematical expression. The valid characters are letters, numbers, and underscore. The first character must be a lowercase letter.",
                              "nested_items": []
                            },
                            {
                              "name": "MetricStat",
                              "type": "dict",
                              "description": "The metric to be returned, along with statistics, period, and units. Use this parameter only if this object is retrieving a metric and not performing a math expression on returned data.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "Namespace",
                                      "type": "string",
                                      "description": "The namespace of the metric.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "MetricName",
                                      "type": "string",
                                      "description": "The name of the metric. This is a required field.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Dimensions",
                                      "type": "list",
                                      "description": "The dimensions for the metric.",
                                      "nested_items": [
                                        {
                                          "name": "",
                                          "type": "dict",
                                          "description": "",
                                          "nested_items": [
                                            {
                                              "name": "Name",
                                              "type": "string",
                                              "description": "The name of the dimension. Dimension names must contain only ASCII characters, must include at least one non-whitespace character, and cannot start with a colon ( :). ASCII control characters are not supported as part of dimension names.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "Value",
                                              "type": "string",
                                              "description": "The value of the dimension. Dimension values must contain only ASCII characters and must include at least one non-whitespace character. ASCII control characters are not supported as part of dimension values.",
                                              "nested_items": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "name": "Period",
                                  "type": "integer",
                                  "description": "The granularity, in seconds, of the returned data points. For metrics with regular resolution, a period can be as short as one minute (60 seconds) and must be a multiple of 60. For high-resolution metrics that are collected at intervals of less than one minute, the period can be 1, 5, 10, 30, 60, or any multiple of 60. High-resolution metrics are those metrics stored by a PutMetricData call that includes a StorageResolution of 1 second.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "1 minute",
                                      "description": "Start time between 3 hours and 15 days ago - Use a multiple of 60 seconds (1 minute).",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "5 minutes",
                                      "description": "Start time between 15 and 63 days ago - Use a multiple of 300 seconds (5 minutes).",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "1 hour",
                                      "description": "Start time greater than 63 days ago - Use a multiple of 3600 seconds (1 hour).",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "Stat",
                                  "type": "string",
                                  "description": "The statistic to return. It can include any CloudWatch statistic or extended statistic.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Unit",
                                  "type": "string",
                                  "description": "When you are using a Put operation, this defines what unit you want to use when storing the metric.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "Expression",
                              "type": "string",
                              "description": "This field can contain either a Metrics Insights query, or a metric math expression to be performed on the returned data. For more information about Metrics Insights queries, see Metrics Insights query components and syntax in the Amazon CloudWatch User Guide.",
                              "nested_items": []
                            },
                            {
                              "name": "Label",
                              "type": "string",
                              "description": "A human-readable label for this metric or expression. This is especially useful if this is an expression, so that you know what the value represents. If the metric or expression is shown in a CloudWatch dashboard widget, the label is shown. If Label is omitted, CloudWatch generates a default.",
                              "nested_items": []
                            },
                            {
                              "name": "ReturnData",
                              "type": "boolean",
                              "description": "When used in GetMetricData, this option indicates whether to return the timestamps and raw data values of this metric. If you are performing this call just to do math expressions and do not also need the raw data returned, you can specify false. If you omit this, the default of true is used.",
                              "nested_items": []
                            },
                            {
                              "name": "Period",
                              "type": "integer",
                              "description": "The granularity, in seconds, of the returned data points. For metrics with regular resolution, a period can be as short as one minute (60 seconds) and must be a multiple of 60. For high-resolution metrics that are collected at intervals of less than one minute, the period can be 1, 5, 10, 30, 60, or any multiple of 60. High-resolution metrics are those metrics stored by a PutMetricData operation that includes a StorageResolution of 1 second.",
                              "nested_items": []
                            },
                            {
                              "name": "AccountId",
                              "type": "string",
                              "description": "The ID of the account where the metrics are located.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "A token that you can use in a subsequent operation to retrieve the next set of results.",
          "nested_items": []
        }
      ]
    }
  ]
}