{
  "method_name": "list_metrics",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudwatch/client/list_metrics.html",
  "description": "List the specified metrics. You can use the returned metrics with GetMetricData or GetMetricStatistics to get statistical data. Up to 500 results are returned for any one call. To retrieve additional results, use the returned token with subsequent calls. After you create a metric, allow up to 15 minutes for the metric to appear. To see metric statistics sooner, use GetMetricData or GetMetricStatistics. If you are using CloudWatch cross-account observability, you can use this operation in a monitoring account and view metrics from the linked source accounts. For more information, see CloudWatch cross-account observability. ListMetrics doesn't return information about metrics if those metrics haven't reported data in the past two weeks. To retrieve those metrics, use GetMetricData or GetMetricStatistics.",
  "parameters": [
    {
      "name": "Namespace",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MetricName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Dimensions",
      "type": "list",
      "required": true,
      "description": "The dimensions to filter against. Only the dimensions that match exactly will be returned. (dict) --- Represents filters for a dimension. The dimension name to be matched. Value (string) --- The value of the dimension to be matched.",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The dimension name to be matched.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value of the dimension to be matched.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "RecentlyActive",
      "type": "string",
      "required": false,
      "description": "To filter the results to show only metrics that have had data points published in the past three hours, specify this parameter with a value of PT3H. This is the only valid value for this parameter. The results that are returned are an approximation of the value you specify. There is a low probability that the returned results include metrics with last published data as much as 50 minutes more than the specified time interval.",
      "nested_params": []
    },
    {
      "name": "IncludeLinkedAccounts",
      "type": "boolean",
      "required": false,
      "description": "If you are using this operation in a monitoring account, specify true to include metrics from source accounts in the returned data. The default is false.",
      "nested_params": []
    },
    {
      "name": "OwningAccount",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Metrics",
          "type": "list",
          "description": "The metrics that match your request.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Namespace",
                  "type": "string",
                  "description": "The namespace of the metric.",
                  "nested_items": []
                },
                {
                  "name": "MetricName",
                  "type": "string",
                  "description": "The name of the metric. This is a required field.",
                  "nested_items": []
                },
                {
                  "name": "Dimensions",
                  "type": "list",
                  "description": "The dimensions for the metric.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Name",
                          "type": "string",
                          "description": "The name of the dimension. Dimension names must contain only ASCII characters, must include at least one non-whitespace character, and cannot start with a colon ( :). ASCII control characters are not supported as part of dimension names.",
                          "nested_items": []
                        },
                        {
                          "name": "Value",
                          "type": "string",
                          "description": "The value of the dimension. Dimension values must contain only ASCII characters and must include at least one non-whitespace character. ASCII control characters are not supported as part of dimension values.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The token that marks the start of the next batch of returned results.",
          "nested_items": []
        },
        {
          "name": "OwningAccounts",
          "type": "list",
          "description": "If you are using this operation in a monitoring account, this array contains the account IDs of the source accounts where the metrics in the returned data are from.",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}