{
  "method_name": "create_profile",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/transfer/client/create_profile.html",
  "description": "Creates the local or partner profile to use for AS2 transfers.",
  "parameters": [
    {
      "name": "As2Id",
      "type": "string",
      "required": true,
      "description": "The As2Id is the AS2-name, as defined in the RFC 4130. For inbound transfers, this is the AS2-From header for the AS2 messages sent from the partner. For outbound connectors, this is the AS2-To header for the AS2 messages sent to the partner using the StartFileTransfer API operation. This ID cannot include spaces.",
      "nested_params": []
    },
    {
      "name": "ProfileType",
      "type": "string",
      "required": true,
      "description": "Determines the type of profile to create: Specify LOCAL to create a local profile. A local profile represents the AS2-enabled Transfer Family server organization or party. Specify PARTNER to create a partner profile. A partner profile represents a remote organization, external to Transfer Family.",
      "nested_params": []
    },
    {
      "name": "CertificateIds",
      "type": "list",
      "required": false,
      "description": "An array of identifiers for the imported certificates. You use this identifier for working with profiles and partner profiles. (string) ---",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "Key-value pairs that can be used to group and search for AS2 profiles. (dict) --- Creates a key-value pair for a specific resource. Tags are metadata that you can use to search for and group a resource for various purposes. You can apply tags to servers, users, and roles. A tag key can take more than one value. For example, to group servers for accounting purposes, you might create a tag called Group and assign the values Research and Accounting to that group. The name assigned to the tag that you create. Contains one or more values that you assigned to the key name you create.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The name assigned to the tag that you create.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "Contains one or more values that you assigned to the key name you create.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ProfileId",
          "type": "string",
          "description": "The unique identifier for the AS2 profile, returned after the API call succeeds.",
          "nested_items": []
        }
      ]
    }
  ]
}