{
  "method_name": "create_web_app",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/transfer/client/create_web_app.html",
  "description": "Creates a web app based on specified parameters, and returns the ID for the new web app.",
  "parameters": [
    {
      "name": "IdentityProviderDetails",
      "type": "dict",
      "required": true,
      "description": "You can provide a structure that contains the details for the identity provider to use with your web app. For more details about this parameter, see Configure your identity provider for Transfer Family web apps. IdentityCenterConfig (dict) --- A structure that describes the values to use for the IAM Identity Center settings when you create a web app. InstanceArn (string) --- The Amazon Resource Name (ARN) for the IAM Identity Center used for the web app. Role (string) --- The IAM role in IAM Identity Center used for the web app.",
      "nested_params": [
        {
          "name": "IdentityCenterConfig",
          "type": "dict",
          "required": false,
          "description": "A structure that describes the values to use for the IAM Identity Center settings when you create a web app.",
          "nested_params": [
            {
              "name": "InstanceArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) for the IAM Identity Center used for the web app.",
              "nested_params": []
            },
            {
              "name": "Role",
              "type": "string",
              "required": false,
              "description": "The IAM role in IAM Identity Center used for the web app.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "AccessEndpoint",
      "type": "string",
      "required": false,
      "description": "The AccessEndpoint is the URL that you provide to your users for them to interact with the Transfer Family web app. You can specify a custom URL or use the default value. Before you enter a custom URL for this parameter, follow the steps described in Update your access endpoint with a custom URL.",
      "nested_params": []
    },
    {
      "name": "WebAppUnits",
      "type": "dict",
      "required": false,
      "description": "A union that contains the value for number of concurrent connections or the user sessions on your web app. Provisioned (integer) --- An integer that represents the number of units for your desired number of concurrent connections, or the number of user sessions on your web app at the same time. Each increment allows an additional 250 concurrent sessions: a value of 1 sets the number of concurrent sessions to 250; 2 sets a value of 500, and so on.",
      "nested_params": [
        {
          "name": "Provisioned",
          "type": "integer",
          "required": false,
          "description": "An integer that represents the number of units for your desired number of concurrent connections, or the number of user sessions on your web app at the same time. Each increment allows an additional 250 concurrent sessions: a value of 1 sets the number of concurrent sessions to 250; 2 sets a value of 500, and so on.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "Key-value pairs that can be used to group and search for web apps. (dict) --- Creates a key-value pair for a specific resource. Tags are metadata that you can use to search for and group a resource for various purposes. You can apply tags to servers, users, and roles. A tag key can take more than one value. For example, to group servers for accounting purposes, you might create a tag called Group and assign the values Research and Accounting to that group. The name assigned to the tag that you create. Contains one or more values that you assigned to the key name you create.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The name assigned to the tag that you create.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "Contains one or more values that you assigned to the key name you create.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "WebAppEndpointPolicy",
      "type": "string",
      "required": false,
      "description": "Setting for the type of endpoint policy for the web app. The default value is STANDARD. If you are creating the web app in an Amazon Web Services GovCloud (US) Region, you can set this parameter to FIPS.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "WebAppId",
          "type": "string",
          "description": "Returns a unique identifier for the web app.",
          "nested_items": []
        }
      ]
    }
  ]
}