{
  "method_name": "describe_user",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/transfer/client/describe_user.html",
  "description": "Describes the user assigned to the specific file transfer protocol-enabled server, as identified by its ServerId property. The response from this call returns the properties of the user associated with the ServerId value that was specified.",
  "parameters": [
    {
      "name": "ServerId",
      "type": "string",
      "required": true,
      "description": "A system-assigned unique identifier for a server that has this user assigned.",
      "nested_params": []
    },
    {
      "name": "UserName",
      "type": "string",
      "required": true,
      "description": "The name of the user assigned to one or more servers. User names are part of the sign-in credentials to use the Transfer Family service and perform file transfer tasks.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ServerId",
          "type": "string",
          "description": "A system-assigned unique identifier for a server that has this user assigned.",
          "nested_items": []
        },
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "Arn",
              "type": "string",
              "description": "Specifies the unique Amazon Resource Name (ARN) for the user that was requested to be described.",
              "nested_items": []
            },
            {
              "name": "HomeDirectory",
              "type": "string",
              "description": "The landing directory (folder) for a user when they log in to the server using the client.",
              "nested_items": []
            },
            {
              "name": "HomeDirectoryMappings",
              "type": "list",
              "description": "Logical directory mappings that specify what Amazon S3 or Amazon EFS paths and keys should be visible to your user and how you want to make them visible. You must specify the Entry and Target pair, where Entry shows how the path is made visible and Target is the actual Amazon S3 or Amazon EFS path. If you only specify a target, it is displayed as is. You also must ensure that your Identity and Access Management (IAM) role provides access to paths in Target. This value can be set only when HomeDirectoryType is set to LOGICAL.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Entry",
                      "type": "string",
                      "description": "Represents an entry for HomeDirectoryMappings.",
                      "nested_items": []
                    },
                    {
                      "name": "Target",
                      "type": "string",
                      "description": "Represents the map target that is used in a HomeDirectoryMapEntry.",
                      "nested_items": []
                    },
                    {
                      "name": "Type",
                      "type": "string",
                      "description": "Specifies the type of mapping. Set the type to FILE if you want the mapping to point to a file, or DIRECTORY for the directory to point to a directory.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "HomeDirectoryType",
              "type": "string",
              "description": "The type of landing directory (folder) that you want your users' home directory to be when they log in to the server. If you set it to PATH, the user will see the absolute Amazon S3 bucket or Amazon EFS path as is in their file transfer protocol clients. If you set it to LOGICAL, you need to provide mappings in the HomeDirectoryMappings for how you want to make Amazon S3 or Amazon EFS paths visible to your users.",
              "nested_items": []
            },
            {
              "name": "Policy",
              "type": "string",
              "description": "A session policy for your user so that you can use the same Identity and Access Management (IAM) role across multiple users. This policy scopes down a user's access to portions of their Amazon S3 bucket. Variables that you can use inside this policy include ${Transfer:UserName}, ${Transfer:HomeDirectory}, and ${Transfer:HomeBucket}.",
              "nested_items": []
            },
            {
              "name": "PosixProfile",
              "type": "dict",
              "description": "Specifies the full POSIX identity, including user ID ( Uid), group ID ( Gid), and any secondary groups IDs ( SecondaryGids), that controls your users' access to your Amazon Elastic File System (Amazon EFS) file systems. The POSIX permissions that are set on files and directories in your file system determine the level of access your users get when transferring files into and out of your Amazon EFS file systems.",
              "nested_items": [
                {
                  "name": "Uid",
                  "type": "integer",
                  "description": "The POSIX user ID used for all EFS operations by this user.",
                  "nested_items": []
                },
                {
                  "name": "Gid",
                  "type": "integer",
                  "description": "The POSIX group ID used for all EFS operations by this user.",
                  "nested_items": []
                },
                {
                  "name": "SecondaryGids",
                  "type": "list",
                  "description": "The secondary POSIX group IDs used for all EFS operations by this user.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "integer",
                      "description": "(integer) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "Role",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the Identity and Access Management (IAM) role that controls your users' access to your Amazon S3 bucket or Amazon EFS file system. The policies attached to this role determine the level of access that you want to provide your users when transferring files into and out of your Amazon S3 bucket or Amazon EFS file system. The IAM role should also contain a trust relationship that allows the server to access your resources when servicing your users' transfer requests.",
              "nested_items": []
            },
            {
              "name": "SshPublicKeys",
              "type": "list",
              "description": "Specifies the public key portion of the Secure Shell (SSH) keys stored for the described user.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "DateImported",
                      "type": "datetime",
                      "description": "Specifies the date that the public key was added to the Transfer Family user.",
                      "nested_items": []
                    },
                    {
                      "name": "SshPublicKeyBody",
                      "type": "string",
                      "description": "Specifies the content of the SSH public key as specified by the PublicKeyId.",
                      "nested_items": []
                    },
                    {
                      "name": "SshPublicKeyId",
                      "type": "string",
                      "description": "Specifies the SshPublicKeyId parameter contains the identifier of the public key.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "Tags",
              "type": "list",
              "description": "Specifies the key-value pairs for the user requested. Tag can be used to search for and group users for a variety of purposes.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Key",
                      "type": "string",
                      "description": "The name assigned to the tag that you create.",
                      "nested_items": []
                    },
                    {
                      "name": "Value",
                      "type": "string",
                      "description": "Contains one or more values that you assigned to the key name you create.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "UserName",
              "type": "string",
              "description": "Specifies the name of the user that was requested to be described. User names are used for authentication purposes. This is the string that will be used by your user when they log in to your server.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}