{
  "method_name": "describe_connector",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/transfer/client/describe_connector.html",
  "description": "Describes the connector that's identified by the ConnectorId.",
  "parameters": [
    {
      "name": "ConnectorId",
      "type": "string",
      "required": true,
      "description": "The unique identifier for the connector.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Connector",
          "type": "dict",
          "description": "The structure that contains the details of the connector.",
          "nested_items": [
            {
              "name": "Arn",
              "type": "string",
              "description": "The unique Amazon Resource Name (ARN) for the connector.",
              "nested_items": []
            },
            {
              "name": "ConnectorId",
              "type": "string",
              "description": "The unique identifier for the connector.",
              "nested_items": []
            },
            {
              "name": "Url",
              "type": "string",
              "description": "The URL of the partner's AS2 or SFTP endpoint.",
              "nested_items": []
            },
            {
              "name": "As2Config",
              "type": "dict",
              "description": "A structure that contains the parameters for an AS2 connector object.",
              "nested_items": [
                {
                  "name": "LocalProfileId",
                  "type": "string",
                  "description": "A unique identifier for the AS2 local profile.",
                  "nested_items": []
                },
                {
                  "name": "PartnerProfileId",
                  "type": "string",
                  "description": "A unique identifier for the partner profile for the connector.",
                  "nested_items": []
                },
                {
                  "name": "MessageSubject",
                  "type": "string",
                  "description": "Used as the Subject HTTP header attribute in AS2 messages that are being sent with the connector.",
                  "nested_items": []
                },
                {
                  "name": "Compression",
                  "type": "string",
                  "description": "Specifies whether the AS2 file is compressed.",
                  "nested_items": []
                },
                {
                  "name": "EncryptionAlgorithm",
                  "type": "string",
                  "description": "The algorithm that is used to encrypt the file.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "Do not use the DES_EDE3_CBC algorithm unless you must support a legacy client that requires it, as it is a weak encryption algorithm.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "You can only specify NONE if the URL for your connector uses HTTPS. Using HTTPS ensures that no traffic is sent in clear text.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "SigningAlgorithm",
                  "type": "string",
                  "description": "The algorithm that is used to sign the AS2 messages sent with the connector.",
                  "nested_items": []
                },
                {
                  "name": "MdnSigningAlgorithm",
                  "type": "string",
                  "description": "The signing algorithm for the MDN response.",
                  "nested_items": []
                },
                {
                  "name": "MdnResponse",
                  "type": "string",
                  "description": "Used for outbound requests (from an Transfer Family connector to a partner AS2 server) to determine whether the partner response for transfers is synchronous or asynchronous. Specify either of the following values:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "or not",
                      "description": "SYNC: The system expects a synchronous MDN response, confirming that the file was transferred successfully (or not).",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "NONE: Specifies that no MDN response is required.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "BasicAuthSecretId",
                  "type": "string",
                  "description": "Provides Basic authentication support to the AS2 Connectors API. To use Basic authentication, you must provide the name or Amazon Resource Name (ARN) of a secret in Secrets Manager.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "You are storing these credentials in Secrets Manager, not passing them directly into this API.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "If you are using the API, SDKs, or CloudFormation to configure your connector, then you must create the secret before you can enable Basic authentication. However, if you are using the Amazon Web Services management console, you can have the system create the secret for you.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "PreserveContentType",
                  "type": "string",
                  "description": "Allows you to use the Amazon S3 Content-Type that is associated with objects in S3 instead of having the content type mapped based on the file extension. This parameter is enabled by default when you create an AS2 connector from the console, but disabled by default when you create an AS2 connector by calling the API directly.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "AccessRole",
              "type": "string",
              "description": "Connectors are used to send files using either the AS2 or SFTP protocol. For the access role, provide the Amazon Resource Name (ARN) of the Identity and Access Management role to use.",
              "nested_items": []
            },
            {
              "name": "LoggingRole",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the Identity and Access Management (IAM) role that allows a connector to turn on CloudWatch logging for Amazon S3 events. When set, you can view connector activity in your CloudWatch logs.",
              "nested_items": []
            },
            {
              "name": "Tags",
              "type": "list",
              "description": "Key-value pairs that can be used to group and search for connectors.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Key",
                      "type": "string",
                      "description": "The name assigned to the tag that you create.",
                      "nested_items": []
                    },
                    {
                      "name": "Value",
                      "type": "string",
                      "description": "Contains one or more values that you assigned to the key name you create.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "SftpConfig",
              "type": "dict",
              "description": "A structure that contains the parameters for an SFTP connector object.",
              "nested_items": [
                {
                  "name": "UserSecretId",
                  "type": "string",
                  "description": "The identifier for the secret (in Amazon Web Services Secrets Manager) that contains the SFTP user's private key, password, or both. The identifier must be the Amazon Resource Name (ARN) of the secret.",
                  "nested_items": []
                },
                {
                  "name": "TrustedHostKeys",
                  "type": "list",
                  "description": "The public portion of the host key, or keys, that are used to identify the external server to which you are connecting. You can use the ssh-keyscan command against the SFTP server to retrieve the necessary key.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "For RSA keys, the <key type> string is ssh-rsa.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "For ECDSA keys, the <key type> string is either ecdsa-sha2-nistp256, ecdsa-sha2-nistp384, or ecdsa-sha2-nistp521, depending on the size of the key you generated.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "MaxConcurrentConnections",
                  "type": "integer",
                  "description": "Specify the number of concurrent connections that your connector creates to the remote server. The default value is 5 (this is also the maximum value allowed).",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "ServiceManagedEgressIpAddresses",
              "type": "list",
              "description": "The list of egress IP addresses of this connector. These IP addresses are assigned automatically when you create the connector.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "SecurityPolicyName",
              "type": "string",
              "description": "The text name of the security policy for the specified connector.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}