{
  "method_name": "list_users",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/transfer/client/list_users.html",
  "description": "Lists the users for a file transfer protocol-enabled server that you specify by passing the ServerId parameter.",
  "parameters": [
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ServerId",
      "type": "string",
      "required": true,
      "description": "A system-assigned unique identifier for a server that has users assigned to it.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "NextToken",
          "type": "string",
          "description": "When you can get additional results from the ListUsers call, a NextToken parameter is returned in the output. You can then pass in a subsequent command to the NextToken parameter to continue listing additional users.",
          "nested_items": []
        },
        {
          "name": "ServerId",
          "type": "string",
          "description": "A system-assigned unique identifier for a server that the users are assigned to.",
          "nested_items": []
        },
        {
          "name": "Users",
          "type": "list",
          "description": "Returns the Transfer Family users and their properties for the ServerId value that you specify.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Arn",
                  "type": "string",
                  "description": "Provides the unique Amazon Resource Name (ARN) for the user that you want to learn about.",
                  "nested_items": []
                },
                {
                  "name": "HomeDirectory",
                  "type": "string",
                  "description": "The landing directory (folder) for a user when they log in to the server using the client.",
                  "nested_items": []
                },
                {
                  "name": "HomeDirectoryType",
                  "type": "string",
                  "description": "The type of landing directory (folder) that you want your users' home directory to be when they log in to the server. If you set it to PATH, the user will see the absolute Amazon S3 bucket or Amazon EFS path as is in their file transfer protocol clients. If you set it to LOGICAL, you need to provide mappings in the HomeDirectoryMappings for how you want to make Amazon S3 or Amazon EFS paths visible to your users.",
                  "nested_items": []
                },
                {
                  "name": "Role",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the Identity and Access Management (IAM) role that controls your users' access to your Amazon S3 bucket or Amazon EFS file system. The policies attached to this role determine the level of access that you want to provide your users when transferring files into and out of your Amazon S3 bucket or Amazon EFS file system. The IAM role should also contain a trust relationship that allows the server to access your resources when servicing your users' transfer requests.",
                  "nested_items": []
                },
                {
                  "name": "SshPublicKeyCount",
                  "type": "integer",
                  "description": "Specifies the number of SSH public keys stored for the user you specified.",
                  "nested_items": []
                },
                {
                  "name": "UserName",
                  "type": "string",
                  "description": "Specifies the name of the user whose ARN was specified. User names are used for authentication purposes.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}