{
  "method_name": "start_directory_listing",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/transfer/client/start_directory_listing.html",
  "description": "Retrieves a list of the contents of a directory from a remote SFTP server. You specify the connector ID, the output path, and the remote directory path. You can also specify the optional MaxItems value to control the maximum number of items that are listed from the remote directory. This API returns a list of all files and directories in the remote directory (up to the maximum value), but does not return files or folders in sub-directories. That is, it only returns a list of files and directories one-level deep. After you receive the listing file, you can provide the files that you want to transfer to the RetrieveFilePaths parameter of the StartFileTransfer API call. The naming convention for the output file is connector-ID-listing-ID.json. The output file contains the following information:",
  "parameters": [
    {
      "name": "ConnectorId",
      "type": "string",
      "required": true,
      "description": "The unique identifier for the connector.",
      "nested_params": []
    },
    {
      "name": "RemoteDirectoryPath",
      "type": "string",
      "required": true,
      "description": "Specifies the directory on the remote SFTP server for which you want to list its contents.",
      "nested_params": []
    },
    {
      "name": "MaxItems",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "OutputDirectoryPath",
      "type": "string",
      "required": true,
      "description": "Specifies the path (bucket and prefix) in Amazon S3 storage to store the results of the directory listing.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ListingId",
          "type": "string",
          "description": "Returns a unique identifier for the directory listing call.",
          "nested_items": []
        },
        {
          "name": "OutputFileName",
          "type": "string",
          "description": "Returns the file name where the results are stored. This is a combination of the connector ID and the listing ID: <connector-id>-<listing-id>.json.",
          "nested_items": []
        }
      ]
    }
  ]
}