{
  "method_name": "add_endpoints",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/globalaccelerator/client/add_endpoints.html",
  "description": "Add endpoints to an endpoint group. The AddEndpoints API operation is the recommended option for adding endpoints. The alternative options are to add endpoints when you create an endpoint group (with the CreateEndpointGroup API) or when you update an endpoint group (with the UpdateEndpointGroup API). There are two advantages to using AddEndpoints to add endpoints in Global Accelerator: For information about endpoint types and requirements for endpoints that you can add to Global Accelerator, see Endpoints for standard accelerators in the Global Accelerator Developer Guide.",
  "parameters": [
    {
      "name": "EndpointConfigurations",
      "type": "list",
      "required": true,
      "description": "The list of endpoint objects. (dict) --- A complex type for endpoints. A resource must be valid and active when you add it as an endpoint. EndpointId (string) --- An ID for the endpoint. If the endpoint is a Network Load Balancer or Application Load Balancer, this is the Amazon Resource Name (ARN) of the resource. If the endpoint is an Elastic IP address, this is the Elastic IP address allocation ID. For Amazon EC2 instances, this is the EC2 instance ID. For cross-account endpoints, this must be the ARN of the resource. Weight (integer) --- The weight associated with the endpoint. When you add weights to endpoints, you configure Global Accelerator to route traffic based on proportions that you specify. For example, you might specify endpoint weights of 4, 5, 5, and 6 (sum=20). The result is that 4/20 of your traffic, on average, is routed to the first endpoint, 5/20 is routed both to the second and third endpoints, and 6/20 is routed to the last endpoint. For more information, see Endpoint weights in the Global Accelerator Developer Guide. ClientIPPreservationEnabled (boolean) --- Indicates whether client IP address preservation is enabled for an endpoint. The value is true or false. The default value is true for Application Load Balancer endpoints. If the value is set to true, the client's IP address is preserved in the X-Forwarded-For request header as traffic travels to applications on the endpoint fronted by the accelerator. Client IP address preservation is supported, in specific Amazon Web Services Regions, for endpoints that are Application Load Balancers, Amazon EC2 instances, and Network Load Balancers with security groups. IMPORTANT: You cannot use client IP address preservation with Network Load Balancers with TLS listeners. For more information, see Preserve client IP addresses in Global Accelerator in the Global Accelerator Developer Guide. AttachmentArn (string) --- The Amazon Resource Name (ARN) of the cross-account attachment that specifies the endpoints (resources) that can be added to accelerators and principals that have permission to add the endpoints.",
      "nested_params": [
        {
          "name": "EndpointId",
          "type": "string",
          "required": false,
          "description": "An ID for the endpoint. If the endpoint is a Network Load Balancer or Application Load Balancer, this is the Amazon Resource Name (ARN) of the resource. If the endpoint is an Elastic IP address, this is the Elastic IP address allocation ID. For Amazon EC2 instances, this is the EC2 instance ID. A resource must be valid and active when you add it as an endpoint. For cross-account endpoints, this must be the ARN of the resource.",
          "nested_params": []
        },
        {
          "name": "Weight",
          "type": "integer",
          "required": false,
          "description": "The weight associated with the endpoint. When you add weights to endpoints, you configure Global Accelerator to route traffic based on proportions that you specify. For example, you might specify endpoint weights of 4, 5, 5, and 6 (sum=20). The result is that 4/20 of your traffic, on average, is routed to the first endpoint, 5/20 is routed both to the second and third endpoints, and 6/20 is routed to the last endpoint. For more information, see Endpoint weights in the Global Accelerator Developer Guide.",
          "nested_params": []
        },
        {
          "name": "ClientIPPreservationEnabled",
          "type": "boolean",
          "required": false,
          "description": "Indicates whether client IP address preservation is enabled for an endpoint. The value is true or false. The default value is true for Application Load Balancer endpoints. If the value is set to true, the client's IP address is preserved in the X-Forwarded-For request header as traffic travels to applications on the endpoint fronted by the accelerator. Client IP address preservation is supported, in specific Amazon Web Services Regions, for endpoints that are Application Load Balancers, Amazon EC2 instances, and Network Load Balancers with security groups. IMPORTANT: You cannot use client IP address preservation with Network Load Balancers with TLS listeners. For more information, see Preserve client IP addresses in Global Accelerator in the Global Accelerator Developer Guide.",
          "nested_params": []
        },
        {
          "name": "AttachmentArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the cross-account attachment that specifies the endpoints (resources) that can be added to accelerators and principals that have permission to add the endpoints.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "EndpointGroupArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the endpoint group.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "EndpointDescriptions",
          "type": "list",
          "description": "The list of endpoint objects.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "EndpointId",
                  "type": "string",
                  "description": "An ID for the endpoint. If the endpoint is a Network Load Balancer or Application Load Balancer, this is the Amazon Resource Name (ARN) of the resource. If the endpoint is an Elastic IP address, this is the Elastic IP address allocation ID. For Amazon EC2 instances, this is the EC2 instance ID.",
                  "nested_items": []
                },
                {
                  "name": "Weight",
                  "type": "integer",
                  "description": "The weight associated with the endpoint. When you add weights to endpoints, you configure Global Accelerator to route traffic based on proportions that you specify. For example, you might specify endpoint weights of 4, 5, 5, and 6 (sum=20). The result is that 4/20 of your traffic, on average, is routed to the first endpoint, 5/20 is routed both to the second and third endpoints, and 6/20 is routed to the last endpoint. For more information, see Endpoint weights in the Global Accelerator Developer Guide.",
                  "nested_items": []
                },
                {
                  "name": "HealthState",
                  "type": "string",
                  "description": "The health status of the endpoint.",
                  "nested_items": []
                },
                {
                  "name": "HealthReason",
                  "type": "string",
                  "description": "Returns a null result.",
                  "nested_items": []
                },
                {
                  "name": "ClientIPPreservationEnabled",
                  "type": "boolean",
                  "description": "Indicates whether client IP address preservation is enabled for an endpoint. The value is true or false. The default value is true for Application Load Balancers endpoints.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "EndpointGroupArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the endpoint group.",
          "nested_items": []
        }
      ]
    }
  ]
}