{
  "method_name": "create_cross_account_attachment",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/globalaccelerator/client/create_cross_account_attachment.html",
  "description": "Create a cross-account attachment in Global Accelerator. You create a cross-account attachment to specify the principals who have permission to work with resources in accelerators in their own account. You specify, in the same attachment, the resources that are shared. A principal can be an Amazon Web Services account number or the Amazon Resource Name (ARN) for an accelerator. For account numbers that are listed as principals, to work with a resource listed in the attachment, you must sign in to an account specified as a principal. Then, you can work with resources that are listed, with any of your accelerators. If an accelerator ARN is listed in the cross-account attachment as a principal, anyone with permission to make updates to the accelerator can work with resources that are listed in the attachment. Specify each principal and resource separately. To specify two CIDR address pools, list them individually under Resources, and so on. For a command line operation, for example, you might use a statement like the following: \"Resources\": [{\"Cidr\": \"169.254.60.0/24\"},{\"Cidr\": \"169.254.59.0/24\"}] For more information, see Working with cross-account attachments and resources in Global Accelerator in the Global Accelerator Developer Guide.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "The name of the cross-account attachment.",
      "nested_params": []
    },
    {
      "name": "Principals",
      "type": "list",
      "required": false,
      "description": "The principals to include in the cross-account attachment. A principal can be an Amazon Web Services account number or the Amazon Resource Name (ARN) for an accelerator. (string) ---",
      "nested_params": []
    },
    {
      "name": "Resources",
      "type": "list",
      "required": false,
      "description": "The Amazon Resource Names (ARNs) for the resources to include in the cross-account attachment. A resource can be any supported Amazon Web Services resource type for Global Accelerator or a CIDR range for a bring your own IP address (BYOIP) address pool. (dict) --- A resource is one of the following: the ARN for an Amazon Web Services resource that is supported by Global Accelerator to be added as an endpoint, or a CIDR range that specifies a bring your own IP (BYOIP) address pool. EndpointId (string) --- The endpoint ID for the endpoint that is specified as a Amazon Web Services resource. An endpoint ID for the cross-account feature is the ARN of an Amazon Web Services resource, such as a Network Load Balancer, that Global Accelerator supports as an endpoint for an accelerator. Cidr (string) --- An IP address range, in CIDR format, that is specified as resource. The address must be provisioned and advertised in Global Accelerator by following the bring your own IP address (BYOIP) process for Global Accelerator For more information, see Bring your own IP addresses (BYOIP) in the Global Accelerator Developer Guide. Region (string) --- The Amazon Web Services Region where a shared endpoint resource is located.",
      "nested_params": [
        {
          "name": "EndpointId",
          "type": "string",
          "required": false,
          "description": "The endpoint ID for the endpoint that is specified as a Amazon Web Services resource. An endpoint ID for the cross-account feature is the ARN of an Amazon Web Services resource, such as a Network Load Balancer, that Global Accelerator supports as an endpoint for an accelerator.",
          "nested_params": []
        },
        {
          "name": "Cidr",
          "type": "string",
          "required": false,
          "description": "An IP address range, in CIDR format, that is specified as resource. The address must be provisioned and advertised in Global Accelerator by following the bring your own IP address (BYOIP) process for Global Accelerator For more information, see Bring your own IP addresses (BYOIP) in the Global Accelerator Developer Guide.",
          "nested_params": []
        },
        {
          "name": "Region",
          "type": "string",
          "required": false,
          "description": "The Amazon Web Services Region where a shared endpoint resource is located.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "IdempotencyToken",
      "type": "string",
      "required": true,
      "description": "A unique, case-sensitive identifier that you provide to ensure the idempotency--\u0094that is, the uniqueness--\u0094of the request. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "Add tags for a cross-account attachment. For more information, see Tagging in Global Accelerator in the Global Accelerator Developer Guide. (dict) --- A complex type that contains a Tag key and Tag value. A string that contains a Tag key. A string that contains a Tag value.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "A string that contains a Tag key.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "A string that contains a Tag value.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "CrossAccountAttachment",
          "type": "dict",
          "description": "Information about the cross-account attachment.",
          "nested_items": [
            {
              "name": "AttachmentArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the cross-account attachment.",
              "nested_items": []
            },
            {
              "name": "Name",
              "type": "string",
              "description": "The name of the cross-account attachment.",
              "nested_items": []
            },
            {
              "name": "Principals",
              "type": "list",
              "description": "The principals included in the cross-account attachment.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Resources",
              "type": "list",
              "description": "The resources included in the cross-account attachment.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "EndpointId",
                      "type": "string",
                      "description": "The endpoint ID for the endpoint that is specified as a Amazon Web Services resource.",
                      "nested_items": []
                    },
                    {
                      "name": "Cidr",
                      "type": "string",
                      "description": "An IP address range, in CIDR format, that is specified as resource. The address must be provisioned and advertised in Global Accelerator by following the bring your own IP address (BYOIP) process for Global Accelerator.",
                      "nested_items": []
                    },
                    {
                      "name": "Region",
                      "type": "string",
                      "description": "The Amazon Web Services Region where a shared endpoint resource is located.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "LastModifiedTime",
              "type": "datetime",
              "description": "The date and time that the cross-account attachment was last modified.",
              "nested_items": []
            },
            {
              "name": "CreatedTime",
              "type": "datetime",
              "description": "The date and time that the cross-account attachment was created.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}