{
  "method_name": "remove_endpoints",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/globalaccelerator/client/remove_endpoints.html",
  "description": "Remove endpoints from an endpoint group. The RemoveEndpoints API operation is the recommended option for removing endpoints. The alternative is to remove endpoints by updating an endpoint group by using the UpdateEndpointGroup API operation. There are two advantages to using AddEndpoints to remove endpoints instead:",
  "parameters": [
    {
      "name": "EndpointIdentifiers",
      "type": "list",
      "required": true,
      "description": "The identifiers of the endpoints that you want to remove. (dict) --- A complex type for an endpoint. Specifies information about the endpoint to remove from the endpoint group. An ID for the endpoint. If the endpoint is a Network Load Balancer or Application Load Balancer, this is the Amazon Resource Name (ARN) of the resource. If the endpoint is an Elastic IP address, this is the Elastic IP address allocation ID. For Amazon EC2 instances, this is the EC2 instance ID. An Application Load Balancer can be either internal or internet-facing. ClientIPPreservationEnabled (boolean) --- Indicates whether client IP address preservation is enabled for an endpoint. The value is true or false. If the value is set to true, the client's IP address is preserved in the X-Forwarded-For request header as traffic travels to applications on the endpoint fronted by the accelerator.",
      "nested_params": [
        {
          "name": "EndpointId",
          "type": "string",
          "required": false,
          "description": "An ID for the endpoint. If the endpoint is a Network Load Balancer or Application Load Balancer, this is the Amazon Resource Name (ARN) of the resource. If the endpoint is an Elastic IP address, this is the Elastic IP address allocation ID. For Amazon EC2 instances, this is the EC2 instance ID. An Application Load Balancer can be either internal or internet-facing.",
          "nested_params": []
        },
        {
          "name": "ClientIPPreservationEnabled",
          "type": "boolean",
          "required": false,
          "description": "Indicates whether client IP address preservation is enabled for an endpoint. The value is true or false. If the value is set to true, the client's IP address is preserved in the X-Forwarded-For request header as traffic travels to applications on the endpoint fronted by the accelerator.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "EndpointGroupArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the endpoint group.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}