{
  "method_name": "update_listener",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/globalaccelerator/client/update_listener.html",
  "description": "Update a listener.",
  "parameters": [
    {
      "name": "ListenerArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the listener to update.",
      "nested_params": []
    },
    {
      "name": "PortRanges",
      "type": "list",
      "required": false,
      "description": "The updated list of port ranges for the connections from clients to the accelerator. (dict) --- A complex type for a range of ports for a listener. FromPort (integer) --- The first port in the range of ports, inclusive. ToPort (integer) --- The last port in the range of ports, inclusive.",
      "nested_params": [
        {
          "name": "FromPort",
          "type": "integer",
          "required": false,
          "description": "The first port in the range of ports, inclusive.",
          "nested_params": []
        },
        {
          "name": "ToPort",
          "type": "integer",
          "required": false,
          "description": "The last port in the range of ports, inclusive.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Protocol",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ClientAffinity",
      "type": "string",
      "required": false,
      "description": "Client affinity lets you direct all requests from a user to the same endpoint, if you have stateful applications, regardless of the port and protocol of the client request. Client affinity gives you control over whether to always route each client to the same specific endpoint. Global Accelerator uses a consistent-flow hashing algorithm to choose the optimal endpoint for a connection. If client affinity is NONE, Global Accelerator uses the 'five-tuple' (5-tuple) properties--\u0094source IP address, source port, destination IP address, destination port, and protocol--\u0094to select the hash value, and then chooses the best endpoint. However, with this setting, if someone uses different ports to connect to Global Accelerator, their connections might not be always routed to the same endpoint because the hash value changes. If you want a given client to always be routed to the same endpoint, set client affinity to SOURCE_IP instead. When you use the SOURCE_IP setting, Global Accelerator uses the 'two-tuple' (2-tuple) properties--\u0094 source (client) IP address and destination IP address--\u0094to select the hash value. The default value is NONE.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "ListenerArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the listener.",
              "nested_items": []
            },
            {
              "name": "PortRanges",
              "type": "list",
              "description": "The list of port ranges for the connections from clients to the accelerator.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "FromPort",
                      "type": "integer",
                      "description": "The first port in the range of ports, inclusive.",
                      "nested_items": []
                    },
                    {
                      "name": "ToPort",
                      "type": "integer",
                      "description": "The last port in the range of ports, inclusive.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "Protocol",
              "type": "string",
              "description": "The protocol for the connections from clients to the accelerator.",
              "nested_items": []
            },
            {
              "name": "ClientAffinity",
              "type": "string",
              "description": "Client affinity lets you direct all requests from a user to the same endpoint, if you have stateful applications, regardless of the port and protocol of the client request. Client affinity gives you control over whether to always route each client to the same specific endpoint.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}