{
  "method_name": "register_stream_consumer",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kinesis/client/register_stream_consumer.html",
  "description": "Registers a consumer with a Kinesis data stream. When you use this operation, the consumer you register can then call  SubscribeToShard to receive data from the stream using enhanced fan-out, at a rate of up to 2 MiB per second for every shard you subscribe to. This rate is unaffected by the total number of consumers that read from the same stream. You can add tags to the registered consumer when making a RegisterStreamConsumer request by setting the Tags parameter. If you pass the Tags parameter, in addition to having the kinesis:RegisterStreamConsumer permission, you must also have the kinesis:TagResource permission for the consumer that will be registered. Tags will take effect from the CREATING status of the consumer. You can register up to 20 consumers per stream. A given consumer can only be registered with one stream at a time. For an example of how to use this operation, see Enhanced Fan-Out Using the Kinesis Data Streams API. The use of this operation has a limit of five transactions per second per account. Also, only 5 consumers can be created simultaneously. In other words, you cannot have more than 5 consumers in a CREATING status at the same time. Registering a 6th consumer while there are 5 in a CREATING status results in a LimitExceededException.",
  "parameters": [
    {
      "name": "StreamARN",
      "type": "string",
      "required": true,
      "description": "The ARN of the Kinesis data stream that you want to register the consumer with. For more info, see Amazon Resource Names (ARNs) and Amazon Web Services Service Namespaces.",
      "nested_params": []
    },
    {
      "name": "ConsumerName",
      "type": "string",
      "required": true,
      "description": "For a given Kinesis data stream, each consumer must have a unique name. However, consumer names don't have to be unique across data streams.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "dict",
      "required": false,
      "description": "A set of up to 50 key-value pairs. A tag consists of a required key and an optional value. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "ConsumerName",
              "type": "string",
              "description": "The name of the consumer is something you choose when you register the consumer.",
              "nested_items": []
            },
            {
              "name": "ConsumerARN",
              "type": "string",
              "description": "When you register a consumer, Kinesis Data Streams generates an ARN for it. You need this ARN to be able to call  SubscribeToShard.",
              "nested_items": []
            },
            {
              "name": "ConsumerStatus",
              "type": "string",
              "description": "A consumer can't read data while in the CREATING or DELETING states.",
              "nested_items": []
            },
            {
              "name": "ConsumerCreationTimestamp",
              "type": "datetime",
              "description": "",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}