{
  "method_name": "create_resource_share",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ram/client/create_resource_share.html",
  "description": "Creates a resource share. You can provide a list of the Amazon Resource Names (ARNs) for the resources that you want to share, a list of principals you want to share the resources with, and the permissions to grant those principals.",
  "parameters": [
    {
      "name": "name",
      "type": "string",
      "required": true,
      "description": "Specifies the name of the resource share.",
      "nested_params": []
    },
    {
      "name": "resourceArns",
      "type": "list",
      "required": false,
      "description": "Specifies a list of one or more ARNs of the resources to associate with the resource share. (string) ---",
      "nested_params": []
    },
    {
      "name": "principals",
      "type": "list",
      "required": false,
      "description": "Specifies a list of one or more principals to associate with the resource share. You can include the following values: An Amazon Web Services account ID, for example: 123456789012 An Amazon Resource Name (ARN) of an organization in Organizations, for example: organizations::123456789012:organization/o-exampleorgid An ARN of an organizational unit (OU) in Organizations, for example: organizations::123456789012:ou/o-exampleorgid/ou-examplerootid-exampleouid123 An ARN of an IAM role, for example: iam::123456789012:role/rolename An ARN of an IAM user, for example: iam::123456789012user/username (string) ---",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "list",
      "required": false,
      "description": "Specifies one or more tags to attach to the resource share itself. It doesn't attach the tags to the resources associated with the resource share. (dict) --- A structure containing a tag. A tag is metadata that you can attach to your resources to help organize and categorize them. You can also use them to help you secure your resources. For more information, see Controlling access to Amazon Web Services resources using tags. For more information about tags, see Tagging Amazon Web Services resources in the Amazon Web Services General Reference Guide. key (string) --- The key, or name, attached to the tag. Every tag must have a key. Key names are case sensitive. value (string) --- The string value attached to the tag. The value can be an empty string. Key values are case sensitive.",
      "nested_params": [
        {
          "name": "key",
          "type": "string",
          "required": false,
          "description": "The key, or name, attached to the tag. Every tag must have a key. Key names are case sensitive.",
          "nested_params": []
        },
        {
          "name": "value",
          "type": "string",
          "required": false,
          "description": "The string value attached to the tag. The value can be an empty string. Key values are case sensitive.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "allowExternalPrincipals",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "clientToken",
      "type": "string",
      "required": false,
      "description": "Specifies a unique, case-sensitive identifier that you provide to ensure the idempotency of the request. This lets you safely retry the request without accidentally performing the same operation a second time. Passing the same value to a later call to an operation requires that you also pass the same value for all other parameters. We recommend that you use a UUID type of value.. If you don't provide this value, then Amazon Web Services generates a random one for you. If you retry the operation with the same ClientToken, but with different parameters, the retry fails with an IdempotentParameterMismatch error.",
      "nested_params": []
    },
    {
      "name": "permissionArns",
      "type": "list",
      "required": false,
      "description": "Specifies the Amazon Resource Names (ARNs) of the RAM permission to associate with the resource share. If you do not specify an ARN for the permission, RAM automatically attaches the default version of the permission for each resource type. You can associate only one permission with each resource type included in the resource share. (string) ---",
      "nested_params": []
    },
    {
      "name": "sources",
      "type": "list",
      "required": false,
      "description": "Specifies from which source accounts the service principal has access to the resources in this resource share. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "resourceShare",
          "type": "dict",
          "description": "An object with information about the new resource share.",
          "nested_items": [
            {
              "name": "resourceShareArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the resource share.",
              "nested_items": []
            },
            {
              "name": "name",
              "type": "string",
              "description": "The name of the resource share.",
              "nested_items": []
            },
            {
              "name": "owningAccountId",
              "type": "string",
              "description": "The ID of the Amazon Web Services account that owns the resource share.",
              "nested_items": []
            },
            {
              "name": "allowExternalPrincipals",
              "type": "boolean",
              "description": "Indicates whether principals outside your organization in Organizations can be associated with a resource share.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "True --- the resource share can be shared with any Amazon Web Services account.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "False --- the resource share can be shared with only accounts in the same organization as the account that owns the resource share.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "status",
              "type": "string",
              "description": "The current status of the resource share.",
              "nested_items": []
            },
            {
              "name": "statusMessage",
              "type": "string",
              "description": "A message about the status of the resource share.",
              "nested_items": []
            },
            {
              "name": "tags",
              "type": "list",
              "description": "The tag key and value pairs attached to the resource share.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "key",
                      "type": "string",
                      "description": "The key, or name, attached to the tag. Every tag must have a key. Key names are case sensitive.",
                      "nested_items": []
                    },
                    {
                      "name": "value",
                      "type": "string",
                      "description": "The string value attached to the tag. The value can be an empty string. Key values are case sensitive.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "creationTime",
              "type": "datetime",
              "description": "The date and time when the resource share was created.",
              "nested_items": []
            },
            {
              "name": "lastUpdatedTime",
              "type": "datetime",
              "description": "The date and time when the resource share was last updated.",
              "nested_items": []
            },
            {
              "name": "featureSet",
              "type": "string",
              "description": "Indicates what features are available for this resource share. This parameter can have one of the following values:",
              "nested_items": [
                {
                  "name": "STANDARD",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "CREATED_FROM_POLICY",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "PROMOTING_TO_STANDARD",
                  "type": "",
                  "description": "",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "clientToken",
          "type": "string",
          "description": "The idempotency identifier associated with this request. If you want to repeat the same operation in an idempotent manner then you must include this value in the clientToken request parameter of that later call. All other parameters must also have the same values that you used in the first call.",
          "nested_items": []
        }
      ]
    }
  ]
}