{
  "method_name": "list_principals",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ram/client/list_principals.html",
  "description": "Lists the principals that you are sharing resources with or that are sharing resources with you.",
  "parameters": [
    {
      "name": "resourceOwner",
      "type": "string",
      "required": true,
      "description": "Specifies that you want to list information for only resource shares that match the following: SELF --- principals that your account is sharing resources with OTHER-ACCOUNTS --- principals that are sharing resources with your account.",
      "nested_params": []
    },
    {
      "name": "resourceArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "principals",
      "type": "list",
      "required": false,
      "description": "Specifies that you want to list information for only the listed principals. You can include the following values: An Amazon Web Services account ID, for example: 123456789012 An Amazon Resource Name (ARN) of an organization in Organizations, for example: organizations::123456789012:organization/o-exampleorgid An ARN of an organizational unit (OU) in Organizations, for example: organizations::123456789012:ou/o-exampleorgid/ou-examplerootid-exampleouid123 An ARN of an IAM role, for example: iam::123456789012:role/rolename An ARN of an IAM user, for example: iam::123456789012user/username (string) ---",
      "nested_params": []
    },
    {
      "name": "resourceType",
      "type": "string",
      "required": false,
      "description": "Specifies that you want to list information for only principals associated with resource shares that include the specified resource type. For a list of valid values, query the  ListResourceTypes operation.",
      "nested_params": []
    },
    {
      "name": "resourceShareArns",
      "type": "list",
      "required": false,
      "description": "Specifies that you want to list information for only principals associated with the resource shares specified by a list the Amazon Resource Names (ARNs). (string) ---",
      "nested_params": []
    },
    {
      "name": "nextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "maxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "principals",
          "type": "list",
          "description": "An array of objects that contain the details about the principals.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "id",
                  "type": "string",
                  "description": "The ID of the principal that can be associated with a resource share.",
                  "nested_items": []
                },
                {
                  "name": "resourceShareArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of a resource share the principal is associated with.",
                  "nested_items": []
                },
                {
                  "name": "creationTime",
                  "type": "datetime",
                  "description": "The date and time when the principal was associated with the resource share.",
                  "nested_items": []
                },
                {
                  "name": "lastUpdatedTime",
                  "type": "datetime",
                  "description": "The date and time when the association between the resource share and the principal was last updated.",
                  "nested_items": []
                },
                {
                  "name": "external",
                  "type": "boolean",
                  "description": "Indicates the relationship between the Amazon Web Services account the principal belongs to and the account that owns the resource share:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "True --- The two accounts belong to same organization.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "False --- The two accounts do not belong to the same organization.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "nextToken",
          "type": "string",
          "description": "If present, this value indicates that more output is available than is included in the current response. Use this value in the NextToken request parameter in a subsequent call to the operation to get the next part of the output. You should repeat this until the NextToken response element comes back as null. This indicates that this is the last page of results.",
          "nested_items": []
        }
      ]
    }
  ]
}