{
  "method_name": "replace_permission_associations",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ram/client/replace_permission_associations.html",
  "description": "Updates all resource shares that use a managed permission to a different managed permission. This operation always applies the default version of the target managed permission. You can optionally specify that the update applies to only resource shares that currently use a specified version. This enables you to update to the latest version, without changing the which managed permission is used. You can use this operation to update all of your resource shares to use the current default version of the permission by specifying the same value for the fromPermissionArn and toPermissionArn parameters. You can use the optional fromPermissionVersion parameter to update only those resources that use a specified version of the managed permission to the new managed permission.",
  "parameters": [
    {
      "name": "fromPermissionArn",
      "type": "string",
      "required": true,
      "description": "Specifies the Amazon Resource Name (ARN) of the managed permission that you want to replace.",
      "nested_params": []
    },
    {
      "name": "fromPermissionVersion",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "toPermissionArn",
      "type": "string",
      "required": true,
      "description": "Specifies the ARN of the managed permission that you want to associate with resource shares in place of the one specified by fromPerssionArn and fromPermissionVersion. The operation always associates the version that is currently the default for the specified managed permission.",
      "nested_params": []
    },
    {
      "name": "clientToken",
      "type": "string",
      "required": false,
      "description": "Specifies a unique, case-sensitive identifier that you provide to ensure the idempotency of the request. This lets you safely retry the request without accidentally performing the same operation a second time. Passing the same value to a later call to an operation requires that you also pass the same value for all other parameters. We recommend that you use a UUID type of value.. If you don't provide this value, then Amazon Web Services generates a random one for you. If you retry the operation with the same ClientToken, but with different parameters, the retry fails with an IdempotentParameterMismatch error.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "replacePermissionAssociationsWork",
          "type": "dict",
          "description": "Specifies a data structure that you can use to track the asynchronous tasks that RAM performs to complete this operation. You can use the  ListReplacePermissionAssociationsWork operation and pass the id value returned in this structure.",
          "nested_items": [
            {
              "name": "id",
              "type": "string",
              "description": "The unique identifier for the background task associated with one  ReplacePermissionAssociations request.",
              "nested_items": []
            },
            {
              "name": "fromPermissionArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the managed permission that this background task is replacing.",
              "nested_items": []
            },
            {
              "name": "fromPermissionVersion",
              "type": "string",
              "description": "The version of the managed permission that this background task is replacing.",
              "nested_items": []
            },
            {
              "name": "toPermissionArn",
              "type": "string",
              "description": "The ARN of the managed permission that this background task is associating with the resource shares in place of the managed permission and version specified in fromPermissionArn and fromPermissionVersion.",
              "nested_items": []
            },
            {
              "name": "toPermissionVersion",
              "type": "string",
              "description": "The version of the managed permission that this background task is associating with the resource shares. This is always the version that is currently the default for this managed permission.",
              "nested_items": []
            },
            {
              "name": "status",
              "type": "string",
              "description": "Specifies the current status of the background tasks for the specified ID. The output is one of the following strings:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "IN_PROGRESS.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "COMPLETED.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "FAILED.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "statusMessage",
              "type": "string",
              "description": "Specifies the reason for a FAILED status. This field is present only when there status is FAILED.",
              "nested_items": []
            },
            {
              "name": "creationTime",
              "type": "datetime",
              "description": "The date and time when this asynchronous background task was created.",
              "nested_items": []
            },
            {
              "name": "lastUpdatedTime",
              "type": "datetime",
              "description": "The date and time when the status of this background task was last updated.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "clientToken",
          "type": "string",
          "description": "The idempotency identifier associated with this request. If you want to repeat the same operation in an idempotent manner then you must include this value in the clientToken request parameter of that later call. All other parameters must also have the same values that you used in the first call.",
          "nested_items": []
        }
      ]
    }
  ]
}