{
  "method_name": "set_default_permission_version",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ram/client/set_default_permission_version.html",
  "description": "Designates the specified version number as the default version for the specified customer managed permission. New resource shares automatically use this new default permission. Existing resource shares continue to use their original permission version, but you can use  ReplacePermissionAssociations to update them.",
  "parameters": [
    {
      "name": "permissionArn",
      "type": "string",
      "required": true,
      "description": "Specifies the Amazon Resource Name (ARN) of the customer managed permission whose default version you want to change.",
      "nested_params": []
    },
    {
      "name": "permissionVersion",
      "type": "integer",
      "required": true,
      "description": "Specifies the version number that you want to designate as the default for customer managed permission. To see a list of all available version numbers, use  ListPermissionVersions.",
      "nested_params": []
    },
    {
      "name": "clientToken",
      "type": "string",
      "required": false,
      "description": "Specifies a unique, case-sensitive identifier that you provide to ensure the idempotency of the request. This lets you safely retry the request without accidentally performing the same operation a second time. Passing the same value to a later call to an operation requires that you also pass the same value for all other parameters. We recommend that you use a UUID type of value.. If you don't provide this value, then Amazon Web Services generates a random one for you. If you retry the operation with the same ClientToken, but with different parameters, the retry fails with an IdempotentParameterMismatch error.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "returnValue",
          "type": "boolean",
          "description": "A boolean value that indicates whether the operation was successful.",
          "nested_items": []
        },
        {
          "name": "clientToken",
          "type": "string",
          "description": "The idempotency identifier associated with this request. If you want to repeat the same operation in an idempotent manner then you must include this value in the clientToken request parameter of that later call. All other parameters must also have the same values that you used in the first call.",
          "nested_items": []
        }
      ]
    }
  ]
}