{
  "method_name": "create_firewall",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/network-firewall/client/create_firewall.html",
  "description": "Creates an Network Firewall  Firewall and accompanying  FirewallStatus for a VPC. The firewall defines the configuration settings for an Network Firewall firewall. The settings that you can define at creation include the firewall policy, the subnets in your VPC to use for the firewall endpoints, and any tags that are attached to the firewall Amazon Web Services resource. After you create a firewall, you can provide additional settings, like the logging configuration. To update the settings for a firewall, you use the operations that apply to the settings themselves, for example  UpdateLoggingConfiguration,  AssociateSubnets, and  UpdateFirewallDeleteProtection. To manage a firewall's tags, use the standard Amazon Web Services resource tagging operations,  ListTagsForResource,  TagResource, and  UntagResource. To retrieve information about firewalls, use  ListFirewalls and  DescribeFirewall. To generate a report on the last 30 days of traffic monitored by a firewall, use  StartAnalysisReport.",
  "parameters": [
    {
      "name": "FirewallName",
      "type": "string",
      "required": true,
      "description": "The descriptive name of the firewall. You can't change the name of a firewall after you create it.",
      "nested_params": []
    },
    {
      "name": "FirewallPolicyArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the  FirewallPolicy that you want to use for the firewall.",
      "nested_params": []
    },
    {
      "name": "VpcId",
      "type": "string",
      "required": false,
      "description": "The unique identifier of the VPC where Network Firewall should create the firewall. You can't change this setting after you create the firewall.",
      "nested_params": []
    },
    {
      "name": "SubnetMappings",
      "type": "list",
      "required": true,
      "description": "The public subnets to use for your Network Firewall firewalls. Each subnet must belong to a different Availability Zone in the VPC. Network Firewall creates a firewall endpoint in each subnet. (dict) --- The ID for a subnet that's used in an association with a firewall. This is used in  CreateFirewall,  AssociateSubnets, and  CreateVpcEndpointAssociation. Network Firewall creates an instance of the associated firewall in each subnet that you specify, to filter traffic in the subnet's Availability Zone. The unique identifier for the subnet. IPAddressType (string) --- The subnet's IP address type. You can't change the IP address type after you create the subnet.",
      "nested_params": [
        {
          "name": "SubnetId",
          "type": "string",
          "required": false,
          "description": "The unique identifier for the subnet.",
          "nested_params": []
        },
        {
          "name": "IPAddressType",
          "type": "string",
          "required": false,
          "description": "The subnet's IP address type. You can't change the IP address type after you create the subnet.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "DeleteProtection",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "SubnetChangeProtection",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "FirewallPolicyChangeProtection",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "The key:value pairs to associate with the resource. (dict) --- A key:value pair associated with an Amazon Web Services resource. The key:value pair can be anything you define. Typically, the tag key represents a category (such as 'environment') and the tag value represents a specific value within that category (such as 'test,' 'development,' or 'production'). You can add up to 50 tags to each Amazon Web Services resource. The part of the key:value pair that defines a tag. You can use a tag key to describe a category of information, such as 'customer.' Tag keys are case-sensitive. You can use a tag value to describe a specific value within a category, such as 'companyA' or 'companyB.' Tag values are case-sensitive.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The part of the key:value pair that defines a tag. You can use a tag key to describe a category of information, such as 'customer.' Tag keys are case-sensitive.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The part of the key:value pair that defines a tag. You can use a tag value to describe a specific value within a category, such as 'companyA' or 'companyB.' Tag values are case-sensitive.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "EncryptionConfiguration",
      "type": "dict",
      "required": true,
      "description": "A complex type that contains settings for encryption of your firewall resources. KeyId (string) --- The ID of the Amazon Web Services Key Management Service (KMS) customer managed key. You can use any of the key identifiers that KMS supports, unless you're using a key that's managed by another account. If you're using a key managed by another account, then specify the key ARN. For more information, see Key ID in the Amazon Web Services KMS Developer Guide. The type of Amazon Web Services KMS key to use for encryption of your Network Firewall resources.",
      "nested_params": [
        {
          "name": "KeyId",
          "type": "string",
          "required": false,
          "description": "The ID of the Amazon Web Services Key Management Service (KMS) customer managed key. You can use any of the key identifiers that KMS supports, unless you're using a key that's managed by another account. If you're using a key managed by another account, then specify the key ARN. For more information, see Key ID in the Amazon Web Services KMS Developer Guide.",
          "nested_params": []
        },
        {
          "name": "Type",
          "type": "string",
          "required": false,
          "description": "The type of Amazon Web Services KMS key to use for encryption of your Network Firewall resources.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "EnabledAnalysisTypes",
      "type": "list",
      "required": false,
      "description": "An optional setting indicating the specific traffic analysis types to enable on the firewall. (string) ---",
      "nested_params": []
    },
    {
      "name": "TransitGatewayId",
      "type": "string",
      "required": false,
      "description": "Required when creating a transit gateway-attached firewall. The unique identifier of the transit gateway to attach to this firewall. You can provide either a transit gateway from your account or one that has been shared with you through Resource Access Manager. For information about creating firewalls, see  CreateFirewall. For specific guidance about transit gateway-attached firewalls, see Considerations for transit gateway-attached firewalls in the Network Firewall Developer Guide.",
      "nested_params": []
    },
    {
      "name": "AvailabilityZoneMappings",
      "type": "list",
      "required": true,
      "description": "Required. The Availability Zones where you want to create firewall endpoints for a transit gateway-attached firewall. You must specify at least one Availability Zone. Consider enabling the firewall in every Availability Zone where you have workloads to maintain Availability Zone independence. You can modify Availability Zones later using  AssociateAvailabilityZones or  DisassociateAvailabilityZones, but this may briefly disrupt traffic. The AvailabilityZoneChangeProtection setting controls whether you can make these modifications. (dict) --- Defines the mapping between an Availability Zone and a firewall endpoint for a transit gateway-attached firewall. Each mapping represents where the firewall can process traffic. You use these mappings when calling  CreateFirewall,  AssociateAvailabilityZones, and  DisassociateAvailabilityZones. To retrieve the current Availability Zone mappings for a firewall, use  DescribeFirewall. The ID of the Availability Zone where the firewall endpoint is located. For example, us-east-2a. The Availability Zone must be in the same Region as the transit gateway.",
      "nested_params": [
        {
          "name": "AvailabilityZone",
          "type": "string",
          "required": false,
          "description": "The ID of the Availability Zone where the firewall endpoint is located. For example, us-east-2a. The Availability Zone must be in the same Region as the transit gateway.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "AvailabilityZoneChangeProtection",
      "type": "boolean",
      "required": false,
      "description": "Optional. A setting indicating whether the firewall is protected against changes to its Availability Zone configuration. When set to TRUE, you cannot add or remove Availability Zones without first disabling this protection using  UpdateAvailabilityZoneChangeProtection. Default value: FALSE.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "FirewallName",
              "type": "string",
              "description": "The descriptive name of the firewall. You can't change the name of a firewall after you create it.",
              "nested_items": []
            },
            {
              "name": "FirewallArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the firewall.",
              "nested_items": []
            },
            {
              "name": "FirewallPolicyArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the firewall policy.",
              "nested_items": []
            },
            {
              "name": "VpcId",
              "type": "string",
              "description": "The unique identifier of the VPC where the firewall is in use.",
              "nested_items": []
            },
            {
              "name": "SubnetMappings",
              "type": "list",
              "description": "The primary public subnets that Network Firewall is using for the firewall. Network Firewall creates a firewall endpoint in each subnet. Create a subnet mapping for each Availability Zone where you want to use the firewall.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "SubnetId",
                      "type": "string",
                      "description": "The unique identifier for the subnet.",
                      "nested_items": []
                    },
                    {
                      "name": "IPAddressType",
                      "type": "string",
                      "description": "The subnet's IP address type. You can't change the IP address type after you create the subnet.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "DeleteProtection",
              "type": "boolean",
              "description": "A flag indicating whether it is possible to delete the firewall. A setting of TRUE indicates that the firewall is protected against deletion. Use this setting to protect against accidentally deleting a firewall that is in use. When you create a firewall, the operation initializes this flag to TRUE.",
              "nested_items": []
            },
            {
              "name": "SubnetChangeProtection",
              "type": "boolean",
              "description": "A setting indicating whether the firewall is protected against changes to the subnet associations. Use this setting to protect against accidentally modifying the subnet associations for a firewall that is in use. When you create a firewall, the operation initializes this setting to TRUE.",
              "nested_items": []
            },
            {
              "name": "FirewallPolicyChangeProtection",
              "type": "boolean",
              "description": "A setting indicating whether the firewall is protected against a change to the firewall policy association. Use this setting to protect against accidentally modifying the firewall policy for a firewall that is in use. When you create a firewall, the operation initializes this setting to TRUE.",
              "nested_items": []
            },
            {
              "name": "Description",
              "type": "string",
              "description": "A description of the firewall.",
              "nested_items": []
            },
            {
              "name": "FirewallId",
              "type": "string",
              "description": "The unique identifier for the firewall.",
              "nested_items": []
            },
            {
              "name": "Tags",
              "type": "list",
              "description": "(dict) ---",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Key",
                      "type": "string",
                      "description": "The part of the key:value pair that defines a tag. You can use a tag key to describe a category of information, such as 'customer.' Tag keys are case-sensitive.",
                      "nested_items": []
                    },
                    {
                      "name": "Value",
                      "type": "string",
                      "description": "The part of the key:value pair that defines a tag. You can use a tag value to describe a specific value within a category, such as 'companyA' or 'companyB.' Tag values are case-sensitive.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "EncryptionConfiguration",
              "type": "dict",
              "description": "A complex type that contains the Amazon Web Services KMS encryption configuration settings for your firewall.",
              "nested_items": [
                {
                  "name": "KeyId",
                  "type": "string",
                  "description": "The ID of the Amazon Web Services Key Management Service (KMS) customer managed key. You can use any of the key identifiers that KMS supports, unless you're using a key that's managed by another account. If you're using a key managed by another account, then specify the key ARN. For more information, see Key ID in the Amazon Web Services KMS Developer Guide.",
                  "nested_items": []
                },
                {
                  "name": "Type",
                  "type": "string",
                  "description": "The type of Amazon Web Services KMS key to use for encryption of your Network Firewall resources.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "NumberOfAssociations",
              "type": "integer",
              "description": "The number of VpcEndpointAssociation resources that use this firewall.",
              "nested_items": []
            },
            {
              "name": "EnabledAnalysisTypes",
              "type": "list",
              "description": "An optional setting indicating the specific traffic analysis types to enable on the firewall.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "TransitGatewayId",
              "type": "string",
              "description": "The unique identifier of the transit gateway associated with this firewall. This field is only present for transit gateway-attached firewalls.",
              "nested_items": []
            },
            {
              "name": "TransitGatewayOwnerAccountId",
              "type": "string",
              "description": "The Amazon Web Services account ID that owns the transit gateway. This may be different from the firewall owner's account ID when using a shared transit gateway.",
              "nested_items": []
            },
            {
              "name": "AvailabilityZoneMappings",
              "type": "list",
              "description": "The Availability Zones where the firewall endpoints are created for a transit gateway-attached firewall. Each mapping specifies an Availability Zone where the firewall processes traffic.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "AvailabilityZone",
                      "type": "string",
                      "description": "The ID of the Availability Zone where the firewall endpoint is located. For example, us-east-2a. The Availability Zone must be in the same Region as the transit gateway.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "AvailabilityZoneChangeProtection",
              "type": "boolean",
              "description": "A setting indicating whether the firewall is protected against changes to its Availability Zone configuration. When set to TRUE, you must first disable this protection before adding or removing Availability Zones.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "FirewallStatus",
          "type": "dict",
          "description": "Detailed information about the current status of a  Firewall. You can retrieve this for a firewall by calling  DescribeFirewall and providing the firewall name and ARN.",
          "nested_items": [
            {
              "name": "Status",
              "type": "string",
              "description": "The readiness of the configured firewall to handle network traffic across all of the Availability Zones where you have it configured. This setting is READY only when the ConfigurationSyncStateSummary value is IN_SYNC and the Attachment Status values for all of the configured subnets are READY.",
              "nested_items": []
            },
            {
              "name": "ConfigurationSyncStateSummary",
              "type": "string",
              "description": "The configuration sync state for the firewall. This summarizes the Config settings in the SyncStates for this firewall status object.",
              "nested_items": []
            },
            {
              "name": "SyncStates",
              "type": "dict",
              "description": "Status for the subnets that you've configured in the firewall. This contains one array element per Availability Zone where you've configured a subnet in the firewall.",
              "nested_items": [
                {
                  "name": "Attachment",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "Instantiates a firewall endpoint in the subnet, ready to take traffic.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "Configures the endpoint with the current firewall policy settings, to provide the filtering behavior for the endpoint.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "CapacityUsageSummary",
              "type": "dict",
              "description": "Describes the capacity usage of the resources contained in a firewall's reference sets. Network Firewall calculates the capacity usage by taking an aggregated count of all of the resources used by all of the reference sets in a firewall.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "AvailableCIDRCount",
                      "type": "integer",
                      "description": "The number of CIDR blocks available for use by the IP set references in a firewall.",
                      "nested_items": []
                    },
                    {
                      "name": "UtilizedCIDRCount",
                      "type": "integer",
                      "description": "The number of CIDR blocks used by the IP set references in a firewall.",
                      "nested_items": []
                    },
                    {
                      "name": "IPSetReferences",
                      "type": "dict",
                      "description": "The list of the IP set references used by a firewall.",
                      "nested_items": [
                        {
                          "name": "ResolvedCIDRCount",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "dict",
                              "description": "",
                              "nested_items": [
                                {
                                  "name": "ResolvedCIDRCount",
                                  "type": "integer",
                                  "description": "Describes the total number of CIDR blocks currently in use by the IP set references in a firewall. To determine how many CIDR blocks are available for you to use in a firewall, you can call AvailableCIDRCount.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "TransitGatewayAttachmentSyncState",
              "type": "dict",
              "description": "The synchronization state of the transit gateway attachment. This indicates whether the firewall's transit gateway configuration is properly synchronized and operational. Use this to verify that your transit gateway configuration changes have been applied.",
              "nested_items": [
                {
                  "name": "AttachmentId",
                  "type": "string",
                  "description": "The unique identifier of the transit gateway attachment.",
                  "nested_items": []
                },
                {
                  "name": "TransitGatewayAttachmentStatus",
                  "type": "string",
                  "description": "The current status of the transit gateway attachment.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "CREATING - The attachment is being created.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "DELETING - The attachment is being deleted.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "DELETED - The attachment has been deleted.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "FAILED - The attachment creation has failed and cannot be recovered.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "ERROR - The attachment is in an error state that might be recoverable.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "READY - The attachment is active and processing traffic.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "PENDING_ACCEPTANCE - The attachment is waiting to be accepted.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "REJECTING - The attachment is in the process of being rejected.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "REJECTED - The attachment has been rejected.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "StatusMessage",
                  "type": "string",
                  "description": "A message providing additional information about the current status, particularly useful when the transit gateway attachment is in a non- READY state.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "CREATING - The attachment is being created.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "DELETING - The attachment is being deleted.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "DELETED - The attachment has been deleted.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "FAILED - The attachment creation has failed and cannot be recovered.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "ERROR - The attachment is in an error state that might be recoverable.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "READY - The attachment is active and processing traffic.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "PENDING_ACCEPTANCE - The attachment is waiting to be accepted.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "REJECTING - The attachment is in the process of being rejected.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "REJECTED - The attachment has been rejected.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}