{
  "method_name": "delete_rule_group",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/network-firewall/client/delete_rule_group.html",
  "description": "Deletes the specified  RuleGroup.",
  "parameters": [
    {
      "name": "RuleGroupName",
      "type": "string",
      "required": false,
      "description": "The descriptive name of the rule group. You can't change the name of a rule group after you create it. You must specify the ARN or the name, and you can specify both.",
      "nested_params": []
    },
    {
      "name": "RuleGroupArn",
      "type": "string",
      "required": false,
      "description": "The Amazon Resource Name (ARN) of the rule group. You must specify the ARN or the name, and you can specify both.",
      "nested_params": []
    },
    {
      "name": "Type",
      "type": "string",
      "required": false,
      "description": "Indicates whether the rule group is stateless or stateful. If the rule group is stateless, it contains stateless rules. If it is stateful, it contains stateful rules.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "RuleGroupResponse",
          "type": "dict",
          "description": "The high-level properties of a rule group. This, along with the  RuleGroup, define the rule group. You can retrieve all objects for a rule group by calling  DescribeRuleGroup.",
          "nested_items": [
            {
              "name": "RuleGroupArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the rule group.",
              "nested_items": []
            },
            {
              "name": "RuleGroupName",
              "type": "string",
              "description": "The descriptive name of the rule group. You can't change the name of a rule group after you create it.",
              "nested_items": []
            },
            {
              "name": "RuleGroupId",
              "type": "string",
              "description": "The unique identifier for the rule group.",
              "nested_items": []
            },
            {
              "name": "Description",
              "type": "string",
              "description": "A description of the rule group.",
              "nested_items": []
            },
            {
              "name": "Type",
              "type": "string",
              "description": "Indicates whether the rule group is stateless or stateful. If the rule group is stateless, it contains stateless rules. If it is stateful, it contains stateful rules.",
              "nested_items": []
            },
            {
              "name": "Capacity",
              "type": "integer",
              "description": "The maximum operating resources that this rule group can use. Rule group capacity is fixed at creation. When you update a rule group, you are limited to this capacity. When you reference a rule group from a firewall policy, Network Firewall reserves this capacity for the rule group.",
              "nested_items": []
            },
            {
              "name": "RuleGroupStatus",
              "type": "string",
              "description": "Detailed information about the current status of a rule group.",
              "nested_items": []
            },
            {
              "name": "Tags",
              "type": "list",
              "description": "The key:value pairs to associate with the resource.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Key",
                      "type": "string",
                      "description": "The part of the key:value pair that defines a tag. You can use a tag key to describe a category of information, such as 'customer.' Tag keys are case-sensitive.",
                      "nested_items": []
                    },
                    {
                      "name": "Value",
                      "type": "string",
                      "description": "The part of the key:value pair that defines a tag. You can use a tag value to describe a specific value within a category, such as 'companyA' or 'companyB.' Tag values are case-sensitive.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "ConsumedCapacity",
              "type": "integer",
              "description": "The number of capacity units currently consumed by the rule group rules.",
              "nested_items": []
            },
            {
              "name": "NumberOfAssociations",
              "type": "integer",
              "description": "The number of firewall policies that use this rule group.",
              "nested_items": []
            },
            {
              "name": "EncryptionConfiguration",
              "type": "dict",
              "description": "A complex type that contains the Amazon Web Services KMS encryption configuration settings for your rule group.",
              "nested_items": [
                {
                  "name": "KeyId",
                  "type": "string",
                  "description": "The ID of the Amazon Web Services Key Management Service (KMS) customer managed key. You can use any of the key identifiers that KMS supports, unless you're using a key that's managed by another account. If you're using a key managed by another account, then specify the key ARN. For more information, see Key ID in the Amazon Web Services KMS Developer Guide.",
                  "nested_items": []
                },
                {
                  "name": "Type",
                  "type": "string",
                  "description": "The type of Amazon Web Services KMS key to use for encryption of your Network Firewall resources.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "SourceMetadata",
              "type": "dict",
              "description": "A complex type that contains metadata about the rule group that your own rule group is copied from. You can use the metadata to track the version updates made to the originating rule group.",
              "nested_items": [
                {
                  "name": "SourceArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the rule group that your own rule group is copied from.",
                  "nested_items": []
                },
                {
                  "name": "SourceUpdateToken",
                  "type": "string",
                  "description": "The update token of the Amazon Web Services managed rule group that your own rule group is copied from. To determine the update token for the managed rule group, call DescribeRuleGroup.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "SnsTopic",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the Amazon Simple Notification Service SNS topic that's used to record changes to the managed rule group. You can subscribe to the SNS topic to receive notifications when the managed rule group is modified, such as for new versions and for version expiration. For more information, see the Amazon Simple Notification Service Developer Guide..",
              "nested_items": []
            },
            {
              "name": "LastModifiedTime",
              "type": "datetime",
              "description": "The last time that the rule group was changed.",
              "nested_items": []
            },
            {
              "name": "AnalysisResults",
              "type": "list",
              "description": "The list of analysis results for AnalyzeRuleGroup. If you set AnalyzeRuleGroup to TRUE in  CreateRuleGroup,  UpdateRuleGroup, or  DescribeRuleGroup, Network Firewall analyzes the rule group and identifies the rules that might adversely effect your firewall's functionality. For example, if Network Firewall detects a rule that's routing traffic asymmetrically, which impacts the service's ability to properly process traffic, the service includes the rule in the list of analysis results.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "IdentifiedRuleIds",
                      "type": "list",
                      "description": "The priority number of the stateless rules identified in the analysis.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "IdentifiedType",
                      "type": "string",
                      "description": "The types of rule configurations that Network Firewall analyzes your rule groups for. Network Firewall analyzes stateless rule groups for the following types of rule configurations:",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "STATELESS_RULE_FORWARDING_ASYMMETRICALLY Cause: One or more stateless rules with the action pass or forward are forwarding traffic asymmetrically. Specifically, the rule's set of source IP addresses or their associated port numbers, don't match the set of destination IP addresses or their associated port numbers. To mitigate: Make sure that there's an existing return path. For example, if the rule allows traffic from source 10.1.0.0/24 to destination 20.1.0.0/24, you should allow return traffic from source 20.1.0.0/24 to destination 10.1.0.0/24.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "STATELESS_RULE_CONTAINS_TCP_FLAGS Cause: At least one stateless rule with the action pass or forward contains TCP flags that are inconsistent in the forward and return directions. To mitigate: Prevent asymmetric routing issues caused by TCP flags by following these actions:",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "",
                              "description": "Remove unnecessary TCP flag inspections from the rules.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "If you need to inspect TCP flags, check that the rules correctly account for changes in TCP flags throughout the TCP connection cycle, for example SYN and ACK flags used in a 3-way TCP handshake.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "AnalysisDetail",
                      "type": "string",
                      "description": "Provides analysis details for the identified rule.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "SummaryConfiguration",
              "type": "dict",
              "description": "A complex type containing the currently selected rule option fields that will be displayed for rule summarization returned by  DescribeRuleGroupSummary.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "The RuleOptions specified in  SummaryConfiguration.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Rule metadata organization preferences.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}