{
  "method_name": "describe_firewall_policy",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/network-firewall/client/describe_firewall_policy.html",
  "description": "Returns the data objects for the specified firewall policy.",
  "parameters": [
    {
      "name": "FirewallPolicyName",
      "type": "string",
      "required": false,
      "description": "The descriptive name of the firewall policy. You can't change the name of a firewall policy after you create it. You must specify the ARN or the name, and you can specify both.",
      "nested_params": []
    },
    {
      "name": "FirewallPolicyArn",
      "type": "string",
      "required": false,
      "description": "The Amazon Resource Name (ARN) of the firewall policy. You must specify the ARN or the name, and you can specify both.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "UpdateToken",
          "type": "string",
          "description": "A token used for optimistic locking. Network Firewall returns a token to your requests that access the firewall policy. The token marks the state of the policy resource at the time of the request.",
          "nested_items": []
        },
        {
          "name": "FirewallPolicyResponse",
          "type": "dict",
          "description": "The high-level properties of a firewall policy. This, along with the  FirewallPolicy, define the policy. You can retrieve all objects for a firewall policy by calling  DescribeFirewallPolicy.",
          "nested_items": [
            {
              "name": "FirewallPolicyName",
              "type": "string",
              "description": "The descriptive name of the firewall policy. You can't change the name of a firewall policy after you create it.",
              "nested_items": []
            },
            {
              "name": "FirewallPolicyArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the firewall policy.",
              "nested_items": []
            },
            {
              "name": "FirewallPolicyId",
              "type": "string",
              "description": "The unique identifier for the firewall policy.",
              "nested_items": []
            },
            {
              "name": "Description",
              "type": "string",
              "description": "A description of the firewall policy.",
              "nested_items": []
            },
            {
              "name": "FirewallPolicyStatus",
              "type": "string",
              "description": "The current status of the firewall policy. You can retrieve this for a firewall policy by calling  DescribeFirewallPolicy and providing the firewall policy's name or ARN.",
              "nested_items": []
            },
            {
              "name": "Tags",
              "type": "list",
              "description": "The key:value pairs to associate with the resource.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Key",
                      "type": "string",
                      "description": "The part of the key:value pair that defines a tag. You can use a tag key to describe a category of information, such as 'customer.' Tag keys are case-sensitive.",
                      "nested_items": []
                    },
                    {
                      "name": "Value",
                      "type": "string",
                      "description": "The part of the key:value pair that defines a tag. You can use a tag value to describe a specific value within a category, such as 'companyA' or 'companyB.' Tag values are case-sensitive.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "ConsumedStatelessRuleCapacity",
              "type": "integer",
              "description": "The number of capacity units currently consumed by the policy's stateless rules.",
              "nested_items": []
            },
            {
              "name": "ConsumedStatefulRuleCapacity",
              "type": "integer",
              "description": "The number of capacity units currently consumed by the policy's stateful rules.",
              "nested_items": []
            },
            {
              "name": "NumberOfAssociations",
              "type": "integer",
              "description": "The number of firewalls that are associated with this firewall policy.",
              "nested_items": []
            },
            {
              "name": "EncryptionConfiguration",
              "type": "dict",
              "description": "A complex type that contains the Amazon Web Services KMS encryption configuration settings for your firewall policy.",
              "nested_items": [
                {
                  "name": "KeyId",
                  "type": "string",
                  "description": "The ID of the Amazon Web Services Key Management Service (KMS) customer managed key. You can use any of the key identifiers that KMS supports, unless you're using a key that's managed by another account. If you're using a key managed by another account, then specify the key ARN. For more information, see Key ID in the Amazon Web Services KMS Developer Guide.",
                  "nested_items": []
                },
                {
                  "name": "Type",
                  "type": "string",
                  "description": "The type of Amazon Web Services KMS key to use for encryption of your Network Firewall resources.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "LastModifiedTime",
              "type": "datetime",
              "description": "The last time that the firewall policy was changed.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "FirewallPolicy",
          "type": "dict",
          "description": "The policy for the specified firewall policy.",
          "nested_items": [
            {
              "name": "StatelessRuleGroupReferences",
              "type": "list",
              "description": "References to the stateless rule groups that are used in the policy. These define the matching criteria in stateless rules.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "ResourceArn",
                      "type": "string",
                      "description": "The Amazon Resource Name (ARN) of the stateless rule group.",
                      "nested_items": []
                    },
                    {
                      "name": "Priority",
                      "type": "integer",
                      "description": "An integer setting that indicates the order in which to run the stateless rule groups in a single  FirewallPolicy. Network Firewall applies each stateless rule group to a packet starting with the group that has the lowest priority setting. You must ensure that the priority settings are unique within each policy.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "StatelessDefaultActions",
              "type": "list",
              "description": "The actions to take on a packet if it doesn't match any of the stateless rules in the policy. If you want non-matching packets to be forwarded for stateful inspection, specify aws:forward_to_sfe.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "StatelessFragmentDefaultActions",
              "type": "list",
              "description": "The actions to take on a fragmented UDP packet if it doesn't match any of the stateless rules in the policy. Network Firewall only manages UDP packet fragments and silently drops packet fragments for other protocols. If you want non-matching fragmented UDP packets to be forwarded for stateful inspection, specify aws:forward_to_sfe.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "StatelessCustomActions",
              "type": "list",
              "description": "The custom action definitions that are available for use in the firewall policy's StatelessDefaultActions setting. You name each custom action that you define, and then you can use it by name in your default actions specifications.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "In a rule group's  StatelessRulesAndCustomActions specification. The custom actions are available for use by name inside the StatelessRulesAndCustomActions where you define them. You can use them for your stateless rule actions to specify what to do with a packet that matches the rule's match attributes.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "In a  FirewallPolicy specification, in StatelessCustomActions. The custom actions are available for use inside the policy where you define them. You can use them for the policy's default stateless actions settings to specify what to do with packets that don't match any of the policy's stateless rules.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "StatefulRuleGroupReferences",
              "type": "list",
              "description": "References to the stateful rule groups that are used in the policy. These define the inspection criteria in stateful rules.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "ResourceArn",
                      "type": "string",
                      "description": "The Amazon Resource Name (ARN) of the stateful rule group.",
                      "nested_items": []
                    },
                    {
                      "name": "Priority",
                      "type": "integer",
                      "description": "An integer setting that indicates the order in which to run the stateful rule groups in a single  FirewallPolicy. This setting only applies to firewall policies that specify the STRICT_ORDER rule order in the stateful engine options settings.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Action",
                          "type": "string",
                          "description": "The action that changes the rule group from DROP to ALERT. This only applies to managed rule groups.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "DeepThreatInspection",
                      "type": "boolean",
                      "description": "Network Firewall plans to augment the active threat defense managed rule group with an additional deep threat inspection capability. When this capability is released, Amazon Web Services will analyze service logs of network traffic processed by these rule groups to identify threat indicators across customers. Amazon Web Services will use these threat indicators to improve the active threat defense managed rule groups and protect the security of Amazon Web Services customers and services.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "StatefulDefaultActions",
              "type": "list",
              "description": "The default actions to take on a packet that doesn't match any stateful rules. The stateful default action is optional, and is only valid when using the strict rule order.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "aws:drop_strict.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "aws:drop_established.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "aws:alert_strict.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "aws:alert_established.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "StatefulEngineOptions",
              "type": "dict",
              "description": "Additional options governing how Network Firewall handles stateful rules. The stateful rule groups that you use in your policy must have stateful rule options settings that are compatible with these settings.",
              "nested_items": [
                {
                  "name": "RuleOrder",
                  "type": "string",
                  "description": "Indicates how to manage the order of stateful rule evaluation for the policy. STRICT_ORDER is the recommended option, but DEFAULT_ACTION_ORDER is the default option. With STRICT_ORDER, provide your rules in the order that you want them to be evaluated. You can then choose one or more default actions for packets that don't match any rules. Choose STRICT_ORDER to have the stateful rules engine determine the evaluation order of your rules. The default action for this rule order is PASS, followed by DROP, REJECT, and ALERT actions. Stateful rules are provided to the rule engine as Suricata compatible strings, and Suricata evaluates them based on your settings. For more information, see Evaluation order for stateful rules in the Network Firewall Developer Guide.",
                  "nested_items": []
                },
                {
                  "name": "StreamExceptionPolicy",
                  "type": "string",
                  "description": "Configures how Network Firewall processes traffic when a network connection breaks midstream. Network connections can break due to disruptions in external networks or within the firewall itself.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "DROP - Network Firewall fails closed and drops all subsequent traffic going to the firewall. This is the default behavior.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "CONTINUE - Network Firewall continues to apply rules to the subsequent traffic without context from traffic before the break. This impacts the behavior of rules that depend on this context. For example, if you have a stateful rule to drop http traffic, Network Firewall won't match the traffic for this rule because the service won't have the context from session initialization defining the application layer protocol as HTTP. However, this behavior is rule dependent--\u0094a TCP-layer rule using a flow:stateless rule would still match, as would the aws:drop_strict default action.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "REJECT - Network Firewall fails closed and drops all subsequent traffic going to the firewall. Network Firewall also sends a TCP reject packet back to your client so that the client can immediately establish a new session. Network Firewall will have context about the new session and will apply rules to the subsequent traffic.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "FlowTimeouts",
                  "type": "dict",
                  "description": "Configures the amount of time that can pass without any traffic sent through the firewall before the firewall determines that the connection is idle.",
                  "nested_items": [
                    {
                      "name": "TcpIdleTimeoutSeconds",
                      "type": "integer",
                      "description": "The number of seconds that can pass without any TCP traffic sent through the firewall before the firewall determines that the connection is idle. After the idle timeout passes, data packets are dropped, however, the next TCP SYN packet is considered a new flow and is processed by the firewall. Clients or targets can use TCP keepalive packets to reset the idle timeout.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "TLSInspectionConfigurationArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the TLS inspection configuration.",
              "nested_items": []
            },
            {
              "name": "PolicyVariables",
              "type": "dict",
              "description": "Contains variables that you can use to override default Suricata settings in your firewall policy.",
              "nested_items": [
                {
                  "name": "RuleVariables",
                  "type": "dict",
                  "description": "The IPv4 or IPv6 addresses in CIDR notation to use for the Suricata HOME_NET variable. If your firewall uses an inspection VPC, you might want to override the HOME_NET variable with the CIDRs of your home networks. If you don't override HOME_NET with your own CIDRs, Network Firewall by default uses the CIDR of your inspection VPC.",
                  "nested_items": [
                    {
                      "name": "Definition",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "Definition",
                              "type": "list",
                              "description": "The list of IP addresses and address ranges, in CIDR notation.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "string",
                                  "description": "(string) ---",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}