{
  "method_name": "disassociate_subnets",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/network-firewall/client/disassociate_subnets.html",
  "description": "Removes the specified subnet associations from the firewall. This removes the firewall endpoints from the subnets and removes any network filtering protections that the endpoints were providing.",
  "parameters": [
    {
      "name": "UpdateToken",
      "type": "string",
      "required": false,
      "description": "An optional token that you can use for optimistic locking. Network Firewall returns a token to your requests that access the firewall. The token marks the state of the firewall resource at the time of the request. To make an unconditional change to the firewall, omit the token in your update request. Without the token, Network Firewall performs your updates regardless of whether the firewall has changed since you last retrieved it. To make a conditional change to the firewall, provide the token in your update request. Network Firewall uses the token to ensure that the firewall hasn't changed since you last retrieved it. If it has changed, the operation fails with an InvalidTokenException. If this happens, retrieve the firewall again to get a current copy of it with a new token. Reapply your changes as needed, then try the operation again using the new token.",
      "nested_params": []
    },
    {
      "name": "FirewallArn",
      "type": "string",
      "required": false,
      "description": "The Amazon Resource Name (ARN) of the firewall. You must specify the ARN or the name, and you can specify both.",
      "nested_params": []
    },
    {
      "name": "FirewallName",
      "type": "string",
      "required": false,
      "description": "The descriptive name of the firewall. You can't change the name of a firewall after you create it. You must specify the ARN or the name, and you can specify both.",
      "nested_params": []
    },
    {
      "name": "SubnetIds",
      "type": "list",
      "required": true,
      "description": "The unique identifiers for the subnets that you want to disassociate. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "FirewallArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the firewall.",
          "nested_items": []
        },
        {
          "name": "FirewallName",
          "type": "string",
          "description": "The descriptive name of the firewall. You can't change the name of a firewall after you create it.",
          "nested_items": []
        },
        {
          "name": "SubnetMappings",
          "type": "list",
          "description": "The IDs of the subnets that are associated with the firewall.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "SubnetId",
                  "type": "string",
                  "description": "The unique identifier for the subnet.",
                  "nested_items": []
                },
                {
                  "name": "IPAddressType",
                  "type": "string",
                  "description": "The subnet's IP address type. You can't change the IP address type after you create the subnet.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "UpdateToken",
          "type": "string",
          "description": "An optional token that you can use for optimistic locking. Network Firewall returns a token to your requests that access the firewall. The token marks the state of the firewall resource at the time of the request.",
          "nested_items": []
        }
      ]
    }
  ]
}