{
  "method_name": "put_resource_policy",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/network-firewall/client/put_resource_policy.html",
  "description": "Creates or updates an IAM policy for your rule group, firewall policy, or firewall. Use this to share these resources between accounts. This operation works in conjunction with the Amazon Web Services Resource Access Manager (RAM) service to manage resource sharing for Network Firewall. For information about using sharing with Network Firewall resources, see Sharing Network Firewall resources in the Network Firewall Developer Guide. Use this operation to create or update a resource policy for your Network Firewall rule group, firewall policy, or firewall. In the resource policy, you specify the accounts that you want to share the Network Firewall resource with and the operations that you want the accounts to be able to perform. When you add an account in the resource policy, you then run the following Resource Access Manager (RAM) operations to access and accept the shared resource. For additional information about resource sharing using RAM, see Resource Access Manager User Guide.",
  "parameters": [
    {
      "name": "ResourceArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the account that you want to share your Network Firewall resources with.",
      "nested_params": []
    },
    {
      "name": "Policy",
      "type": "string",
      "required": true,
      "description": "The IAM policy statement that lists the accounts that you want to share your Network Firewall resources with and the operations that you want the accounts to be able to perform. For a rule group resource, you can specify the following operations in the Actions section of the statement: network-firewall:CreateFirewallPolicy network-firewall:UpdateFirewallPolicy network-firewall:ListRuleGroups For a firewall policy resource, you can specify the following operations in the Actions section of the statement: network-firewall:AssociateFirewallPolicy network-firewall:ListFirewallPolicies For a firewall resource, you can specify the following operations in the Actions section of the statement: network-firewall:CreateVpcEndpointAssociation network-firewall:DescribeFirewallMetadata network-firewall:ListFirewalls In the Resource section of the statement, you specify the ARNs for the Network Firewall resources that you want to share with the account that you specified in Arn.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}