{
  "method_name": "list_key_rotations",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kms/client/list_key_rotations.html",
  "description": "Returns information about all completed key material rotations for the specified KMS key. You must specify the KMS key in all requests. You can refine the key rotations list by limiting the number of rotations returned. For detailed information about automatic and on-demand key rotations, see Rotating KMS keys in the Key Management Service Developer Guide. Cross-account use: No. You cannot perform this operation on a KMS key in a different Amazon Web Services account. Required permissions: kms:ListKeyRotations (key policy) Eventual consistency: The KMS API follows an eventual consistency model. For more information, see KMS eventual consistency.",
  "parameters": [
    {
      "name": "KeyId",
      "type": "string",
      "required": true,
      "description": "Gets the key rotations for the specified KMS key. Specify the key ID or key ARN of the KMS key. For example: Key ID: 1234abcd-12ab-34cd-56ef-1234567890ab Key ARN: arn:aws:kms:us-east-2:111122223333:key/1234abcd-12ab-34cd-56ef-1234567890ab To get the key ID and key ARN for a KMS key, use  ListKeys or  DescribeKey.",
      "nested_params": []
    },
    {
      "name": "Limit",
      "type": "integer",
      "required": false,
      "description": "Use this parameter to specify the maximum number of items to return. When this value is present, KMS does not return more than the specified number of items, but it might return fewer. This value is optional. If you include a value, it must be between 1 and 1000, inclusive. If you do not include a value, it defaults to 100.",
      "nested_params": []
    },
    {
      "name": "Marker",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Rotations",
          "type": "list",
          "description": "A list of completed key material rotations.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "KeyId",
                  "type": "string",
                  "description": "Unique identifier of the key.",
                  "nested_items": []
                },
                {
                  "name": "RotationDate",
                  "type": "datetime",
                  "description": "Date and time that the key material rotation completed. Formatted as Unix time.",
                  "nested_items": []
                },
                {
                  "name": "RotationType",
                  "type": "string",
                  "description": "Identifies whether the key material rotation was a scheduled automatic rotation or an on-demand rotation.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextMarker",
          "type": "string",
          "description": "When Truncated is true, this element is present and contains the value to use for the Marker parameter in a subsequent request.",
          "nested_items": []
        },
        {
          "name": "Truncated",
          "type": "boolean",
          "description": "A flag that indicates whether there are more items in the list. When this value is true, the list in this response is truncated. To get more items, pass the value of the NextMarker element in this response to the Marker parameter in a subsequent request.",
          "nested_items": []
        }
      ]
    }
  ]
}