{
  "method_name": "retire_grant",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kms/client/retire_grant.html",
  "description": "Deletes a grant. Typically, you retire a grant when you no longer need its permissions. To identify the grant to retire, use a grant token, or both the grant ID and a key identifier (key ID or key ARN) of the KMS key. The  CreateGrant operation returns both values. This operation can be called by the retiring principal for a grant, by the grantee principal if the grant allows the RetireGrant operation, and by the Amazon Web Services account in which the grant is created. It can also be called by principals to whom permission for retiring a grant is delegated. For details, see Retiring and revoking grants in the Key Management Service Developer Guide. For detailed information about grants, including grant terminology, see Grants in KMS in the Key Management Service Developer Guide . For examples of working with grants in several programming languages, see Programming grants. Cross-account use: Yes. You can retire a grant on a KMS key in a different Amazon Web Services account. Required permissions: Permission to retire a grant is determined primarily by the grant. For details, see Retiring and revoking grants in the Key Management Service Developer Guide. Eventual consistency: The KMS API follows an eventual consistency model. For more information, see KMS eventual consistency.",
  "parameters": [
    {
      "name": "GrantToken",
      "type": "string",
      "required": false,
      "description": "Identifies the grant to be retired. You can use a grant token to identify a new grant even before it has achieved eventual consistency. Only the  CreateGrant operation returns a grant token. For details, see Grant token and Eventual consistency in the Key Management Service Developer Guide.",
      "nested_params": []
    },
    {
      "name": "KeyId",
      "type": "string",
      "required": false,
      "description": "The key ARN KMS key associated with the grant. To find the key ARN, use the  ListKeys operation. For example: arn:aws:kms:us-east-2:444455556666:key/1234abcd-12ab-34cd-56ef-1234567890ab.",
      "nested_params": []
    },
    {
      "name": "GrantId",
      "type": "string",
      "required": false,
      "description": "Identifies the grant to retire. To get the grant ID, use  CreateGrant,  ListGrants, or  ListRetirableGrants. Grant ID Example - 0123456789012345678901234567890123456789012345678901234567890123",
      "nested_params": []
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "Checks if your request will succeed. DryRun is an optional parameter. To learn more about how to use this parameter, see Testing your KMS API calls in the Key Management Service Developer Guide.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}