{
  "method_name": "get_data_protection_settings",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/workspaces-web/client/get_data_protection_settings.html",
  "description": "Gets the data protection settings.",
  "parameters": [
    {
      "name": "dataProtectionSettingsArn",
      "type": "string",
      "required": true,
      "description": "The ARN of the data protection settings.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "dataProtectionSettings",
          "type": "dict",
          "description": "The data protection settings.",
          "nested_items": [
            {
              "name": "additionalEncryptionContext",
              "type": "dict",
              "description": "The additional encryption context of the data protection settings.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "associatedPortalArns",
              "type": "list",
              "description": "A list of web portal ARNs that this data protection settings resource is associated with.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "creationDate",
              "type": "datetime",
              "description": "The creation date timestamp of the data protection settings.",
              "nested_items": []
            },
            {
              "name": "customerManagedKey",
              "type": "string",
              "description": "The customer managed key used to encrypt sensitive information in the data protection settings.",
              "nested_items": []
            },
            {
              "name": "dataProtectionSettingsArn",
              "type": "string",
              "description": "The ARN of the data protection settings resource.",
              "nested_items": []
            },
            {
              "name": "description",
              "type": "string",
              "description": "The description of the data protection settings.",
              "nested_items": []
            },
            {
              "name": "displayName",
              "type": "string",
              "description": "The display name of the data protection settings.",
              "nested_items": []
            },
            {
              "name": "inlineRedactionConfiguration",
              "type": "dict",
              "description": "The inline redaction configuration for the data protection settings.",
              "nested_items": [
                {
                  "name": "globalConfidenceLevel",
                  "type": "integer",
                  "description": "The global confidence level for the inline redaction configuration. This indicates the certainty of data type matches in the redaction process. Confidence level 3 means high confidence, and requires a formatted text pattern match in order for content to be redacted. Confidence level 2 means medium confidence, and redaction considers both formatted and unformatted text, and adds keyword associate to the logic. Confidence level 1 means low confidence, and redaction is enforced for both formatted pattern + unformatted pattern without keyword. This is applied to patterns that do not have a pattern-level confidence level. Defaults to confidence level 2.",
                  "nested_items": []
                },
                {
                  "name": "globalEnforcedUrls",
                  "type": "list",
                  "description": "The global enforced URL configuration for the inline redaction configuration. This is applied to patterns that do not have a pattern-level enforced URL list.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "globalExemptUrls",
                  "type": "list",
                  "description": "The global exempt URL configuration for the inline redaction configuration. This is applied to patterns that do not have a pattern-level exempt URL list.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "inlineRedactionPatterns",
                  "type": "list",
                  "description": "The inline redaction patterns to be enabled for the inline redaction configuration.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "builtInPatternId",
                          "type": "string",
                          "description": "The built-in pattern from the list of preconfigured patterns. Either a customPattern or builtInPatternId is required.",
                          "nested_items": []
                        },
                        {
                          "name": "confidenceLevel",
                          "type": "integer",
                          "description": "The confidence level for inline redaction pattern. This indicates the certainty of data type matches in the redaction process. Confidence level 3 means high confidence, and requires a formatted text pattern match in order for content to be redacted. Confidence level 2 means medium confidence, and redaction considers both formatted and unformatted text, and adds keyword associate to the logic. Confidence level 1 means low confidence, and redaction is enforced for both formatted pattern + unformatted pattern without keyword. This overrides the global confidence level.",
                          "nested_items": []
                        },
                        {
                          "name": "customPattern",
                          "type": "dict",
                          "description": ">The configuration for a custom pattern. Either a customPattern or builtInPatternId is required.",
                          "nested_items": [
                            {
                              "name": "keywordRegex",
                              "type": "string",
                              "description": "The keyword regex for the customer pattern. After there is a match to the pattern regex, the keyword regex is used to search within the proximity of the match. If there is a keyword match, then the match is confirmed. If no keyword regex is provided, the pattern regex match will automatically be confirmed. The format must follow JavaScript regex format. The pattern must be enclosed between slashes, and can have flags behind the second slash. For example, '/ab+c/gi'",
                              "nested_items": []
                            },
                            {
                              "name": "patternDescription",
                              "type": "string",
                              "description": "The pattern description for the customer pattern.",
                              "nested_items": []
                            },
                            {
                              "name": "patternName",
                              "type": "string",
                              "description": "The pattern name for the custom pattern.",
                              "nested_items": []
                            },
                            {
                              "name": "patternRegex",
                              "type": "string",
                              "description": "The pattern regex for the customer pattern. The format must follow JavaScript regex format. The pattern must be enclosed between slashes, and can have flags behind the second slash. For example: '/ab+c/gi'.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "enforcedUrls",
                          "type": "list",
                          "description": "The enforced URL configuration for the inline redaction pattern. This will override the global enforced URL configuration.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "exemptUrls",
                          "type": "list",
                          "description": "The exempt URL configuration for the inline redaction pattern. This will override the global exempt URL configuration for the inline redaction pattern.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "redactionPlaceHolder",
                          "type": "dict",
                          "description": "The redaction placeholder that will replace the redacted text in session for the inline redaction pattern.",
                          "nested_items": [
                            {
                              "name": "redactionPlaceHolderText",
                              "type": "string",
                              "description": "The redaction placeholder text that will replace the redacted text in session for the custom text redaction placeholder type.",
                              "nested_items": []
                            },
                            {
                              "name": "redactionPlaceHolderType",
                              "type": "string",
                              "description": "The redaction placeholder type that will replace the redacted text in session.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}