{
  "method_name": "batch_get_deployment_targets",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/codedeploy/client/batch_get_deployment_targets.html",
  "description": "Returns an array of one or more targets associated with a deployment. This method works with all compute types and should be used instead of the deprecated BatchGetDeploymentInstances. The maximum number of targets that can be returned is 25. The type of targets returned depends on the deployment's compute platform or deployment method:",
  "parameters": [
    {
      "name": "deploymentId",
      "type": "string",
      "required": true,
      "description": "The unique ID of a deployment.",
      "nested_params": []
    },
    {
      "name": "targetIds",
      "type": "list",
      "required": true,
      "description": "The unique IDs of the deployment targets. The compute platform of the deployment determines the type of the targets and their formats. The maximum number of deployment target IDs you can specify is 25. For deployments that use the EC2/On-premises compute platform, the target IDs are Amazon EC2 or on-premises instances IDs, and their target type is instanceTarget. For deployments that use the Lambda compute platform, the target IDs are the names of Lambda functions, and their target type is instanceTarget. For deployments that use the Amazon ECS compute platform, the target IDs are pairs of Amazon ECS clusters and services specified using the format <clustername>:<servicename>. Their target type is ecsTarget. For deployments that are deployed with CloudFormation, the target IDs are CloudFormation stack IDs. Their target type is cloudFormationTarget. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "deploymentTargets",
          "type": "list",
          "description": "A list of target objects for a deployment. Each target object contains details about the target, such as its status and lifecycle events. The type of the target objects depends on the deployment' compute platform.",
          "nested_items": [
            {
              "name": "EC2/On-premises",
              "type": "",
              "description": "",
              "nested_items": []
            },
            {
              "name": "Lambda",
              "type": "",
              "description": "",
              "nested_items": []
            },
            {
              "name": "Amazon ECS",
              "type": "",
              "description": "",
              "nested_items": []
            },
            {
              "name": "CloudFormation",
              "type": "",
              "description": "",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}