{
  "method_name": "create_deployment_config",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/codedeploy/client/create_deployment_config.html",
  "description": "Creates a deployment configuration.",
  "parameters": [
    {
      "name": "deploymentConfigName",
      "type": "string",
      "required": true,
      "description": "The name of the deployment configuration to create.",
      "nested_params": []
    },
    {
      "name": "minimumHealthyHosts",
      "type": "dict",
      "required": false,
      "description": "The minimum number of healthy instances that should be available at any time during the deployment. There are two parameters expected in the input: type and value. The type parameter takes either of the following values: HOST_COUNT: The value parameter represents the minimum number of healthy instances as an absolute value. FLEET_PERCENT: The value parameter represents the minimum number of healthy instances as a percentage of the total number of instances in the deployment. If you specify FLEET_PERCENT, at the start of the deployment, CodeDeploy converts the percentage to the equivalent number of instances and rounds up fractional instances. The value parameter takes an integer. For example, to set a minimum of 95% healthy instance, specify a type of FLEET_PERCENT and a value of 95. type (string) --- The minimum healthy instance type: HOST_COUNT: The minimum number of healthy instances as an absolute value. FLEET_PERCENT: The minimum number of healthy instances as a percentage of the total number of instances in the deployment. In an example of nine instances, if a HOST_COUNT of six is specified, deploy to up to three instances at a time. The deployment is successful if six or more instances are deployed to successfully. Otherwise, the deployment fails. If a FLEET_PERCENT of 40 is specified, deploy to up to five instances at a time. The deployment is successful if four or more instances are deployed to successfully. For more information, see CodeDeploy Instance Health in the CodeDeploy User Guide. value (integer) --- The minimum healthy instance value.",
      "nested_params": []
    },
    {
      "name": "trafficRoutingConfig",
      "type": "dict",
      "required": false,
      "description": "The configuration that specifies how the deployment traffic is routed. type (string) --- The type of traffic shifting ( TimeBasedCanary or TimeBasedLinear) used by a deployment configuration. timeBasedCanary (dict) --- A configuration that shifts traffic from one version of a Lambda function or ECS task set to another in two increments. The original and target Lambda function versions or ECS task sets are specified in the deployment's AppSpec file. canaryPercentage (integer) --- The percentage of traffic to shift in the first increment of a TimeBasedCanary deployment. canaryInterval (integer) --- The number of minutes between the first and second traffic shifts of a TimeBasedCanary deployment. timeBasedLinear (dict) --- A configuration that shifts traffic from one version of a Lambda function or Amazon ECS task set to another in equal increments, with an equal number of minutes between each increment. The original and target Lambda function versions or Amazon ECS task sets are specified in the deployment's AppSpec file. linearPercentage (integer) --- The percentage of traffic that is shifted at the start of each increment of a TimeBasedLinear deployment. linearInterval (integer) --- The number of minutes between each incremental traffic shift of a TimeBasedLinear deployment.",
      "nested_params": [
        {
          "name": "type",
          "type": "string",
          "required": false,
          "description": "The type of traffic shifting ( TimeBasedCanary or TimeBasedLinear) used by a deployment configuration.",
          "nested_params": []
        },
        {
          "name": "timeBasedCanary",
          "type": "dict",
          "required": false,
          "description": "A configuration that shifts traffic from one version of a Lambda function or ECS task set to another in two increments. The original and target Lambda function versions or ECS task sets are specified in the deployment's AppSpec file.",
          "nested_params": [
            {
              "name": "canaryPercentage",
              "type": "integer",
              "required": false,
              "description": "The percentage of traffic to shift in the first increment of a TimeBasedCanary deployment.",
              "nested_params": []
            },
            {
              "name": "canaryInterval",
              "type": "integer",
              "required": false,
              "description": "The number of minutes between the first and second traffic shifts of a TimeBasedCanary deployment.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "timeBasedLinear",
          "type": "dict",
          "required": false,
          "description": "A configuration that shifts traffic from one version of a Lambda function or Amazon ECS task set to another in equal increments, with an equal number of minutes between each increment. The original and target Lambda function versions or Amazon ECS task sets are specified in the deployment's AppSpec file.",
          "nested_params": [
            {
              "name": "linearPercentage",
              "type": "integer",
              "required": false,
              "description": "The percentage of traffic that is shifted at the start of each increment of a TimeBasedLinear deployment.",
              "nested_params": []
            },
            {
              "name": "linearInterval",
              "type": "integer",
              "required": false,
              "description": "The number of minutes between each incremental traffic shift of a TimeBasedLinear deployment.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "computePlatform",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "zonalConfig",
      "type": "dict",
      "required": false,
      "description": "Configure the ZonalConfig object if you want CodeDeploy to deploy your application to one Availability Zone at a time, within an Amazon Web Services Region. For more information about the zonal configuration feature, see zonal configuration in the CodeDeploy User Guide. firstZoneMonitorDurationInSeconds (integer) --- The period of time, in seconds, that CodeDeploy must wait after completing a deployment to the first Availability Zone. CodeDeploy will wait this amount of time before starting a deployment to the second Availability Zone. You might set this option if you want to allow extra bake time for the first Availability Zone. If you don't specify a value for firstZoneMonitorDurationInSeconds, then CodeDeploy uses the monitorDurationInSeconds value for the first Availability Zone. monitorDurationInSeconds (integer) --- The period of time, in seconds, that CodeDeploy must wait after completing a deployment to an Availability Zone. CodeDeploy will wait this amount of time before starting a deployment to the next Availability Zone. Consider adding a monitor duration to give the deployment some time to prove itself (or --\u0098bake') in one Availability Zone before it is released in the next zone. If you don't specify a monitorDurationInSeconds, CodeDeploy starts deploying to the next Availability Zone immediately. minimumHealthyHostsPerZone (dict) --- The number or percentage of instances that must remain available per Availability Zone during a deployment. This option works in conjunction with the MinimumHealthyHosts option. For more information, see About the minimum number of healthy hosts per Availability Zone in the CodeDeploy User Guide. If you don't specify the minimumHealthyHostsPerZone option, then CodeDeploy uses a default value of 0 percent. type (string) --- The type associated with the MinimumHealthyHostsPerZone option. value (integer) --- The value associated with the MinimumHealthyHostsPerZone option.",
      "nested_params": [
        {
          "name": "firstZoneMonitorDurationInSeconds",
          "type": "integer",
          "required": false,
          "description": "The period of time, in seconds, that CodeDeploy must wait after completing a deployment to the first Availability Zone. CodeDeploy will wait this amount of time before starting a deployment to the second Availability Zone. You might set this option if you want to allow extra bake time for the first Availability Zone. If you don't specify a value for firstZoneMonitorDurationInSeconds, then CodeDeploy uses the monitorDurationInSeconds value for the first Availability Zone. For more information about the zonal configuration feature, see zonal configuration in the CodeDeploy User Guide.",
          "nested_params": []
        },
        {
          "name": "monitorDurationInSeconds",
          "type": "integer",
          "required": false,
          "description": "The period of time, in seconds, that CodeDeploy must wait after completing a deployment to an Availability Zone. CodeDeploy will wait this amount of time before starting a deployment to the next Availability Zone. Consider adding a monitor duration to give the deployment some time to prove itself (or --\u0098bake') in one Availability Zone before it is released in the next zone. If you don't specify a monitorDurationInSeconds, CodeDeploy starts deploying to the next Availability Zone immediately. For more information about the zonal configuration feature, see zonal configuration in the CodeDeploy User Guide.",
          "nested_params": []
        },
        {
          "name": "minimumHealthyHostsPerZone",
          "type": "dict",
          "required": false,
          "description": "The number or percentage of instances that must remain available per Availability Zone during a deployment. This option works in conjunction with the MinimumHealthyHosts option. For more information, see About the minimum number of healthy hosts per Availability Zone in the CodeDeploy User Guide. If you don't specify the minimumHealthyHostsPerZone option, then CodeDeploy uses a default value of 0 percent. For more information about the zonal configuration feature, see zonal configuration in the CodeDeploy User Guide.",
          "nested_params": [
            {
              "name": "type",
              "type": "string",
              "required": false,
              "description": "The type associated with the MinimumHealthyHostsPerZone option.",
              "nested_params": []
            },
            {
              "name": "value",
              "type": "integer",
              "required": false,
              "description": "The value associated with the MinimumHealthyHostsPerZone option.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "deploymentConfigId",
          "type": "string",
          "description": "A unique deployment configuration ID.",
          "nested_items": []
        }
      ]
    }
  ]
}