{
  "method_name": "suggest",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudsearchdomain/client/suggest.html",
  "description": "Retrieves autocomplete suggestions for a partial query string. You can use suggestions enable you to display likely matches before users finish typing. In Amazon CloudSearch, suggestions are based on the contents of a particular text field. When you request suggestions, Amazon CloudSearch finds all of the documents whose values in the suggester field start with the specified query string. The beginning of the field must match the query string to be considered a match. For more information about configuring suggesters and retrieving suggestions, see Getting Suggestions in the Amazon CloudSearch Developer Guide. The endpoint for submitting Suggest requests is domain-specific. You submit suggest requests to a domain's search endpoint. To get the search endpoint for your domain, use the Amazon CloudSearch configuration service DescribeDomains action. A domain's endpoints are also displayed on the domain dashboard in the Amazon CloudSearch console.",
  "parameters": [
    {
      "name": "query",
      "type": "string",
      "required": true,
      "description": "Specifies the string for which you want to get suggestions.",
      "nested_params": []
    },
    {
      "name": "suggester",
      "type": "string",
      "required": true,
      "description": "Specifies the name of the suggester to use to find suggested matches.",
      "nested_params": []
    },
    {
      "name": "size",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "timems",
              "type": "integer",
              "description": "How long it took to process the request, in milliseconds.",
              "nested_items": []
            },
            {
              "name": "rid",
              "type": "string",
              "description": "The encrypted resource ID for the request.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "query",
              "type": "string",
              "description": "The query string specified in the suggest request.",
              "nested_items": []
            },
            {
              "name": "found",
              "type": "integer",
              "description": "The number of documents that were found to match the query string.",
              "nested_items": []
            },
            {
              "name": "suggestions",
              "type": "list",
              "description": "The documents that match the query string.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "suggestion",
                      "type": "string",
                      "description": "The string that matches the query string specified in the SuggestRequest.",
                      "nested_items": []
                    },
                    {
                      "name": "score",
                      "type": "integer",
                      "description": "The relevance score of a suggested match.",
                      "nested_items": []
                    },
                    {
                      "name": "id",
                      "type": "string",
                      "description": "The document ID of the suggested document.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}