{
  "method_name": "create_address",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/snowball/client/create_address.html",
  "description": "Creates an address for a Snow device to be shipped to. In most regions, addresses are validated at the time of creation. The address you provide must be located within the serviceable area of your region. If the address is invalid or unsupported, then an exception is thrown. If providing an address as a JSON file through the cli-input-json option, include the full file path. For example, --cli-input-json file://create-address.json.",
  "parameters": [
    {
      "name": "Address",
      "type": "dict",
      "required": true,
      "description": "The address that you want the Snow device shipped to. AddressId (string) --- The unique ID for an address. Name (string) --- The name of a person to receive a Snow device at an address. Company (string) --- The name of the company to receive a Snow device at an address. Street1 (string) --- The first line in a street address that a Snow device is to be delivered to. Street2 (string) --- The second line in a street address that a Snow device is to be delivered to. Street3 (string) --- The third line in a street address that a Snow device is to be delivered to. City (string) --- The city in an address that a Snow device is to be delivered to. StateOrProvince (string) --- The state or province in an address that a Snow device is to be delivered to. PrefectureOrDistrict (string) --- This field is no longer used and the value is ignored. Landmark (string) --- This field is no longer used and the value is ignored. Country (string) --- The country in an address that a Snow device is to be delivered to. PostalCode (string) --- The postal code in an address that a Snow device is to be delivered to. PhoneNumber (string) --- The phone number associated with an address that a Snow device is to be delivered to. IsRestricted (boolean) --- If the address you are creating is a primary address, then set this option to true. This field is not supported in most regions. Type (string) --- Differentiates between delivery address and pickup address in the customer account. Provided at job creation.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "AddressId",
          "type": "string",
          "description": "The automatically generated ID for a specific address. You'll use this ID when you create a job to specify which address you want the Snow device for that job shipped to.",
          "nested_items": []
        }
      ]
    }
  ]
}