{
  "method_name": "update_cluster",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/snowball/client/update_cluster.html",
  "description": "While a cluster's ClusterState value is in the AwaitingQuorum state, you can update some of the information associated with a cluster. Once the cluster changes to a different job state, usually 60 minutes after the cluster being created, this action is no longer available.",
  "parameters": [
    {
      "name": "ClusterId",
      "type": "string",
      "required": true,
      "description": "The cluster ID of the cluster that you want to update, for example CID123e4567-e89b-12d3-a456-426655440000.",
      "nested_params": []
    },
    {
      "name": "RoleARN",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Resources",
      "type": "dict",
      "required": true,
      "description": "The updated arrays of  JobResource objects that can include updated  S3Resource objects or  LambdaResource objects. S3Resources (list) --- An array of S3Resource objects. (dict) --- Each S3Resource object represents an Amazon S3 bucket that your transferred data will be exported from or imported into. For export jobs, this object can have an optional KeyRange value. The length of the range is defined at job creation, and has either an inclusive BeginMarker, an inclusive EndMarker, or both. Ranges are UTF-8 binary sorted. BucketArn (string) --- The Amazon Resource Name (ARN) of an Amazon S3 bucket. KeyRange (dict) --- For export jobs, you can provide an optional KeyRange within a specific Amazon S3 bucket. BeginMarker (string) --- The key that starts an optional key range for an export job. Ranges are inclusive and UTF-8 binary sorted. EndMarker (string) --- The key that ends an optional key range for an export job. TargetOnDeviceServices (list) --- Specifies the service or services on the Snow Family device that your transferred data will be exported from or imported into. Amazon Web Services Snow Family supports Amazon S3 and NFS (Network File System). (dict) --- An object that represents the service or services on the Snow Family device that your transferred data will be exported from or imported into. ServiceName (string) --- Specifies the name of the service on the Snow Family device that your transferred data will be exported from or imported into. TransferOption (string) --- Specifies whether the data is being imported or exported. You can import or export the data, or use it locally on the device. LambdaResources (list) --- The Python-language Lambda functions for this job. (dict) --- Identifies LambdaArn (string) --- An Amazon Resource Name (ARN) that represents an Lambda function to be triggered by PUT object actions on the associated local Amazon S3 resource. EventTriggers (list) --- The array of ARNs for  S3Resource objects to trigger the  LambdaResource objects associated with this job. (dict) --- The container for the  EventTriggerDefinition$EventResourceARN. EventResourceARN (string) --- The Amazon Resource Name (ARN) for any local Amazon S3 resource that is an Lambda function's event trigger associated with this job. Ec2AmiResources (list) --- The Amazon Machine Images (AMIs) associated with this job. (dict) --- A JSON-formatted object that contains the IDs for an Amazon Machine Image (AMI), including the Amazon EC2-compatible AMI ID and the Snow device AMI ID. Each AMI has these two IDs to simplify identifying the AMI in both the Amazon Web Services Cloud and on the device. The ID of the AMI in Amazon EC2. SnowballAmiId (string) --- The ID of the AMI on the Snow device.",
      "nested_params": [
        {
          "name": "S3Resources",
          "type": "list",
          "required": false,
          "description": "An array of S3Resource objects.",
          "nested_params": [
            {
              "name": "BucketArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of an Amazon S3 bucket.",
              "nested_params": []
            },
            {
              "name": "KeyRange",
              "type": "dict",
              "required": false,
              "description": "For export jobs, you can provide an optional KeyRange within a specific Amazon S3 bucket. The length of the range is defined at job creation, and has either an inclusive BeginMarker, an inclusive EndMarker, or both. Ranges are UTF-8 binary sorted.",
              "nested_params": [
                {
                  "name": "BeginMarker",
                  "type": "string",
                  "required": false,
                  "description": "The key that starts an optional key range for an export job. Ranges are inclusive and UTF-8 binary sorted.",
                  "nested_params": []
                },
                {
                  "name": "EndMarker",
                  "type": "string",
                  "required": false,
                  "description": "The key that ends an optional key range for an export job. Ranges are inclusive and UTF-8 binary sorted.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "TargetOnDeviceServices",
              "type": "list",
              "required": false,
              "description": "Specifies the service or services on the Snow Family device that your transferred data will be exported from or imported into. Amazon Web Services Snow Family supports Amazon S3 and NFS (Network File System).",
              "nested_params": [
                {
                  "name": "ServiceName",
                  "type": "string",
                  "required": false,
                  "description": "Specifies the name of the service on the Snow Family device that your transferred data will be exported from or imported into.",
                  "nested_params": []
                },
                {
                  "name": "TransferOption",
                  "type": "string",
                  "required": false,
                  "description": "Specifies whether the data is being imported or exported. You can import or export the data, or use it locally on the device.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "LambdaResources",
          "type": "list",
          "required": false,
          "description": "The Python-language Lambda functions for this job.",
          "nested_params": [
            {
              "name": "LambdaArn",
              "type": "string",
              "required": false,
              "description": "An Amazon Resource Name (ARN) that represents an Lambda function to be triggered by PUT object actions on the associated local Amazon S3 resource.",
              "nested_params": []
            },
            {
              "name": "EventTriggers",
              "type": "list",
              "required": false,
              "description": "The array of ARNs for  S3Resource objects to trigger the  LambdaResource objects associated with this job.",
              "nested_params": [
                {
                  "name": "EventResourceARN",
                  "type": "string",
                  "required": false,
                  "description": "The Amazon Resource Name (ARN) for any local Amazon S3 resource that is an Lambda function's event trigger associated with this job.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "Ec2AmiResources",
          "type": "list",
          "required": false,
          "description": "The Amazon Machine Images (AMIs) associated with this job.",
          "nested_params": [
            {
              "name": "AmiId",
              "type": "string",
              "required": false,
              "description": "The ID of the AMI in Amazon EC2.",
              "nested_params": []
            },
            {
              "name": "SnowballAmiId",
              "type": "string",
              "required": false,
              "description": "The ID of the AMI on the Snow device.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "OnDeviceServiceConfiguration",
      "type": "dict",
      "required": false,
      "description": "Specifies the service or services on the Snow Family device that your transferred data will be exported from or imported into. Amazon Web Services Snow Family device clusters support Amazon S3 and NFS (Network File System). NFSOnDeviceService (dict) --- Represents the NFS (Network File System) service on a Snow Family device. StorageLimit (integer) --- The maximum NFS storage for one Snow Family device. StorageUnit (string) --- The scale unit of the NFS storage on the device. Valid values: TB. TGWOnDeviceService (dict) --- Represents the Storage Gateway service Tape Gateway type on a Snow Family device. StorageLimit (integer) --- The maximum number of virtual tapes to store on one Snow Family device. Due to physical resource limitations, this value must be set to 80 for Snowball Edge. StorageUnit (string) --- The scale unit of the virtual tapes on the device. EKSOnDeviceService (dict) --- The configuration of EKS Anywhere on the Snow Family device. KubernetesVersion (string) --- The Kubernetes version for EKS Anywhere on the Snow Family device. EKSAnywhereVersion (string) --- The optional version of EKS Anywhere on the Snow Family device. S3OnDeviceService (dict) --- Configuration for Amazon S3 compatible storage on Snow family devices. StorageLimit (float) --- If the specified storage limit value matches storage limit of one of the defined configurations, that configuration will be used. If the specified storage limit value does not match any defined configuration, the request will fail. If more than one configuration has the same storage limit as specified, the other input need to be provided. StorageUnit (string) --- Storage unit. Currently the only supported unit is TB. ServiceSize (integer) --- Applicable when creating a cluster. Specifies how many nodes are needed for Amazon S3 compatible storage on Snow family devices. If specified, the other input can be omitted. FaultTolerance (integer) --- >Fault tolerance level of the cluster. This indicates the number of nodes that can go down without degrading the performance of the cluster. This additional input helps when the specified StorageLimit matches more than one Amazon S3 compatible storage on Snow family devices service configuration.",
      "nested_params": [
        {
          "name": "NFSOnDeviceService",
          "type": "dict",
          "required": false,
          "description": "Represents the NFS (Network File System) service on a Snow Family device.",
          "nested_params": [
            {
              "name": "StorageLimit",
              "type": "integer",
              "required": false,
              "description": "The maximum NFS storage for one Snow Family device.",
              "nested_params": []
            },
            {
              "name": "StorageUnit",
              "type": "string",
              "required": false,
              "description": "The scale unit of the NFS storage on the device. Valid values: TB.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "TGWOnDeviceService",
          "type": "dict",
          "required": false,
          "description": "Represents the Storage Gateway service Tape Gateway type on a Snow Family device.",
          "nested_params": [
            {
              "name": "StorageLimit",
              "type": "integer",
              "required": false,
              "description": "The maximum number of virtual tapes to store on one Snow Family device. Due to physical resource limitations, this value must be set to 80 for Snowball Edge.",
              "nested_params": []
            },
            {
              "name": "StorageUnit",
              "type": "string",
              "required": false,
              "description": "The scale unit of the virtual tapes on the device.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "EKSOnDeviceService",
          "type": "dict",
          "required": false,
          "description": "The configuration of EKS Anywhere on the Snow Family device.",
          "nested_params": [
            {
              "name": "KubernetesVersion",
              "type": "string",
              "required": false,
              "description": "The Kubernetes version for EKS Anywhere on the Snow Family device.",
              "nested_params": []
            },
            {
              "name": "EKSAnywhereVersion",
              "type": "string",
              "required": false,
              "description": "The optional version of EKS Anywhere on the Snow Family device.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "S3OnDeviceService",
          "type": "dict",
          "required": false,
          "description": "Configuration for Amazon S3 compatible storage on Snow family devices.",
          "nested_params": [
            {
              "name": "StorageLimit",
              "type": "float",
              "required": false,
              "description": "If the specified storage limit value matches storage limit of one of the defined configurations, that configuration will be used. If the specified storage limit value does not match any defined configuration, the request will fail. If more than one configuration has the same storage limit as specified, the other input need to be provided.",
              "nested_params": []
            },
            {
              "name": "StorageUnit",
              "type": "string",
              "required": false,
              "description": "Storage unit. Currently the only supported unit is TB.",
              "nested_params": []
            },
            {
              "name": "ServiceSize",
              "type": "integer",
              "required": false,
              "description": "Applicable when creating a cluster. Specifies how many nodes are needed for Amazon S3 compatible storage on Snow family devices. If specified, the other input can be omitted.",
              "nested_params": []
            },
            {
              "name": "FaultTolerance",
              "type": "integer",
              "required": false,
              "description": ">Fault tolerance level of the cluster. This indicates the number of nodes that can go down without degrading the performance of the cluster. This additional input helps when the specified StorageLimit matches more than one Amazon S3 compatible storage on Snow family devices service configuration.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "AddressId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ShippingOption",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Notification",
      "type": "dict",
      "required": false,
      "description": "The new or updated  Notification object. SnsTopicARN (string) --- The new SNS TopicArn that you want to associate with this job. You can create Amazon Resource Names (ARNs) for topics by using the CreateTopic Amazon SNS API action. You can subscribe email addresses to an Amazon SNS topic through the Amazon Web Services Management Console, or by using the Subscribe Amazon Simple Notification Service (Amazon SNS) API action. JobStatesToNotify (list) --- The list of job states that will trigger a notification for this job. (string) --- NotifyAll (boolean) --- Any change in job state will trigger a notification for this job. DevicePickupSnsTopicARN (string) --- Used to send SNS notifications for the person picking up the device (identified during job creation).",
      "nested_params": [
        {
          "name": "SnsTopicARN",
          "type": "string",
          "required": false,
          "description": "The new SNS TopicArn that you want to associate with this job. You can create Amazon Resource Names (ARNs) for topics by using the CreateTopic Amazon SNS API action. You can subscribe email addresses to an Amazon SNS topic through the Amazon Web Services Management Console, or by using the Subscribe Amazon Simple Notification Service (Amazon SNS) API action.",
          "nested_params": []
        },
        {
          "name": "JobStatesToNotify",
          "type": "list",
          "required": false,
          "description": "The list of job states that will trigger a notification for this job.",
          "nested_params": []
        },
        {
          "name": "NotifyAll",
          "type": "boolean",
          "required": false,
          "description": "Any change in job state will trigger a notification for this job.",
          "nested_params": []
        },
        {
          "name": "DevicePickupSnsTopicARN",
          "type": "string",
          "required": false,
          "description": "Used to send SNS notifications for the person picking up the device (identified during job creation).",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ForwardingAddressId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}