{
  "method_name": "list_backup_job_summaries",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/backup/client/list_backup_job_summaries.html",
  "description": "This is a request for a summary of backup jobs created or running within the most recent 30 days. You can include parameters AccountID, State, ResourceType, MessageCategory, AggregationPeriod, MaxResults, or NextToken to filter results. This request returns a summary that contains Region, Account, State, ResourceType, MessageCategory, StartTime, EndTime, and Count of included jobs.",
  "parameters": [
    {
      "name": "AccountId",
      "type": "string",
      "required": false,
      "description": "Returns the job count for the specified account. If the request is sent from a member account or an account not part of Amazon Web Services Organizations, jobs within requestor's account will be returned. Root, admin, and delegated administrator accounts can use the value ANY to return job counts from every account in the organization. AGGREGATE_ALL aggregates job counts from all accounts within the authenticated organization, then returns the sum.",
      "nested_params": []
    },
    {
      "name": "State",
      "type": "string",
      "required": false,
      "description": "This parameter returns the job count for jobs with the specified state. The the value ANY returns count of all states. AGGREGATE_ALL aggregates job counts for all states and returns the sum. Completed with issues is a status found only in the Backup console. For API, this status refers to jobs with a state of COMPLETED and a MessageCategory with a value other than SUCCESS; that is, the status is completed but comes with a status message. To obtain the job count for Completed with issues, run two GET requests, and subtract the second, smaller number: GET /audit/backup-job-summaries?AggregationPeriod=FOURTEEN_DAYS&State=COMPLETED GET /audit/backup-job-summaries?AggregationPeriod=FOURTEEN_DAYS&MessageCategory=SUCCESS&State=COMPLETED.",
      "nested_params": []
    },
    {
      "name": "ResourceType",
      "type": "string",
      "required": false,
      "description": "Returns the job count for the specified resource type. Use request GetSupportedResourceTypes to obtain strings for supported resource types. The the value ANY returns count of all resource types. AGGREGATE_ALL aggregates job counts for all resource types and returns the sum. The type of Amazon Web Services resource to be backed up; for example, an Amazon Elastic Block Store (Amazon EBS) volume or an Amazon Relational Database Service (Amazon RDS) database.",
      "nested_params": []
    },
    {
      "name": "MessageCategory",
      "type": "string",
      "required": false,
      "description": "This parameter returns the job count for the specified message category. Example accepted strings include AccessDenied, Success, and InvalidParameters. See Monitoring for a list of accepted MessageCategory strings. The the value ANY returns count of all message categories. AGGREGATE_ALL aggregates job counts for all message categories and returns the sum.",
      "nested_params": []
    },
    {
      "name": "AggregationPeriod",
      "type": "string",
      "required": false,
      "description": "The period for the returned results. ONE_DAY - The daily job count for the prior 14 days. SEVEN_DAYS - The aggregated job count for the prior 7 days. FOURTEEN_DAYS - The aggregated job count for prior 14 days.",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "The maximum number of items to be returned. The value is an integer. Range of accepted values is from 1 to 500.",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "BackupJobSummaries",
          "type": "list",
          "description": "The summary information.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Region",
                  "type": "string",
                  "description": "The Amazon Web Services Regions within the job summary.",
                  "nested_items": []
                },
                {
                  "name": "AccountId",
                  "type": "string",
                  "description": "The account ID that owns the jobs within the summary.",
                  "nested_items": []
                },
                {
                  "name": "State",
                  "type": "string",
                  "description": "This value is job count for jobs with the specified state.",
                  "nested_items": []
                },
                {
                  "name": "ResourceType",
                  "type": "string",
                  "description": "This value is the job count for the specified resource type. The request GetSupportedResourceTypes returns strings for supported resource types.",
                  "nested_items": []
                },
                {
                  "name": "MessageCategory",
                  "type": "string",
                  "description": "This parameter is the job count for the specified message category.",
                  "nested_items": []
                },
                {
                  "name": "Count",
                  "type": "integer",
                  "description": "The value as a number of jobs in a job summary.",
                  "nested_items": []
                },
                {
                  "name": "StartTime",
                  "type": "datetime",
                  "description": "The value of time in number format of a job start time.",
                  "nested_items": []
                },
                {
                  "name": "EndTime",
                  "type": "datetime",
                  "description": "The value of time in number format of a job end time.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "AggregationPeriod",
          "type": "string",
          "description": "The period for the returned results.",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "ONE_DAY - The daily job count for the prior 14 days.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "SEVEN_DAYS - The aggregated job count for the prior 7 days.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "FOURTEEN_DAYS - The aggregated job count for prior 14 days.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The next item following a partial list of returned resources. For example, if a request is made to return MaxResults number of resources, NextToken allows you to return more items in your list starting at the location pointed to by the next token.",
          "nested_items": []
        }
      ]
    }
  ]
}