{
  "method_name": "update_framework",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/backup/client/update_framework.html",
  "description": "Updates the specified framework.",
  "parameters": [
    {
      "name": "FrameworkName",
      "type": "string",
      "required": true,
      "description": "The unique name of a framework. This name is between 1 and 256 characters, starting with a letter, and consisting of letters (a-z, A-Z), numbers (0-9), and underscores (_).",
      "nested_params": []
    },
    {
      "name": "FrameworkDescription",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "FrameworkControls",
      "type": "list",
      "required": true,
      "description": "The controls that make up the framework. Each control in the list has a name, input parameters, and scope. (dict) --- Contains detailed information about all of the controls of a framework. Each framework must contain at least one control. The name of a control. This name is between 1 and 256 characters. ControlInputParameters (list) --- The name/value pairs. (dict) --- The parameters for a control. A control can have zero, one, or more than one parameter. An example of a control with two parameters is: 'backup plan frequency is at least daily and the retention period is at least 1 year'. The first parameter is daily. The second parameter is 1 year. ParameterName (string) --- The name of a parameter, for example, BackupPlanFrequency. ParameterValue (string) --- The value of parameter, for example, hourly. ControlScope (dict) --- The scope of a control. The control scope defines what the control will evaluate. Three examples of control scopes are: a specific backup plan, all backup plans with a specific tag, or all backup plans. For more information, see ControlScope. ComplianceResourceIds (list) --- The ID of the only Amazon Web Services resource that you want your control scope to contain. (string) --- ComplianceResourceTypes (list) --- Describes whether the control scope includes one or more types of resources, such as EFS or RDS. (string) --- Tags (dict) --- The tag key-value pair applied to those Amazon Web Services resources that you want to trigger an evaluation for a rule. A maximum of one key-value pair can be provided. The tag value is optional, but it cannot be an empty string if you are creating or editing a framework from the console (though the value can be an empty string when included in a CloudFormation template). The structure to assign a tag is: [{\"Key\":\"string\",\"Value\":\"string\"}]. (string) --- (string) ---",
      "nested_params": [
        {
          "name": "ControlName",
          "type": "string",
          "required": false,
          "description": "The name of a control. This name is between 1 and 256 characters.",
          "nested_params": []
        },
        {
          "name": "ControlInputParameters",
          "type": "list",
          "required": false,
          "description": "The name/value pairs.",
          "nested_params": [
            {
              "name": "ParameterName",
              "type": "string",
              "required": false,
              "description": "The name of a parameter, for example, BackupPlanFrequency.",
              "nested_params": []
            },
            {
              "name": "ParameterValue",
              "type": "string",
              "required": false,
              "description": "The value of parameter, for example, hourly.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ControlScope",
          "type": "dict",
          "required": false,
          "description": "The scope of a control. The control scope defines what the control will evaluate. Three examples of control scopes are: a specific backup plan, all backup plans with a specific tag, or all backup plans. For more information, see ControlScope.",
          "nested_params": [
            {
              "name": "ComplianceResourceIds",
              "type": "list",
              "required": false,
              "description": "The ID of the only Amazon Web Services resource that you want your control scope to contain.",
              "nested_params": []
            },
            {
              "name": "ComplianceResourceTypes",
              "type": "list",
              "required": false,
              "description": "Describes whether the control scope includes one or more types of resources, such as EFS or RDS.",
              "nested_params": []
            },
            {
              "name": "Tags",
              "type": "dict",
              "required": false,
              "description": "The tag key-value pair applied to those Amazon Web Services resources that you want to trigger an evaluation for a rule. A maximum of one key-value pair can be provided. The tag value is optional, but it cannot be an empty string if you are creating or editing a framework from the console (though the value can be an empty string when included in a CloudFormation template). The structure to assign a tag is: [{\"Key\":\"string\",\"Value\":\"string\"}].",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "IdempotencyToken",
      "type": "string",
      "required": false,
      "description": "A customer-chosen string that you can use to distinguish between otherwise identical calls to UpdateFrameworkInput. Retrying a successful request with the same idempotency token results in a success message with no action taken. This field is autopopulated if not provided.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "FrameworkName",
          "type": "string",
          "description": "The unique name of a framework. This name is between 1 and 256 characters, starting with a letter, and consisting of letters (a-z, A-Z), numbers (0-9), and underscores (_).",
          "nested_items": []
        },
        {
          "name": "FrameworkArn",
          "type": "string",
          "description": "An Amazon Resource Name (ARN) that uniquely identifies a resource. The format of the ARN depends on the resource type.",
          "nested_items": []
        },
        {
          "name": "CreationTime",
          "type": "datetime",
          "description": "The date and time that a framework is created, in ISO 8601 representation. The value of CreationTime is accurate to milliseconds. For example, 2020-07-10T15:00:00.000-08:00 represents the 10th of July 2020 at 3:00 PM 8 hours behind UTC.",
          "nested_items": []
        }
      ]
    }
  ]
}