{
  "method_name": "get_login_profile",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iam/client/get_login_profile.html",
  "description": "Retrieves the user name for the specified IAM user. A login profile is created when you create a password for the user to access the Amazon Web Services Management Console. If the user does not exist or does not have a password, the operation returns a 404 ( NoSuchEntity) error. If you create an IAM user with access to the console, the CreateDate reflects the date you created the initial password for the user. If you create an IAM user with programmatic access, and then later add a password for the user to access the Amazon Web Services Management Console, the CreateDate reflects the initial password creation date. A user with programmatic access does not have a login profile unless you create a password for the user to access the Amazon Web Services Management Console.",
  "parameters": [
    {
      "name": "UserName",
      "type": "string",
      "required": false,
      "description": "The name of the user whose login profile you want to retrieve. This parameter is optional. If no user name is included, it defaults to the principal making the request. When you make this request with root user credentials, you must use an AssumeRoot session to omit the user name. This parameter allows (through its regex pattern) a string of characters consisting of upper and lowercase alphanumeric characters with no spaces. You can also include any of the following characters: _+=,.@-",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "LoginProfile",
          "type": "dict",
          "description": "A structure containing the user name and the profile creation date for the user.",
          "nested_items": [
            {
              "name": "UserName",
              "type": "string",
              "description": "The name of the user, which can be used for signing in to the Amazon Web Services Management Console.",
              "nested_items": []
            },
            {
              "name": "CreateDate",
              "type": "datetime",
              "description": "The date when the password for the user was created.",
              "nested_items": []
            },
            {
              "name": "PasswordResetRequired",
              "type": "boolean",
              "description": "Specifies whether the user is required to set a new password on next sign-in.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}