{
  "method_name": "create_extension_association",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/appconfig/client/create_extension_association.html",
  "description": "When you create an extension or configure an Amazon Web Services authored extension, you associate the extension with an AppConfig application, environment, or configuration profile. For example, you can choose to run the AppConfig deployment events to Amazon SNS Amazon Web Services authored extension and receive notifications on an Amazon SNS topic anytime a configuration deployment is started for a specific application. Defining which extension to associate with an AppConfig resource is called an extension association. An extension association is a specified relationship between an extension and an AppConfig resource, such as an application or a configuration profile. For more information about extensions and associations, see Extending workflows in the AppConfig User Guide.",
  "parameters": [
    {
      "name": "ExtensionIdentifier",
      "type": "string",
      "required": true,
      "description": "The name, the ID, or the Amazon Resource Name (ARN) of the extension.",
      "nested_params": []
    },
    {
      "name": "ExtensionVersionNumber",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ResourceIdentifier",
      "type": "string",
      "required": true,
      "description": "The ARN of an application, configuration profile, or environment.",
      "nested_params": []
    },
    {
      "name": "Parameters",
      "type": "dict",
      "required": false,
      "description": "The parameter names and values defined in the extensions. Extension parameters marked Required must be entered for this field. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "dict",
      "required": false,
      "description": "Adds one or more tags for the specified extension association. Tags are metadata that help you categorize resources in different ways, for example, by purpose, owner, or environment. Each tag consists of a key and an optional value, both of which you define. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Id",
          "type": "string",
          "description": "The system-generated ID for the association.",
          "nested_items": []
        },
        {
          "name": "ExtensionArn",
          "type": "string",
          "description": "The ARN of the extension defined in the association.",
          "nested_items": []
        },
        {
          "name": "ResourceArn",
          "type": "string",
          "description": "The ARNs of applications, configuration profiles, or environments defined in the association.",
          "nested_items": []
        },
        {
          "name": "Arn",
          "type": "string",
          "description": "The system-generated Amazon Resource Name (ARN) for the extension.",
          "nested_items": []
        },
        {
          "name": "Parameters",
          "type": "dict",
          "description": "The parameter names and values defined in the association.",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "ExtensionVersionNumber",
          "type": "integer",
          "description": "The version number for the extension defined in the association.",
          "nested_items": []
        }
      ]
    }
  ]
}