{
  "method_name": "update_app_instance_bot",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/chime-sdk-identity/client/update_app_instance_bot.html",
  "description": "Updates the name and metadata of an AppInstanceBot.",
  "parameters": [
    {
      "name": "AppInstanceBotArn",
      "type": "string",
      "required": true,
      "description": "The ARN of the AppInstanceBot.",
      "nested_params": []
    },
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "The name of the AppInstanceBot.",
      "nested_params": []
    },
    {
      "name": "Metadata",
      "type": "string",
      "required": true,
      "description": "The metadata of the AppInstanceBot.",
      "nested_params": []
    },
    {
      "name": "Configuration",
      "type": "dict",
      "required": true,
      "description": "The configuration for the bot update. The configuration for an Amazon Lex V2 bot. RespondsTo (string) --- Determines whether the Amazon Lex V2 bot responds to all standard messages. Control messages are not supported. InvokedBy (dict) --- Specifies the type of message that triggers a bot. Sets standard messages as the bot trigger. For standard messages: ALL: The bot processes all standard messages. AUTO: The bot responds to ALL messages when the channel has one other non-hidden member, and responds to MENTIONS when the channel has more than one other non-hidden member. MENTIONS: The bot processes all standard messages that have a message attribute with CHIME.mentions and a value of the bot ARN. NONE: The bot processes no standard messages. Sets targeted messages as the bot trigger. For targeted messages: ALL: The bot processes all TargetedMessages sent to it. The bot then responds with a targeted message back to the sender. NONE: The bot processes no targeted messages. The ARN of the Amazon Lex V2 bot's alias. The ARN uses this format: arn:aws:lex:REGION:ACCOUNT:bot-alias/MYBOTID/MYBOTALIAS Identifies the Amazon Lex V2 bot's language and locale. The string must match one of the supported locales in Amazon Lex V2. All of the intents, slot types, and slots used in the bot must have the same locale. For more information, see Supported languages in the Amazon Lex V2 Developer Guide. WelcomeIntent (string) --- The name of the welcome intent configured in the Amazon Lex V2 bot.",
      "nested_params": [
        {
          "name": "Lex",
          "type": "dict",
          "required": false,
          "description": "The configuration for an Amazon Lex V2 bot.",
          "nested_params": [
            {
              "name": "RespondsTo",
              "type": "string",
              "required": false,
              "description": "Determines whether the Amazon Lex V2 bot responds to all standard messages. Control messages are not supported.",
              "nested_params": []
            },
            {
              "name": "InvokedBy",
              "type": "dict",
              "required": false,
              "description": "Specifies the type of message that triggers a bot.",
              "nested_params": [
                {
                  "name": "StandardMessages",
                  "type": "string",
                  "required": false,
                  "description": "Sets standard messages as the bot trigger. For standard messages:",
                  "nested_params": []
                },
                {
                  "name": "TargetedMessages",
                  "type": "string",
                  "required": false,
                  "description": "Sets targeted messages as the bot trigger. For targeted messages:",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "LexBotAliasArn",
              "type": "string",
              "required": false,
              "description": "The ARN of the Amazon Lex V2 bot's alias. The ARN uses this format: arn:aws:lex:REGION:ACCOUNT:bot-alias/MYBOTID/MYBOTALIAS.",
              "nested_params": []
            },
            {
              "name": "LocaleId",
              "type": "string",
              "required": false,
              "description": "Identifies the Amazon Lex V2 bot's language and locale. The string must match one of the supported locales in Amazon Lex V2. All of the intents, slot types, and slots used in the bot must have the same locale. For more information, see Supported languages in the Amazon Lex V2 Developer Guide.",
              "nested_params": []
            },
            {
              "name": "WelcomeIntent",
              "type": "string",
              "required": false,
              "description": "The name of the welcome intent configured in the Amazon Lex V2 bot.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "AppInstanceBotArn",
          "type": "string",
          "description": "The ARN of the AppInstanceBot.",
          "nested_items": []
        }
      ]
    }
  ]
}