{
  "method_name": "update_profile_job",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/databrew/client/update_profile_job.html",
  "description": "Modifies the definition of an existing profile job.",
  "parameters": [
    {
      "name": "Configuration",
      "type": "dict",
      "required": true,
      "description": "Configuration for profile jobs. Used to select columns, do evaluations, and override default parameters of evaluations. When configuration is null, the profile job will run with default settings. DatasetStatisticsConfiguration (dict) --- Configuration for inter-column evaluations. Configuration can be used to select evaluations and override parameters of evaluations. When configuration is undefined, the profile job will run all supported inter-column evaluations. IncludedStatistics (list) --- List of included evaluations. When the list is undefined, all supported evaluations will be included. (string) --- Overrides (list) --- List of overrides for evaluations. (dict) --- Override of a particular evaluation for a profile job. The name of an evaluation A map that includes overrides of an evaluation's parameters. (string) --- (string) --- ProfileColumns (list) --- List of column selectors. ProfileColumns can be used to select columns from the dataset. When ProfileColumns is undefined, the profile job will profile all supported columns. (dict) --- Selector of a column from a dataset for profile job configuration. One selector includes either a column name or a regular expression. Regex (string) --- A regular expression for selecting a column from a dataset. Name (string) --- The name of a column from a dataset. ColumnStatisticsConfigurations (list) --- List of configurations for column evaluations. ColumnStatisticsConfigurations are used to select evaluations and override parameters of evaluations for particular columns. When ColumnStatisticsConfigurations is undefined, the profile job will profile all supported columns and run all supported evaluations. (dict) --- Configuration for column evaluations for a profile job. ColumnStatisticsConfiguration can be used to select evaluations and override parameters of evaluations for particular columns. Selectors (list) --- List of column selectors. Selectors can be used to select columns from the dataset. When selectors are undefined, configuration will be applied to all supported columns. Configuration for evaluations. Statistics can be used to select evaluations and override parameters of evaluations. (string) --- (string) --- EntityDetectorConfiguration (dict) --- Configuration of entity detection for a profile job. When undefined, entity detection is disabled. Entity types to detect. Can be any of the following: USA_SSN EMAIL USA_ITIN USA_PASSPORT_NUMBER PHONE_NUMBER USA_DRIVING_LICENSE BANK_ACCOUNT CREDIT_CARD IP_ADDRESS MAC_ADDRESS USA_DEA_NUMBER USA_HCPCS_CODE USA_NATIONAL_PROVIDER_IDENTIFIER USA_NATIONAL_DRUG_CODE USA_HEALTH_INSURANCE_CLAIM_NUMBER USA_MEDICARE_BENEFICIARY_IDENTIFIER USA_CPT_CODE PERSON_NAME DATE The Entity type group USA_ALL is also supported, and includes all of the above entity types except PERSON_NAME and DATE. (string) --- AllowedStatistics (list) --- Configuration of statistics that are allowed to be run on columns that contain detected entities. When undefined, no statistics will be computed on columns that contain detected entities. (dict) --- Configuration of statistics that are allowed to be run on columns that contain detected entities. One or more column statistics to allow for columns that contain detected entities. (string) ---",
      "nested_params": [
        {
          "name": "DatasetStatisticsConfiguration",
          "type": "dict",
          "required": false,
          "description": "Configuration for inter-column evaluations. Configuration can be used to select evaluations and override parameters of evaluations. When configuration is undefined, the profile job will run all supported inter-column evaluations.",
          "nested_params": [
            {
              "name": "IncludedStatistics",
              "type": "list",
              "required": false,
              "description": "List of included evaluations. When the list is undefined, all supported evaluations will be included.",
              "nested_params": []
            },
            {
              "name": "Overrides",
              "type": "list",
              "required": false,
              "description": "List of overrides for evaluations.",
              "nested_params": [
                {
                  "name": "Statistic",
                  "type": "string",
                  "required": false,
                  "description": "The name of an evaluation.",
                  "nested_params": []
                },
                {
                  "name": "Parameters",
                  "type": "dict",
                  "required": false,
                  "description": "A map that includes overrides of an evaluation's parameters.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "ProfileColumns",
          "type": "list",
          "required": false,
          "description": "List of column selectors. ProfileColumns can be used to select columns from the dataset. When ProfileColumns is undefined, the profile job will profile all supported columns.",
          "nested_params": [
            {
              "name": "Regex",
              "type": "string",
              "required": false,
              "description": "A regular expression for selecting a column from a dataset.",
              "nested_params": []
            },
            {
              "name": "Name",
              "type": "string",
              "required": false,
              "description": "The name of a column from a dataset.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ColumnStatisticsConfigurations",
          "type": "list",
          "required": false,
          "description": "List of configurations for column evaluations. ColumnStatisticsConfigurations are used to select evaluations and override parameters of evaluations for particular columns. When ColumnStatisticsConfigurations is undefined, the profile job will profile all supported columns and run all supported evaluations.",
          "nested_params": [
            {
              "name": "Selectors",
              "type": "list",
              "required": false,
              "description": "List of column selectors. Selectors can be used to select columns from the dataset. When selectors are undefined, configuration will be applied to all supported columns.",
              "nested_params": [
                {
                  "name": "Regex",
                  "type": "string",
                  "required": false,
                  "description": "A regular expression for selecting a column from a dataset.",
                  "nested_params": []
                },
                {
                  "name": "Name",
                  "type": "string",
                  "required": false,
                  "description": "The name of a column from a dataset.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Statistics",
              "type": "dict",
              "required": false,
              "description": "Configuration for evaluations. Statistics can be used to select evaluations and override parameters of evaluations.",
              "nested_params": [
                {
                  "name": "IncludedStatistics",
                  "type": "list",
                  "required": false,
                  "description": "List of included evaluations. When the list is undefined, all supported evaluations will be included.",
                  "nested_params": []
                },
                {
                  "name": "Overrides",
                  "type": "list",
                  "required": false,
                  "description": "List of overrides for evaluations.",
                  "nested_params": [
                    {
                      "name": "Statistic",
                      "type": "string",
                      "required": false,
                      "description": "The name of an evaluation.",
                      "nested_params": []
                    },
                    {
                      "name": "Parameters",
                      "type": "dict",
                      "required": false,
                      "description": "A map that includes overrides of an evaluation's parameters.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "EntityDetectorConfiguration",
          "type": "dict",
          "required": false,
          "description": "Configuration of entity detection for a profile job. When undefined, entity detection is disabled.",
          "nested_params": [
            {
              "name": "EntityTypes",
              "type": "list",
              "required": false,
              "description": "Entity types to detect. Can be any of the following:",
              "nested_params": []
            },
            {
              "name": "AllowedStatistics",
              "type": "list",
              "required": false,
              "description": "Configuration of statistics that are allowed to be run on columns that contain detected entities. When undefined, no statistics will be computed on columns that contain detected entities.",
              "nested_params": [
                {
                  "name": "Statistics",
                  "type": "list",
                  "required": false,
                  "description": "One or more column statistics to allow for columns that contain detected entities.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "EncryptionKeyArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "EncryptionMode",
      "type": "string",
      "required": false,
      "description": "The encryption mode for the job, which can be one of the following: SSE-KMS - Server-side encryption with keys managed by KMS. SSE-S3 - Server-side encryption with keys managed by Amazon S3.",
      "nested_params": []
    },
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "The name of the job to be updated.",
      "nested_params": []
    },
    {
      "name": "LogSubscription",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxCapacity",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxRetries",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "OutputLocation",
      "type": "dict",
      "required": true,
      "description": "Represents an Amazon S3 location (bucket name, bucket owner, and object key) where DataBrew can read input data, or write output from a job. The Amazon S3 bucket name. Key (string) --- The unique name of the object in the bucket. BucketOwner (string) --- The Amazon Web Services account ID of the bucket owner.",
      "nested_params": [
        {
          "name": "Bucket",
          "type": "string",
          "required": false,
          "description": "The Amazon S3 bucket name.",
          "nested_params": []
        },
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The unique name of the object in the bucket.",
          "nested_params": []
        },
        {
          "name": "BucketOwner",
          "type": "string",
          "required": false,
          "description": "The Amazon Web Services account ID of the bucket owner.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ValidationConfigurations",
      "type": "list",
      "required": true,
      "description": "List of validation configurations that are applied to the profile job. (dict) --- Configuration for data quality validation. Used to select the Rulesets and Validation Mode to be used in the profile job. When ValidationConfiguration is null, the profile job will run without data quality validation. The Amazon Resource Name (ARN) for the ruleset to be validated in the profile job. The TargetArn of the selected ruleset should be the same as the Amazon Resource Name (ARN) of the dataset that is associated with the profile job. ValidationMode (string) --- Mode of data quality validation. Default mode is 'CHECK_ALL' which verifies all rules defined in the selected ruleset.",
      "nested_params": [
        {
          "name": "RulesetArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) for the ruleset to be validated in the profile job. The TargetArn of the selected ruleset should be the same as the Amazon Resource Name (ARN) of the dataset that is associated with the profile job.",
          "nested_params": []
        },
        {
          "name": "ValidationMode",
          "type": "string",
          "required": false,
          "description": "Mode of data quality validation. Default mode is 'CHECK_ALL' which verifies all rules defined in the selected ruleset.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "RoleArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the Identity and Access Management (IAM) role to be assumed when DataBrew runs the job.",
      "nested_params": []
    },
    {
      "name": "Timeout",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "JobSample",
      "type": "dict",
      "required": false,
      "description": "Sample configuration for Profile Jobs only. Determines the number of rows on which the Profile job will be executed. If a JobSample value is not provided for profile jobs, the default value will be used. The default value is CUSTOM_ROWS for the mode parameter and 20000 for the size parameter. Mode (string) --- A value that determines whether the profile job is run on the entire dataset or a specified number of rows. This value must be one of the following: FULL_DATASET - The profile job is run on the entire dataset. CUSTOM_ROWS - The profile job is run on the number of rows specified in the Size parameter. Size (integer) --- The Size parameter is only required when the mode is CUSTOM_ROWS. The profile job is run on the specified number of rows. The maximum value for size is Long.MAX_VALUE. Long.MAX_VALUE = 9223372036854775807",
      "nested_params": [
        {
          "name": "Mode",
          "type": "string",
          "required": false,
          "description": "A value that determines whether the profile job is run on the entire dataset or a specified number of rows. This value must be one of the following:",
          "nested_params": []
        },
        {
          "name": "Size",
          "type": "integer",
          "required": false,
          "description": "The Size parameter is only required when the mode is CUSTOM_ROWS. The profile job is run on the specified number of rows. The maximum value for size is Long.MAX_VALUE. Long.MAX_VALUE = 9223372036854775807",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Name",
          "type": "string",
          "description": "The name of the job that was updated.",
          "nested_items": []
        }
      ]
    }
  ]
}