{
  "method_name": "update_dataset",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/databrew/client/update_dataset.html",
  "description": "Modifies the definition of an existing DataBrew dataset.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "The name of the dataset to be updated.",
      "nested_params": []
    },
    {
      "name": "Format",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "FormatOptions",
      "type": "dict",
      "required": false,
      "description": "Represents a set of options that define the structure of either comma-separated value (CSV), Excel, or JSON input. Json (dict) --- Options that define how JSON input is to be interpreted by DataBrew. MultiLine (boolean) --- A value that specifies whether JSON input contains embedded new line characters. Excel (dict) --- Options that define how Excel input is to be interpreted by DataBrew. SheetNames (list) --- One or more named sheets in the Excel file that will be included in the dataset. (string) --- SheetIndexes (list) --- One or more sheet numbers in the Excel file that will be included in the dataset. (integer) --- HeaderRow (boolean) --- A variable that specifies whether the first row in the file is parsed as the header. If this value is false, column names are auto-generated. Csv (dict) --- Options that define how CSV input is to be interpreted by DataBrew. Delimiter (string) --- A single character that specifies the delimiter being used in the CSV file. HeaderRow (boolean) --- A variable that specifies whether the first row in the file is parsed as the header. If this value is false, column names are auto-generated.",
      "nested_params": [
        {
          "name": "Json",
          "type": "dict",
          "required": false,
          "description": "Options that define how JSON input is to be interpreted by DataBrew.",
          "nested_params": [
            {
              "name": "MultiLine",
              "type": "boolean",
              "required": false,
              "description": "A value that specifies whether JSON input contains embedded new line characters.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Excel",
          "type": "dict",
          "required": false,
          "description": "Options that define how Excel input is to be interpreted by DataBrew.",
          "nested_params": [
            {
              "name": "SheetNames",
              "type": "list",
              "required": false,
              "description": "One or more named sheets in the Excel file that will be included in the dataset.",
              "nested_params": []
            },
            {
              "name": "SheetIndexes",
              "type": "list",
              "required": false,
              "description": "One or more sheet numbers in the Excel file that will be included in the dataset.",
              "nested_params": []
            },
            {
              "name": "HeaderRow",
              "type": "boolean",
              "required": false,
              "description": "A variable that specifies whether the first row in the file is parsed as the header. If this value is false, column names are auto-generated.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Csv",
          "type": "dict",
          "required": false,
          "description": "Options that define how CSV input is to be interpreted by DataBrew.",
          "nested_params": [
            {
              "name": "Delimiter",
              "type": "string",
              "required": false,
              "description": "A single character that specifies the delimiter being used in the CSV file.",
              "nested_params": []
            },
            {
              "name": "HeaderRow",
              "type": "boolean",
              "required": false,
              "description": "A variable that specifies whether the first row in the file is parsed as the header. If this value is false, column names are auto-generated.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "Input",
      "type": "dict",
      "required": true,
      "description": "Represents information on how DataBrew can find data, in either the Glue Data Catalog or Amazon S3. S3InputDefinition (dict) --- The Amazon S3 location where the data is stored. The Amazon S3 bucket name. Key (string) --- The unique name of the object in the bucket. BucketOwner (string) --- The Amazon Web Services account ID of the bucket owner. DataCatalogInputDefinition (dict) --- The Glue Data Catalog parameters for the data. CatalogId (string) --- The unique identifier of the Amazon Web Services account that holds the Data Catalog that stores the data. The name of a database in the Data Catalog. The name of a database table in the Data Catalog. This table corresponds to a DataBrew dataset. TempDirectory (dict) --- Represents an Amazon location where DataBrew can store intermediate results. DatabaseInputDefinition (dict) --- Connection information for dataset input files stored in a database. The Glue Connection that stores the connection information for the target database. DatabaseTableName (string) --- The table within the target database. TempDirectory (dict) --- Represents an Amazon S3 location (bucket name, bucket owner, and object key) where DataBrew can read input data, or write output from a job. QueryString (string) --- Custom SQL to run against the provided Glue connection. This SQL will be used as the input for DataBrew projects and jobs. Metadata (dict) --- Contains additional resource information needed for specific datasets. SourceArn (string) --- The Amazon Resource Name (ARN) associated with the dataset. Currently, DataBrew only supports ARNs from Amazon AppFlow.",
      "nested_params": [
        {
          "name": "S3InputDefinition",
          "type": "dict",
          "required": false,
          "description": "The Amazon S3 location where the data is stored.",
          "nested_params": [
            {
              "name": "Bucket",
              "type": "string",
              "required": false,
              "description": "The Amazon S3 bucket name.",
              "nested_params": []
            },
            {
              "name": "Key",
              "type": "string",
              "required": false,
              "description": "The unique name of the object in the bucket.",
              "nested_params": []
            },
            {
              "name": "BucketOwner",
              "type": "string",
              "required": false,
              "description": "The Amazon Web Services account ID of the bucket owner.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "DataCatalogInputDefinition",
          "type": "dict",
          "required": false,
          "description": "The Glue Data Catalog parameters for the data.",
          "nested_params": [
            {
              "name": "CatalogId",
              "type": "string",
              "required": false,
              "description": "The unique identifier of the Amazon Web Services account that holds the Data Catalog that stores the data.",
              "nested_params": []
            },
            {
              "name": "DatabaseName",
              "type": "string",
              "required": false,
              "description": "The name of a database in the Data Catalog.",
              "nested_params": []
            },
            {
              "name": "TableName",
              "type": "string",
              "required": false,
              "description": "The name of a database table in the Data Catalog. This table corresponds to a DataBrew dataset.",
              "nested_params": []
            },
            {
              "name": "TempDirectory",
              "type": "dict",
              "required": false,
              "description": "Represents an Amazon location where DataBrew can store intermediate results.",
              "nested_params": [
                {
                  "name": "Bucket",
                  "type": "string",
                  "required": false,
                  "description": "The Amazon S3 bucket name.",
                  "nested_params": []
                },
                {
                  "name": "Key",
                  "type": "string",
                  "required": false,
                  "description": "The unique name of the object in the bucket.",
                  "nested_params": []
                },
                {
                  "name": "BucketOwner",
                  "type": "string",
                  "required": false,
                  "description": "The Amazon Web Services account ID of the bucket owner.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "DatabaseInputDefinition",
          "type": "dict",
          "required": false,
          "description": "Connection information for dataset input files stored in a database.",
          "nested_params": [
            {
              "name": "GlueConnectionName",
              "type": "string",
              "required": false,
              "description": "The Glue Connection that stores the connection information for the target database.",
              "nested_params": []
            },
            {
              "name": "DatabaseTableName",
              "type": "string",
              "required": false,
              "description": "The table within the target database.",
              "nested_params": []
            },
            {
              "name": "TempDirectory",
              "type": "dict",
              "required": false,
              "description": "Represents an Amazon S3 location (bucket name, bucket owner, and object key) where DataBrew can read input data, or write output from a job.",
              "nested_params": [
                {
                  "name": "Bucket",
                  "type": "string",
                  "required": false,
                  "description": "The Amazon S3 bucket name.",
                  "nested_params": []
                },
                {
                  "name": "Key",
                  "type": "string",
                  "required": false,
                  "description": "The unique name of the object in the bucket.",
                  "nested_params": []
                },
                {
                  "name": "BucketOwner",
                  "type": "string",
                  "required": false,
                  "description": "The Amazon Web Services account ID of the bucket owner.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "QueryString",
              "type": "string",
              "required": false,
              "description": "Custom SQL to run against the provided Glue connection. This SQL will be used as the input for DataBrew projects and jobs.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Metadata",
          "type": "dict",
          "required": false,
          "description": "Contains additional resource information needed for specific datasets.",
          "nested_params": [
            {
              "name": "SourceArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) associated with the dataset. Currently, DataBrew only supports ARNs from Amazon AppFlow.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "PathOptions",
      "type": "dict",
      "required": true,
      "description": "A set of options that defines how DataBrew interprets an Amazon S3 path of the dataset. LastModifiedDateCondition (dict) --- If provided, this structure defines a date range for matching Amazon S3 objects based on their LastModifiedDate attribute in Amazon S3. The expression which includes condition names followed by substitution variables, possibly grouped and combined with other conditions. For example, '(starts_with :prefix1 or starts_with :prefix2) and (ends_with :suffix1 or ends_with :suffix2)'. Substitution variables should start with --\u0098:' symbol. The map of substitution variable names to their values used in this filter expression. (string) --- (string) --- FilesLimit (dict) --- If provided, this structure imposes a limit on a number of files that should be selected. The number of Amazon S3 files to select. OrderedBy (string) --- A criteria to use for Amazon S3 files sorting before their selection. By default uses LAST_MODIFIED_DATE as a sorting criteria. Currently it's the only allowed value. Order (string) --- A criteria to use for Amazon S3 files sorting before their selection. By default uses DESCENDING order, i.e. most recent files are selected first. Another possible value is ASCENDING. Parameters (dict) --- A structure that maps names of parameters used in the Amazon S3 path of a dataset to their definitions. (string) --- (dict) --- Represents a dataset parameter that defines type and conditions for a parameter in the Amazon S3 path of the dataset. The name of the parameter that is used in the dataset's Amazon S3 path. The type of the dataset parameter, can be one of a --\u0098String', --\u0098Number' or --\u0098Datetime'. DatetimeOptions (dict) --- Additional parameter options such as a format and a timezone. Required for datetime parameters. Required option, that defines the datetime format used for a date parameter in the Amazon S3 path. Should use only supported datetime specifiers and separation characters, all literal a-z or A-Z characters should be escaped with single quotes. E.g. 'MM.dd.yyyy---\u0098at'-HH:mm'. TimezoneOffset (string) --- Optional value for a timezone offset of the datetime parameter value in the Amazon S3 path. Shouldn't be used if Format for this parameter includes timezone fields. If no offset specified, UTC is assumed. LocaleCode (string) --- Optional value for a non-US locale code, needed for correct interpretation of some date formats. CreateColumn (boolean) --- Optional boolean value that defines whether the captured value of this parameter should be used to create a new column in a dataset. Filter (dict) --- The optional filter expression structure to apply additional matching criteria to the parameter. (string) --- (string) ---",
      "nested_params": [
        {
          "name": "LastModifiedDateCondition",
          "type": "dict",
          "required": false,
          "description": "If provided, this structure defines a date range for matching Amazon S3 objects based on their LastModifiedDate attribute in Amazon S3.",
          "nested_params": [
            {
              "name": "Expression",
              "type": "string",
              "required": false,
              "description": "The expression which includes condition names followed by substitution variables, possibly grouped and combined with other conditions. For example, '(starts_with :prefix1 or starts_with :prefix2) and (ends_with :suffix1 or ends_with :suffix2)'. Substitution variables should start with --\u0098:' symbol.",
              "nested_params": []
            },
            {
              "name": "ValuesMap",
              "type": "dict",
              "required": false,
              "description": "The map of substitution variable names to their values used in this filter expression.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "FilesLimit",
          "type": "dict",
          "required": false,
          "description": "If provided, this structure imposes a limit on a number of files that should be selected.",
          "nested_params": [
            {
              "name": "MaxFiles",
              "type": "integer",
              "required": false,
              "description": "The number of Amazon S3 files to select.",
              "nested_params": []
            },
            {
              "name": "OrderedBy",
              "type": "string",
              "required": false,
              "description": "A criteria to use for Amazon S3 files sorting before their selection. By default uses LAST_MODIFIED_DATE as a sorting criteria. Currently it's the only allowed value.",
              "nested_params": []
            },
            {
              "name": "Order",
              "type": "string",
              "required": false,
              "description": "A criteria to use for Amazon S3 files sorting before their selection. By default uses DESCENDING order, i.e. most recent files are selected first. Another possible value is ASCENDING.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Parameters",
          "type": "dict",
          "required": false,
          "description": "A structure that maps names of parameters used in the Amazon S3 path of a dataset to their definitions.",
          "nested_params": [
            {
              "name": "Name",
              "type": "string",
              "required": false,
              "description": "The name of the parameter that is used in the dataset's Amazon S3 path.",
              "nested_params": []
            },
            {
              "name": "Type",
              "type": "string",
              "required": false,
              "description": "The type of the dataset parameter, can be one of a --\u0098String', --\u0098Number' or --\u0098Datetime'.",
              "nested_params": []
            },
            {
              "name": "DatetimeOptions",
              "type": "dict",
              "required": false,
              "description": "Additional parameter options such as a format and a timezone. Required for datetime parameters.",
              "nested_params": [
                {
                  "name": "Format",
                  "type": "string",
                  "required": false,
                  "description": "Required option, that defines the datetime format used for a date parameter in the Amazon S3 path. Should use only supported datetime specifiers and separation characters, all literal a-z or A-Z characters should be escaped with single quotes. E.g. 'MM.dd.yyyy---\u0098at'-HH:mm'.",
                  "nested_params": []
                },
                {
                  "name": "TimezoneOffset",
                  "type": "string",
                  "required": false,
                  "description": "Optional value for a timezone offset of the datetime parameter value in the Amazon S3 path. Shouldn't be used if Format for this parameter includes timezone fields. If no offset specified, UTC is assumed.",
                  "nested_params": []
                },
                {
                  "name": "LocaleCode",
                  "type": "string",
                  "required": false,
                  "description": "Optional value for a non-US locale code, needed for correct interpretation of some date formats.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "CreateColumn",
              "type": "boolean",
              "required": false,
              "description": "Optional boolean value that defines whether the captured value of this parameter should be used to create a new column in a dataset.",
              "nested_params": []
            },
            {
              "name": "Filter",
              "type": "dict",
              "required": false,
              "description": "The optional filter expression structure to apply additional matching criteria to the parameter.",
              "nested_params": [
                {
                  "name": "Expression",
                  "type": "string",
                  "required": false,
                  "description": "The expression which includes condition names followed by substitution variables, possibly grouped and combined with other conditions. For example, '(starts_with :prefix1 or starts_with :prefix2) and (ends_with :suffix1 or ends_with :suffix2)'. Substitution variables should start with --\u0098:' symbol.",
                  "nested_params": []
                },
                {
                  "name": "ValuesMap",
                  "type": "dict",
                  "required": false,
                  "description": "The map of substitution variable names to their values used in this filter expression.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Name",
          "type": "string",
          "description": "The name of the dataset that you updated.",
          "nested_items": []
        }
      ]
    }
  ]
}