{
  "method_name": "submit_task_state_change",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ecs/client/submit_task_state_change.html",
  "description": "Sent to acknowledge that a task changed states.",
  "parameters": [
    {
      "name": "cluster",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "task",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "status",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "reason",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "containers",
      "type": "list",
      "required": false,
      "description": "Any containers that's associated with the state change request. (dict) --- An object that represents a change in state for a container. containerName (string) --- The name of the container. imageDigest (string) --- The container image SHA 256 digest. runtimeId (string) --- The ID of the Docker container. exitCode (integer) --- The exit code for the container, if the state change is a result of the container exiting. networkBindings (list) --- Any network bindings that are associated with the container. (dict) --- Details on the network bindings between a container and its host container instance. After a task reaches the RUNNING status, manual and automatic host and container port assignments are visible in the networkBindings section of DescribeTasks API responses. bindIP (string) --- The IP address that the container is bound to on the container instance. containerPort (integer) --- The port number on the container that's used with the network binding. hostPort (integer) --- The port number on the host that's used with the network binding. protocol (string) --- The protocol used for the network binding. containerPortRange (string) --- The port number range on the container that's bound to the dynamically mapped host port range. The following rules apply when you specify a containerPortRange: You must use either the bridge network mode or the awsvpc network mode. This parameter is available for both the EC2 and Fargate launch types. This parameter is available for both the Linux and Windows operating systems. The container instance must have at least version 1.67.0 of the container agent and at least version 1.67.0-1 of the ecs-init package You can specify a maximum of 100 port ranges per container. You do not specify a hostPortRange. The value of the hostPortRange is set as follows: For containers in a task with the awsvpc network mode, the hostPortRange is set to the same value as the containerPortRange. This is a static mapping strategy. For containers in a task with the bridge network mode, the Amazon ECS agent finds open host ports from the default ephemeral range and passes it to docker to bind them to the container ports. The containerPortRange valid values are between 1 and 65535. A port can only be included in one port mapping per container. You cannot specify overlapping port ranges. The first port in the range must be less than last port in the range. Docker recommends that you turn off the docker-proxy in the Docker daemon config file when you have a large number of ports. For more information, see Issue #11185 on the Github website. For information about how to turn off the docker-proxy in the Docker daemon config file, see Docker daemon in the Amazon ECS Developer Guide. You can call DescribeTasks to view the hostPortRange which are the host ports that are bound to the container ports. hostPortRange (string) --- The port number range on the host that's used with the network binding. This is assigned is assigned by Docker and delivered by the Amazon ECS agent. reason (string) --- The reason for the state change. status (string) --- The status of the container.",
      "nested_params": [
        {
          "name": "containerName",
          "type": "string",
          "required": false,
          "description": "The name of the container.",
          "nested_params": []
        },
        {
          "name": "imageDigest",
          "type": "string",
          "required": false,
          "description": "The container image SHA 256 digest.",
          "nested_params": []
        },
        {
          "name": "runtimeId",
          "type": "string",
          "required": false,
          "description": "The ID of the Docker container.",
          "nested_params": []
        },
        {
          "name": "exitCode",
          "type": "integer",
          "required": false,
          "description": "The exit code for the container, if the state change is a result of the container exiting.",
          "nested_params": []
        },
        {
          "name": "networkBindings",
          "type": "list",
          "required": false,
          "description": "Any network bindings that are associated with the container.",
          "nested_params": [
            {
              "name": "bindIP",
              "type": "string",
              "required": false,
              "description": "The IP address that the container is bound to on the container instance.",
              "nested_params": []
            },
            {
              "name": "containerPort",
              "type": "integer",
              "required": false,
              "description": "The port number on the container that's used with the network binding.",
              "nested_params": []
            },
            {
              "name": "hostPort",
              "type": "integer",
              "required": false,
              "description": "The port number on the host that's used with the network binding.",
              "nested_params": []
            },
            {
              "name": "protocol",
              "type": "string",
              "required": false,
              "description": "The protocol used for the network binding.",
              "nested_params": []
            },
            {
              "name": "containerPortRange",
              "type": "string",
              "required": false,
              "description": "The port number range on the container that's bound to the dynamically mapped host port range. The following rules apply when you specify a containerPortRange:",
              "nested_params": []
            },
            {
              "name": "hostPortRange",
              "type": "string",
              "required": false,
              "description": "The port number range on the host that's used with the network binding. This is assigned is assigned by Docker and delivered by the Amazon ECS agent.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "reason",
          "type": "string",
          "required": false,
          "description": "The reason for the state change.",
          "nested_params": []
        },
        {
          "name": "status",
          "type": "string",
          "required": false,
          "description": "The status of the container.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "attachments",
      "type": "list",
      "required": true,
      "description": "Any attachments associated with the state change request. (dict) --- An object representing a change in state for a task attachment. The Amazon Resource Name (ARN) of the attachment. The status of the attachment.",
      "nested_params": [
        {
          "name": "attachmentArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the attachment.",
          "nested_params": []
        },
        {
          "name": "status",
          "type": "string",
          "required": false,
          "description": "The status of the attachment.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "managedAgents",
      "type": "list",
      "required": true,
      "description": "The details for the managed agent that's associated with the task. (dict) --- An object representing a change in state for a managed agent. The name of the container that's associated with the managed agent. The name of the managed agent. The status of the managed agent. reason (string) --- The reason for the status of the managed agent.",
      "nested_params": [
        {
          "name": "containerName",
          "type": "string",
          "required": false,
          "description": "The name of the container that's associated with the managed agent.",
          "nested_params": []
        },
        {
          "name": "managedAgentName",
          "type": "string",
          "required": false,
          "description": "The name of the managed agent.",
          "nested_params": []
        },
        {
          "name": "status",
          "type": "string",
          "required": false,
          "description": "The status of the managed agent.",
          "nested_params": []
        },
        {
          "name": "reason",
          "type": "string",
          "required": false,
          "description": "The reason for the status of the managed agent.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "pullStartedAt",
      "type": "datetime",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "pullStoppedAt",
      "type": "datetime",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "executionStoppedAt",
      "type": "datetime",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "acknowledgment",
          "type": "string",
          "description": "Acknowledgement of the state change.",
          "nested_items": []
        }
      ]
    }
  ]
}