{
  "method_name": "update_task_set",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ecs/client/update_task_set.html",
  "description": "Modifies a task set. This is used when a service uses the EXTERNAL deployment controller type. For more information, see Amazon ECS Deployment Types in the Amazon Elastic Container Service Developer Guide.",
  "parameters": [
    {
      "name": "cluster",
      "type": "string",
      "required": true,
      "description": "The short name or full Amazon Resource Name (ARN) of the cluster that hosts the service that the task set is found in.",
      "nested_params": []
    },
    {
      "name": "service",
      "type": "string",
      "required": true,
      "description": "The short name or full Amazon Resource Name (ARN) of the service that the task set is found in.",
      "nested_params": []
    },
    {
      "name": "taskSet",
      "type": "string",
      "required": true,
      "description": "The short name or full Amazon Resource Name (ARN) of the task set to update.",
      "nested_params": []
    },
    {
      "name": "scale",
      "type": "dict",
      "required": true,
      "description": "A floating-point percentage of the desired number of tasks to place and keep running in the task set. value (float) --- The value, specified as a percent total of a service's desiredCount, to scale the task set. Accepted values are numbers between 0 and 100. unit (string) --- The unit of measure for the scale value.",
      "nested_params": [
        {
          "name": "value",
          "type": "float",
          "required": false,
          "description": "The value, specified as a percent total of a service's desiredCount, to scale the task set. Accepted values are numbers between 0 and 100.",
          "nested_params": []
        },
        {
          "name": "unit",
          "type": "string",
          "required": false,
          "description": "The unit of measure for the scale value.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "id",
              "type": "string",
              "description": "The ID of the task set.",
              "nested_items": []
            },
            {
              "name": "taskSetArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the task set.",
              "nested_items": []
            },
            {
              "name": "serviceArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the service the task set exists in.",
              "nested_items": []
            },
            {
              "name": "clusterArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the cluster that the service that hosts the task set exists in.",
              "nested_items": []
            },
            {
              "name": "startedBy",
              "type": "string",
              "description": "The tag specified when a task set is started. If an CodeDeploy deployment created the task set, the startedBy parameter is CODE_DEPLOY. If an external deployment created the task set, the startedBy field isn't used.",
              "nested_items": []
            },
            {
              "name": "externalId",
              "type": "string",
              "description": "The external ID associated with the task set.",
              "nested_items": []
            },
            {
              "name": "status",
              "type": "string",
              "description": "The status of the task set. The following describes each state.",
              "nested_items": []
            },
            {
              "name": "taskDefinition",
              "type": "string",
              "description": "The task definition that the task set is using.",
              "nested_items": []
            },
            {
              "name": "computedDesiredCount",
              "type": "integer",
              "description": "The computed desired count for the task set. This is calculated by multiplying the service's desiredCount by the task set's scale percentage. The result is always rounded up. For example, if the computed desired count is 1.2, it rounds up to 2 tasks.",
              "nested_items": []
            },
            {
              "name": "pendingCount",
              "type": "integer",
              "description": "The number of tasks in the task set that are in the PENDING status during a deployment. A task in the PENDING state is preparing to enter the RUNNING state. A task set enters the PENDING status when it launches for the first time or when it's restarted after being in the STOPPED state.",
              "nested_items": []
            },
            {
              "name": "runningCount",
              "type": "integer",
              "description": "The number of tasks in the task set that are in the RUNNING status during a deployment. A task in the RUNNING state is running and ready for use.",
              "nested_items": []
            },
            {
              "name": "createdAt",
              "type": "datetime",
              "description": "The Unix timestamp for the time when the task set was created.",
              "nested_items": []
            },
            {
              "name": "updatedAt",
              "type": "datetime",
              "description": "The Unix timestamp for the time when the task set was last updated.",
              "nested_items": []
            },
            {
              "name": "launchType",
              "type": "string",
              "description": "The launch type the tasks in the task set are using. For more information, see Amazon ECS launch types in the Amazon Elastic Container Service Developer Guide.",
              "nested_items": []
            },
            {
              "name": "capacityProviderStrategy",
              "type": "list",
              "description": "The capacity provider strategy that are associated with the task set.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "capacityProvider",
                      "type": "string",
                      "description": "The short name of the capacity provider.",
                      "nested_items": []
                    },
                    {
                      "name": "weight",
                      "type": "integer",
                      "description": "The weight value designates the relative percentage of the total number of tasks launched that should use the specified capacity provider. The weight value is taken into consideration after the base value, if defined, is satisfied.",
                      "nested_items": []
                    },
                    {
                      "name": "base",
                      "type": "integer",
                      "description": "The base value designates how many tasks, at a minimum, to run on the specified capacity provider. Only one capacity provider in a capacity provider strategy can have a base defined. If no value is specified, the default value of 0 is used.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "platformVersion",
              "type": "string",
              "description": "The Fargate platform version where the tasks in the task set are running. A platform version is only specified for tasks run on Fargate. For more information, see Fargate platform versions in the Amazon Elastic Container Service Developer Guide.",
              "nested_items": []
            },
            {
              "name": "platformFamily",
              "type": "string",
              "description": "The operating system that your tasks in the set are running on. A platform family is specified only for tasks that use the Fargate launch type.",
              "nested_items": []
            },
            {
              "name": "networkConfiguration",
              "type": "dict",
              "description": "The network configuration for the task set.",
              "nested_items": [
                {
                  "name": "awsvpcConfiguration",
                  "type": "dict",
                  "description": "The VPC subnets and security groups that are associated with a task.",
                  "nested_items": [
                    {
                      "name": "subnets",
                      "type": "list",
                      "description": "The IDs of the subnets associated with the task or service. There's a limit of 16 subnets that can be specified.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "securityGroups",
                      "type": "list",
                      "description": "The IDs of the security groups associated with the task or service. If you don't specify a security group, the default security group for the VPC is used. There's a limit of 5 security groups that can be specified.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "assignPublicIp",
                      "type": "string",
                      "description": "Whether the task's elastic network interface receives a public IP address.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "When you use create-service or update-service, the default is DISABLED.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "When the service deploymentController is ECS, the value must be DISABLED.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "loadBalancers",
              "type": "list",
              "description": "Details on a load balancer that are used with a task set.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "targetGroupArn",
                      "type": "string",
                      "description": "The full Amazon Resource Name (ARN) of the Elastic Load Balancing target group or groups associated with a service or task set.",
                      "nested_items": []
                    },
                    {
                      "name": "loadBalancerName",
                      "type": "string",
                      "description": "The name of the load balancer to associate with the Amazon ECS service or task set.",
                      "nested_items": []
                    },
                    {
                      "name": "containerName",
                      "type": "string",
                      "description": "The name of the container (as it appears in a container definition) to associate with the load balancer.",
                      "nested_items": []
                    },
                    {
                      "name": "containerPort",
                      "type": "integer",
                      "description": "The port on the container to associate with the load balancer. This port must correspond to a containerPort in the task definition the tasks in the service are using. For tasks that use the EC2 launch type, the container instance they're launched on must allow ingress traffic on the hostPort of the port mapping.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "serviceRegistries",
              "type": "list",
              "description": "The details for the service discovery registries to assign to this task set. For more information, see Service discovery.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "registryArn",
                      "type": "string",
                      "description": "The Amazon Resource Name (ARN) of the service registry. The currently supported service registry is Cloud Map. For more information, see CreateService.",
                      "nested_items": []
                    },
                    {
                      "name": "port",
                      "type": "integer",
                      "description": "The port value used if your service discovery service specified an SRV record. This field might be used if both the awsvpc network mode and SRV records are used.",
                      "nested_items": []
                    },
                    {
                      "name": "containerName",
                      "type": "string",
                      "description": "The container name value to be used for your service discovery service. It's already specified in the task definition. If the task definition that your service task specifies uses the bridge or host network mode, you must specify a containerName and containerPort combination from the task definition. If the task definition that your service task specifies uses the awsvpc network mode and a type SRV DNS record is used, you must specify either a containerName and containerPort combination or a port value. However, you can't specify both.",
                      "nested_items": []
                    },
                    {
                      "name": "containerPort",
                      "type": "integer",
                      "description": "The port value to be used for your service discovery service. It's already specified in the task definition. If the task definition your service task specifies uses the bridge or host network mode, you must specify a containerName and containerPort combination from the task definition. If the task definition your service task specifies uses the awsvpc network mode and a type SRV DNS record is used, you must specify either a containerName and containerPort combination or a port value. However, you can't specify both.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "value",
                  "type": "float",
                  "description": "The value, specified as a percent total of a service's desiredCount, to scale the task set. Accepted values are numbers between 0 and 100.",
                  "nested_items": []
                },
                {
                  "name": "unit",
                  "type": "string",
                  "description": "The unit of measure for the scale value.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "stabilityStatus",
              "type": "string",
              "description": "The stability status. This indicates whether the task set has reached a steady state. If the following conditions are met, the task set are in STEADY_STATE:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "The task runningCount is equal to the computedDesiredCount.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "The pendingCount is 0.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "There are no tasks that are running on container instances in the DRAINING status.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "All tasks are reporting a healthy status from the load balancers, service discovery, and container health checks.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "stabilityStatusAt",
              "type": "datetime",
              "description": "The Unix timestamp for the time when the task set stability status was retrieved.",
              "nested_items": []
            },
            {
              "name": "tags",
              "type": "list",
              "description": "The metadata that you apply to the task set to help you categorize and organize them. Each tag consists of a key and an optional value. You define both.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "Maximum number of tags per resource - 50",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "For each resource, each tag key must be unique, and each tag key can have only one value.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Maximum key length - 128 Unicode characters in UTF-8",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Maximum value length - 256 Unicode characters in UTF-8",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "If your tagging schema is used across multiple services and resources, remember that other services may have restrictions on allowed characters. Generally allowed characters are: letters, numbers, and spaces representable in UTF-8, and the following characters: + - = . _ : / @.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Tag keys and values are case-sensitive.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Do not use aws:, AWS:, or any upper or lowercase combination of such as a prefix for either keys or values as it is reserved for Amazon Web Services use. You cannot edit or delete tag keys or values with this prefix. Tags with this prefix do not count against your tags per resource limit.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "fargateEphemeralStorage",
              "type": "dict",
              "description": "The Fargate ephemeral storage settings for the task set.",
              "nested_items": [
                {
                  "name": "kmsKeyId",
                  "type": "string",
                  "description": "Specify an Key Management Service key ID to encrypt the ephemeral storage for deployment.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}