{
  "method_name": "list_service_dependents",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/application-signals/client/list_service_dependents.html",
  "description": "Returns the list of dependents that invoked the specified service during the provided time range. Dependents include other services, CloudWatch Synthetics canaries, and clients that are instrumented with CloudWatch RUM app monitors.",
  "parameters": [
    {
      "name": "StartTime",
      "type": "datetime",
      "required": true,
      "description": "The start of the time period to retrieve information about. When used in a raw HTTP Query API, it is formatted as be epoch time in seconds. For example: 1698778057 Your requested start time will be rounded to the nearest hour.",
      "nested_params": []
    },
    {
      "name": "EndTime",
      "type": "datetime",
      "required": true,
      "description": "The end of the time period to retrieve information about. When used in a raw HTTP Query API, it is formatted as be epoch time in seconds. For example: 1698778057 Your requested start time will be rounded to the nearest hour.",
      "nested_params": []
    },
    {
      "name": "KeyAttributes",
      "type": "dict",
      "required": true,
      "description": "Use this field to specify which service you want to retrieve information for. You must specify at least the Type, Name, and Environment attributes. This is a string-to-string map. It can include the following fields. Type designates the type of object this is. ResourceType specifies the type of the resource. This field is used only when the value of the Type field is Resource or AWS::Resource. Name specifies the name of the object. This is used only if the value of the Type field is Service, RemoteService, or AWS::Service. Identifier identifies the resource objects of this resource. This is used only if the value of the Type field is Resource or AWS::Resource. Environment specifies the location where this object is hosted, or what it belongs to. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "StartTime",
          "type": "datetime",
          "description": "The start of the time period that the returned information applies to. When used in a raw HTTP Query API, it is formatted as be epoch time in seconds. For example: 1698778057",
          "nested_items": []
        },
        {
          "name": "EndTime",
          "type": "datetime",
          "description": "The end of the time period that the returned information applies to. When used in a raw HTTP Query API, it is formatted as be epoch time in seconds. For example: 1698778057",
          "nested_items": []
        },
        {
          "name": "ServiceDependents",
          "type": "list",
          "description": "An array, where each object in the array contains information about one of the dependents of this service.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "OperationName",
                  "type": "string",
                  "description": "If the invoked entity is an operation on an entity, the name of that dependent operation is displayed here.",
                  "nested_items": []
                },
                {
                  "name": "DependentKeyAttributes",
                  "type": "dict",
                  "description": "This is a string-to-string map. It can include the following fields.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "Type designates the type of object this is.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "ResourceType specifies the type of the resource. This field is used only when the value of the Type field is Resource or AWS::Resource.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Name specifies the name of the object. This is used only if the value of the Type field is Service, RemoteService, or AWS::Service.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Identifier identifies the resource objects of this resource. This is used only if the value of the Type field is Resource or AWS::Resource.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Environment specifies the location where this object is hosted, or what it belongs to.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "DependentOperationName",
                  "type": "string",
                  "description": "If the dependent invoker was a service that invoked it from an operation, the name of that dependent operation is displayed here.",
                  "nested_items": []
                },
                {
                  "name": "MetricReferences",
                  "type": "list",
                  "description": "An array of structures that each contain information about one metric associated with this service dependent that was discovered by Application Signals.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Namespace",
                          "type": "string",
                          "description": "The namespace of the metric. For more information, see CloudWatchNamespaces.",
                          "nested_items": []
                        },
                        {
                          "name": "MetricType",
                          "type": "string",
                          "description": "Used to display the appropriate statistics in the CloudWatch console.",
                          "nested_items": []
                        },
                        {
                          "name": "Dimensions",
                          "type": "list",
                          "description": "An array of one or more dimensions that further define the metric. For more information, see CloudWatchDimensions.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "dict",
                              "description": "",
                              "nested_items": [
                                {
                                  "name": "Name",
                                  "type": "string",
                                  "description": "The name of the dimension. Dimension names must contain only ASCII characters, must include at least one non-whitespace character, and cannot start with a colon ( :). ASCII control characters are not supported as part of dimension names.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Value",
                                  "type": "string",
                                  "description": "The value of the dimension. Dimension values must contain only ASCII characters and must include at least one non-whitespace character. ASCII control characters are not supported as part of dimension values.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "name": "MetricName",
                          "type": "string",
                          "description": "The name of the metric.",
                          "nested_items": []
                        },
                        {
                          "name": "AccountId",
                          "type": "string",
                          "description": "Amazon Web Services account ID.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "Include this value in your next use of this API to get next set of service dependents.",
          "nested_items": []
        }
      ]
    }
  ]
}