{
  "method_name": "tag_resource",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ecr-public/client/tag_resource.html",
  "description": "Associates the specified tags to a resource with the specified resourceArn. If existing tags on a resource aren't specified in the request parameters, they aren't changed. When a resource is deleted, the tags associated with that resource are also deleted.",
  "parameters": [
    {
      "name": "resourceArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the resource to add tags to. Currently, the supported resource is an Amazon ECR Public repository.",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "list",
      "required": true,
      "description": "The tags to add to the resource. A tag is an array of key-value pairs. Tag keys can have a maximum character length of 128 characters, and tag values can have a maximum length of 256 characters. (dict) --- The metadata that you apply to a resource to help you categorize and organize them. Each tag consists of a key and an optional value. You define both. Key (string) --- One part of a key-value pair that make up a tag. A key is a general label that acts like a category for more specific tag values. Value (string) --- The optional part of a key-value pair that make up a tag. A value acts as a descriptor within a tag category (key).",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "One part of a key-value pair that make up a tag. A key is a general label that acts like a category for more specific tag values.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The optional part of a key-value pair that make up a tag. A value acts as a descriptor within a tag category (key).",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}