{
  "method_name": "create_load_balancer",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/elb/client/create_load_balancer.html",
  "description": "Creates a Classic Load Balancer. You can add listeners, security groups, subnets, and tags when you create your load balancer, or you can add them later using  CreateLoadBalancerListeners,  ApplySecurityGroupsToLoadBalancer,  AttachLoadBalancerToSubnets, and  AddTags. To describe your current load balancers, see  DescribeLoadBalancers. When you are finished with a load balancer, you can delete it using  DeleteLoadBalancer. You can create up to 20 load balancers per region per account. You can request an increase for the number of load balancers for your account. For more information, see Limits for Your Classic Load Balancer in the Classic Load Balancers Guide.",
  "parameters": [
    {
      "name": "LoadBalancerName",
      "type": "string",
      "required": true,
      "description": "The name of the load balancer. This name must be unique within your set of load balancers for the region, must have a maximum of 32 characters, must contain only alphanumeric characters or hyphens, and cannot begin or end with a hyphen.",
      "nested_params": []
    },
    {
      "name": "Listeners",
      "type": "list",
      "required": true,
      "description": "The listeners. For more information, see Listeners for Your Classic Load Balancer in the Classic Load Balancers Guide. (dict) --- Information about a listener. For information about the protocols and the ports supported by Elastic Load Balancing, see Listeners for Your Classic Load Balancer in the Classic Load Balancers Guide. The load balancer transport protocol to use for routing: HTTP, HTTPS, TCP, or SSL. The port on which the load balancer is listening. On EC2-VPC, you can specify any port from the range 1-65535. On EC2-Classic, you can specify any port from the following list: 25, 80, 443, 465, 587, 1024-65535. InstanceProtocol (string) --- The protocol to use for routing traffic to instances: HTTP, HTTPS, TCP, or SSL. If the front-end protocol is TCP or SSL, the back-end protocol must be TCP or SSL. If the front-end protocol is HTTP or HTTPS, the back-end protocol must be HTTP or HTTPS. If there is another listener with the same InstancePort whose InstanceProtocol is secure, (HTTPS or SSL), the listener's InstanceProtocol must also be secure. If there is another listener with the same InstancePort whose InstanceProtocol is HTTP or TCP, the listener's InstanceProtocol must be HTTP or TCP. The port on which the instance is listening. SSLCertificateId (string) --- The Amazon Resource Name (ARN) of the server certificate.",
      "nested_params": [
        {
          "name": "Protocol",
          "type": "string",
          "required": false,
          "description": "The load balancer transport protocol to use for routing: HTTP, HTTPS, TCP, or SSL.",
          "nested_params": []
        },
        {
          "name": "LoadBalancerPort",
          "type": "integer",
          "required": false,
          "description": "The port on which the load balancer is listening. On EC2-VPC, you can specify any port from the range 1-65535. On EC2-Classic, you can specify any port from the following list: 25, 80, 443, 465, 587, 1024-65535.",
          "nested_params": []
        },
        {
          "name": "InstanceProtocol",
          "type": "string",
          "required": false,
          "description": "The protocol to use for routing traffic to instances: HTTP, HTTPS, TCP, or SSL. If the front-end protocol is TCP or SSL, the back-end protocol must be TCP or SSL. If the front-end protocol is HTTP or HTTPS, the back-end protocol must be HTTP or HTTPS. If there is another listener with the same InstancePort whose InstanceProtocol is secure, (HTTPS or SSL), the listener's InstanceProtocol must also be secure. If there is another listener with the same InstancePort whose InstanceProtocol is HTTP or TCP, the listener's InstanceProtocol must be HTTP or TCP.",
          "nested_params": []
        },
        {
          "name": "InstancePort",
          "type": "integer",
          "required": false,
          "description": "The port on which the instance is listening.",
          "nested_params": []
        },
        {
          "name": "SSLCertificateId",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the server certificate.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "AvailabilityZones",
      "type": "list",
      "required": false,
      "description": "One or more Availability Zones from the same region as the load balancer. You must specify at least one Availability Zone. You can add more Availability Zones after you create the load balancer using  EnableAvailabilityZonesForLoadBalancer. (string) ---",
      "nested_params": []
    },
    {
      "name": "Subnets",
      "type": "list",
      "required": false,
      "description": "The IDs of the subnets in your VPC to attach to the load balancer. Specify one subnet per Availability Zone specified in AvailabilityZones. (string) ---",
      "nested_params": []
    },
    {
      "name": "SecurityGroups",
      "type": "list",
      "required": false,
      "description": "The IDs of the security groups to assign to the load balancer. (string) ---",
      "nested_params": []
    },
    {
      "name": "Scheme",
      "type": "string",
      "required": false,
      "description": "The type of a load balancer. Valid only for load balancers in a VPC. By default, Elastic Load Balancing creates an Internet-facing load balancer with a DNS name that resolves to public IP addresses. For more information about Internet-facing and Internal load balancers, see Load Balancer Scheme in the Elastic Load Balancing User Guide. Specify internal to create a load balancer with a DNS name that resolves to private IP addresses.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "A list of tags to assign to the load balancer. For more information about tagging your load balancer, see Tag Your Classic Load Balancer in the Classic Load Balancers Guide. (dict) --- Information about a tag. The key of the tag. Value (string) --- The value of the tag.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key of the tag.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value of the tag.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "DNSName",
          "type": "string",
          "description": "The DNS name of the load balancer.",
          "nested_items": []
        }
      ]
    }
  ]
}