{
  "method_name": "register_instances_with_load_balancer",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/elb/client/register_instances_with_load_balancer.html",
  "description": "Adds the specified instances to the specified load balancer. The instance must be a running instance in the same network as the load balancer (EC2-Classic or the same VPC). If you have EC2-Classic instances and a load balancer in a VPC with ClassicLink enabled, you can link the EC2-Classic instances to that VPC and then register the linked EC2-Classic instances with the load balancer in the VPC. Note that RegisterInstanceWithLoadBalancer completes when the request has been registered. Instance registration takes a little time to complete. To check the state of the registered instances, use  DescribeLoadBalancers or  DescribeInstanceHealth. After the instance is registered, it starts receiving traffic and requests from the load balancer. Any instance that is not in one of the Availability Zones registered for the load balancer is moved to the OutOfService state. If an Availability Zone is added to the load balancer later, any instances registered with the load balancer move to the InService state. To deregister instances from a load balancer, use  DeregisterInstancesFromLoadBalancer. For more information, see Register or De-Register EC2 Instances in the Classic Load Balancers Guide.",
  "parameters": [
    {
      "name": "LoadBalancerName",
      "type": "string",
      "required": true,
      "description": "The name of the load balancer.",
      "nested_params": []
    },
    {
      "name": "Instances",
      "type": "list",
      "required": true,
      "description": "The IDs of the instances. (dict) --- The ID of an EC2 instance. InstanceId (string) --- The instance ID.",
      "nested_params": [
        {
          "name": "InstanceId",
          "type": "string",
          "required": false,
          "description": "The instance ID.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Instances",
          "type": "list",
          "description": "The updated list of instances for the load balancer.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "InstanceId",
                  "type": "string",
                  "description": "The instance ID.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}