{
  "method_name": "put_events",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/personalize-events/client/put_events.html",
  "description": "Records item interaction event data. For more information see Recording item interaction events.",
  "parameters": [
    {
      "name": "trackingId",
      "type": "string",
      "required": true,
      "description": "The tracking ID for the event. The ID is generated by a call to the CreateEventTracker API.",
      "nested_params": []
    },
    {
      "name": "userId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "sessionId",
      "type": "string",
      "required": true,
      "description": "The session ID associated with the user's visit. Your application generates the sessionId when a user first visits your website or uses your application. Amazon Personalize uses the sessionId to associate events with the user before they log in. For more information, see Recording item interaction events.",
      "nested_params": []
    },
    {
      "name": "eventList",
      "type": "list",
      "required": true,
      "description": "A list of event data from the session. (dict) --- Represents item interaction event information sent using the PutEvents API. eventId (string) --- An ID associated with the event. If an event ID is not provided, Amazon Personalize generates a unique ID for the event. An event ID is not used as an input to the model. Amazon Personalize uses the event ID to distinguish unique events. Any subsequent events after the first with the same event ID are not used in model training. The type of event, such as click or download. This property corresponds to the EVENT_TYPE field of your Item interactions dataset's schema and depends on the types of events you are tracking. eventValue (float) --- The event value that corresponds to the EVENT_VALUE field of the Item interactions schema. itemId (string) --- The item ID key that corresponds to the ITEM_ID field of the Item interactions dataset's schema. properties (string) --- A string map of event-specific data that you might choose to record. For example, if a user rates a movie on your site, other than movie ID ( itemId) and rating ( eventValue) , you might also send the number of movie ratings made by the user. Each item in the map consists of a key-value pair. For example, {\"numberOfRatings\": \"12\"} The keys use camel case names that match the fields in the Item interactions dataset's schema. In the above example, the numberOfRatings would match the --\u0098NUMBER_OF_RATINGS' field defined in the Item interactions dataset's schema. The following can't be included as a keyword for properties (case insensitive). userId sessionId eventType timestamp recommendationId impression The timestamp (in Unix time) on the client side when the event occurred. recommendationId (string) --- The ID of the list of recommendations that contains the item the user interacted with. Provide a recommendationId to have Amazon Personalize implicitly record the recommendations you show your user as impressions data. Or provide a recommendationId if you use a metric attribution to measure the impact of recommendations. For more information on recording impressions data, see Recording impressions data. For more information on creating a metric attribution see Measuring impact of recommendations. impression (list) --- A list of item IDs that represents the sequence of items you have shown the user. For example, [\"itemId1\", \"itemId2\", \"itemId3\"]. Provide a list of items to manually record impressions data for an event. (string) --- metricAttribution (dict) --- Contains information about the metric attribution associated with an event. For more information about metric attributions, see Measuring impact of recommendations. The source of the event, such as a third party.",
      "nested_params": [
        {
          "name": "eventId",
          "type": "string",
          "required": false,
          "description": "An ID associated with the event. If an event ID is not provided, Amazon Personalize generates a unique ID for the event. An event ID is not used as an input to the model. Amazon Personalize uses the event ID to distinguish unique events. Any subsequent events after the first with the same event ID are not used in model training.",
          "nested_params": []
        },
        {
          "name": "eventType",
          "type": "string",
          "required": false,
          "description": "The type of event, such as click or download. This property corresponds to the EVENT_TYPE field of your Item interactions dataset's schema and depends on the types of events you are tracking.",
          "nested_params": []
        },
        {
          "name": "eventValue",
          "type": "float",
          "required": false,
          "description": "The event value that corresponds to the EVENT_VALUE field of the Item interactions schema.",
          "nested_params": []
        },
        {
          "name": "itemId",
          "type": "string",
          "required": false,
          "description": "The item ID key that corresponds to the ITEM_ID field of the Item interactions dataset's schema.",
          "nested_params": []
        },
        {
          "name": "properties",
          "type": "string",
          "required": false,
          "description": "A string map of event-specific data that you might choose to record. For example, if a user rates a movie on your site, other than movie ID ( itemId) and rating ( eventValue) , you might also send the number of movie ratings made by the user. Each item in the map consists of a key-value pair. For example, {\"numberOfRatings\": \"12\"} The keys use camel case names that match the fields in the Item interactions dataset's schema. In the above example, the numberOfRatings would match the --\u0098NUMBER_OF_RATINGS' field defined in the Item interactions dataset's schema. The following can't be included as a keyword for properties (case insensitive).",
          "nested_params": []
        },
        {
          "name": "sentAt",
          "type": "datetime",
          "required": false,
          "description": "The timestamp (in Unix time) on the client side when the event occurred.",
          "nested_params": []
        },
        {
          "name": "recommendationId",
          "type": "string",
          "required": false,
          "description": "The ID of the list of recommendations that contains the item the user interacted with. Provide a recommendationId to have Amazon Personalize implicitly record the recommendations you show your user as impressions data. Or provide a recommendationId if you use a metric attribution to measure the impact of recommendations. For more information on recording impressions data, see Recording impressions data. For more information on creating a metric attribution see Measuring impact of recommendations.",
          "nested_params": []
        },
        {
          "name": "impression",
          "type": "list",
          "required": false,
          "description": "A list of item IDs that represents the sequence of items you have shown the user. For example, [\"itemId1\", \"itemId2\", \"itemId3\"]. Provide a list of items to manually record impressions data for an event. For more information on recording impressions data, see Recording impressions data.",
          "nested_params": []
        },
        {
          "name": "metricAttribution",
          "type": "dict",
          "required": false,
          "description": "Contains information about the metric attribution associated with an event. For more information about metric attributions, see Measuring impact of recommendations.",
          "nested_params": [
            {
              "name": "eventAttributionSource",
              "type": "string",
              "required": false,
              "description": "The source of the event, such as a third party.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}