{
  "method_name": "create_platform_endpoint",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sns/client/create_platform_endpoint.html",
  "description": "Creates an endpoint for a device and mobile app on one of the supported push notification services, such as GCM (Firebase Cloud Messaging) and APNS. CreatePlatformEndpoint requires the PlatformApplicationArn that is returned from CreatePlatformApplication. You can use the returned EndpointArn to send a message to a mobile app or by the Subscribe action for subscription to a topic. The CreatePlatformEndpoint action is idempotent, so if the requester already owns an endpoint with the same device token and attributes, that endpoint's ARN is returned without creating a new endpoint. For more information, see Using Amazon SNS Mobile Push Notifications. When using CreatePlatformEndpoint with Baidu, two attributes must be provided: ChannelId and UserId. The token field must also contain the ChannelId. For more information, see Creating an Amazon SNS Endpoint for Baidu.",
  "parameters": [
    {
      "name": "PlatformApplicationArn",
      "type": "string",
      "required": true,
      "description": "PlatformApplicationArn returned from CreatePlatformApplication is used to create a an endpoint.",
      "nested_params": []
    },
    {
      "name": "Token",
      "type": "string",
      "required": true,
      "description": "Unique identifier created by the notification service for an app on a device. The specific name for Token will vary, depending on which notification service is being used. For example, when using APNS as the notification service, you need the device token. Alternatively, when using GCM (Firebase Cloud Messaging) or ADM, the device token equivalent is called the registration ID.",
      "nested_params": []
    },
    {
      "name": "CustomUserData",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Attributes",
      "type": "dict",
      "required": false,
      "description": "For a list of attributes, see SetEndpointAttributes. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "EndpointArn",
          "type": "string",
          "description": "EndpointArn returned from CreateEndpoint action.",
          "nested_items": []
        }
      ]
    }
  ]
}