{
  "method_name": "set_topic_attributes",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sns/client/set_topic_attributes.html",
  "description": "Allows a topic owner to set an attribute of the topic to a new value.",
  "parameters": [
    {
      "name": "TopicArn",
      "type": "string",
      "required": true,
      "description": "The ARN of the topic to modify.",
      "nested_params": []
    },
    {
      "name": "AttributeName",
      "type": "string",
      "required": true,
      "description": "A map of attributes with their corresponding values. The following lists the names, descriptions, and values of the special request parameters that the SetTopicAttributes action uses: ApplicationSuccessFeedbackRoleArn --- Indicates failed message delivery status for an Amazon SNS topic that is subscribed to a platform application endpoint. DeliveryPolicy --- The policy that defines how Amazon SNS retries failed deliveries to HTTP/S endpoints. DisplayName --- The display name to use for a topic with SMS subscriptions. Policy --- The policy that defines who can access your topic. By default, only the topic owner can publish or subscribe to the topic. TracingConfig --- Tracing mode of an Amazon SNS topic. By default TracingConfig is set to PassThrough, and the topic passes through the tracing header it receives from an Amazon SNS publisher to its subscriptions. If set to Active, Amazon SNS will vend X-Ray segment data to topic owner account if the sampled flag in the tracing header is true. This is only supported on standard topics. HTTP HTTPSuccessFeedbackRoleArn --- Indicates successful message delivery status for an Amazon SNS topic that is subscribed to an HTTP endpoint. HTTPSuccessFeedbackSampleRate --- Indicates percentage of successful messages to sample for an Amazon SNS topic that is subscribed to an HTTP endpoint. HTTPFailureFeedbackRoleArn --- Indicates failed message delivery status for an Amazon SNS topic that is subscribed to an HTTP endpoint. Amazon Kinesis Data Firehose FirehoseSuccessFeedbackRoleArn --- Indicates successful message delivery status for an Amazon SNS topic that is subscribed to an Amazon Kinesis Data Firehose endpoint. FirehoseSuccessFeedbackSampleRate --- Indicates percentage of successful messages to sample for an Amazon SNS topic that is subscribed to an Amazon Kinesis Data Firehose endpoint. FirehoseFailureFeedbackRoleArn --- Indicates failed message delivery status for an Amazon SNS topic that is subscribed to an Amazon Kinesis Data Firehose endpoint. Lambda LambdaSuccessFeedbackRoleArn --- Indicates successful message delivery status for an Amazon SNS topic that is subscribed to an Lambda endpoint. LambdaSuccessFeedbackSampleRate --- Indicates percentage of successful messages to sample for an Amazon SNS topic that is subscribed to an Lambda endpoint. LambdaFailureFeedbackRoleArn --- Indicates failed message delivery status for an Amazon SNS topic that is subscribed to an Lambda endpoint. Platform application endpoint ApplicationSuccessFeedbackRoleArn --- Indicates successful message delivery status for an Amazon SNS topic that is subscribed to an Amazon Web Services application endpoint. ApplicationSuccessFeedbackSampleRate --- Indicates percentage of successful messages to sample for an Amazon SNS topic that is subscribed to an Amazon Web Services application endpoint. ApplicationFailureFeedbackRoleArn --- Indicates failed message delivery status for an Amazon SNS topic that is subscribed to an Amazon Web Services application endpoint. Amazon SQS SQSSuccessFeedbackRoleArn --- Indicates successful message delivery status for an Amazon SNS topic that is subscribed to an Amazon SQS endpoint. SQSSuccessFeedbackSampleRate --- Indicates percentage of successful messages to sample for an Amazon SNS topic that is subscribed to an Amazon SQS endpoint. SQSFailureFeedbackRoleArn --- Indicates failed message delivery status for an Amazon SNS topic that is subscribed to an Amazon SQS endpoint. The following attribute applies only to server-side-encryption: KmsMasterKeyId --- The ID of an Amazon Web Services managed customer master key (CMK) for Amazon SNS or a custom CMK. For more information, see Key Terms. For more examples, see KeyId in the Key Management Service API Reference. SignatureVersion --- The signature version corresponds to the hashing algorithm used while creating the signature of the notifications, subscription confirmations, or unsubscribe confirmation messages sent by Amazon SNS. By default, SignatureVersion is set to 1. The following attribute applies only to FIFO topics: ArchivePolicy --- The policy that sets the retention period for messages stored in the message archive of an Amazon SNS FIFO topic. ContentBasedDeduplication --- Enables content-based deduplication for FIFO topics. By default, ContentBasedDeduplication is set to false. If you create a FIFO topic and this attribute is false, you must specify a value for the MessageDeduplicationId parameter for the Publish action. When you set ContentBasedDeduplication to true, Amazon SNS uses a SHA-256 hash to generate the MessageDeduplicationId using the body of the message (but not the attributes of the message). (Optional) To override the generated value, you can specify a value for the MessageDeduplicationId parameter for the Publish action. FifoThroughputScope --- Enables higher throughput for your FIFO topic by adjusting the scope of deduplication. This attribute has two possible values: Topic --- The scope of message deduplication is across the entire topic. This is the default value and maintains existing behavior, with a maximum throughput of 3000 messages per second or 20MB per second, whichever comes first. MessageGroup --- The scope of deduplication is within each individual message group, which enables higher throughput per topic subject to regional quotas. For more information on quotas or to request an increase, see Amazon SNS service quotas in the Amazon Web Services General Reference.",
      "nested_params": []
    },
    {
      "name": "AttributeValue",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}