{
  "method_name": "put_configuration_recorder",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/config/client/put_configuration_recorder.html",
  "description": "Creates or updates the customer managed configuration recorder. You can use this operation to create a new customer managed configuration recorder or to update the roleARN and the recordingGroup for an existing customer managed configuration recorder. To start the customer managed configuration recorder and begin recording configuration changes for the resource types you specify, use the StartConfigurationRecorder operation. For more information, see **Working with the Configuration Recorder** in the Config Developer Guide.",
  "parameters": [
    {
      "name": "ConfigurationRecorder",
      "type": "dict",
      "required": true,
      "description": "An object for the configuration recorder. A configuration recorder records configuration changes for the resource types in scope. arn (string) --- The Amazon Resource Name (ARN) of the specified configuration recorder. name (string) --- The name of the configuration recorder. For customer managed configuration recorders, Config automatically assigns the name of 'default' when creating a configuration recorder if you do not specify a name at creation time. For service-linked configuration recorders, Config automatically assigns a name that has the prefix ' AWS' to a new service-linked configuration recorder. roleARN (string) --- The Amazon Resource Name (ARN) of the IAM role assumed by Config and used by the specified configuration recorder. recordingGroup (dict) --- Specifies which resource types are in scope for the configuration recorder to record. allSupported (boolean) --- Specifies whether Config records configuration changes for all supported resource types, excluding the global IAM resource types. If you set this field to true, when Config adds support for a new resource type, Config starts recording resources of that type automatically. If you set this field to true, you cannot enumerate specific resource types to record in the resourceTypes field of RecordingGroup, or to exclude in the resourceTypes field of ExclusionByResourceTypes. includeGlobalResourceTypes (boolean) --- This option is a bundle which only applies to the global IAM resource types: IAM users, groups, roles, and customer managed policies. These global IAM resource types can only be recorded by Config in Regions where Config was available before February 2022. You cannot be record the global IAM resouce types in Regions supported by Config after February 2022. For a list of those Regions, see Recording Amazon Web Services Resources | Global Resources. resourceTypes (list) --- A comma-separated list that specifies which resource types Config records. For a list of valid resourceTypes values, see the Resource Type Value column in Supported Amazon Web Services resource Types in the Config developer guide. (string) --- exclusionByResourceTypes (dict) --- An object that specifies how Config excludes resource types from being recorded by the configuration recorder. resourceTypes (list) --- A comma-separated list of resource types to exclude from recording by the configuration recorder. (string) --- recordingStrategy (dict) --- An object that specifies the recording strategy for the configuration recorder. If you set the useOnly field of RecordingStrategy to ALL_SUPPORTED_RESOURCE_TYPES, Config records configuration changes for all supported resource types, excluding the global IAM resource types. You also must set the allSupported field of RecordingGroup to true. When Config adds support for a new resource type, Config automatically starts recording resources of that type. If you set the useOnly field of RecordingStrategy to INCLUSION_BY_RESOURCE_TYPES, Config records configuration changes for only the resource types you specify in the resourceTypes field of RecordingGroup. If you set the useOnly field of RecordingStrategy to EXCLUSION_BY_RESOURCE_TYPES, Config records configuration changes for all supported resource types except the resource types that you specify to exclude from being recorded in the resourceTypes field of ExclusionByResourceTypes. useOnly (string) --- The recording strategy for the configuration recorder. If you set this option to ALL_SUPPORTED_RESOURCE_TYPES, Config records configuration changes for all supported resource types, excluding the global IAM resource types. For a list of supported resource types, see Supported Resource Types in the Config developer guide. If you set this option to INCLUSION_BY_RESOURCE_TYPES, Config records configuration changes for only the resource types that you specify in the resourceTypes field of RecordingGroup. If you set this option to EXCLUSION_BY_RESOURCE_TYPES, Config records configuration changes for all supported resource types, except the resource types that you specify to exclude from being recorded in the resourceTypes field of ExclusionByResourceTypes. recordingMode (dict) --- Specifies the default recording frequency for the configuration recorder. Config supports Continuous recording and Daily recording. Continuous recording allows you to record configuration changes continuously whenever a change occurs. Daily recording allows you to receive a configuration item (CI) representing the most recent state of your resources over the last 24-hour period, only if it's different from the previous CI recorded. You can also override the recording frequency for specific resource types. The default recording frequency that Config uses to record configuration changes. recordingModeOverrides (list) --- An array of recordingModeOverride objects for you to specify your overrides for the recording mode. The recordingModeOverride object in the recordingModeOverrides array consists of three fields: a description, the new recordingFrequency, and an array of resourceTypes to override. (dict) --- An object for you to specify your overrides for the recording mode. description (string) --- A description that you provide for the override. A comma-separated list that specifies which resource types Config includes in the override. (string) --- The recording frequency that will be applied to all the resource types specified in the override. recordingScope (string) --- Specifies whether the ConfigurationItems in scope for the specified configuration recorder are recorded for free ( INTERNAL) or if it impacts the costs to your bill ( PAID). servicePrincipal (string) --- For service-linked configuration recorders, specifies the linked Amazon Web Services service for the configuration recorder.",
      "nested_params": [
        {
          "name": "arn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the specified configuration recorder.",
          "nested_params": []
        },
        {
          "name": "name",
          "type": "string",
          "required": false,
          "description": "The name of the configuration recorder. For customer managed configuration recorders, Config automatically assigns the name of 'default' when creating a configuration recorder if you do not specify a name at creation time. For service-linked configuration recorders, Config automatically assigns a name that has the prefix ' AWS' to a new service-linked configuration recorder.",
          "nested_params": []
        },
        {
          "name": "roleARN",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the IAM role assumed by Config and used by the specified configuration recorder.",
          "nested_params": []
        },
        {
          "name": "recordingGroup",
          "type": "dict",
          "required": false,
          "description": "Specifies which resource types are in scope for the configuration recorder to record.",
          "nested_params": [
            {
              "name": "allSupported",
              "type": "boolean",
              "required": false,
              "description": "Specifies whether Config records configuration changes for all supported resource types, excluding the global IAM resource types. If you set this field to true, when Config adds support for a new resource type, Config starts recording resources of that type automatically. If you set this field to true, you cannot enumerate specific resource types to record in the resourceTypes field of RecordingGroup, or to exclude in the resourceTypes field of ExclusionByResourceTypes.",
              "nested_params": []
            },
            {
              "name": "includeGlobalResourceTypes",
              "type": "boolean",
              "required": false,
              "description": "This option is a bundle which only applies to the global IAM resource types: IAM users, groups, roles, and customer managed policies. These global IAM resource types can only be recorded by Config in Regions where Config was available before February 2022. You cannot be record the global IAM resouce types in Regions supported by Config after February 2022. For a list of those Regions, see Recording Amazon Web Services Resources | Global Resources.",
              "nested_params": []
            },
            {
              "name": "resourceTypes",
              "type": "list",
              "required": false,
              "description": "A comma-separated list that specifies which resource types Config records.",
              "nested_params": []
            },
            {
              "name": "exclusionByResourceTypes",
              "type": "dict",
              "required": false,
              "description": "An object that specifies how Config excludes resource types from being recorded by the configuration recorder.",
              "nested_params": [
                {
                  "name": "resourceTypes",
                  "type": "list",
                  "required": false,
                  "description": "A comma-separated list of resource types to exclude from recording by the configuration recorder.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "recordingStrategy",
              "type": "dict",
              "required": false,
              "description": "An object that specifies the recording strategy for the configuration recorder.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "recordingMode",
          "type": "dict",
          "required": false,
          "description": "Specifies the default recording frequency for the configuration recorder. Config supports Continuous recording and Daily recording.",
          "nested_params": []
        },
        {
          "name": "recordingScope",
          "type": "string",
          "required": false,
          "description": "Specifies whether the ConfigurationItems in scope for the specified configuration recorder are recorded for free ( INTERNAL) or if it impacts the costs to your bill ( PAID).",
          "nested_params": []
        },
        {
          "name": "servicePrincipal",
          "type": "string",
          "required": false,
          "description": "For service-linked configuration recorders, specifies the linked Amazon Web Services service for the configuration recorder.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": false,
      "description": "The tags for the customer managed configuration recorder. Each tag consists of a key and an optional value, both of which you define. (dict) --- The tags for the resource. The metadata that you apply to a resource to help you categorize and organize them. Tag keys can have a maximum character length of 128 characters, and tag values can have a maximum length of 256 characters. Key (string) --- One part of a key-value pair that make up a tag. A key is a general label that acts like a category for more specific tag values. Value (string) --- The optional part of a key-value pair that make up a tag. A value acts as a descriptor within a tag category (key).",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "One part of a key-value pair that make up a tag. A key is a general label that acts like a category for more specific tag values.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The optional part of a key-value pair that make up a tag. A value acts as a descriptor within a tag category (key).",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}