{
  "method_name": "synthesize_speech",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/polly/client/synthesize_speech.html",
  "description": "Synthesizes UTF-8 input, plain text or SSML, to a stream of bytes. SSML input must be valid, well-formed SSML. Some alphabets might not be available with all the voices (for example, Cyrillic might not be read at all by English voices) unless phoneme mapping is used. For more information, see How it Works.",
  "parameters": [
    {
      "name": "Engine",
      "type": "string",
      "required": false,
      "description": "Specifies the engine ( standard, neural, long-form, or generative) for Amazon Polly to use when processing input text for speech synthesis. Provide an engine that is supported by the voice you select. If you don't provide an engine, the standard engine is selected by default. If a chosen voice isn't supported by the standard engine, this will result in an error. For information on Amazon Polly voices and which voices are available for each engine, see Available Voices. Type: String Valid Values: standard | neural | long-form | generative Required: Yes.",
      "nested_params": []
    },
    {
      "name": "LanguageCode",
      "type": "string",
      "required": false,
      "description": "Optional language code for the Synthesize Speech request. This is only necessary if using a bilingual voice, such as Aditi, which can be used for either Indian English (en-IN) or Hindi (hi-IN). If a bilingual voice is used and no language code is specified, Amazon Polly uses the default language of the bilingual voice. The default language for any voice is the one returned by the DescribeVoices operation for the LanguageCode parameter. For example, if no language code is specified, Aditi will use Indian English rather than Hindi.",
      "nested_params": []
    },
    {
      "name": "LexiconNames",
      "type": "list",
      "required": false,
      "description": "List of one or more pronunciation lexicon names you want the service to apply during synthesis. Lexicons are applied only if the language of the lexicon is the same as the language of the voice. For information about storing lexicons, see PutLexicon. (string) ---",
      "nested_params": []
    },
    {
      "name": "OutputFormat",
      "type": "string",
      "required": true,
      "description": "The format in which the returned output will be encoded. For audio stream, this will be mp3, ogg_vorbis, or pcm. For speech marks, this will be json. When pcm is used, the content returned is audio/pcm in a signed 16-bit, 1 channel (mono), little-endian format.",
      "nested_params": []
    },
    {
      "name": "SampleRate",
      "type": "string",
      "required": false,
      "description": "The audio frequency specified in Hz. The valid values for mp3 and ogg_vorbis are '8000', '16000', '22050', and '24000'. The default value for standard voices is '22050'. The default value for neural voices is '24000'. The default value for long-form voices is '24000'. The default value for generative voices is '24000'. Valid values for pcm are '8000' and '16000' The default value is '16000'.",
      "nested_params": []
    },
    {
      "name": "SpeechMarkTypes",
      "type": "list",
      "required": false,
      "description": "The type of speech marks returned for the input text. (string) ---",
      "nested_params": []
    },
    {
      "name": "Text",
      "type": "string",
      "required": true,
      "description": "Input text to synthesize. If you specify ssml as the TextType, follow the SSML format for the input text.",
      "nested_params": []
    },
    {
      "name": "TextType",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "VoiceId",
      "type": "string",
      "required": true,
      "description": "Voice ID to use for the synthesis. You can get a list of available voice IDs by calling the DescribeVoices operation.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "AudioStream",
          "type": "StreamingBody",
          "description": "Stream containing the synthesized speech.",
          "nested_items": []
        },
        {
          "name": "ContentType",
          "type": "string",
          "description": "Specifies the type audio stream. This should reflect the OutputFormat parameter in your request.",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "If you request mp3 as the OutputFormat, the ContentType returned is audio/mpeg.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "If you request ogg_vorbis as the OutputFormat, the ContentType returned is audio/ogg.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "mono",
              "description": "If you request pcm as the OutputFormat, the ContentType returned is audio/pcm in a signed 16-bit, 1 channel (mono), little-endian format.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "If you request json as the OutputFormat, the ContentType returned is application/x-json-stream.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "RequestCharacters",
          "type": "integer",
          "description": "Number of characters synthesized.",
          "nested_items": []
        }
      ]
    }
  ]
}