{
  "method_name": "create_location_hdfs",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/datasync/client/create_location_hdfs.html",
  "description": "Creates a transfer location for a Hadoop Distributed File System (HDFS). DataSync can use this location as a source or destination for transferring data. Before you begin, make sure that you understand how DataSync accesses HDFS clusters.",
  "parameters": [
    {
      "name": "Subdirectory",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NameNodes",
      "type": "list",
      "required": true,
      "description": "The NameNode that manages the HDFS namespace. The NameNode performs operations such as opening, closing, and renaming files and directories. The NameNode contains the information to map blocks of data to the DataNodes. You can use only one NameNode. (dict) --- The NameNode of the Hadoop Distributed File System (HDFS). The NameNode manages the file system's namespace. The hostname of the NameNode in the HDFS cluster. This value is the IP address or Domain Name Service (DNS) name of the NameNode. An agent that's installed on-premises uses this hostname to communicate with the NameNode in the network. The port that the NameNode uses to listen to client requests.",
      "nested_params": [
        {
          "name": "Hostname",
          "type": "string",
          "required": false,
          "description": "The hostname of the NameNode in the HDFS cluster. This value is the IP address or Domain Name Service (DNS) name of the NameNode. An agent that's installed on-premises uses this hostname to communicate with the NameNode in the network.",
          "nested_params": []
        },
        {
          "name": "Port",
          "type": "integer",
          "required": false,
          "description": "The port that the NameNode uses to listen to client requests.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "BlockSize",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ReplicationFactor",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "KmsKeyProviderUri",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "QopConfiguration",
      "type": "dict",
      "required": false,
      "description": "The Quality of Protection (QOP) configuration specifies the Remote Procedure Call (RPC) and data transfer protection settings configured on the Hadoop Distributed File System (HDFS) cluster. If QopConfiguration isn't specified, RpcProtection and DataTransferProtection default to PRIVACY. If you set RpcProtection or DataTransferProtection, the other parameter assumes the same value. RpcProtection (string) --- The RPC protection setting configured on the HDFS cluster. This setting corresponds to your hadoop.rpc.protection setting in your core-site.xml file on your Hadoop cluster. DataTransferProtection (string) --- The data transfer protection setting configured on the HDFS cluster. This setting corresponds to your dfs.data.transfer.protection setting in the hdfs-site.xml file on your Hadoop cluster.",
      "nested_params": [
        {
          "name": "RpcProtection",
          "type": "string",
          "required": false,
          "description": "The RPC protection setting configured on the HDFS cluster. This setting corresponds to your hadoop.rpc.protection setting in your core-site.xml file on your Hadoop cluster.",
          "nested_params": []
        },
        {
          "name": "DataTransferProtection",
          "type": "string",
          "required": false,
          "description": "The data transfer protection setting configured on the HDFS cluster. This setting corresponds to your dfs.data.transfer.protection setting in the hdfs-site.xml file on your Hadoop cluster.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "AuthenticationType",
      "type": "string",
      "required": true,
      "description": "The type of authentication used to determine the identity of the user.",
      "nested_params": []
    },
    {
      "name": "SimpleUser",
      "type": "string",
      "required": false,
      "description": "The user name used to identify the client on the host operating system.",
      "nested_params": []
    },
    {
      "name": "KerberosPrincipal",
      "type": "string",
      "required": false,
      "description": "The Kerberos principal with access to the files and folders on the HDFS cluster.",
      "nested_params": []
    },
    {
      "name": "KerberosKeytab",
      "type": "bytes",
      "required": false,
      "description": "The Kerberos key table (keytab) that contains mappings between the defined Kerberos principal and the encrypted keys. You can load the keytab from a file by providing the file's address. If you're using the CLI, it performs base64 encoding for you. Otherwise, provide the base64-encoded text.",
      "nested_params": []
    },
    {
      "name": "KerberosKrb5Conf",
      "type": "bytes",
      "required": false,
      "description": "The krb5.conf file that contains the Kerberos configuration information. You can load the krb5.conf file by providing the file's address. If you're using the CLI, it performs the base64 encoding for you. Otherwise, provide the base64-encoded text.",
      "nested_params": []
    },
    {
      "name": "AgentArns",
      "type": "list",
      "required": true,
      "description": "The Amazon Resource Names (ARNs) of the DataSync agents that can connect to your HDFS cluster. (string) ---",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "The key-value pair that represents the tag that you want to add to the location. The value can be an empty string. We recommend using tags to name your resources. (dict) --- A key-value pair representing a single tag that's been applied to an Amazon Web Services resource. The key for an Amazon Web Services resource tag. Value (string) --- The value for an Amazon Web Services resource tag.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key for an Amazon Web Services resource tag.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value for an Amazon Web Services resource tag.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "LocationArn",
          "type": "string",
          "description": "The ARN of the source HDFS cluster location that you create.",
          "nested_items": []
        }
      ]
    }
  ]
}