{
  "method_name": "create_location_fsx_windows",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/datasync/client/create_location_fsx_windows.html",
  "description": "Creates a transfer location for an Amazon FSx for Windows File Server file system. DataSync can use this location as a source or destination for transferring data. Before you begin, make sure that you understand how DataSync accesses FSx for Windows File Server file systems.",
  "parameters": [
    {
      "name": "Subdirectory",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "FsxFilesystemArn",
      "type": "string",
      "required": true,
      "description": "Specifies the Amazon Resource Name (ARN) for the FSx for Windows File Server file system.",
      "nested_params": []
    },
    {
      "name": "SecurityGroupArns",
      "type": "list",
      "required": true,
      "description": "Specifies the ARNs of the Amazon EC2 security groups that provide access to your file system's preferred subnet. The security groups that you specify must be able to communicate with your file system's security groups. For information about configuring security groups for file system access, see the Amazon FSx for Windows File Server User Guide. (string) ---",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "Specifies labels that help you categorize, filter, and search for your Amazon Web Services resources. We recommend creating at least a name tag for your location. (dict) --- A key-value pair representing a single tag that's been applied to an Amazon Web Services resource. The key for an Amazon Web Services resource tag. Value (string) --- The value for an Amazon Web Services resource tag.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key for an Amazon Web Services resource tag.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value for an Amazon Web Services resource tag.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "User",
      "type": "string",
      "required": true,
      "description": "Specifies the user with the permissions to mount and access the files, folders, and file metadata in your FSx for Windows File Server file system. For information about choosing a user with the right level of access for your transfer, see required permissions for FSx for Windows File Server locations.",
      "nested_params": []
    },
    {
      "name": "Domain",
      "type": "string",
      "required": false,
      "description": "Specifies the name of the Windows domain that the FSx for Windows File Server file system belongs to. If you have multiple Active Directory domains in your environment, configuring this parameter makes sure that DataSync connects to the right file system.",
      "nested_params": []
    },
    {
      "name": "Password",
      "type": "string",
      "required": true,
      "description": "Specifies the password of the user with the permissions to mount and access the files, folders, and file metadata in your FSx for Windows File Server file system.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "LocationArn",
          "type": "string",
          "description": "The ARN of the FSx for Windows File Server file system location you created.",
          "nested_items": []
        }
      ]
    }
  ]
}