{
  "method_name": "update_location_nfs",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/datasync/client/update_location_nfs.html",
  "description": "Modifies the following configuration parameters of the Network File System (NFS) transfer location that you're using with DataSync. For more information, see Configuring transfers with an NFS file server.",
  "parameters": [
    {
      "name": "LocationArn",
      "type": "string",
      "required": true,
      "description": "Specifies the Amazon Resource Name (ARN) of the NFS transfer location that you want to update.",
      "nested_params": []
    },
    {
      "name": "Subdirectory",
      "type": "string",
      "required": false,
      "description": "Specifies the export path in your NFS file server that you want DataSync to mount. This path (or a subdirectory of the path) is where DataSync transfers data to or from. For information on configuring an export for DataSync, see Accessing NFS file servers.",
      "nested_params": []
    },
    {
      "name": "ServerHostname",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "OnPremConfig",
      "type": "dict",
      "required": true,
      "description": "The DataSync agents that can connect to your Network File System (NFS) file server. The Amazon Resource Names (ARNs) of the DataSync agents that can connect to your NFS file server. You can specify more than one agent. For more information, see Using multiple DataSync agents. (string) ---",
      "nested_params": [
        {
          "name": "AgentArns",
          "type": "list",
          "required": false,
          "description": "The Amazon Resource Names (ARNs) of the DataSync agents that can connect to your NFS file server. You can specify more than one agent. For more information, see Using multiple DataSync agents.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "MountOptions",
      "type": "dict",
      "required": false,
      "description": "Specifies how DataSync can access a location using the NFS protocol. Version (string) --- Specifies the NFS version that you want DataSync to use when mounting your NFS share. If the server refuses to use the version specified, the task fails. You can specify the following options: AUTOMATIC (default): DataSync chooses NFS version 4.1. NFS3: Stateless protocol version that allows for asynchronous writes on the server. NFSv4_0: Stateful, firewall-friendly protocol version that supports delegations and pseudo file systems. NFSv4_1: Stateful protocol version that supports sessions, directory delegations, and parallel data processing. NFS version 4.1 also includes all features available in version 4.0.",
      "nested_params": [
        {
          "name": "Version",
          "type": "string",
          "required": false,
          "description": "Specifies the NFS version that you want DataSync to use when mounting your NFS share. If the server refuses to use the version specified, the task fails. You can specify the following options:",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}