{
  "method_name": "create_persistent_contact_association",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/connect/client/create_persistent_contact_association.html",
  "description": "Enables rehydration of chats for the lifespan of a contact. For more information about chat rehydration, see Enable persistent chat in the Amazon Connect Administrator Guide.",
  "parameters": [
    {
      "name": "InstanceId",
      "type": "string",
      "required": true,
      "description": "The identifier of the Amazon Connect instance. You can find the instance ID in the Amazon Resource Name (ARN) of the instance.",
      "nested_params": []
    },
    {
      "name": "InitialContactId",
      "type": "string",
      "required": true,
      "description": "This is the contactId of the current contact that the CreatePersistentContactAssociation API is being called from.",
      "nested_params": []
    },
    {
      "name": "RehydrationType",
      "type": "string",
      "required": true,
      "description": "The contactId chosen for rehydration depends on the type chosen. ENTIRE_PAST_SESSION: Rehydrates a chat from the most recently terminated past chat contact of the specified past ended chat session. To use this type, provide the initialContactId of the past ended chat session in the sourceContactId field. In this type, Amazon Connect determines what the most recent chat contact on the past ended chat session and uses it to start a persistent chat. FROM_SEGMENT: Rehydrates a chat from the specified past chat contact provided in the sourceContactId field. The actual contactId used for rehydration is provided in the response of this API. To illustrate how to use rehydration type, consider the following example: A customer starts a chat session. Agent a1 accepts the chat and a conversation starts between the customer and Agent a1. This first contact creates a contact ID C1. Agent a1 then transfers the chat to Agent a2. This creates another contact ID C2. At this point Agent a2 ends the chat. The customer is forwarded to the disconnect flow for a post chat survey that creates another contact ID C3. After the chat survey, the chat session ends. Later, the customer returns and wants to resume their past chat session. At this point, the customer can have following use cases: Use Case 1: The customer wants to continue the past chat session but they want to hide the post chat survey. For this they will use the following configuration: SourceContactId = 'C2' RehydrationType = 'FROM_SEGMENT' This starts a persistent chat session from the specified past ended contact (C2). Transcripts of past chat sessions C2 and C1 are accessible in the current persistent chat session. Note that chat segment C3 is dropped from the persistent chat session. Use Case 2: The customer wants to continue the past chat session and see the transcript of the entire past engagement, including the post chat survey. For this they will use the following configuration: SourceContactId = 'C1' RehydrationType = 'ENTIRE_PAST_SESSION' This starts a persistent chat session from the most recently ended chat contact (C3). Transcripts of past chat sessions C3, C2 and C1 are accessible in the current persistent chat session.",
      "nested_params": []
    },
    {
      "name": "SourceContactId",
      "type": "string",
      "required": true,
      "description": "The contactId from which a persistent chat session must be started.",
      "nested_params": []
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ContinuedFromContactId",
          "type": "string",
          "description": "The contactId from which a persistent chat session is started. This field is populated only for persistent chat.",
          "nested_items": []
        }
      ]
    }
  ]
}