{
  "method_name": "create_routing_profile",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/connect/client/create_routing_profile.html",
  "description": "Creates a new routing profile.",
  "parameters": [
    {
      "name": "InstanceId",
      "type": "string",
      "required": true,
      "description": "The identifier of the Amazon Connect instance. You can find the instance ID in the Amazon Resource Name (ARN) of the instance.",
      "nested_params": []
    },
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "The name of the routing profile. Must not be more than 127 characters.",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": true,
      "description": "Description of the routing profile. Must not be more than 250 characters.",
      "nested_params": []
    },
    {
      "name": "DefaultOutboundQueueId",
      "type": "string",
      "required": true,
      "description": "The default outbound queue for the routing profile.",
      "nested_params": []
    },
    {
      "name": "QueueConfigs",
      "type": "list",
      "required": true,
      "description": "The inbound queues associated with the routing profile. If no queue is added, the agent can make only outbound calls. The limit of 10 array members applies to the maximum number of RoutingProfileQueueConfig objects that can be passed during a CreateRoutingProfile API request. It is different from the quota of 50 queues per routing profile per instance that is listed in Amazon Connect service quotas. (dict) --- Contains information about the queue and channel for which priority and delay can be set. Contains information about a queue resource. The identifier for the queue. The channels agents can handle in the Contact Control Panel (CCP) for this routing profile. The order in which contacts are to be handled for the queue. For more information, see Queues: priority and delay. The delay, in seconds, a contact should be in the queue before they are routed to an available agent. For more information, see Queues: priority and delay in the Amazon Connect Administrator Guide.",
      "nested_params": [
        {
          "name": "QueueReference",
          "type": "dict",
          "required": false,
          "description": "Contains information about a queue resource.",
          "nested_params": [
            {
              "name": "QueueId",
              "type": "string",
              "required": false,
              "description": "The identifier for the queue.",
              "nested_params": []
            },
            {
              "name": "Channel",
              "type": "string",
              "required": false,
              "description": "The channels agents can handle in the Contact Control Panel (CCP) for this routing profile.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Priority",
          "type": "integer",
          "required": false,
          "description": "The order in which contacts are to be handled for the queue. For more information, see Queues: priority and delay.",
          "nested_params": []
        },
        {
          "name": "Delay",
          "type": "integer",
          "required": false,
          "description": "The delay, in seconds, a contact should be in the queue before they are routed to an available agent. For more information, see Queues: priority and delay in the Amazon Connect Administrator Guide.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "MediaConcurrencies",
      "type": "list",
      "required": true,
      "description": "The channels that agents can handle in the Contact Control Panel (CCP) for this routing profile. (dict) --- Contains information about which channels are supported, and how many contacts an agent can have on a channel simultaneously. The channels that agents can handle in the Contact Control Panel (CCP). The number of contacts an agent can have on a channel simultaneously. Valid Range for VOICE: Minimum value of 1. Maximum value of 1. Valid Range for CHAT: Minimum value of 1. Maximum value of 10. Valid Range for TASK: Minimum value of 1. CrossChannelBehavior (dict) --- Defines the cross-channel routing behavior for each channel that is enabled for this Routing Profile. For example, this allows you to offer an agent a different contact from another channel when they are currently working with a contact from a Voice channel. Specifies the other channels that can be routed to an agent handling their current channel.",
      "nested_params": [
        {
          "name": "Channel",
          "type": "string",
          "required": false,
          "description": "The channels that agents can handle in the Contact Control Panel (CCP).",
          "nested_params": []
        },
        {
          "name": "Concurrency",
          "type": "integer",
          "required": false,
          "description": "The number of contacts an agent can have on a channel simultaneously. Valid Range for VOICE: Minimum value of 1. Maximum value of 1. Valid Range for CHAT: Minimum value of 1. Maximum value of 10. Valid Range for TASK: Minimum value of 1. Maximum value of 10.",
          "nested_params": []
        },
        {
          "name": "CrossChannelBehavior",
          "type": "dict",
          "required": false,
          "description": "Defines the cross-channel routing behavior for each channel that is enabled for this Routing Profile. For example, this allows you to offer an agent a different contact from another channel when they are currently working with a contact from a Voice channel.",
          "nested_params": [
            {
              "name": "BehaviorType",
              "type": "string",
              "required": false,
              "description": "Specifies the other channels that can be routed to an agent handling their current channel.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "Tags",
      "type": "dict",
      "required": false,
      "description": "The tags used to organize, track, or control access for this resource. For example, { 'Tags': {'key1':'value1', 'key2':'value2'} }. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "AgentAvailabilityTimer",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "RoutingProfileArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the routing profile.",
          "nested_items": []
        },
        {
          "name": "RoutingProfileId",
          "type": "string",
          "description": "The identifier of the routing profile.",
          "nested_items": []
        }
      ]
    }
  ]
}