{
  "method_name": "release_phone_number",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/connect/client/release_phone_number.html",
  "description": "Releases a phone number previously claimed to an Amazon Connect instance or traffic distribution group. You can call this API only in the Amazon Web Services Region where the number was claimed. If you plan to claim and release numbers frequently, contact us for a service quota exception. Otherwise, it is possible you will be blocked from claiming and releasing any more numbers until up to 180 days past the oldest number released has expired. By default you can claim and release up to 200% of your maximum number of active phone numbers. If you claim and release phone numbers using the UI or API during a rolling 180 day cycle that exceeds 200% of your phone number service level quota, you will be blocked from claiming any more numbers until 180 days past the oldest number released has expired. For example, if you already have 99 claimed numbers and a service level quota of 99 phone numbers, and in any 180 day period you release 99, claim 99, and then release 99, you will have exceeded the 200% limit. At that point you are blocked from claiming any more numbers until you open an Amazon Web Services support ticket.",
  "parameters": [
    {
      "name": "PhoneNumberId",
      "type": "string",
      "required": true,
      "description": "A unique identifier for the phone number.",
      "nested_params": []
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": false,
      "description": "A unique, case-sensitive identifier that you provide to ensure the idempotency of the request. If not provided, the Amazon Web Services SDK populates this field. For more information about idempotency, see Making retries safe with idempotent APIs. This field is autopopulated if not provided.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}