{
  "method_name": "put_bandwidth_rate_limit_schedule",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/backup-gateway/client/put_bandwidth_rate_limit_schedule.html",
  "description": "This action sets the bandwidth rate limit schedule for a specified gateway. By default, gateways do not have a bandwidth rate limit schedule, which means no bandwidth rate limiting is in effect. Use this to initiate a gateway's bandwidth rate limit schedule.",
  "parameters": [
    {
      "name": "BandwidthRateLimitIntervals",
      "type": "list",
      "required": true,
      "description": "An array containing bandwidth rate limit schedule intervals for a gateway. When no bandwidth rate limit intervals have been scheduled, the array is empty. (dict) --- Describes a bandwidth rate limit interval for a gateway. A bandwidth rate limit schedule consists of one or more bandwidth rate limit intervals. A bandwidth rate limit interval defines a period of time on one or more days of the week, during which bandwidth rate limits are specified for uploading, downloading, or both. AverageUploadRateLimitInBitsPerSec (integer) --- The average upload rate limit component of the bandwidth rate limit interval, in bits per second. This field does not appear in the response if the upload rate limit is not set. The days of the week component of the bandwidth rate limit interval, represented as ordinal numbers from 0 to 6, where 0 represents Sunday and 6 represents Saturday. (integer) --- The hour of the day to end the bandwidth rate limit interval. The minute of the hour to end the bandwidth rate limit interval. The hour of the day to start the bandwidth rate limit interval. The minute of the hour to start the bandwidth rate limit interval. The interval begins at the start of that minute. To begin an interval exactly at the start of the hour, use the value 0.",
      "nested_params": [
        {
          "name": "AverageUploadRateLimitInBitsPerSec",
          "type": "integer",
          "required": false,
          "description": "The average upload rate limit component of the bandwidth rate limit interval, in bits per second. This field does not appear in the response if the upload rate limit is not set.",
          "nested_params": []
        },
        {
          "name": "DaysOfWeek",
          "type": "list",
          "required": false,
          "description": "The days of the week component of the bandwidth rate limit interval, represented as ordinal numbers from 0 to 6, where 0 represents Sunday and 6 represents Saturday.",
          "nested_params": []
        },
        {
          "name": "EndHourOfDay",
          "type": "integer",
          "required": false,
          "description": "The hour of the day to end the bandwidth rate limit interval.",
          "nested_params": []
        },
        {
          "name": "EndMinuteOfHour",
          "type": "integer",
          "required": false,
          "description": "The minute of the hour to end the bandwidth rate limit interval.",
          "nested_params": []
        },
        {
          "name": "StartHourOfDay",
          "type": "integer",
          "required": false,
          "description": "The hour of the day to start the bandwidth rate limit interval.",
          "nested_params": []
        },
        {
          "name": "StartMinuteOfHour",
          "type": "integer",
          "required": false,
          "description": "The minute of the hour to start the bandwidth rate limit interval. The interval begins at the start of that minute. To begin an interval exactly at the start of the hour, use the value 0.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "GatewayArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the gateway. Use the ListGateways operation to return a list of gateways for your account and Amazon Web Services Region.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "GatewayArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the gateway. Use the ListGateways operation to return a list of gateways for your account and Amazon Web Services Region.",
          "nested_items": []
        }
      ]
    }
  ]
}