{
  "method_name": "describe_parameters",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ssm/client/describe_parameters.html",
  "description": "Lists the parameters in your Amazon Web Services account or the parameters shared with you when you enable the Shared option. Request results are returned on a best-effort basis. If you specify MaxResults in the request, the response includes information up to the limit specified. The number of items returned, however, can be between zero and the value of MaxResults. If the service reaches an internal limit while processing the results, it stops the operation and returns the matching values up to that point and a NextToken. You can specify the NextToken in a subsequent call to get the next set of results.",
  "parameters": [
    {
      "name": "Filters",
      "type": "list",
      "required": true,
      "description": "This data type is deprecated. Instead, use ParameterFilters. (dict) --- This data type is deprecated. Instead, use  ParameterStringFilter. The name of the filter. The filter values. (string) ---",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The name of the filter.",
          "nested_params": []
        },
        {
          "name": "Values",
          "type": "list",
          "required": false,
          "description": "The filter values.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ParameterFilters",
      "type": "list",
      "required": true,
      "description": "Filters to limit the request results. (dict) --- One or more filters. Use a filter to return a more specific list of results. The name of the filter. The ParameterStringFilter object is used by the  DescribeParameters and  GetParametersByPath API operations. However, not all of the pattern values listed for Key can be used with both operations. For DescribeParameters, all of the listed patterns are valid except Label. For GetParametersByPath, the following patterns listed for Key aren't valid: tag, DataType, Name, Path, and Tier. For examples of Amazon Web Services CLI commands demonstrating valid parameter filter constructions, see Searching for Systems Manager parameters in the Amazon Web Services Systems Manager User Guide. Option (string) --- For all filters used with  DescribeParameters, valid options include Equals and BeginsWith. The Name filter additionally supports the Contains option. (Exception: For filters using the key Path, valid options include Recursive and OneLevel.) For filters used with  GetParametersByPath, valid options include Equals and BeginsWith. (Exception: For filters using Label as the Key name, the only valid option is Equals.) Values (list) --- The value you want to search for. (string) ---",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The name of the filter. The ParameterStringFilter object is used by the  DescribeParameters and  GetParametersByPath API operations. However, not all of the pattern values listed for Key can be used with both operations. For DescribeParameters, all of the listed patterns are valid except Label. For GetParametersByPath, the following patterns listed for Key aren't valid: tag, DataType, Name, Path, and Tier. For examples of Amazon Web Services CLI commands demonstrating valid parameter filter constructions, see Searching for Systems Manager parameters in the Amazon Web Services Systems Manager User Guide.",
          "nested_params": []
        },
        {
          "name": "Option",
          "type": "string",
          "required": false,
          "description": "For all filters used with  DescribeParameters, valid options include Equals and BeginsWith. The Name filter additionally supports the Contains option. (Exception: For filters using the key Path, valid options include Recursive and OneLevel.) For filters used with  GetParametersByPath, valid options include Equals and BeginsWith. (Exception: For filters using Label as the Key name, the only valid option is Equals.)",
          "nested_params": []
        },
        {
          "name": "Values",
          "type": "list",
          "required": false,
          "description": "The value you want to search for.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Shared",
      "type": "boolean",
      "required": false,
      "description": "Lists parameters that are shared with you.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Parameters",
          "type": "list",
          "description": "Parameters returned by the request.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The parameter name.",
                  "nested_items": []
                },
                {
                  "name": "ARN",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the parameter.",
                  "nested_items": []
                },
                {
                  "name": "Type",
                  "type": "string",
                  "description": "The type of parameter. Valid parameter types include the following: String, StringList, and SecureString.",
                  "nested_items": []
                },
                {
                  "name": "KeyId",
                  "type": "string",
                  "description": "The alias of the Key Management Service (KMS) key used to encrypt the parameter. Applies to SecureString parameters only.",
                  "nested_items": []
                },
                {
                  "name": "LastModifiedDate",
                  "type": "datetime",
                  "description": "Date the parameter was last changed or updated.",
                  "nested_items": []
                },
                {
                  "name": "LastModifiedUser",
                  "type": "string",
                  "description": "Amazon Resource Name (ARN) of the Amazon Web Services user who last changed the parameter.",
                  "nested_items": []
                },
                {
                  "name": "Description",
                  "type": "string",
                  "description": "Description of the parameter actions.",
                  "nested_items": []
                },
                {
                  "name": "AllowedPattern",
                  "type": "string",
                  "description": "A parameter name can include only the following letters and symbols.",
                  "nested_items": []
                },
                {
                  "name": "Version",
                  "type": "integer",
                  "description": "The parameter version.",
                  "nested_items": []
                },
                {
                  "name": "Tier",
                  "type": "string",
                  "description": "The parameter tier.",
                  "nested_items": []
                },
                {
                  "name": "Policies",
                  "type": "list",
                  "description": "A list of policies associated with a parameter.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "PolicyText",
                          "type": "string",
                          "description": "The JSON text of the policy.",
                          "nested_items": []
                        },
                        {
                          "name": "PolicyType",
                          "type": "string",
                          "description": "The type of policy. Parameter Store, a tool in Amazon Web Services Systems Manager, supports the following policy types: Expiration, ExpirationNotification, and NoChangeNotification.",
                          "nested_items": []
                        },
                        {
                          "name": "PolicyStatus",
                          "type": "string",
                          "description": "The status of the policy. Policies report the following statuses: Pending (the policy hasn't been enforced or applied yet), Finished (the policy was applied), Failed (the policy wasn't applied), or InProgress (the policy is being applied now).",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "DataType",
                  "type": "string",
                  "description": "The data type of the parameter, such as text or aws:ec2:image. The default is text.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The token to use when requesting the next set of items.",
          "nested_items": []
        }
      ]
    }
  ]
}