{
  "method_name": "describe_instance_patch_states_for_patch_group",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ssm/client/describe_instance_patch_states_for_patch_group.html",
  "description": "Retrieves the high-level patch state for the managed nodes in the specified patch group.",
  "parameters": [
    {
      "name": "PatchGroup",
      "type": "string",
      "required": true,
      "description": "The name of the patch group for which the patch state information should be retrieved.",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": true,
      "description": "Each entry in the array is a structure containing: Key (string between 1 and 200 characters) Values (array containing a single string) Type (string 'Equal', 'NotEqual', 'LessThan', 'GreaterThan') (dict) --- Defines a filter used in  DescribeInstancePatchStatesForPatchGroup to scope down the information returned by the API. Example: To filter for all managed nodes in a patch group having more than three patches with a FailedCount status, use the following for the filter: Value for Key: FailedCount Value for Type: GreaterThan Value for Values: 3 The key for the filter. Supported values include the following: InstalledCount InstalledOtherCount InstalledPendingRebootCount InstalledRejectedCount MissingCount FailedCount UnreportedNotApplicableCount NotApplicableCount The value for the filter. Must be an integer greater than or equal to 0. (string) --- The type of comparison that should be performed for the value.",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "InstancePatchStates",
          "type": "list",
          "description": "The high-level patch state for the requested managed nodes.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "InstanceId",
                  "type": "string",
                  "description": "The ID of the managed node the high-level patch compliance information was collected for.",
                  "nested_items": []
                },
                {
                  "name": "PatchGroup",
                  "type": "string",
                  "description": "The name of the patch group the managed node belongs to.",
                  "nested_items": []
                },
                {
                  "name": "BaselineId",
                  "type": "string",
                  "description": "The ID of the patch baseline used to patch the managed node.",
                  "nested_items": []
                },
                {
                  "name": "SnapshotId",
                  "type": "string",
                  "description": "The ID of the patch baseline snapshot used during the patching operation when this compliance data was collected.",
                  "nested_items": []
                },
                {
                  "name": "InstallOverrideList",
                  "type": "string",
                  "description": "An https URL or an Amazon Simple Storage Service (Amazon S3) path-style URL to a list of patches to be installed. This patch installation list, which you maintain in an S3 bucket in YAML format and specify in the SSM document AWS-RunPatchBaseline, overrides the patches specified by the default patch baseline.",
                  "nested_items": []
                },
                {
                  "name": "OwnerInformation",
                  "type": "string",
                  "description": "Placeholder information. This field will always be empty in the current release of the service.",
                  "nested_items": []
                },
                {
                  "name": "InstalledCount",
                  "type": "integer",
                  "description": "The number of patches from the patch baseline that are installed on the managed node.",
                  "nested_items": []
                },
                {
                  "name": "InstalledOtherCount",
                  "type": "integer",
                  "description": "The number of patches not specified in the patch baseline that are installed on the managed node.",
                  "nested_items": []
                },
                {
                  "name": "InstalledPendingRebootCount",
                  "type": "integer",
                  "description": "The number of patches installed by Patch Manager since the last time the managed node was rebooted.",
                  "nested_items": []
                },
                {
                  "name": "InstalledRejectedCount",
                  "type": "integer",
                  "description": "The number of patches installed on a managed node that are specified in a RejectedPatches list. Patches with a status of InstalledRejected were typically installed before they were added to a RejectedPatches list.",
                  "nested_items": []
                },
                {
                  "name": "MissingCount",
                  "type": "integer",
                  "description": "The number of patches from the patch baseline that are applicable for the managed node but aren't currently installed.",
                  "nested_items": []
                },
                {
                  "name": "FailedCount",
                  "type": "integer",
                  "description": "The number of patches from the patch baseline that were attempted to be installed during the last patching operation, but failed to install.",
                  "nested_items": []
                },
                {
                  "name": "UnreportedNotApplicableCount",
                  "type": "integer",
                  "description": "The number of patches beyond the supported limit of NotApplicableCount that aren't reported by name to Inventory. Inventory is a tool in Amazon Web Services Systems Manager.",
                  "nested_items": []
                },
                {
                  "name": "NotApplicableCount",
                  "type": "integer",
                  "description": "The number of patches from the patch baseline that aren't applicable for the managed node and therefore aren't installed on the node. This number may be truncated if the list of patch names is very large. The number of patches beyond this limit are reported in UnreportedNotApplicableCount.",
                  "nested_items": []
                },
                {
                  "name": "AvailableSecurityUpdateCount",
                  "type": "integer",
                  "description": "The number of security-related patches that are available but not approved because they didn't meet the patch baseline requirements. For example, an updated version of a patch might have been released before the specified auto-approval period was over.",
                  "nested_items": []
                },
                {
                  "name": "OperationStartTime",
                  "type": "datetime",
                  "description": "The time the most recent patching operation was started on the managed node.",
                  "nested_items": []
                },
                {
                  "name": "OperationEndTime",
                  "type": "datetime",
                  "description": "The time the most recent patching operation completed on the managed node.",
                  "nested_items": []
                },
                {
                  "name": "Operation",
                  "type": "string",
                  "description": "The type of patching operation that was performed: or.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "SCAN assesses the patch compliance state.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "INSTALL installs missing patches.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "LastNoRebootInstallOperationTime",
                  "type": "datetime",
                  "description": "The time of the last attempt to patch the managed node with NoReboot specified as the reboot option.",
                  "nested_items": []
                },
                {
                  "name": "RebootOption",
                  "type": "string",
                  "description": "Indicates the reboot option specified in the patch baseline.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "RebootIfNeeded: Patch Manager tries to reboot the managed node if it installed any patches, or if any patches are detected with a status of InstalledPendingReboot.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "NoReboot: Patch Manager attempts to install missing packages without trying to reboot the system. Patches installed with this option are assigned a status of InstalledPendingReboot. These patches might not be in effect until a reboot is performed.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "CriticalNonCompliantCount",
                  "type": "integer",
                  "description": "The number of patches per node that are specified as Critical for compliance reporting in the patch baseline aren't installed. These patches might be missing, have failed installation, were rejected, or were installed but awaiting a required managed node reboot. The status of these managed nodes is NON_COMPLIANT.",
                  "nested_items": []
                },
                {
                  "name": "SecurityNonCompliantCount",
                  "type": "integer",
                  "description": "The number of patches per node that are specified as Security in a patch advisory aren't installed. These patches might be missing, have failed installation, were rejected, or were installed but awaiting a required managed node reboot. The status of these managed nodes is NON_COMPLIANT.",
                  "nested_items": []
                },
                {
                  "name": "OtherNonCompliantCount",
                  "type": "integer",
                  "description": "The number of patches per node that are specified as other than Critical or Security but aren't compliant with the patch baseline. The status of these managed nodes is NON_COMPLIANT.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The token to use when requesting the next set of items. If there are no additional items to return, the string is empty.",
          "nested_items": []
        }
      ]
    }
  ]
}