{
  "method_name": "describe_patch_group_state",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ssm/client/describe_patch_group_state.html",
  "description": "Returns high-level aggregated patch compliance state information for a patch group.",
  "parameters": [
    {
      "name": "PatchGroup",
      "type": "string",
      "required": true,
      "description": "The name of the patch group whose patch snapshot should be retrieved.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Instances",
          "type": "integer",
          "description": "The number of managed nodes in the patch group.",
          "nested_items": []
        },
        {
          "name": "InstancesWithInstalledPatches",
          "type": "integer",
          "description": "The number of managed nodes with installed patches.",
          "nested_items": []
        },
        {
          "name": "InstancesWithInstalledOtherPatches",
          "type": "integer",
          "description": "The number of managed nodes with patches installed that aren't defined in the patch baseline.",
          "nested_items": []
        },
        {
          "name": "InstancesWithInstalledPendingRebootPatches",
          "type": "integer",
          "description": "The number of managed nodes with patches installed by Patch Manager that haven't been rebooted after the patch installation. The status of these managed nodes is NON_COMPLIANT.",
          "nested_items": []
        },
        {
          "name": "InstancesWithInstalledRejectedPatches",
          "type": "integer",
          "description": "The number of managed nodes with patches installed that are specified in a RejectedPatches list. Patches with a status of INSTALLED_REJECTED were typically installed before they were added to a RejectedPatches list.",
          "nested_items": []
        },
        {
          "name": "InstancesWithMissingPatches",
          "type": "integer",
          "description": "The number of managed nodes with missing patches from the patch baseline.",
          "nested_items": []
        },
        {
          "name": "InstancesWithFailedPatches",
          "type": "integer",
          "description": "The number of managed nodes with patches from the patch baseline that failed to install.",
          "nested_items": []
        },
        {
          "name": "InstancesWithNotApplicablePatches",
          "type": "integer",
          "description": "The number of managed nodes with patches that aren't applicable.",
          "nested_items": []
        },
        {
          "name": "InstancesWithUnreportedNotApplicablePatches",
          "type": "integer",
          "description": "The number of managed nodes with NotApplicable patches beyond the supported limit, which aren't reported by name to Inventory. Inventory is a tool in Amazon Web Services Systems Manager.",
          "nested_items": []
        },
        {
          "name": "InstancesWithCriticalNonCompliantPatches",
          "type": "integer",
          "description": "The number of managed nodes where patches that are specified as Critical for compliance reporting in the patch baseline aren't installed. These patches might be missing, have failed installation, were rejected, or were installed but awaiting a required managed node reboot. The status of these managed nodes is NON_COMPLIANT.",
          "nested_items": []
        },
        {
          "name": "InstancesWithSecurityNonCompliantPatches",
          "type": "integer",
          "description": "The number of managed nodes where patches that are specified as Security in a patch advisory aren't installed. These patches might be missing, have failed installation, were rejected, or were installed but awaiting a required managed node reboot. The status of these managed nodes is NON_COMPLIANT.",
          "nested_items": []
        },
        {
          "name": "InstancesWithOtherNonCompliantPatches",
          "type": "integer",
          "description": "The number of managed nodes with patches installed that are specified as other than Critical or Security but aren't compliant with the patch baseline. The status of these managed nodes is NON_COMPLIANT.",
          "nested_items": []
        },
        {
          "name": "InstancesWithAvailableSecurityUpdates",
          "type": "integer",
          "description": "The number of managed nodes for which security-related patches are available but not approved because because they didn't meet the patch baseline requirements. For example, an updated version of a patch might have been released before the specified auto-approval period was over.",
          "nested_items": []
        }
      ]
    }
  ]
}