{
  "method_name": "list_commands",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ssm/client/list_commands.html",
  "description": "Lists the commands requested by users of the Amazon Web Services account.",
  "parameters": [
    {
      "name": "CommandId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "InstanceId",
      "type": "string",
      "required": false,
      "description": "(Optional) Lists commands issued against this managed node ID.",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": true,
      "description": "(Optional) One or more filters. Use a filter to return a more specific list of results. (dict) --- Describes a command filter. The name of the filter. The filter value. Valid values for each filter key are as follows: InvokedAfter: Specify a timestamp to limit your results. For example, specify 2024-07-07T00:00:00Z to see a list of command executions occurring July 7, 2021, and later. InvokedBefore: Specify a timestamp to limit your results. For example, specify 2024-07-07T00:00:00Z to see a list of command executions from before July 7, 2021. Status: Specify a valid command status to see a list of all command executions with that status. The status choices depend on the API you call. The status values you can specify for ListCommands are: Pending InProgress Success Cancelled Failed TimedOut (this includes both Delivery and Execution time outs) AccessDenied DeliveryTimedOut ExecutionTimedOut Incomplete NoInstancesInTag LimitExceeded The status values you can specify for ListCommandInvocations are: Pending InProgress Delayed Success Cancelled Failed TimedOut (this includes both Delivery and Execution time outs) AccessDenied DeliveryTimedOut ExecutionTimedOut Undeliverable InvalidPlatform Terminated DocumentName: Specify name of the Amazon Web Services Systems Manager document (SSM document) for which you want to see command execution results. For example, specify AWS-RunPatchBaseline to see command executions that used this SSM document to perform security patching operations on managed nodes. ExecutionStage: Specify one of the following values ( ListCommands operations only): Executing: Returns a list of command executions that are currently still running. Complete: Returns a list of command executions that have already completed.",
      "nested_params": [
        {
          "name": "key",
          "type": "string",
          "required": false,
          "description": "The name of the filter.",
          "nested_params": []
        },
        {
          "name": "value",
          "type": "string",
          "required": false,
          "description": "The filter value. Valid values for each filter key are as follows:",
          "nested_params": [
            {
              "name": "InvokedAfter",
              "type": "",
              "required": false,
              "description": "",
              "nested_params": []
            },
            {
              "name": "InvokedBefore",
              "type": "",
              "required": false,
              "description": "",
              "nested_params": []
            },
            {
              "name": "Status",
              "type": "",
              "required": false,
              "description": "Pending InProgress Success Cancelled Failed TimedOut (this includes both Delivery and Execution time outs) AccessDenied DeliveryTimedOut ExecutionTimedOut Incomplete NoInstancesInTag LimitExceeded.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Commands",
          "type": "list",
          "description": "(Optional) The list of commands requested by the user.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "CommandId",
                  "type": "string",
                  "description": "A unique identifier for this command.",
                  "nested_items": []
                },
                {
                  "name": "DocumentName",
                  "type": "string",
                  "description": "The name of the document requested for execution.",
                  "nested_items": []
                },
                {
                  "name": "DocumentVersion",
                  "type": "string",
                  "description": "The Systems Manager document (SSM document) version.",
                  "nested_items": []
                },
                {
                  "name": "Comment",
                  "type": "string",
                  "description": "User-specified information about the command, such as a brief description of what the command should do.",
                  "nested_items": []
                },
                {
                  "name": "ExpiresAfter",
                  "type": "datetime",
                  "description": "If a command expires, it changes status to DeliveryTimedOut for all invocations that have the status InProgress, Pending, or Delayed. ExpiresAfter is calculated based on the total timeout for the overall command. For more information, see Understanding command timeout values in the Amazon Web Services Systems Manager User Guide.",
                  "nested_items": []
                },
                {
                  "name": "Parameters",
                  "type": "dict",
                  "description": "The parameter values to be inserted in the document when running the command.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "list",
                          "description": "(list) ---",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "InstanceIds",
                  "type": "list",
                  "description": "The managed node IDs against which this command was requested.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Targets",
                  "type": "list",
                  "description": "An array of search criteria that targets managed nodes using a Key,Value combination that you specify. Targets is required if you don't provide one or more managed node IDs in the call.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "Key=tag-key,Values=tag-value-1,tag-value-2",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "RequestedDateTime",
                  "type": "datetime",
                  "description": "The date and time the command was requested.",
                  "nested_items": []
                },
                {
                  "name": "Status",
                  "type": "string",
                  "description": "The status of the command.",
                  "nested_items": []
                },
                {
                  "name": "StatusDetails",
                  "type": "string",
                  "description": "A detailed status of the command execution. StatusDetails includes more information than Status because it includes states resulting from error and concurrency control parameters. StatusDetails can show different results than Status. For more information about these statuses, see Understanding command statuses in the Amazon Web Services Systems Manager User Guide. StatusDetails can be one of the following values:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "Pending: The command hasn't been sent to any managed nodes.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "In Progress: The command has been sent to at least one managed node but hasn't reached a final state on all managed nodes.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Success: The command successfully ran on all invocations. This is a terminal state.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Delivery Timed Out: The value of MaxErrors or more command invocations shows a status of Delivery Timed Out. This is a terminal state.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Execution Timed Out: The value of MaxErrors or more command invocations shows a status of Execution Timed Out. This is a terminal state.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Failed: The value of MaxErrors or more command invocations shows a status of Failed. This is a terminal state.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Incomplete: The command was attempted on all managed nodes and one or more invocations doesn't have a value of Success but not enough invocations failed for the status to be Failed. This is a terminal state.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Cancelled: The command was terminated before it was completed. This is a terminal state.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Rate Exceeded: The number of managed nodes targeted by the command exceeded the account limit for pending invocations. The system has canceled the command before running it on any managed node. This is a terminal state.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Delayed: The system attempted to send the command to the managed node but wasn't successful. The system retries again.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "OutputS3Region",
                  "type": "string",
                  "description": "(Deprecated) You can no longer specify this parameter. The system ignores it. Instead, Systems Manager automatically determines the Amazon Web Services Region of the S3 bucket.",
                  "nested_items": []
                },
                {
                  "name": "OutputS3BucketName",
                  "type": "string",
                  "description": "The S3 bucket where the responses to the command executions should be stored. This was requested when issuing the command.",
                  "nested_items": []
                },
                {
                  "name": "OutputS3KeyPrefix",
                  "type": "string",
                  "description": "The S3 directory path inside the bucket where the responses to the command executions should be stored. This was requested when issuing the command.",
                  "nested_items": []
                },
                {
                  "name": "MaxConcurrency",
                  "type": "string",
                  "description": "The maximum number of managed nodes that are allowed to run the command at the same time. You can specify a number of managed nodes, such as 10, or a percentage of nodes, such as 10%. The default value is 50. For more information about how to use MaxConcurrency, see Amazon Web Services Systems Manager Run Command in the Amazon Web Services Systems Manager User Guide.",
                  "nested_items": []
                },
                {
                  "name": "MaxErrors",
                  "type": "string",
                  "description": "The maximum number of errors allowed before the system stops sending the command to additional targets. You can specify a number of errors, such as 10, or a percentage or errors, such as 10%. The default value is 0. For more information about how to use MaxErrors, see Amazon Web Services Systems Manager Run Command in the Amazon Web Services Systems Manager User Guide.",
                  "nested_items": []
                },
                {
                  "name": "TargetCount",
                  "type": "integer",
                  "description": "The number of targets for the command.",
                  "nested_items": []
                },
                {
                  "name": "CompletedCount",
                  "type": "integer",
                  "description": "The number of targets for which the command invocation reached a terminal state. Terminal states include the following: Success, Failed, Execution Timed Out, Delivery Timed Out, Cancelled, Terminated, or Undeliverable.",
                  "nested_items": []
                },
                {
                  "name": "ErrorCount",
                  "type": "integer",
                  "description": "The number of targets for which the status is Failed or Execution Timed Out.",
                  "nested_items": []
                },
                {
                  "name": "DeliveryTimedOutCount",
                  "type": "integer",
                  "description": "The number of targets for which the status is Delivery Timed Out.",
                  "nested_items": []
                },
                {
                  "name": "ServiceRole",
                  "type": "string",
                  "description": "The Identity and Access Management (IAM) service role that Run Command, a tool in Amazon Web Services Systems Manager, uses to act on your behalf when sending notifications about command status changes.",
                  "nested_items": []
                },
                {
                  "name": "NotificationConfig",
                  "type": "dict",
                  "description": "Configurations for sending notifications about command status changes.",
                  "nested_items": [
                    {
                      "name": "NotificationArn",
                      "type": "string",
                      "description": "An Amazon Resource Name (ARN) for an Amazon Simple Notification Service (Amazon SNS) topic. Run Command pushes notifications about command status changes to this topic.",
                      "nested_items": []
                    },
                    {
                      "name": "NotificationEvents",
                      "type": "list",
                      "description": "The different events for which you can receive notifications. To learn more about these events, see Monitoring Systems Manager status changes using Amazon SNS notifications in the Amazon Web Services Systems Manager User Guide.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "NotificationType",
                      "type": "string",
                      "description": "The type of notification.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "Command: Receive notification when the status of a command changes.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "Invocation: For commands sent to multiple managed nodes, receive notification on a per-node basis when the status of a command changes.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "CloudWatchOutputConfig",
                  "type": "dict",
                  "description": "Amazon CloudWatch Logs information where you want Amazon Web Services Systems Manager to send the command output.",
                  "nested_items": [
                    {
                      "name": "CloudWatchLogGroupName",
                      "type": "string",
                      "description": "The name of the CloudWatch Logs log group where you want to send command output. If you don't specify a group name, Amazon Web Services Systems Manager automatically creates a log group for you. The log group uses the following naming format:",
                      "nested_items": []
                    },
                    {
                      "name": "CloudWatchOutputEnabled",
                      "type": "boolean",
                      "description": "Enables Systems Manager to send command output to CloudWatch Logs.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "TimeoutSeconds",
                  "type": "integer",
                  "description": "The TimeoutSeconds value specified for a command.",
                  "nested_items": []
                },
                {
                  "name": "AlarmConfiguration",
                  "type": "dict",
                  "description": "The details for the CloudWatch alarm applied to your command.",
                  "nested_items": [
                    {
                      "name": "IgnorePollAlarmFailure",
                      "type": "boolean",
                      "description": "When this value is true, your automation or command continues to run in cases where we can't retrieve alarm status information from CloudWatch. In cases where we successfully retrieve an alarm status of OK or INSUFFICIENT_DATA, the automation or command continues to run, regardless of this value. Default is false.",
                      "nested_items": []
                    },
                    {
                      "name": "Alarms",
                      "type": "list",
                      "description": "The name of the CloudWatch alarm specified in the configuration.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "Name",
                              "type": "string",
                              "description": "The name of your CloudWatch alarm.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "TriggeredAlarms",
                  "type": "list",
                  "description": "The CloudWatch alarm that was invoked by the command.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Name",
                          "type": "string",
                          "description": "The name of your CloudWatch alarm.",
                          "nested_items": []
                        },
                        {
                          "name": "State",
                          "type": "string",
                          "description": "The state of your CloudWatch alarm.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "(Optional) The token for the next set of items to return. (You received this token from a previous call.)",
          "nested_items": []
        }
      ]
    }
  ]
}