{
  "method_name": "modify_document_permission",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ssm/client/modify_document_permission.html",
  "description": "Shares a Amazon Web Services Systems Manager document (SSM document)publicly or privately. If you share a document privately, you must specify the Amazon Web Services user IDs for those people who can use the document. If you share a document publicly, you must specify All as the account ID.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "The name of the document that you want to share.",
      "nested_params": []
    },
    {
      "name": "PermissionType",
      "type": "string",
      "required": true,
      "description": "The permission type for the document. The permission type can be Share.",
      "nested_params": []
    },
    {
      "name": "AccountIdsToAdd",
      "type": "list",
      "required": false,
      "description": "The Amazon Web Services users that should have access to the document. The account IDs can either be a group of account IDs or All. You must specify a value for this parameter or the AccountIdsToRemove parameter. (string) ---",
      "nested_params": []
    },
    {
      "name": "AccountIdsToRemove",
      "type": "list",
      "required": false,
      "description": "The Amazon Web Services users that should no longer have access to the document. The Amazon Web Services user can either be a group of account IDs or All. This action has a higher priority than AccountIdsToAdd. If you specify an ID to add and the same ID to remove, the system removes access to the document. You must specify a value for this parameter or the AccountIdsToAdd parameter. (string) ---",
      "nested_params": []
    },
    {
      "name": "SharedDocumentVersion",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}