{
  "method_name": "reset_service_setting",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ssm/client/reset_service_setting.html",
  "description": "ServiceSetting is an account-level setting for an Amazon Web Services service. This setting defines how a user interacts with or uses a service or a feature of a service. For example, if an Amazon Web Services service charges money to the account based on feature or service usage, then the Amazon Web Services service team might create a default setting of 'false'. This means the user can't use this feature unless they change the setting to 'true' and intentionally opt in for a paid feature. Services map a SettingId object to a setting value. Amazon Web Services services teams define the default value for a SettingId. You can't create a new SettingId, but you can overwrite the default value if you have the ssm:UpdateServiceSetting permission for the setting. Use the  GetServiceSetting API operation to view the current value. Use the  UpdateServiceSetting API operation to change the default setting. Reset the service setting for the account to the default value as provisioned by the Amazon Web Services service team.",
  "parameters": [],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ServiceSetting",
          "type": "dict",
          "description": "The current, effective service setting after calling the ResetServiceSetting API operation.",
          "nested_items": [
            {
              "name": "SettingId",
              "type": "string",
              "description": "The ID of the service setting.",
              "nested_items": []
            },
            {
              "name": "SettingValue",
              "type": "string",
              "description": "The value of the service setting.",
              "nested_items": []
            },
            {
              "name": "LastModifiedDate",
              "type": "datetime",
              "description": "The last time the service setting was modified.",
              "nested_items": []
            },
            {
              "name": "LastModifiedUser",
              "type": "string",
              "description": "The ARN of the last modified user. This field is populated only if the setting value was overwritten.",
              "nested_items": []
            },
            {
              "name": "ARN",
              "type": "string",
              "description": "The ARN of the service setting.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The status of the service setting. The value can be Default, Customized or PendingUpdate.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "Default: The current setting uses a default value provisioned by the Amazon Web Services service team.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Customized: The current setting use a custom value specified by the customer.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "PendingUpdate: The current setting uses a default or custom value, but a setting change request is pending approval.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}