{
  "method_name": "start_change_request_execution",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ssm/client/start_change_request_execution.html",
  "description": "Creates a change request for Change Manager. The Automation runbooks specified in the change request run only after all required approvals for the change request have been received.",
  "parameters": [
    {
      "name": "ScheduledTime",
      "type": "datetime",
      "required": false,
      "description": "The date and time specified in the change request to run the Automation runbooks.",
      "nested_params": []
    },
    {
      "name": "DocumentName",
      "type": "string",
      "required": true,
      "description": "The name of the change template document to run during the runbook workflow.",
      "nested_params": []
    },
    {
      "name": "DocumentVersion",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Parameters",
      "type": "dict",
      "required": false,
      "description": "A key-value map of parameters that match the declared parameters in the change template document. (string) --- (list) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "ChangeRequestName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "AutoApprove",
      "type": "boolean",
      "required": false,
      "description": "Indicates whether the change request can be approved automatically without the need for manual approvals. If AutoApprovable is enabled in a change template, then setting AutoApprove to true in StartChangeRequestExecution creates a change request that bypasses approver review.",
      "nested_params": []
    },
    {
      "name": "Runbooks",
      "type": "list",
      "required": true,
      "description": "Information about the Automation runbooks that are run during the runbook workflow. (dict) --- Information about an Automation runbook used in a runbook workflow in Change Manager. The name of the Automation runbook used in a runbook workflow. DocumentVersion (string) --- The version of the Automation runbook used in a runbook workflow. Parameters (dict) --- The key-value map of execution parameters, which were supplied when calling StartChangeRequestExecution. (string) --- (list) --- (string) --- TargetParameterName (string) --- The name of the parameter used as the target resource for the rate-controlled runbook workflow. Required if you specify Targets. Targets (list) --- A key-value mapping to target resources that the runbook operation performs tasks on. Required if you specify TargetParameterName. (dict) --- An array of search criteria that targets managed nodes using a key-value pair that you specify. Supported formats include the following. Key=tag-key,Values=tag-value-1,tag-value-2 Key=tag:tag-key,Values=tag-value Key=ResourceGroup,Values=resource-group-name Key=ParameterValues,Values=value-1,value-2,value-3 To target all instances in the Amazon Web Services Region: Key=AWS::EC2::Instance,Values=* Key=InstanceIds,Values=* Key=InstanceIds,Values=instance-id-1,instance-id-2,instance-id-3 Key=tag:tag-key,Values=tag-value-1,tag-value-2 Key=resource-groups:Name,Values=resource-group-name Additionally, Maintenance Windows support targeting resource types: Key=resource-groups:ResourceTypeFilters,Values=resource-type-1,resource-type-2 Key=InstanceIds,Values=instance-id-1,instance-id-2,instance-id-3 Key=tag:tag-key,Values=tag-value-1,tag-value-2 To target all instances in the Amazon Web Services Region: Key=InstanceIds,Values=* For more information about how to send commands that target managed nodes using Key,Value parameters, see Targeting multiple managed nodes in the Amazon Web Services Systems Manager User Guide. Key (string) --- User-defined criteria for sending commands that target managed nodes that meet the criteria. Values (list) --- User-defined criteria that maps to Key. For example, if you specified tag:ServerRole, you could specify value:WebServer to run a command on instances that include EC2 tags of ServerRole,WebServer. Depending on the type of target, the maximum number of values for a key might be lower than the global maximum of 50. (string) --- TargetMaps (list) --- A key-value mapping of runbook parameters to target resources. Both Targets and TargetMaps can't be specified together. (dict) --- (string) --- (list) --- (string) --- MaxConcurrency (string) --- The MaxConcurrency value specified by the user when the operation started, indicating the maximum number of resources that the runbook operation can run on at the same time. MaxErrors (string) --- The MaxErrors value specified by the user when the execution started, indicating the maximum number of errors that can occur during the operation before the updates are stopped or rolled back. TargetLocations (list) --- Information about the Amazon Web Services Regions and Amazon Web Services accounts targeted by the current Runbook operation. (dict) --- The combination of Amazon Web Services Regions and Amazon Web Services accounts targeted by the current Automation execution. Accounts (list) --- The Amazon Web Services accounts targeted by the current Automation execution. (string) --- Regions (list) --- The Amazon Web Services Regions targeted by the current Automation execution. (string) --- TargetLocationMaxConcurrency (string) --- The maximum number of Amazon Web Services Regions and Amazon Web Services accounts allowed to run the Automation concurrently. TargetLocationMaxErrors (string) --- The maximum number of errors allowed before the system stops queueing additional Automation executions for the currently running Automation. ExecutionRoleName (string) --- The Automation execution role used by the currently running Automation. If not specified, the default value is AWS-SystemsManager-AutomationExecutionRole. TargetLocationAlarmConfiguration (dict) --- The details for the CloudWatch alarm you want to apply to an automation or command. IgnorePollAlarmFailure (boolean) --- When this value is true, your automation or command continues to run in cases where we can't retrieve alarm status information from CloudWatch. In cases where we successfully retrieve an alarm status of OK or INSUFFICIENT_DATA, the automation or command continues to run, regardless of this value. Default is false. The name of the CloudWatch alarm specified in the configuration. (dict) --- A CloudWatch alarm you apply to an automation or command. The name of your CloudWatch alarm. IncludeChildOrganizationUnits (boolean) --- Indicates whether to include child organizational units (OUs) that are children of the targeted OUs. The default is false. ExcludeAccounts (list) --- Amazon Web Services accounts or organizational units to exclude as expanded targets. (string) --- Targets (list) --- A list of key-value mappings to target resources. If you specify values for this data type, you must also specify a value for TargetParameterName. This Targets parameter takes precedence over the StartAutomationExecution:Targets parameter if both are supplied. (string) --- TargetsMaxConcurrency (string) --- The maximum number of targets allowed to run this task in parallel. This TargetsMaxConcurrency takes precedence over the StartAutomationExecution:MaxConcurrency parameter if both are supplied. TargetsMaxErrors (string) --- The maximum number of errors that are allowed before the system stops running the automation on additional targets. This TargetsMaxErrors parameter takes precedence over the StartAutomationExecution:MaxErrors parameter if both are supplied.",
      "nested_params": [
        {
          "name": "DocumentName",
          "type": "string",
          "required": false,
          "description": "The name of the Automation runbook used in a runbook workflow.",
          "nested_params": []
        },
        {
          "name": "DocumentVersion",
          "type": "string",
          "required": false,
          "description": "The version of the Automation runbook used in a runbook workflow.",
          "nested_params": []
        },
        {
          "name": "Parameters",
          "type": "dict",
          "required": false,
          "description": "The key-value map of execution parameters, which were supplied when calling StartChangeRequestExecution.",
          "nested_params": []
        },
        {
          "name": "TargetParameterName",
          "type": "string",
          "required": false,
          "description": "The name of the parameter used as the target resource for the rate-controlled runbook workflow. Required if you specify Targets.",
          "nested_params": []
        },
        {
          "name": "Targets",
          "type": "list",
          "required": false,
          "description": "A key-value mapping to target resources that the runbook operation performs tasks on. Required if you specify TargetParameterName.",
          "nested_params": []
        },
        {
          "name": "TargetMaps",
          "type": "list",
          "required": false,
          "description": "A key-value mapping of runbook parameters to target resources. Both Targets and TargetMaps can't be specified together.",
          "nested_params": []
        },
        {
          "name": "MaxConcurrency",
          "type": "string",
          "required": false,
          "description": "The MaxConcurrency value specified by the user when the operation started, indicating the maximum number of resources that the runbook operation can run on at the same time.",
          "nested_params": []
        },
        {
          "name": "MaxErrors",
          "type": "string",
          "required": false,
          "description": "The MaxErrors value specified by the user when the execution started, indicating the maximum number of errors that can occur during the operation before the updates are stopped or rolled back.",
          "nested_params": []
        },
        {
          "name": "TargetLocations",
          "type": "list",
          "required": false,
          "description": "Information about the Amazon Web Services Regions and Amazon Web Services accounts targeted by the current Runbook operation.",
          "nested_params": [
            {
              "name": "Accounts",
              "type": "list",
              "required": false,
              "description": "The Amazon Web Services accounts targeted by the current Automation execution.",
              "nested_params": []
            },
            {
              "name": "Regions",
              "type": "list",
              "required": false,
              "description": "The Amazon Web Services Regions targeted by the current Automation execution.",
              "nested_params": []
            },
            {
              "name": "TargetLocationMaxConcurrency",
              "type": "string",
              "required": false,
              "description": "The maximum number of Amazon Web Services Regions and Amazon Web Services accounts allowed to run the Automation concurrently.",
              "nested_params": []
            },
            {
              "name": "TargetLocationMaxErrors",
              "type": "string",
              "required": false,
              "description": "The maximum number of errors allowed before the system stops queueing additional Automation executions for the currently running Automation.",
              "nested_params": []
            },
            {
              "name": "ExecutionRoleName",
              "type": "string",
              "required": false,
              "description": "The Automation execution role used by the currently running Automation. If not specified, the default value is AWS-SystemsManager-AutomationExecutionRole.",
              "nested_params": []
            },
            {
              "name": "TargetLocationAlarmConfiguration",
              "type": "dict",
              "required": false,
              "description": "The details for the CloudWatch alarm you want to apply to an automation or command.",
              "nested_params": [
                {
                  "name": "IgnorePollAlarmFailure",
                  "type": "boolean",
                  "required": false,
                  "description": "When this value is true, your automation or command continues to run in cases where we can't retrieve alarm status information from CloudWatch. In cases where we successfully retrieve an alarm status of OK or INSUFFICIENT_DATA, the automation or command continues to run, regardless of this value. Default is false.",
                  "nested_params": []
                },
                {
                  "name": "Alarms",
                  "type": "list",
                  "required": false,
                  "description": "The name of the CloudWatch alarm specified in the configuration.",
                  "nested_params": [
                    {
                      "name": "Name",
                      "type": "string",
                      "required": false,
                      "description": "The name of your CloudWatch alarm.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "IncludeChildOrganizationUnits",
              "type": "boolean",
              "required": false,
              "description": "Indicates whether to include child organizational units (OUs) that are children of the targeted OUs. The default is false.",
              "nested_params": []
            },
            {
              "name": "ExcludeAccounts",
              "type": "list",
              "required": false,
              "description": "Amazon Web Services accounts or organizational units to exclude as expanded targets.",
              "nested_params": []
            },
            {
              "name": "Targets",
              "type": "list",
              "required": false,
              "description": "A list of key-value mappings to target resources. If you specify values for this data type, you must also specify a value for TargetParameterName. This Targets parameter takes precedence over the StartAutomationExecution:Targets parameter if both are supplied.",
              "nested_params": []
            },
            {
              "name": "TargetsMaxConcurrency",
              "type": "string",
              "required": false,
              "description": "The maximum number of targets allowed to run this task in parallel. This TargetsMaxConcurrency takes precedence over the StartAutomationExecution:MaxConcurrency parameter if both are supplied.",
              "nested_params": []
            },
            {
              "name": "TargetsMaxErrors",
              "type": "string",
              "required": false,
              "description": "The maximum number of errors that are allowed before the system stops running the automation on additional targets. This TargetsMaxErrors parameter takes precedence over the StartAutomationExecution:MaxErrors parameter if both are supplied.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "Optional metadata that you assign to a resource. You can specify a maximum of five tags for a change request. Tags enable you to categorize a resource in different ways, such as by purpose, owner, or environment. For example, you might want to tag a change request to identify an environment or target Amazon Web Services Region. In this case, you could specify the following key-value pairs: Key=Environment,Value=Production Key=Region,Value=us-east-2 (dict) --- Metadata that you assign to your Amazon Web Services resources. Tags enable you to categorize your resources in different ways, for example, by purpose, owner, or environment. In Amazon Web Services Systems Manager, you can apply tags to Systems Manager documents (SSM documents), managed nodes, maintenance windows, parameters, patch baselines, OpsItems, and OpsMetadata. The name of the tag. The value of the tag.",
      "nested_params": []
    },
    {
      "name": "ScheduledEndTime",
      "type": "datetime",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ChangeDetails",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "AutomationExecutionId",
          "type": "string",
          "description": "The unique ID of a runbook workflow operation. (A runbook workflow is a type of Automation operation.)",
          "nested_items": []
        }
      ]
    }
  ]
}