{
  "method_name": "update_resource_data_sync",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ssm/client/update_resource_data_sync.html",
  "description": "Update a resource data sync. After you create a resource data sync for a Region, you can't change the account options for that sync. For example, if you create a sync in the us-east-2 (Ohio) Region and you choose the Include only the current account option, you can't edit that sync later and choose the Include all accounts from my Organizations configuration option. Instead, you must delete the first resource data sync, and create a new one.",
  "parameters": [
    {
      "name": "SyncName",
      "type": "string",
      "required": true,
      "description": "The name of the resource data sync you want to update.",
      "nested_params": []
    },
    {
      "name": "SyncType",
      "type": "string",
      "required": true,
      "description": "The type of resource data sync. The supported SyncType is SyncFromSource.",
      "nested_params": []
    },
    {
      "name": "SyncSource",
      "type": "dict",
      "required": true,
      "description": "Specify information about the data sources to synchronize. The type of data source for the resource data sync. SourceType is either AwsOrganizations (if an organization is present in Organizations) or SingleAccountMultiRegions. AwsOrganizationsSource (dict) --- Information about the AwsOrganizationsSource resource data sync source. A sync source of this type can synchronize data from Organizations. If an Amazon Web Services organization is present, this is either OrganizationalUnits or EntireOrganization. For OrganizationalUnits, the data is aggregated from a set of organization units. For EntireOrganization, the data is aggregated from the entire Amazon Web Services organization. OrganizationalUnits (list) --- The Organizations organization units included in the sync. (dict) --- The Organizations organizational unit data source for the sync. OrganizationalUnitId (string) --- The Organizations unit ID data source for the sync. The SyncSource Amazon Web Services Regions included in the resource data sync. (string) --- IncludeFutureRegions (boolean) --- Whether to automatically synchronize and aggregate data from new Amazon Web Services Regions when those Regions come online. EnableAllOpsDataSources (boolean) --- When you create a resource data sync, if you choose one of the Organizations options, then Systems Manager automatically enables all OpsData sources in the selected Amazon Web Services Regions for all Amazon Web Services accounts in your organization (or in the selected organization units). For more information, see Setting up Systems Manager Explorer to display data from multiple accounts and Regions in the Amazon Web Services Systems Manager User Guide.",
      "nested_params": [
        {
          "name": "SourceType",
          "type": "string",
          "required": false,
          "description": "The type of data source for the resource data sync. SourceType is either AwsOrganizations (if an organization is present in Organizations) or SingleAccountMultiRegions.",
          "nested_params": []
        },
        {
          "name": "AwsOrganizationsSource",
          "type": "dict",
          "required": false,
          "description": "Information about the AwsOrganizationsSource resource data sync source. A sync source of this type can synchronize data from Organizations.",
          "nested_params": [
            {
              "name": "OrganizationSourceType",
              "type": "string",
              "required": false,
              "description": "If an Amazon Web Services organization is present, this is either OrganizationalUnits or EntireOrganization. For OrganizationalUnits, the data is aggregated from a set of organization units. For EntireOrganization, the data is aggregated from the entire Amazon Web Services organization.",
              "nested_params": []
            },
            {
              "name": "OrganizationalUnits",
              "type": "list",
              "required": false,
              "description": "The Organizations organization units included in the sync.",
              "nested_params": [
                {
                  "name": "OrganizationalUnitId",
                  "type": "string",
                  "required": false,
                  "description": "The Organizations unit ID data source for the sync.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "SourceRegions",
          "type": "list",
          "required": false,
          "description": "The SyncSource Amazon Web Services Regions included in the resource data sync.",
          "nested_params": []
        },
        {
          "name": "IncludeFutureRegions",
          "type": "boolean",
          "required": false,
          "description": "Whether to automatically synchronize and aggregate data from new Amazon Web Services Regions when those Regions come online.",
          "nested_params": []
        },
        {
          "name": "EnableAllOpsDataSources",
          "type": "boolean",
          "required": false,
          "description": "When you create a resource data sync, if you choose one of the Organizations options, then Systems Manager automatically enables all OpsData sources in the selected Amazon Web Services Regions for all Amazon Web Services accounts in your organization (or in the selected organization units). For more information, see Setting up Systems Manager Explorer to display data from multiple accounts and Regions in the Amazon Web Services Systems Manager User Guide.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}