{
  "method_name": "change_cidr_collection",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/route53/client/change_cidr_collection.html",
  "description": "Creates, changes, or deletes CIDR blocks within a collection. Contains authoritative IP information mapping blocks to one or multiple locations. A change request can update multiple locations in a collection at a time, which is helpful if you want to move one or more CIDR blocks from one location to another in one transaction, without downtime. The max number of CIDR blocks included in the request is 1000. As a result, big updates require multiple API calls. Use ChangeCidrCollection to perform the following actions:",
  "parameters": [
    {
      "name": "Id",
      "type": "string",
      "required": true,
      "description": "The UUID of the CIDR collection to update.",
      "nested_params": []
    },
    {
      "name": "CollectionVersion",
      "type": "integer",
      "required": false,
      "description": "A sequential counter that Amazon Route 53 sets to 1 when you create a collection and increments it by 1 each time you update the collection. We recommend that you use ListCidrCollection to get the current value of CollectionVersion for the collection that you want to update, and then include that value with the change request. This prevents Route 53 from overwriting an intervening update: If the value in the request matches the value of CollectionVersion in the collection, Route 53 updates the collection. If the value of CollectionVersion in the collection is greater than the value in the request, the collection was changed after you got the version number. Route 53 does not update the collection, and it returns a CidrCollectionVersionMismatch error.",
      "nested_params": []
    },
    {
      "name": "Changes",
      "type": "list",
      "required": true,
      "description": "Information about changes to a CIDR collection. (dict) --- A complex type that contains information about the CIDR collection change. Name of the location that is associated with the CIDR collection. CIDR collection change action. List of CIDR blocks. (string) ---",
      "nested_params": [
        {
          "name": "LocationName",
          "type": "string",
          "required": false,
          "description": "Name of the location that is associated with the CIDR collection.",
          "nested_params": []
        },
        {
          "name": "Action",
          "type": "string",
          "required": false,
          "description": "CIDR collection change action.",
          "nested_params": []
        },
        {
          "name": "CidrList",
          "type": "list",
          "required": false,
          "description": "List of CIDR blocks.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Id",
          "type": "string",
          "description": "The ID that is returned by ChangeCidrCollection. You can use it as input to GetChange to see if a CIDR collection change has propagated or not.",
          "nested_items": []
        }
      ]
    }
  ]
}