{
  "method_name": "create_query_logging_config",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/route53/client/create_query_logging_config.html",
  "description": "Creates a configuration for DNS query logging. After you create a query logging configuration, Amazon Route 53 begins to publish log data to an Amazon CloudWatch Logs log group. DNS query logs contain information about the queries that Route 53 receives for a specified public hosted zone, such as the following: Before you create a query logging configuration, perform the following operations. For more information, see The confused deputy problem in the Amazon Web Services IAM User Guide. When Route 53 finishes creating the configuration for DNS query logging, it does the following: The name of each log stream is in the following format: hosted zone ID/edge location code. The edge location code is a three-letter code and an arbitrarily assigned number, for example, DFW3. The three-letter code typically corresponds with the International Air Transport Association airport code for an airport near the edge location. (These abbreviations might change in the future.) For a list of edge locations, see 'The Route 53 Global Network' on the Route 53 Product Details page. Query logs contain only the queries that DNS resolvers forward to Route 53. If a DNS resolver has already cached the response to a query (such as the IP address for a load balancer for example.com), the resolver will continue to return the cached response. It doesn't forward another query to Route 53 until the TTL for the corresponding resource record set expires. Depending on how many DNS queries are submitted for a resource record set, and depending on the TTL for that resource record set, query logs might contain information about only one query out of every several thousand queries that are submitted to DNS. For more information about how DNS works, see Routing Internet Traffic to Your Website or Web Application in the Amazon Route 53 Developer Guide. For a list of the values in each query log and the format of each value, see Logging DNS Queries in the Amazon Route 53 Developer Guide. For information about charges for query logs, see Amazon CloudWatch Pricing. If you want Route 53 to stop sending query logs to CloudWatch Logs, delete the query logging configuration. For more information, see DeleteQueryLoggingConfig.",
  "parameters": [
    {
      "name": "HostedZoneId",
      "type": "string",
      "required": true,
      "description": "The ID of the hosted zone that you want to log queries for. You can log queries only for public hosted zones.",
      "nested_params": []
    },
    {
      "name": "CloudWatchLogsLogGroupArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) for the log group that you want to Amazon Route 53 to send query logs to. This is the format of the ARN: arn:aws:logs:region:account-id:log-group:log_group_name To get the ARN for a log group, you can use the CloudWatch console, the DescribeLogGroups API action, the describe-log-groups command, or the applicable command in one of the Amazon Web Services SDKs.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "QueryLoggingConfig",
          "type": "dict",
          "description": "A complex type that contains the ID for a query logging configuration, the ID of the hosted zone that you want to log queries for, and the ARN for the log group that you want Amazon Route 53 to send query logs to.",
          "nested_items": [
            {
              "name": "Id",
              "type": "string",
              "description": "The ID for a configuration for DNS query logging.",
              "nested_items": []
            },
            {
              "name": "HostedZoneId",
              "type": "string",
              "description": "The ID of the hosted zone that CloudWatch Logs is logging queries for.",
              "nested_items": []
            },
            {
              "name": "CloudWatchLogsLogGroupArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the CloudWatch Logs log group that Amazon Route 53 is publishing logs to.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "Location",
          "type": "string",
          "description": "The unique URL representing the new query logging configuration.",
          "nested_items": []
        }
      ]
    }
  ]
}