{
  "method_name": "create_key_signing_key",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/route53/client/create_key_signing_key.html",
  "description": "Creates a new key-signing key (KSK) associated with a hosted zone. You can only have two KSKs per hosted zone.",
  "parameters": [
    {
      "name": "CallerReference",
      "type": "string",
      "required": true,
      "description": "A unique string that identifies the request.",
      "nested_params": []
    },
    {
      "name": "HostedZoneId",
      "type": "string",
      "required": true,
      "description": "The unique string (ID) used to identify a hosted zone.",
      "nested_params": []
    },
    {
      "name": "KeyManagementServiceArn",
      "type": "string",
      "required": true,
      "description": "The Amazon resource name (ARN) for a customer managed key in Key Management Service (KMS). The KeyManagementServiceArn must be unique for each key-signing key (KSK) in a single hosted zone. To see an example of KeyManagementServiceArn that grants the correct permissions for DNSSEC, scroll down to Example. You must configure the customer managed customer managed key as follows: Status Enabled Key spec ECC_NIST_P256 Key usage Sign and verify Key policy The key policy must give permission for the following actions: DescribeKey GetPublicKey Sign The key policy must also include the Amazon Route 53 service in the principal for your account. Specify the following: \"Service\": \"dnssec-route53.amazonaws.com\" For more information about working with a customer managed key in KMS, see Key Management Service concepts.",
      "nested_params": []
    },
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "A string used to identify a key-signing key (KSK). Name can include numbers, letters, and underscores (_). Name must be unique for each key-signing key in the same hosted zone.",
      "nested_params": []
    },
    {
      "name": "Status",
      "type": "string",
      "required": true,
      "description": "A string specifying the initial status of the key-signing key (KSK). You can set the value to ACTIVE or INACTIVE.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ChangeInfo",
          "type": "dict",
          "description": "A complex type that describes change information about changes made to your hosted zone.",
          "nested_items": [
            {
              "name": "Id",
              "type": "string",
              "description": "This element contains an ID that you use when performing a GetChange action to get detailed information about the change.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The current state of the request. PENDING indicates that this request has not yet been applied to all Amazon Route 53 DNS servers.",
              "nested_items": []
            },
            {
              "name": "SubmittedAt",
              "type": "datetime",
              "description": "The date and time that the change request was submitted in ISO 8601 format and Coordinated Universal Time (UTC). For example, the value 2017-03-27T17:48:16.751Z represents March 27, 2017 at 17:48:16.751 UTC.",
              "nested_items": []
            },
            {
              "name": "Comment",
              "type": "string",
              "description": "A comment you can provide.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "KeySigningKey",
          "type": "dict",
          "description": "The key-signing key (KSK) that the request creates.",
          "nested_items": [
            {
              "name": "Name",
              "type": "string",
              "description": "A string used to identify a key-signing key (KSK). Name can include numbers, letters, and underscores (_). Name must be unique for each key-signing key in the same hosted zone.",
              "nested_items": []
            },
            {
              "name": "KmsArn",
              "type": "string",
              "description": "The Amazon resource name (ARN) used to identify the customer managed key in Key Management Service (KMS). The KmsArn must be unique for each key-signing key (KSK) in a single hosted zone.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "DescribeKey.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "GetPublicKey.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Sign.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Flag",
              "type": "integer",
              "description": "An integer that specifies how the key is used. For key-signing key (KSK), this value is always 257.",
              "nested_items": []
            },
            {
              "name": "SigningAlgorithmMnemonic",
              "type": "string",
              "description": "A string used to represent the signing algorithm. This value must follow the guidelines provided by RFC-8624 Section 3.1.",
              "nested_items": []
            },
            {
              "name": "SigningAlgorithmType",
              "type": "integer",
              "description": "An integer used to represent the signing algorithm. This value must follow the guidelines provided by RFC-8624 Section 3.1.",
              "nested_items": []
            },
            {
              "name": "DigestAlgorithmMnemonic",
              "type": "string",
              "description": "A string used to represent the delegation signer digest algorithm. This value must follow the guidelines provided by RFC-8624 Section 3.3.",
              "nested_items": []
            },
            {
              "name": "DigestAlgorithmType",
              "type": "integer",
              "description": "An integer used to represent the delegation signer digest algorithm. This value must follow the guidelines provided by RFC-8624 Section 3.3.",
              "nested_items": []
            },
            {
              "name": "KeyTag",
              "type": "integer",
              "description": "An integer used to identify the DNSSEC record for the domain name. The process used to calculate the value is described in RFC-4034 Appendix B.",
              "nested_items": []
            },
            {
              "name": "DigestValue",
              "type": "string",
              "description": "A cryptographic digest of a DNSKEY resource record (RR). DNSKEY records are used to publish the public key that resolvers can use to verify DNSSEC signatures that are used to secure certain kinds of information provided by the DNS system.",
              "nested_items": []
            },
            {
              "name": "PublicKey",
              "type": "string",
              "description": "The public key, represented as a Base64 encoding, as required by RFC-4034 Page 5.",
              "nested_items": []
            },
            {
              "name": "DSRecord",
              "type": "string",
              "description": "A string that represents a delegation signer (DS) record.",
              "nested_items": []
            },
            {
              "name": "DNSKEYRecord",
              "type": "string",
              "description": "A string that represents a DNSKEY record.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "A string that represents the current key-signing key (KSK) status.",
              "nested_items": []
            },
            {
              "name": "StatusMessage",
              "type": "string",
              "description": "The status message provided for the following key-signing key (KSK) statuses: ACTION_NEEDED or INTERNAL_FAILURE. The status message includes information about what the problem might be and steps that you can take to correct the issue.",
              "nested_items": []
            },
            {
              "name": "CreatedDate",
              "type": "datetime",
              "description": "The date when the key-signing key (KSK) was created.",
              "nested_items": []
            },
            {
              "name": "LastModifiedDate",
              "type": "datetime",
              "description": "The last time that the key-signing key (KSK) was changed.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "Location",
          "type": "string",
          "description": "The unique URL representing the new key-signing key (KSK).",
          "nested_items": []
        }
      ]
    }
  ]
}