{
  "method_name": "delete_hosted_zone",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/route53/client/delete_hosted_zone.html",
  "description": "Deletes a hosted zone. If the hosted zone was created by another service, such as Cloud Map, see Deleting Public Hosted Zones That Were Created by Another Service in the Amazon Route 53 Developer Guide for information about how to delete it. (The process is the same for public and private hosted zones that were created by another service.) If you want to keep your domain registration but you want to stop routing internet traffic to your website or web application, we recommend that you delete resource record sets in the hosted zone instead of deleting the hosted zone. If you want to avoid the monthly charge for the hosted zone, you can transfer DNS service for the domain to a free DNS service. When you transfer DNS service, you have to update the name servers for the domain registration. If the domain is registered with Route 53, see UpdateDomainNameservers for information about how to replace Route 53 name servers with name servers for the new DNS service. If the domain is registered with another registrar, use the method provided by the registrar to update name servers for the domain registration. For more information, perform an internet search on 'free DNS service.' You can delete a hosted zone only if it contains only the default SOA record and NS resource record sets. If the hosted zone contains other resource record sets, you must delete them before you can delete the hosted zone. If you try to delete a hosted zone that contains other resource record sets, the request fails, and Route 53 returns a HostedZoneNotEmpty error. For information about deleting records from your hosted zone, see ChangeResourceRecordSets. To verify that the hosted zone has been deleted, do one of the following:",
  "parameters": [
    {
      "name": "Id",
      "type": "string",
      "required": true,
      "description": "The ID of the hosted zone you want to delete.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ChangeInfo",
          "type": "dict",
          "description": "A complex type that contains the ID, the status, and the date and time of a request to delete a hosted zone.",
          "nested_items": [
            {
              "name": "Id",
              "type": "string",
              "description": "This element contains an ID that you use when performing a GetChange action to get detailed information about the change.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The current state of the request. PENDING indicates that this request has not yet been applied to all Amazon Route 53 DNS servers.",
              "nested_items": []
            },
            {
              "name": "SubmittedAt",
              "type": "datetime",
              "description": "The date and time that the change request was submitted in ISO 8601 format and Coordinated Universal Time (UTC). For example, the value 2017-03-27T17:48:16.751Z represents March 27, 2017 at 17:48:16.751 UTC.",
              "nested_items": []
            },
            {
              "name": "Comment",
              "type": "string",
              "description": "A comment you can provide.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}