{
  "method_name": "get_hosted_zone",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/route53/client/get_hosted_zone.html",
  "description": "Gets information about a specified hosted zone including the four name servers assigned to the hosted zone. returns the VPCs associated with the specified hosted zone and does not reflect the VPC associations by Route 53 Profiles. To get the associations to a Profile, call the ListProfileAssociations API.",
  "parameters": [
    {
      "name": "Id",
      "type": "string",
      "required": true,
      "description": "The ID of the hosted zone that you want to get information about.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "HostedZone",
          "type": "dict",
          "description": "A complex type that contains general information about the specified hosted zone.",
          "nested_items": [
            {
              "name": "Id",
              "type": "string",
              "description": "The ID that Amazon Route 53 assigned to the hosted zone when you created it.",
              "nested_items": []
            },
            {
              "name": "Name",
              "type": "string",
              "description": "The name of the domain. For public hosted zones, this is the name that you have registered with your DNS registrar.",
              "nested_items": []
            },
            {
              "name": "CallerReference",
              "type": "string",
              "description": "The value that you specified for CallerReference when you created the hosted zone.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Comment",
                  "type": "string",
                  "description": "Any comments that you want to include about the hosted zone.",
                  "nested_items": []
                },
                {
                  "name": "PrivateZone",
                  "type": "boolean",
                  "description": "A value that indicates whether this is a private hosted zone.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "ResourceRecordSetCount",
              "type": "integer",
              "description": "The number of resource record sets in the hosted zone.",
              "nested_items": []
            },
            {
              "name": "LinkedService",
              "type": "dict",
              "description": "If the hosted zone was created by another service, the service that created the hosted zone. When a hosted zone is created by another service, you can't edit or delete it using Route 53.",
              "nested_items": [
                {
                  "name": "ServicePrincipal",
                  "type": "string",
                  "description": "If the health check or hosted zone was created by another service, the service that created the resource. When a resource is created by another service, you can't edit or delete it using Amazon Route 53.",
                  "nested_items": []
                },
                {
                  "name": "Description",
                  "type": "string",
                  "description": "If the health check or hosted zone was created by another service, an optional description that can be provided by the other service. When a resource is created by another service, you can't edit or delete it using Amazon Route 53.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "DelegationSet",
          "type": "dict",
          "description": "A complex type that lists the Amazon Route 53 name servers for the specified hosted zone.",
          "nested_items": [
            {
              "name": "Id",
              "type": "string",
              "description": "The ID that Amazon Route 53 assigns to a reusable delegation set.",
              "nested_items": []
            },
            {
              "name": "CallerReference",
              "type": "string",
              "description": "The value that you specified for CallerReference when you created the reusable delegation set.",
              "nested_items": []
            },
            {
              "name": "NameServers",
              "type": "list",
              "description": "A complex type that contains a list of the authoritative name servers for a hosted zone or for a reusable delegation set.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "VPCs",
          "type": "list",
          "description": "A complex type that contains information about the VPCs that are associated with the specified hosted zone.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "VPCRegion",
                  "type": "string",
                  "description": "(Private hosted zones only) The region that an Amazon VPC was created in.",
                  "nested_items": []
                },
                {
                  "name": "VPCId",
                  "type": "string",
                  "description": "(Private hosted zones only) The ID of an Amazon VPC.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}