{
  "method_name": "list_resource_record_sets",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/route53/client/list_resource_record_sets.html",
  "description": "Lists the resource record sets in a specified hosted zone. ListResourceRecordSets returns up to 300 resource record sets at a time in ASCII order, beginning at a position specified by the name and type elements. ListResourceRecordSets sorts results first by DNS name with the labels reversed, for example: com.example.www. Note the trailing dot, which can change the sort order when the record name contains characters that appear before . (decimal 46) in the ASCII table. These characters include the following: ! \" # $ % & ' ( ) * + , - When multiple records have the same DNS name, ListResourceRecordSets sorts results by the record type. You can use the name and type elements to specify the resource record set that the list begins with: The results begin with the first resource record set that the hosted zone contains. The results begin with the first resource record set in the list whose name is greater than or equal to Name. Amazon Route 53 returns the InvalidInput error. The results begin with the first resource record set in the list whose name is greater than or equal to Name, and whose type is greater than or equal to Type. This action returns the most current version of the records. This includes records that are PENDING, and that are not yet available on all Route 53 DNS servers. To ensure that you get an accurate listing of the resource record sets for a hosted zone at a point in time, do not submit a ChangeResourceRecordSets request while you're paging through the results of a ListResourceRecordSets request. If you do, some pages may display results without the latest changes while other pages display results with the latest changes. If a ListResourceRecordSets command returns more than one page of results, the value of IsTruncated is true. To display the next page of results, get the values of NextRecordName, NextRecordType, and NextRecordIdentifier (if any) from the response. Then submit another ListResourceRecordSets request, and specify those values for StartRecordName, StartRecordType, and StartRecordIdentifier.",
  "parameters": [
    {
      "name": "HostedZoneId",
      "type": "string",
      "required": true,
      "description": "The ID of the hosted zone that contains the resource record sets that you want to list.",
      "nested_params": []
    },
    {
      "name": "StartRecordName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "StartRecordType",
      "type": "string",
      "required": false,
      "description": "The type of resource record set to begin the record listing from. Valid values for basic resource record sets: A | AAAA | CAA | CNAME | MX | NAPTR | NS | PTR | SOA | SPF | SRV | TXT Values for weighted, latency, geolocation, and failover resource record sets: A | AAAA | CAA | CNAME | MX | NAPTR | PTR | SPF | SRV | TXT Values for alias resource record sets: API Gateway custom regional API or edge-optimized API: A CloudFront distribution: A or AAAA Elastic Beanstalk environment that has a regionalized subdomain: A Elastic Load Balancing load balancer: A | AAAA S3 bucket: A VPC interface VPC endpoint: A Another resource record set in this hosted zone: The type of the resource record set that the alias references. Constraint: Specifying type without specifying name returns an InvalidInput error.",
      "nested_params": [
        {
          "name": "API Gateway custom regional API or edge-optimized API",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "CloudFront distribution",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "Elastic Beanstalk environment that has a regionalized subdomain",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "Elastic Load Balancing load balancer",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "S3 bucket",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "VPC interface VPC endpoint",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "Another resource record set in this hosted zone:",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        }
      ]
    },
    {
      "name": "StartRecordIdentifier",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxItems",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ResourceRecordSets",
          "type": "list",
          "description": "Information about multiple resource record sets.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Name",
                  "type": "string",
                  "description": "For ChangeResourceRecordSets requests, the name of the record that you want to create, update, or delete. For ListResourceRecordSets responses, the name of a record in the specified hosted zone.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "The * must replace the entire label. For example, you can't specify *prod.example.com or prod*.example.com.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "The * can't replace any of the middle labels, for example, marketing.*.example.com.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "ASCII 42",
                      "description": "If you include * in any position other than the leftmost label in a domain name, DNS treats it as an * character (ASCII 42), not as a wildcard.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Type",
                  "type": "string",
                  "description": "The DNS record type. For information about different record types and how data is encoded for them, see Supported DNS Resource Record Types in the Amazon Route 53 Developer Guide.",
                  "nested_items": [
                    {
                      "name": "Amazon API Gateway custom regional APIs and edge-optimized APIs:",
                      "type": "",
                      "description": "",
                      "nested_items": []
                    },
                    {
                      "name": "CloudFront distributions:",
                      "type": "",
                      "description": "",
                      "nested_items": []
                    },
                    {
                      "name": "Amazon API Gateway environment that has a regionalized subdomain",
                      "type": "",
                      "description": "",
                      "nested_items": []
                    },
                    {
                      "name": "ELB load balancers:",
                      "type": "",
                      "description": "",
                      "nested_items": []
                    },
                    {
                      "name": "Amazon S3 buckets:",
                      "type": "",
                      "description": "",
                      "nested_items": []
                    },
                    {
                      "name": "Amazon Virtual Private Cloud interface VPC endpoints",
                      "type": "",
                      "description": "",
                      "nested_items": []
                    },
                    {
                      "name": "Another resource record set in this hosted zone:",
                      "type": "",
                      "description": "",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "SetIdentifier",
                  "type": "string",
                  "description": "Resource record sets that have a routing policy other than simple: An identifier that differentiates among multiple resource record sets that have the same combination of name and type, such as multiple weighted resource record sets named acme.example.com that have a type of A. In a group of resource record sets that have the same name and type, the value of SetIdentifier must be unique for each resource record set.",
                  "nested_items": []
                },
                {
                  "name": "Weight",
                  "type": "integer",
                  "description": "Weighted resource record sets only: Among resource record sets that have the same combination of DNS name and type, a value that determines the proportion of DNS queries that Amazon Route 53 responds to using the current resource record set. Route 53 calculates the sum of the weights for the resource record sets that have the same combination of DNS name and type. Route 53 then responds to queries based on the ratio of a resource's weight to the total. Note the following:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "You must specify a value for the Weight element for every weighted resource record set.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "You can only specify one ResourceRecord per weighted resource record set.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "You can't create latency, failover, or geolocation resource record sets that have the same values for the Name and Type elements as weighted resource record sets.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "You can create a maximum of 100 weighted resource record sets that have the same values for the Name and Type elements.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "but not weighted alias",
                      "description": "For weighted (but not weighted alias) resource record sets, if you set Weight to 0 for a resource record set, Route 53 never responds to queries with the applicable value for that resource record set. However, if you set Weight to 0 for all resource record sets that have the same combination of DNS name and type, traffic is routed to all resources with equal probability. The effect of setting Weight to 0 is different when you associate health checks with weighted resource record sets. For more information, see Options for Configuring Route 53 Active-Active and Active-Passive Failover in the Amazon Route 53 Developer Guide.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Region",
                  "type": "string",
                  "description": "Latency-based resource record sets only: The Amazon EC2 Region where you created the resource that this resource record set refers to. The resource typically is an Amazon Web Services resource, such as an EC2 instance or an ELB load balancer, and is referred to by an IP address or a DNS domain name, depending on the record type.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "You can only specify one ResourceRecord per latency resource record set.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "You can only create one latency resource record set for each Amazon EC2 Region.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "You aren't required to create latency resource record sets for all Amazon EC2 Regions. Route 53 will choose the region with the best latency from among the regions that you create latency resource record sets for.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "You can't create non-latency resource record sets that have the same values for the Name and Type elements as latency resource record sets.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "GeoLocation",
                  "type": "dict",
                  "description": "Geolocation resource record sets only: A complex type that lets you control how Amazon Route 53 responds to DNS queries based on the geographic origin of the query. For example, if you want all queries from Africa to be routed to a web server with an IP address of 192.0.2.111, create a resource record set with a Type of A and a ContinentCode of AF.",
                  "nested_items": [
                    {
                      "name": "ContinentCode",
                      "type": "string",
                      "description": "The two-letter code for the continent.",
                      "nested_items": [
                        {
                          "name": "AF",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "AN",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "AS",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "EU",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "OC",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "NA",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "SA",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "CountryCode",
                      "type": "string",
                      "description": "For geolocation resource record sets, the two-letter code for a country.",
                      "nested_items": []
                    },
                    {
                      "name": "SubdivisionCode",
                      "type": "string",
                      "description": "For geolocation resource record sets, the two-letter code for a state of the United States. Route 53 doesn't support any other values for SubdivisionCode. For a list of state abbreviations, see Appendix B: Two---Letter State and Possession Abbreviations on the United States Postal Service website.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Failover",
                  "type": "string",
                  "description": "Failover resource record sets only: To configure failover, you add the Failover element to two resource record sets. For one resource record set, you specify PRIMARY as the value for Failover; for the other resource record set, you specify SECONDARY. In addition, you include the HealthCheckId element and specify the health check that you want Amazon Route 53 to perform for each resource record set.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "When the primary resource record set is healthy, Route 53 responds to DNS queries with the applicable value from the primary resource record set regardless of the health of the secondary resource record set.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "When the primary resource record set is unhealthy and the secondary resource record set is healthy, Route 53 responds to DNS queries with the applicable value from the secondary resource record set.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "When the secondary resource record set is unhealthy, Route 53 responds to DNS queries with the applicable value from the primary resource record set regardless of the health of the primary resource record set.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "If you omit the HealthCheckId element for the secondary resource record set, and if the primary resource record set is unhealthy, Route 53 always responds to DNS queries with the applicable value from the secondary resource record set. This is true regardless of the health of the associated endpoint.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "MultiValueAnswer",
                  "type": "boolean",
                  "description": "Multivalue answer resource record sets only: To route traffic approximately randomly to multiple resources, such as web servers, create one multivalue answer record for each resource and specify true for MultiValueAnswer. Note the following:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "If you associate a health check with a multivalue answer resource record set, Amazon Route 53 responds to DNS queries with the corresponding IP address only when the health check is healthy.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "If you don't associate a health check with a multivalue answer record, Route 53 always considers the record to be healthy.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Route 53 responds to DNS queries with up to eight healthy records; if you have eight or fewer healthy records, Route 53 responds to all DNS queries with all the healthy records.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "If you have more than eight healthy records, Route 53 responds to different DNS resolvers with different combinations of healthy records.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "When all records are unhealthy, Route 53 responds to DNS queries with up to eight unhealthy records.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "If a resource becomes unavailable after a resolver caches a response, client software typically tries another of the IP addresses in the response.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "TTL",
                  "type": "integer",
                  "description": "The resource record cache time to live (TTL), in seconds. Note the following:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "If you're creating or updating an alias resource record set, omit TTL. Amazon Route 53 uses the value of TTL for the alias target.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "if youâ\u0080\u0099re adding a HealthCheckId element",
                      "description": "If you're associating this resource record set with a health check (if you're adding a HealthCheckId element), we recommend that you specify a TTL of 60 seconds or less so clients respond quickly to changes in health status.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "All of the resource record sets in a group of weighted resource record sets must have the same value for TTL.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "the TTL for load balancers",
                      "description": "If a group of weighted resource record sets includes one or more weighted alias resource record sets for which the alias target is an ELB load balancer, we recommend that you specify a TTL of 60 seconds for all of the non-alias weighted resource record sets that have the same name and type. Values other than 60 seconds (the TTL for load balancers) will change the effect of the values that you specify for Weight.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "ResourceRecords",
                  "type": "list",
                  "description": "Information about the resource records to act upon.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Value",
                          "type": "string",
                          "description": "The current or new DNS record value, not to exceed 4,000 characters. In the case of a DELETE action, if the current value does not match the actual value, an error is returned. For descriptions about how to format Value for different record types, see Supported DNS Resource Record Types in the Amazon Route 53 Developer Guide.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "AliasTarget",
                  "type": "dict",
                  "description": "Alias resource record sets only: Information about the Amazon Web Services resource, such as a CloudFront distribution or an Amazon S3 bucket, that you want to route traffic to.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "You can't create an alias resource record set in a private hosted zone to route traffic to a CloudFront distribution.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "For information about creating failover resource record sets in a private hosted zone, see Configuring Failover in a Private Hosted Zone in the Amazon Route 53 Developer Guide.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "HealthCheckId",
                  "type": "string",
                  "description": "If you want Amazon Route 53 to return this resource record set in response to a DNS query only when the status of a health check is healthy, include the HealthCheckId element and specify the ID of the applicable health check.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "By periodically sending a request to the endpoint that is specified in the health check.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "calculated health checks",
                      "description": "By aggregating the status of a specified group of health checks (calculated health checks)",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "CloudWatch metric health checks",
                      "description": "By determining the current state of a CloudWatch alarm (CloudWatch metric health checks)",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "TrafficPolicyInstanceId",
                  "type": "string",
                  "description": "When you create a traffic policy instance, Amazon Route 53 automatically creates a resource record set. TrafficPolicyInstanceId is the ID of the traffic policy instance that Route 53 created this resource record set for.",
                  "nested_items": []
                },
                {
                  "name": "CidrRoutingConfig",
                  "type": "dict",
                  "description": "The object that is specified in resource record set object when you are linking a resource record set to a CIDR location.",
                  "nested_items": [
                    {
                      "name": "CollectionId",
                      "type": "string",
                      "description": "The CIDR collection ID.",
                      "nested_items": []
                    },
                    {
                      "name": "LocationName",
                      "type": "string",
                      "description": "The CIDR collection location name.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "GeoProximityLocation",
                  "type": "dict",
                  "description": "GeoproximityLocation resource record sets only: A complex type that lets you control how Route 53 responds to DNS queries based on the geographic origin of the query and your resources.",
                  "nested_items": [
                    {
                      "name": "AWSRegion",
                      "type": "string",
                      "description": "The Amazon Web Services Region the resource you are directing DNS traffic to, is in.",
                      "nested_items": []
                    },
                    {
                      "name": "LocalZoneGroup",
                      "type": "string",
                      "description": "Specifies an Amazon Web Services Local Zone Group.",
                      "nested_items": []
                    },
                    {
                      "name": "Coordinates",
                      "type": "dict",
                      "description": "Contains the longitude and latitude for a geographic region.",
                      "nested_items": [
                        {
                          "name": "Latitude",
                          "type": "string",
                          "description": "Specifies a coordinate of the north---south position of a geographic point on the surface of the Earth (-90 - 90).",
                          "nested_items": []
                        },
                        {
                          "name": "Longitude",
                          "type": "string",
                          "description": "Specifies a coordinate of the east---west position of a geographic point on the surface of the Earth (-180 - 180).",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "Bias",
                      "type": "integer",
                      "description": "The bias increases or decreases the size of the geographic region from which Route 53 routes traffic to a resource.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "To expand the size of the geographic region from which Route 53 routes traffic to a resource, specify a positive integer from 1 to 99 for the bias. Route 53 shrinks the size of adjacent regions.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "To shrink the size of the geographic region from which Route 53 routes traffic to a resource, specify a negative bias of -1 to -99. Route 53 expands the size of adjacent regions.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "IsTruncated",
          "type": "boolean",
          "description": "A flag that indicates whether more resource record sets remain to be listed. If your results were truncated, you can make a follow-up pagination request by using the NextRecordName element.",
          "nested_items": []
        },
        {
          "name": "NextRecordName",
          "type": "string",
          "description": "If the results were truncated, the name of the next record in the list.",
          "nested_items": []
        },
        {
          "name": "NextRecordType",
          "type": "string",
          "description": "If the results were truncated, the type of the next record in the list.",
          "nested_items": []
        },
        {
          "name": "NextRecordIdentifier",
          "type": "string",
          "description": "Resource record sets that have a routing policy other than simple: If results were truncated for a given DNS name and type, the value of SetIdentifier for the next resource record set that has the current DNS name and type.",
          "nested_items": []
        },
        {
          "name": "MaxItems",
          "type": "string",
          "description": "The maximum number of records you requested.",
          "nested_items": []
        }
      ]
    }
  ]
}