{
  "method_name": "list_reusable_delegation_sets",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/route53/client/list_reusable_delegation_sets.html",
  "description": "Retrieves a list of the reusable delegation sets that are associated with the current Amazon Web Services account.",
  "parameters": [
    {
      "name": "Marker",
      "type": "string",
      "required": false,
      "description": "If the value of IsTruncated in the previous response was true, you have more reusable delegation sets. To get another group, submit another ListReusableDelegationSets request. For the value of marker, specify the value of NextMarker from the previous response, which is the ID of the first reusable delegation set that Amazon Route 53 will return if you submit another request. If the value of IsTruncated in the previous response was false, there are no more reusable delegation sets to get.",
      "nested_params": []
    },
    {
      "name": "MaxItems",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "DelegationSets",
          "type": "list",
          "description": "A complex type that contains one DelegationSet element for each reusable delegation set that was created by the current Amazon Web Services account.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Id",
                  "type": "string",
                  "description": "The ID that Amazon Route 53 assigns to a reusable delegation set.",
                  "nested_items": []
                },
                {
                  "name": "CallerReference",
                  "type": "string",
                  "description": "The value that you specified for CallerReference when you created the reusable delegation set.",
                  "nested_items": []
                },
                {
                  "name": "NameServers",
                  "type": "list",
                  "description": "A complex type that contains a list of the authoritative name servers for a hosted zone or for a reusable delegation set.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Marker",
          "type": "string",
          "description": "For the second and subsequent calls to ListReusableDelegationSets, Marker is the value that you specified for the marker parameter in the request that produced the current response.",
          "nested_items": []
        },
        {
          "name": "IsTruncated",
          "type": "boolean",
          "description": "A flag that indicates whether there are more reusable delegation sets to be listed.",
          "nested_items": []
        },
        {
          "name": "NextMarker",
          "type": "string",
          "description": "If IsTruncated is true, the value of NextMarker identifies the next reusable delegation set that Amazon Route 53 will return if you submit another ListReusableDelegationSets request and specify the value of NextMarker in the marker parameter.",
          "nested_items": []
        },
        {
          "name": "MaxItems",
          "type": "string",
          "description": "The value that you specified for the maxitems parameter in the call to ListReusableDelegationSets that produced the current response.",
          "nested_items": []
        }
      ]
    }
  ]
}