{
  "method_name": "list_hosted_zones_by_vpc",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/route53/client/list_hosted_zones_by_vpc.html",
  "description": "Lists all the private hosted zones that a specified VPC is associated with, regardless of which Amazon Web Services account or Amazon Web Services service owns the hosted zones. The HostedZoneOwner structure in the response contains one of the following values: ListHostedZonesByVPC returns the hosted zones associated with the specified VPC and does not reflect the hosted zone associations to VPCs via Route 53 Profiles. To get the associations to a Profile, call the ListProfileResourceAssociations API.",
  "parameters": [
    {
      "name": "VPCId",
      "type": "string",
      "required": true,
      "description": "The ID of the Amazon VPC that you want to list hosted zones for.",
      "nested_params": []
    },
    {
      "name": "VPCRegion",
      "type": "string",
      "required": true,
      "description": "For the Amazon VPC that you specified for VPCId, the Amazon Web Services Region that you created the VPC in.",
      "nested_params": []
    },
    {
      "name": "MaxItems",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "If the previous response included a NextToken element, the specified VPC is associated with more hosted zones. To get more hosted zones, submit another ListHostedZonesByVPC request. For the value of NextToken, specify the value of NextToken from the previous response. If the previous response didn't include a NextToken element, there are no more hosted zones to get.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "HostedZoneSummaries",
          "type": "list",
          "description": "A list that contains one HostedZoneSummary element for each hosted zone that the specified Amazon VPC is associated with. Each HostedZoneSummary element contains the hosted zone name and ID, and information about who owns the hosted zone.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "HostedZoneId",
                  "type": "string",
                  "description": "The Route 53 hosted zone ID of a private hosted zone that the specified VPC is associated with.",
                  "nested_items": []
                },
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The name of the private hosted zone, such as example.com.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "OwningAccount",
                      "type": "string",
                      "description": "If the hosted zone was created by an Amazon Web Services account, or was created by an Amazon Web Services service that creates hosted zones using the current account, OwningAccount contains the account ID of that account. For example, when you use Cloud Map to create a hosted zone, Cloud Map creates the hosted zone using the current Amazon Web Services account.",
                      "nested_items": []
                    },
                    {
                      "name": "OwningService",
                      "type": "string",
                      "description": "If an Amazon Web Services service uses its own account to create a hosted zone and associate the specified VPC with that hosted zone, OwningService contains an abbreviation that identifies the service. For example, if Amazon Elastic File System (Amazon EFS) created a hosted zone and associated a VPC with the hosted zone, the value of OwningService is efs.amazonaws.com.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "MaxItems",
          "type": "string",
          "description": "The value that you specified for MaxItems in the most recent ListHostedZonesByVPC request.",
          "nested_items": []
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The value that you will use for NextToken in the next ListHostedZonesByVPC request.",
          "nested_items": []
        }
      ]
    }
  ]
}