{
  "method_name": "list_traffic_policies",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/route53/client/list_traffic_policies.html",
  "description": "Gets information about the latest version for every traffic policy that is associated with the current Amazon Web Services account. Policies are listed in the order that they were created in. For information about how of deleting a traffic policy affects the response from ListTrafficPolicies, see DeleteTrafficPolicy.",
  "parameters": [
    {
      "name": "TrafficPolicyIdMarker",
      "type": "string",
      "required": false,
      "description": "(Conditional) For your first request to ListTrafficPolicies, don't include the TrafficPolicyIdMarker parameter. If you have more traffic policies than the value of MaxItems, ListTrafficPolicies returns only the first MaxItems traffic policies. To get the next group of policies, submit another request to ListTrafficPolicies. For the value of TrafficPolicyIdMarker, specify the value of TrafficPolicyIdMarker that was returned in the previous response.",
      "nested_params": []
    },
    {
      "name": "MaxItems",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "TrafficPolicySummaries",
          "type": "list",
          "description": "A list that contains one TrafficPolicySummary element for each traffic policy that was created by the current Amazon Web Services account.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Id",
                  "type": "string",
                  "description": "The ID that Amazon Route 53 assigned to the traffic policy when you created it.",
                  "nested_items": []
                },
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The name that you specified for the traffic policy when you created it.",
                  "nested_items": []
                },
                {
                  "name": "Type",
                  "type": "string",
                  "description": "The DNS type of the resource record sets that Amazon Route 53 creates when you use a traffic policy to create a traffic policy instance.",
                  "nested_items": []
                },
                {
                  "name": "LatestVersion",
                  "type": "integer",
                  "description": "The version number of the latest version of the traffic policy.",
                  "nested_items": []
                },
                {
                  "name": "TrafficPolicyCount",
                  "type": "integer",
                  "description": "The number of traffic policies that are associated with the current Amazon Web Services account.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "IsTruncated",
          "type": "boolean",
          "description": "A flag that indicates whether there are more traffic policies to be listed. If the response was truncated, you can get the next group of traffic policies by submitting another ListTrafficPolicies request and specifying the value of TrafficPolicyIdMarker in the TrafficPolicyIdMarker request parameter.",
          "nested_items": []
        },
        {
          "name": "TrafficPolicyIdMarker",
          "type": "string",
          "description": "If the value of IsTruncated is true, TrafficPolicyIdMarker is the ID of the first traffic policy in the next group of MaxItems traffic policies.",
          "nested_items": []
        },
        {
          "name": "MaxItems",
          "type": "string",
          "description": "The value that you specified for the MaxItems parameter in the ListTrafficPolicies request that produced the current response.",
          "nested_items": []
        }
      ]
    }
  ]
}