{
  "method_name": "update_traffic_policy_instance",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/route53/client/update_traffic_policy_instance.html",
  "description": "Updates the resource record sets in a specified hosted zone that were created based on the settings in a specified traffic policy version. When you update a traffic policy instance, Amazon Route 53 continues to respond to DNS queries for the root resource record set name (such as example.com) while it replaces one group of resource record sets with another. Route 53 performs the following operations:",
  "parameters": [
    {
      "name": "Id",
      "type": "string",
      "required": true,
      "description": "The ID of the traffic policy instance that you want to update.",
      "nested_params": []
    },
    {
      "name": "TTL",
      "type": "integer",
      "required": true,
      "description": "The TTL that you want Amazon Route 53 to assign to all of the updated resource record sets.",
      "nested_params": []
    },
    {
      "name": "TrafficPolicyId",
      "type": "string",
      "required": true,
      "description": "The ID of the traffic policy that you want Amazon Route 53 to use to update resource record sets for the specified traffic policy instance.",
      "nested_params": []
    },
    {
      "name": "TrafficPolicyVersion",
      "type": "integer",
      "required": true,
      "description": "The version of the traffic policy that you want Amazon Route 53 to use to update resource record sets for the specified traffic policy instance.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "TrafficPolicyInstance",
          "type": "dict",
          "description": "A complex type that contains settings for the updated traffic policy instance.",
          "nested_items": [
            {
              "name": "Id",
              "type": "string",
              "description": "The ID that Amazon Route 53 assigned to the new traffic policy instance.",
              "nested_items": []
            },
            {
              "name": "HostedZoneId",
              "type": "string",
              "description": "The ID of the hosted zone that Amazon Route 53 created resource record sets in.",
              "nested_items": []
            },
            {
              "name": "Name",
              "type": "string",
              "description": "The DNS name, such as www.example.com, for which Amazon Route 53 responds to queries by using the resource record sets that are associated with this traffic policy instance.",
              "nested_items": []
            },
            {
              "name": "TTL",
              "type": "integer",
              "description": "The TTL that Amazon Route 53 assigned to all of the resource record sets that it created in the specified hosted zone.",
              "nested_items": []
            },
            {
              "name": "State",
              "type": "string",
              "description": "The value of State is one of the following values:",
              "nested_items": []
            },
            {
              "name": "Message",
              "type": "string",
              "description": "If State is Failed, an explanation of the reason for the failure. If State is another value, Message is empty.",
              "nested_items": []
            },
            {
              "name": "TrafficPolicyId",
              "type": "string",
              "description": "The ID of the traffic policy that Amazon Route 53 used to create resource record sets in the specified hosted zone.",
              "nested_items": []
            },
            {
              "name": "TrafficPolicyVersion",
              "type": "integer",
              "description": "The version of the traffic policy that Amazon Route 53 used to create resource record sets in the specified hosted zone.",
              "nested_items": []
            },
            {
              "name": "TrafficPolicyType",
              "type": "string",
              "description": "The DNS type that Amazon Route 53 assigned to all of the resource record sets that it created for this traffic policy instance.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}