{
  "method_name": "create_disk_snapshot",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/lightsail/client/create_disk_snapshot.html",
  "description": "Creates a snapshot of a block storage disk. You can use snapshots for backups, to make copies of disks, and to save data before shutting down a Lightsail instance. You can take a snapshot of an attached disk that is in use; however, snapshots only capture data that has been written to your disk at the time the snapshot command is issued. This may exclude any data that has been cached by any applications or the operating system. If you can pause any file systems on the disk long enough to take a snapshot, your snapshot should be complete. Nevertheless, if you cannot pause all file writes to the disk, you should unmount the disk from within the Lightsail instance, issue the create disk snapshot command, and then remount the disk to ensure a consistent and complete snapshot. You may remount and use your disk while the snapshot status is pending. You can also use this operation to create a snapshot of an instance's system volume. You might want to do this, for example, to recover data from the system volume of a botched instance or to create a backup of the system volume like you would for a block storage disk. To create a snapshot of a system volume, just define the instance name parameter when issuing the snapshot command, and a snapshot of the defined instance's system volume will be created. After the snapshot is available, you can create a block storage disk from the snapshot and attach it to a running instance to access the data on the disk. The create disk snapshot operation supports tag-based access control via request tags. For more information, see the Amazon Lightsail Developer Guide.",
  "parameters": [
    {
      "name": "diskName",
      "type": "string",
      "required": false,
      "description": "The unique name of the source disk ( Disk-Virginia-1).",
      "nested_params": []
    },
    {
      "name": "diskSnapshotName",
      "type": "string",
      "required": true,
      "description": "The name of the destination disk snapshot ( my-disk-snapshot) based on the source disk.",
      "nested_params": []
    },
    {
      "name": "instanceName",
      "type": "string",
      "required": false,
      "description": "The unique name of the source instance ( Amazon_Linux-512MB-Virginia-1). When this is defined, a snapshot of the instance's system volume is created.",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "list",
      "required": false,
      "description": "The tag keys and optional values to add to the resource during create. Use the TagResource action to tag a resource after it's created. (dict) --- Describes a tag key and optional value assigned to an Amazon Lightsail resource. For more information about tags in Lightsail, see the Amazon Lightsail Developer Guide. key (string) --- The key of the tag. Constraints: Tag keys accept a maximum of 128 letters, numbers, spaces in UTF-8, or the following characters: + - = . _ : / @ value (string) --- The value of the tag. Constraints: Tag values accept a maximum of 256 letters, numbers, spaces in UTF-8, or the following characters: + - = . _ : / @",
      "nested_params": [
        {
          "name": "key",
          "type": "string",
          "required": false,
          "description": "The key of the tag. Constraints: Tag keys accept a maximum of 128 letters, numbers, spaces in UTF-8, or the following characters: + - = . _ : / @",
          "nested_params": []
        },
        {
          "name": "value",
          "type": "string",
          "required": false,
          "description": "The value of the tag. Constraints: Tag values accept a maximum of 256 letters, numbers, spaces in UTF-8, or the following characters: + - = . _ : / @",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "operations",
          "type": "list",
          "description": "An array of objects that describe the result of the action, such as the status of the request, the timestamp of the request, and the resources affected by the request.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "id",
                  "type": "string",
                  "description": "The ID of the operation.",
                  "nested_items": []
                },
                {
                  "name": "resourceName",
                  "type": "string",
                  "description": "The resource name.",
                  "nested_items": []
                },
                {
                  "name": "resourceType",
                  "type": "string",
                  "description": "The resource type.",
                  "nested_items": []
                },
                {
                  "name": "createdAt",
                  "type": "datetime",
                  "description": "The timestamp when the operation was initialized ( 1479816991.349).",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "availabilityZone",
                      "type": "string",
                      "description": "The Availability Zone. Follows the format us-east-2a (case-sensitive).",
                      "nested_items": []
                    },
                    {
                      "name": "regionName",
                      "type": "string",
                      "description": "The Amazon Web Services Region name.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "isTerminal",
                  "type": "boolean",
                  "description": "A Boolean value indicating whether the operation is terminal.",
                  "nested_items": []
                },
                {
                  "name": "operationDetails",
                  "type": "string",
                  "description": "Details about the operation ( Debian-1GB-Ohio-1).",
                  "nested_items": []
                },
                {
                  "name": "operationType",
                  "type": "string",
                  "description": "The type of operation.",
                  "nested_items": []
                },
                {
                  "name": "status",
                  "type": "string",
                  "description": "The status of the operation.",
                  "nested_items": []
                },
                {
                  "name": "statusChangedAt",
                  "type": "datetime",
                  "description": "The timestamp when the status was changed ( 1479816991.349).",
                  "nested_items": []
                },
                {
                  "name": "errorCode",
                  "type": "string",
                  "description": "The error code.",
                  "nested_items": []
                },
                {
                  "name": "errorDetails",
                  "type": "string",
                  "description": "The error details.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}