{
  "method_name": "create_container_service_registry_login",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/lightsail/client/create_container_service_registry_login.html",
  "description": "Creates a temporary set of log in credentials that you can use to log in to the Docker process on your local machine. After you're logged in, you can use the native Docker commands to push your local container images to the container image registry of your Amazon Lightsail account so that you can use them with your Lightsail container service. The log in credentials expire 12 hours after they are created, at which point you will need to create a new set of log in credentials. After you push your container images to the container image registry of your Lightsail account, use the RegisterContainerImage action to register the pushed images to a specific Lightsail container service.",
  "parameters": [],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "registryLogin",
          "type": "dict",
          "description": "An object that describes the log in information for the container service registry of your Lightsail account.",
          "nested_items": [
            {
              "name": "username",
              "type": "string",
              "description": "The container service registry username to use to push container images to the container image registry of a Lightsail account.",
              "nested_items": []
            },
            {
              "name": "password",
              "type": "string",
              "description": "The container service registry password to use to push container images to the container image registry of a Lightsail account.",
              "nested_items": []
            },
            {
              "name": "expiresAt",
              "type": "datetime",
              "description": "The timestamp of when the container image registry sign-in credentials expire.",
              "nested_items": []
            },
            {
              "name": "registry",
              "type": "string",
              "description": "The address to use to push container images to the container image registry of a Lightsail account.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}