{
  "method_name": "get_bucket_metric_data",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/lightsail/client/get_bucket_metric_data.html",
  "description": "Returns the data points of a specific metric for an Amazon Lightsail bucket. Metrics report the utilization of a bucket. View and collect metric data regularly to monitor the number of objects stored in a bucket (including object versions) and the storage space used by those objects.",
  "parameters": [
    {
      "name": "bucketName",
      "type": "string",
      "required": true,
      "description": "The name of the bucket for which to get metric data.",
      "nested_params": []
    },
    {
      "name": "metricName",
      "type": "string",
      "required": true,
      "description": "The metric for which you want to return information. Valid bucket metric names are listed below, along with the most useful statistics to include in your request, and the published unit value. BucketSizeBytes - The amount of data in bytes stored in a bucket. This value is calculated by summing the size of all objects in the bucket (including object versions), including the size of all parts for all incomplete multipart uploads to the bucket. Statistics: The most useful statistic is Maximum. Unit: The published unit is Bytes. NumberOfObjects - The total number of objects stored in a bucket. This value is calculated by counting all objects in the bucket (including object versions) and the total number of parts for all incomplete multipart uploads to the bucket. Statistics: The most useful statistic is Average. Unit: The published unit is Count.",
      "nested_params": []
    },
    {
      "name": "startTime",
      "type": "datetime",
      "required": true,
      "description": "The timestamp indicating the earliest data to be returned.",
      "nested_params": []
    },
    {
      "name": "endTime",
      "type": "datetime",
      "required": true,
      "description": "The timestamp indicating the latest data to be returned.",
      "nested_params": []
    },
    {
      "name": "period",
      "type": "integer",
      "required": true,
      "description": "The granularity, in seconds, of the returned data points.",
      "nested_params": []
    },
    {
      "name": "statistics",
      "type": "list",
      "required": true,
      "description": "The statistic for the metric. The following statistics are available: Minimum - The lowest value observed during the specified period. Use this value to determine low volumes of activity for your application. Maximum - The highest value observed during the specified period. Use this value to determine high volumes of activity for your application. Sum - The sum of all values submitted for the matching metric. You can use this statistic to determine the total volume of a metric. Average - The value of Sum / SampleCount during the specified period. By comparing this statistic with the Minimum and Maximum values, you can determine the full scope of a metric and how close the average use is to the Minimum and Maximum values. This comparison helps you to know when to increase or decrease your resources. SampleCount - The count, or number, of data points used for the statistical calculation. (string) ---",
      "nested_params": []
    },
    {
      "name": "unit",
      "type": "string",
      "required": true,
      "description": "The unit for the metric data request. Valid units depend on the metric data being requested. For the valid units with each available metric, see the metricName parameter.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "metricName",
          "type": "string",
          "description": "The name of the metric returned.",
          "nested_items": []
        },
        {
          "name": "metricData",
          "type": "list",
          "description": "An array of objects that describe the metric data returned.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "average",
                  "type": "float",
                  "description": "The average.",
                  "nested_items": []
                },
                {
                  "name": "maximum",
                  "type": "float",
                  "description": "The maximum.",
                  "nested_items": []
                },
                {
                  "name": "minimum",
                  "type": "float",
                  "description": "The minimum.",
                  "nested_items": []
                },
                {
                  "name": "sampleCount",
                  "type": "float",
                  "description": "The sample count.",
                  "nested_items": []
                },
                {
                  "name": "sum",
                  "type": "float",
                  "description": "The sum.",
                  "nested_items": []
                },
                {
                  "name": "timestamp",
                  "type": "datetime",
                  "description": "The timestamp ( 1479816991.349).",
                  "nested_items": []
                },
                {
                  "name": "unit",
                  "type": "string",
                  "description": "The unit.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}