{
  "method_name": "get_container_log",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/lightsail/client/get_container_log.html",
  "description": "Returns the log events of a container of your Amazon Lightsail container service. If your container service has more than one node (i.e., a scale greater than 1), then the log events that are returned for the specified container are merged from all nodes on your container service.",
  "parameters": [
    {
      "name": "serviceName",
      "type": "string",
      "required": true,
      "description": "The name of the container service for which to get a container log.",
      "nested_params": []
    },
    {
      "name": "containerName",
      "type": "string",
      "required": true,
      "description": "The name of the container that is either running or previously ran on the container service for which to return a log.",
      "nested_params": []
    },
    {
      "name": "startTime",
      "type": "datetime",
      "required": false,
      "description": "The start of the time interval for which to get log data. Constraints: Specified in Coordinated Universal Time (UTC). Specified in the Unix time format. For example, if you wish to use a start time of October 1, 2018, at 8 PM UTC, specify 1538424000 as the start time. You can convert a human-friendly time to Unix time format using a converter like Epoch converter.",
      "nested_params": []
    },
    {
      "name": "endTime",
      "type": "datetime",
      "required": false,
      "description": "The end of the time interval for which to get log data. Constraints: Specified in Coordinated Universal Time (UTC). Specified in the Unix time format. For example, if you wish to use an end time of October 1, 2018, at 9 PM UTC, specify 1538427600 as the end time. You can convert a human-friendly time to Unix time format using a converter like Epoch converter.",
      "nested_params": []
    },
    {
      "name": "filterPattern",
      "type": "string",
      "required": false,
      "description": "The pattern to use to filter the returned log events to a specific term. The following are a few examples of filter patterns that you can specify: To return all log events, specify a filter pattern of \"\". To exclude log events that contain the ERROR term, and return all other log events, specify a filter pattern of \"-ERROR\". To return log events that contain the ERROR term, specify a filter pattern of \"ERROR\". To return log events that contain both the ERROR and Exception terms, specify a filter pattern of \"ERROR Exception\". To return log events that contain the ERROR or the Exception term, specify a filter pattern of \"?ERROR ?Exception\".",
      "nested_params": []
    },
    {
      "name": "pageToken",
      "type": "string",
      "required": false,
      "description": "The token to advance to the next page of results from your request. To get a page token, perform an initial GetContainerLog request. If your results are paginated, the response will return a next page token that you can specify as the page token in a subsequent request.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "logEvents",
          "type": "list",
          "description": "An array of objects that describe the log events of a container.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "createdAt",
                  "type": "datetime",
                  "description": "The timestamp when the container service log event was created.",
                  "nested_items": []
                },
                {
                  "name": "message",
                  "type": "string",
                  "description": "The message of the container service log event.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "nextPageToken",
          "type": "string",
          "description": "The token to advance to the next page of results from your request.",
          "nested_items": []
        }
      ]
    }
  ]
}