{
  "method_name": "get_relational_database_metric_data",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/lightsail/client/get_relational_database_metric_data.html",
  "description": "Returns the data points of the specified metric for a database in Amazon Lightsail. Metrics report the utilization of your resources, and the error counts generated by them. Monitor and collect metric data regularly to maintain the reliability, availability, and performance of your resources.",
  "parameters": [
    {
      "name": "relationalDatabaseName",
      "type": "string",
      "required": true,
      "description": "The name of your database from which to get metric data.",
      "nested_params": []
    },
    {
      "name": "metricName",
      "type": "string",
      "required": true,
      "description": "The metric for which you want to return information. Valid relational database metric names are listed below, along with the most useful statistics to include in your request, and the published unit value. All relational database metric data is available in 1-minute (60 seconds) granularity. CPUUtilization - The percentage of CPU utilization currently in use on the database. Statistics: The most useful statistics are Maximum and Average. Unit: The published unit is Percent. DatabaseConnections - The number of database connections in use. Statistics: The most useful statistics are Maximum and Sum. Unit: The published unit is Count. DiskQueueDepth - The number of outstanding IOs (read/write requests) that are waiting to access the disk. Statistics: The most useful statistic is Sum. FreeStorageSpace - The amount of available storage space. Unit: The published unit is Bytes. NetworkReceiveThroughput - The incoming (Receive) network traffic on the database, including both customer database traffic and AWS traffic used for monitoring and replication. Statistics: The most useful statistic is Average. Unit: The published unit is Bytes/Second. NetworkTransmitThroughput - The outgoing (Transmit) network traffic on the database, including both customer database traffic and AWS traffic used for monitoring and replication. Unit: The published unit is Bytes/Second.",
      "nested_params": []
    },
    {
      "name": "period",
      "type": "integer",
      "required": true,
      "description": "The granularity, in seconds, of the returned data points. All relational database metric data is available in 1-minute (60 seconds) granularity.",
      "nested_params": []
    },
    {
      "name": "startTime",
      "type": "datetime",
      "required": true,
      "description": "The start of the time interval from which to get metric data. Constraints: Specified in Coordinated Universal Time (UTC). Specified in the Unix time format. For example, if you wish to use a start time of October 1, 2018, at 8 PM UTC, then you input 1538424000 as the start time.",
      "nested_params": []
    },
    {
      "name": "endTime",
      "type": "datetime",
      "required": true,
      "description": "The end of the time interval from which to get metric data. Constraints: Specified in Coordinated Universal Time (UTC). Specified in the Unix time format. For example, if you wish to use an end time of October 1, 2018, at 8 PM UTC, then you input 1538424000 as the end time.",
      "nested_params": []
    },
    {
      "name": "unit",
      "type": "string",
      "required": true,
      "description": "The unit for the metric data request. Valid units depend on the metric data being requested. For the valid units with each available metric, see the metricName parameter.",
      "nested_params": []
    },
    {
      "name": "statistics",
      "type": "list",
      "required": true,
      "description": "The statistic for the metric. The following statistics are available: Minimum - The lowest value observed during the specified period. Use this value to determine low volumes of activity for your application. Maximum - The highest value observed during the specified period. Use this value to determine high volumes of activity for your application. Sum - All values submitted for the matching metric added together. You can use this statistic to determine the total volume of a metric. Average - The value of Sum / SampleCount during the specified period. By comparing this statistic with the Minimum and Maximum values, you can determine the full scope of a metric and how close the average use is to the Minimum and Maximum values. This comparison helps you to know when to increase or decrease your resources. SampleCount - The count, or number, of data points used for the statistical calculation. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "metricName",
          "type": "string",
          "description": "The name of the metric returned.",
          "nested_items": []
        },
        {
          "name": "metricData",
          "type": "list",
          "description": "An array of objects that describe the metric data returned.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "average",
                  "type": "float",
                  "description": "The average.",
                  "nested_items": []
                },
                {
                  "name": "maximum",
                  "type": "float",
                  "description": "The maximum.",
                  "nested_items": []
                },
                {
                  "name": "minimum",
                  "type": "float",
                  "description": "The minimum.",
                  "nested_items": []
                },
                {
                  "name": "sampleCount",
                  "type": "float",
                  "description": "The sample count.",
                  "nested_items": []
                },
                {
                  "name": "sum",
                  "type": "float",
                  "description": "The sum.",
                  "nested_items": []
                },
                {
                  "name": "timestamp",
                  "type": "datetime",
                  "description": "The timestamp ( 1479816991.349).",
                  "nested_items": []
                },
                {
                  "name": "unit",
                  "type": "string",
                  "description": "The unit.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}