{
  "method_name": "get_load_balancer_metric_data",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/lightsail/client/get_load_balancer_metric_data.html",
  "description": "Returns information about health metrics for your Lightsail load balancer. Metrics report the utilization of your resources, and the error counts generated by them. Monitor and collect metric data regularly to maintain the reliability, availability, and performance of your resources.",
  "parameters": [
    {
      "name": "loadBalancerName",
      "type": "string",
      "required": true,
      "description": "The name of the load balancer.",
      "nested_params": []
    },
    {
      "name": "metricName",
      "type": "string",
      "required": true,
      "description": "The metric for which you want to return information. Valid load balancer metric names are listed below, along with the most useful statistics to include in your request, and the published unit value. ClientTLSNegotiationErrorCount - The number of TLS connections initiated by the client that did not establish a session with the load balancer due to a TLS error generated by the load balancer. Possible causes include a mismatch of ciphers or protocols. Statistics: The most useful statistic is Sum. Unit: The published unit is Count. HealthyHostCount - The number of target instances that are considered healthy. Statistics: The most useful statistic are Average, Minimum, and Maximum. HTTPCode_Instance_2XX_Count - The number of HTTP 2XX response codes generated by the target instances. This does not include any response codes generated by the load balancer. Note that Minimum, Maximum, and Average all return 1. HTTPCode_Instance_3XX_Count - The number of HTTP 3XX response codes generated by the target instances. HTTPCode_Instance_4XX_Count - The number of HTTP 4XX response codes generated by the target instances. HTTPCode_Instance_5XX_Count - The number of HTTP 5XX response codes generated by the target instances. HTTPCode_LB_4XX_Count - The number of HTTP 4XX client error codes that originated from the load balancer. Client errors are generated when requests are malformed or incomplete. These requests were not received by the target instance. This count does not include response codes generated by the target instances. HTTPCode_LB_5XX_Count - The number of HTTP 5XX server error codes that originated from the load balancer. This does not include any response codes generated by the target instance. This metric is reported if there are no healthy instances attached to the load balancer, or if the request rate exceeds the capacity of the instances (spillover) or the load balancer. InstanceResponseTime - The time elapsed, in seconds, after the request leaves the load balancer until a response from the target instance is received. Statistics: The most useful statistic is Average. Unit: The published unit is Seconds. RejectedConnectionCount - The number of connections that were rejected because the load balancer had reached its maximum number of connections. RequestCount - The number of requests processed over IPv4. This count includes only the requests with a response generated by a target instance of the load balancer. UnhealthyHostCount - The number of target instances that are considered unhealthy. Unit: The published unit is Count.",
      "nested_params": []
    },
    {
      "name": "period",
      "type": "integer",
      "required": true,
      "description": "The granularity, in seconds, of the returned data points.",
      "nested_params": []
    },
    {
      "name": "startTime",
      "type": "datetime",
      "required": true,
      "description": "The start time of the period.",
      "nested_params": []
    },
    {
      "name": "endTime",
      "type": "datetime",
      "required": true,
      "description": "The end time of the period.",
      "nested_params": []
    },
    {
      "name": "unit",
      "type": "string",
      "required": true,
      "description": "The unit for the metric data request. Valid units depend on the metric data being requested. For the valid units with each available metric, see the metricName parameter.",
      "nested_params": []
    },
    {
      "name": "statistics",
      "type": "list",
      "required": true,
      "description": "The statistic for the metric. The following statistics are available: Minimum - The lowest value observed during the specified period. Use this value to determine low volumes of activity for your application. Maximum - The highest value observed during the specified period. Use this value to determine high volumes of activity for your application. Sum - All values submitted for the matching metric added together. You can use this statistic to determine the total volume of a metric. Average - The value of Sum / SampleCount during the specified period. By comparing this statistic with the Minimum and Maximum values, you can determine the full scope of a metric and how close the average use is to the Minimum and Maximum values. This comparison helps you to know when to increase or decrease your resources. SampleCount - The count, or number, of data points used for the statistical calculation. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "metricName",
          "type": "string",
          "description": "The name of the metric returned.",
          "nested_items": []
        },
        {
          "name": "metricData",
          "type": "list",
          "description": "An array of objects that describe the metric data returned.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "average",
                  "type": "float",
                  "description": "The average.",
                  "nested_items": []
                },
                {
                  "name": "maximum",
                  "type": "float",
                  "description": "The maximum.",
                  "nested_items": []
                },
                {
                  "name": "minimum",
                  "type": "float",
                  "description": "The minimum.",
                  "nested_items": []
                },
                {
                  "name": "sampleCount",
                  "type": "float",
                  "description": "The sample count.",
                  "nested_items": []
                },
                {
                  "name": "sum",
                  "type": "float",
                  "description": "The sum.",
                  "nested_items": []
                },
                {
                  "name": "timestamp",
                  "type": "datetime",
                  "description": "The timestamp ( 1479816991.349).",
                  "nested_items": []
                },
                {
                  "name": "unit",
                  "type": "string",
                  "description": "The unit.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}