{
  "method_name": "create_sol_network_package",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/tnb/client/create_sol_network_package.html",
  "description": "Creates a network package. A network package is a .zip file in CSAR (Cloud Service Archive) format defines the function packages you want to deploy and the Amazon Web Services infrastructure you want to deploy them on. For more information, see Network instances in the Amazon Web Services Telco Network Builder User Guide. A network package consists of a network service descriptor (NSD) file (required) and any additional files (optional), such as scripts specific to your needs. For example, if you have multiple function packages in your network package, you can use the NSD to define which network functions should run in certain VPCs, subnets, or EKS clusters. This request creates an empty network package container with an ID. Once you create a network package, you can upload the network package content using PutSolNetworkPackageContent.",
  "parameters": [],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "arn",
          "type": "string",
          "description": "Network package ARN.",
          "nested_items": []
        },
        {
          "name": "id",
          "type": "string",
          "description": "ID of the network package.",
          "nested_items": []
        },
        {
          "name": "nsdOnboardingState",
          "type": "string",
          "description": "Onboarding state of the network service descriptor in the network package.",
          "nested_items": []
        },
        {
          "name": "nsdOperationalState",
          "type": "string",
          "description": "Operational state of the network service descriptor in the network package.",
          "nested_items": []
        },
        {
          "name": "nsdUsageState",
          "type": "string",
          "description": "Usage state of the network service descriptor in the network package.",
          "nested_items": []
        },
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}