{
  "method_name": "describe_lifecycle_configuration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/efs/client/describe_lifecycle_configuration.html",
  "description": "Returns the current LifecycleConfiguration object for the specified Amazon EFS file system. Lifecycle management uses the LifecycleConfiguration object to identify when to move files between storage classes. For a file system without a LifecycleConfiguration object, the call returns an empty array in the response. This operation requires permissions for the elasticfilesystem:DescribeLifecycleConfiguration operation.",
  "parameters": [
    {
      "name": "FileSystemId",
      "type": "string",
      "required": true,
      "description": "The ID of the file system whose LifecycleConfiguration object you want to retrieve (String).",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "LifecyclePolicies",
          "type": "list",
          "description": "An array of lifecycle management policies. EFS supports a maximum of one policy per file system.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "TransitionToIA",
                  "type": "string",
                  "description": "The number of days after files were last accessed in primary storage (the Standard storage class) at which to move them to Infrequent Access (IA) storage. Metadata operations such as listing the contents of a directory don't count as file access events.",
                  "nested_items": []
                },
                {
                  "name": "TransitionToPrimaryStorageClass",
                  "type": "string",
                  "description": "Whether to move files back to primary (Standard) storage after they are accessed in IA or Archive storage. Metadata operations such as listing the contents of a directory don't count as file access events.",
                  "nested_items": []
                },
                {
                  "name": "TransitionToArchive",
                  "type": "string",
                  "description": "The number of days after files were last accessed in primary storage (the Standard storage class) at which to move them to Archive storage. Metadata operations such as listing the contents of a directory don't count as file access events.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}