{
  "method_name": "put_file_system_policy",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/efs/client/put_file_system_policy.html",
  "description": "Applies an Amazon EFS FileSystemPolicy to an Amazon EFS file system. A file system policy is an IAM resource-based policy and can contain multiple policy statements. A file system always has exactly one file system policy, which can be the default policy or an explicit policy set or updated using this API operation. EFS file system policies have a 20,000 character limit. When an explicit policy is set, it overrides the default policy. For more information about the default file system policy, see Default EFS file system policy. This operation requires permissions for the elasticfilesystem:PutFileSystemPolicy action.",
  "parameters": [
    {
      "name": "FileSystemId",
      "type": "string",
      "required": true,
      "description": "The ID of the EFS file system that you want to create or update the FileSystemPolicy for.",
      "nested_params": []
    },
    {
      "name": "Policy",
      "type": "string",
      "required": true,
      "description": "The FileSystemPolicy that you're creating. Accepts a JSON formatted policy definition. EFS file system policies have a 20,000 character limit. To find out more about the elements that make up a file system policy, see Resource-based policies within Amazon EFS.",
      "nested_params": []
    },
    {
      "name": "BypassPolicyLockoutSafetyCheck",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "FileSystemId",
          "type": "string",
          "description": "Specifies the EFS file system to which the FileSystemPolicy applies.",
          "nested_items": []
        },
        {
          "name": "Policy",
          "type": "string",
          "description": "The JSON formatted FileSystemPolicy for the EFS file system.",
          "nested_items": []
        }
      ]
    }
  ]
}