{
  "method_name": "update_file_system_protection",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/efs/client/update_file_system_protection.html",
  "description": "Updates protection on the file system. This operation requires permissions for the elasticfilesystem:UpdateFileSystemProtection action.",
  "parameters": [
    {
      "name": "FileSystemId",
      "type": "string",
      "required": true,
      "description": "The ID of the file system to update.",
      "nested_params": []
    },
    {
      "name": "ReplicationOverwriteProtection",
      "type": "string",
      "required": false,
      "description": "The status of the file system's replication overwrite protection. ENABLED --- The file system cannot be used as the destination file system in a replication configuration. The file system is writeable. Replication overwrite protection is ENABLED by default. DISABLED --- The file system can be used as the destination file system in a replication configuration. The file system is read-only and can only be modified by EFS replication. REPLICATING --- The file system is being used as the destination file system in a replication configuration. The file system is read-only and is only modified only by EFS replication. If the replication configuration is deleted, the file system's replication overwrite protection is re-enabled and the file system becomes writeable.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ReplicationOverwriteProtection",
          "type": "string",
          "description": "The status of the file system's replication overwrite protection.",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "ENABLED --- The file system cannot be used as the destination file system in a replication configuration. The file system is writeable. Replication overwrite protection is ENABLED by default.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "DISABLED --- The file system can be used as the destination file system in a replication configuration. The file system is read-only and can only be modified by EFS replication.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "REPLICATING --- The file system is being used as the destination file system in a replication configuration. The file system is read-only and is only modified only by EFS replication.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}