{
  "method_name": "update_channel",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iotanalytics/client/update_channel.html",
  "description": "Used to update the settings of a channel.",
  "parameters": [
    {
      "name": "channelName",
      "type": "string",
      "required": true,
      "description": "The name of the channel to be updated.",
      "nested_params": []
    },
    {
      "name": "channelStorage",
      "type": "dict",
      "required": true,
      "description": "Where channel data is stored. You can choose one of serviceManagedS3 or customerManagedS3 storage. If not specified, the default is serviceManagedS3. You can't change this storage option after the channel is created. serviceManagedS3 (dict) --- Used to store channel data in an S3 bucket managed by IoT Analytics. You can't change the choice of S3 storage after the data store is created. customerManagedS3 (dict) --- Used to store channel data in an S3 bucket that you manage. If customer managed storage is selected, the retentionPeriod parameter is ignored. The name of the S3 bucket in which channel data is stored. keyPrefix (string) --- (Optional) The prefix used to create the keys of the channel data objects. Each object in an S3 bucket has a key that is its unique identifier in the bucket. Each object in a bucket has exactly one key. The prefix must end with a forward slash (/). The ARN of the role that grants IoT Analytics permission to interact with your Amazon S3 resources.",
      "nested_params": [
        {
          "name": "serviceManagedS3",
          "type": "dict",
          "required": false,
          "description": "Used to store channel data in an S3 bucket managed by IoT Analytics. You can't change the choice of S3 storage after the data store is created.",
          "nested_params": []
        },
        {
          "name": "customerManagedS3",
          "type": "dict",
          "required": false,
          "description": "Used to store channel data in an S3 bucket that you manage. If customer managed storage is selected, the retentionPeriod parameter is ignored. You can't change the choice of S3 storage after the data store is created.",
          "nested_params": [
            {
              "name": "bucket",
              "type": "string",
              "required": false,
              "description": "The name of the S3 bucket in which channel data is stored.",
              "nested_params": []
            },
            {
              "name": "keyPrefix",
              "type": "string",
              "required": false,
              "description": "(Optional) The prefix used to create the keys of the channel data objects. Each object in an S3 bucket has a key that is its unique identifier in the bucket. Each object in a bucket has exactly one key. The prefix must end with a forward slash (/).",
              "nested_params": []
            },
            {
              "name": "roleArn",
              "type": "string",
              "required": false,
              "description": "The ARN of the role that grants IoT Analytics permission to interact with your Amazon S3 resources.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "retentionPeriod",
      "type": "dict",
      "required": false,
      "description": "How long, in days, message data is kept for the channel. The retention period can't be updated if the channel's Amazon S3 storage is customer-managed. unlimited (boolean) --- If true, message data is kept indefinitely. numberOfDays (integer) --- The number of days that message data is kept. The unlimited parameter must be false.",
      "nested_params": [
        {
          "name": "unlimited",
          "type": "boolean",
          "required": false,
          "description": "If true, message data is kept indefinitely.",
          "nested_params": []
        },
        {
          "name": "numberOfDays",
          "type": "integer",
          "required": false,
          "description": "The number of days that message data is kept. The unlimited parameter must be false.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}