{
  "method_name": "update_datastore",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iotanalytics/client/update_datastore.html",
  "description": "Used to update the settings of a data store.",
  "parameters": [
    {
      "name": "datastoreName",
      "type": "string",
      "required": true,
      "description": "The name of the data store to be updated.",
      "nested_params": []
    },
    {
      "name": "retentionPeriod",
      "type": "dict",
      "required": false,
      "description": "How long, in days, message data is kept for the data store. The retention period can't be updated if the data store's Amazon S3 storage is customer-managed. unlimited (boolean) --- If true, message data is kept indefinitely. numberOfDays (integer) --- The number of days that message data is kept. The unlimited parameter must be false.",
      "nested_params": [
        {
          "name": "unlimited",
          "type": "boolean",
          "required": false,
          "description": "If true, message data is kept indefinitely.",
          "nested_params": []
        },
        {
          "name": "numberOfDays",
          "type": "integer",
          "required": false,
          "description": "The number of days that message data is kept. The unlimited parameter must be false.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "datastoreStorage",
      "type": "dict",
      "required": true,
      "description": "Where data in a data store is stored.. You can choose serviceManagedS3 storage, customerManagedS3 storage, or iotSiteWiseMultiLayerStorage storage. The default is serviceManagedS3. You can't change the choice of Amazon S3 storage after your data store is created. serviceManagedS3 (dict) --- Used to store data in an Amazon S3 bucket managed by IoT Analytics. customerManagedS3 (dict) --- S3-customer-managed; When you choose customer-managed storage, the retentionPeriod parameter is ignored. The name of the Amazon S3 bucket where your data is stored. keyPrefix (string) --- (Optional) The prefix used to create the keys of the data store data objects. Each object in an Amazon S3 bucket has a key that is its unique identifier in the bucket. Each object in a bucket has exactly one key. The prefix must end with a forward slash (/). The ARN of the role that grants IoT Analytics permission to interact with your Amazon S3 resources. iotSiteWiseMultiLayerStorage (dict) --- Used to store data used by IoT SiteWise in an Amazon S3 bucket that you manage. Used to store data used by IoT SiteWise in an Amazon S3 bucket that you manage. The prefix must end with a forward slash (/).",
      "nested_params": [
        {
          "name": "serviceManagedS3",
          "type": "dict",
          "required": false,
          "description": "Used to store data in an Amazon S3 bucket managed by IoT Analytics. You can't change the choice of Amazon S3 storage after your data store is created.",
          "nested_params": []
        },
        {
          "name": "customerManagedS3",
          "type": "dict",
          "required": false,
          "description": "S3-customer-managed; When you choose customer-managed storage, the retentionPeriod parameter is ignored. You can't change the choice of Amazon S3 storage after your data store is created.",
          "nested_params": [
            {
              "name": "bucket",
              "type": "string",
              "required": false,
              "description": "The name of the Amazon S3 bucket where your data is stored.",
              "nested_params": []
            },
            {
              "name": "keyPrefix",
              "type": "string",
              "required": false,
              "description": "(Optional) The prefix used to create the keys of the data store data objects. Each object in an Amazon S3 bucket has a key that is its unique identifier in the bucket. Each object in a bucket has exactly one key. The prefix must end with a forward slash (/).",
              "nested_params": []
            },
            {
              "name": "roleArn",
              "type": "string",
              "required": false,
              "description": "The ARN of the role that grants IoT Analytics permission to interact with your Amazon S3 resources.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "iotSiteWiseMultiLayerStorage",
          "type": "dict",
          "required": false,
          "description": "Used to store data used by IoT SiteWise in an Amazon S3 bucket that you manage. You can't change the choice of Amazon S3 storage after your data store is created.",
          "nested_params": [
            {
              "name": "customerManagedS3Storage",
              "type": "dict",
              "required": false,
              "description": "Used to store data used by IoT SiteWise in an Amazon S3 bucket that you manage.",
              "nested_params": [
                {
                  "name": "bucket",
                  "type": "string",
                  "required": false,
                  "description": "The name of the Amazon S3 bucket where your data is stored.",
                  "nested_params": []
                },
                {
                  "name": "keyPrefix",
                  "type": "string",
                  "required": false,
                  "description": "(Optional) The prefix used to create the keys of the data store data objects. Each object in an Amazon S3 bucket has a key that is its unique identifier in the bucket. Each object in a bucket has exactly one key. The prefix must end with a forward slash (/).",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "fileFormatConfiguration",
      "type": "dict",
      "required": true,
      "description": "Contains the configuration information of file formats. IoT Analytics data stores support JSON and Parquet. The default file format is JSON. You can specify only one format. You can't change the file format after you create the data store. jsonConfiguration (dict) --- Contains the configuration information of the JSON format. parquetConfiguration (dict) --- Contains the configuration information of the Parquet format. schemaDefinition (dict) --- Information needed to define a schema. columns (list) --- Specifies one or more columns that store your data. Each schema can have up to 100 columns. Each column can have up to 100 nested types. (dict) --- Contains information about a column that stores your data. The name of the column. The type of data. For more information about the supported data types, see Common data types in the Glue Developer Guide.",
      "nested_params": [
        {
          "name": "jsonConfiguration",
          "type": "dict",
          "required": false,
          "description": "Contains the configuration information of the JSON format.",
          "nested_params": []
        },
        {
          "name": "parquetConfiguration",
          "type": "dict",
          "required": false,
          "description": "Contains the configuration information of the Parquet format.",
          "nested_params": [
            {
              "name": "schemaDefinition",
              "type": "dict",
              "required": false,
              "description": "Information needed to define a schema.",
              "nested_params": [
                {
                  "name": "columns",
                  "type": "list",
                  "required": false,
                  "description": "Specifies one or more columns that store your data. Each schema can have up to 100 columns. Each column can have up to 100 nested types.",
                  "nested_params": [
                    {
                      "name": "name",
                      "type": "string",
                      "required": false,
                      "description": "The name of the column.",
                      "nested_params": []
                    },
                    {
                      "name": "type",
                      "type": "string",
                      "required": false,
                      "description": "The type of data. For more information about the supported data types, see Common data types in the Glue Developer Guide.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}