{
  "method_name": "invoke",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/lambda/client/invoke.html",
  "description": "Invokes a Lambda function. You can invoke a function synchronously (and wait for the response), or asynchronously. By default, Lambda invokes your function synchronously (i.e. the InvocationType is RequestResponse). To invoke a function asynchronously, set InvocationType to Event. Lambda passes the ClientContext object to your function for synchronous invocations only. For synchronous invocation, details about the function response, including errors, are included in the response body and headers. For either invocation type, you can find more information in the execution log and trace. When an error occurs, your function may be invoked multiple times. Retry behavior varies by error type, client, event source, and invocation type. For example, if you invoke a function asynchronously and it returns an error, Lambda executes the function up to two more times. For more information, see Error handling and automatic retries in Lambda. For asynchronous invocation, Lambda adds events to a queue before sending them to your function. If your function does not have enough capacity to keep up with the queue, events may be lost. Occasionally, your function may receive the same event multiple times, even if no error occurs. To retain events that were not processed, configure your function with a dead-letter queue. The status code in the API response doesn't reflect function errors. Error codes are reserved for errors that prevent your function from executing, such as permissions errors, quota errors, or issues with your function's code and configuration. For example, Lambda returns TooManyRequestsException if running the function would cause you to exceed a concurrency limit at either the account level ( ConcurrentInvocationLimitExceeded) or function level ( ReservedFunctionConcurrentInvocationLimitExceeded). For functions with a long timeout, your client might disconnect during synchronous invocation while it waits for a response. Configure your HTTP client, SDK, firewall, proxy, or operating system to allow for long connections with timeout or keep-alive settings. This operation requires permission for the lambda:InvokeFunction action. For details on how to set up permissions for cross-account invocations, see Granting function access to other accounts.",
  "parameters": [
    {
      "name": "FunctionName",
      "type": "string",
      "required": true,
      "description": "The name or ARN of the Lambda function, version, or alias. Function name --- my-function (name-only), my-function:v1 (with alias). Function ARN --- arn:aws:lambda:us-west-2:123456789012:function:my-function. Partial ARN --- 123456789012:function:my-function. You can append a version number or alias to any of the formats. The length constraint applies only to the full ARN. If you specify only the function name, it is limited to 64 characters in length.",
      "nested_params": [
        {
          "name": "Function name",
          "type": "name-only",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "Function ARN",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "Partial ARN",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        }
      ]
    },
    {
      "name": "InvocationType",
      "type": "string",
      "required": false,
      "description": "Choose from the following options. RequestResponse (default) --- Invoke the function synchronously. Keep the connection open until the function returns a response or times out. The API response includes the function response and additional data. Event --- Invoke the function asynchronously. Send events that fail multiple times to the function's dead-letter queue (if one is configured). The API response only includes a status code. DryRun --- Validate parameter values and verify that the user or role has permission to invoke the function.",
      "nested_params": []
    },
    {
      "name": "LogType",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ClientContext",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Payload",
      "type": "bytes or seekable file-like object",
      "required": false,
      "description": "The JSON that you want to provide to your Lambda function as input. You can enter the JSON directly. For example, --payload '{ \"key\": \"value\" }'. You can also specify a file path. For example, --payload file://payload.json.",
      "nested_params": []
    },
    {
      "name": "Qualifier",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "StatusCode",
          "type": "integer",
          "description": "The HTTP status code is in the 200 range for a successful request. For the RequestResponse invocation type, this status code is 200. For the Event invocation type, this status code is 202. For the DryRun invocation type, the status code is 204.",
          "nested_items": []
        },
        {
          "name": "FunctionError",
          "type": "string",
          "description": "If present, indicates that an error occurred during function execution. Details about the error are included in the response payload.",
          "nested_items": []
        },
        {
          "name": "LogResult",
          "type": "string",
          "description": "The last 4 KB of the execution log, which is base64-encoded.",
          "nested_items": []
        },
        {
          "name": "Payload",
          "type": "StreamingBody",
          "description": "The response from the function, or an error object.",
          "nested_items": []
        },
        {
          "name": "ExecutedVersion",
          "type": "string",
          "description": "The version of the function that executed. When you invoke a function with an alias, this indicates which version the alias resolved to.",
          "nested_items": []
        }
      ]
    }
  ]
}