{
  "method_name": "invoke_model",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/bedrock-runtime/client/invoke_model.html",
  "description": "Invokes the specified Amazon Bedrock model to run inference using the prompt and inference parameters provided in the request body. You use model inference to generate text, images, and embeddings. For example code, see Invoke model code examples in the Amazon Bedrock User Guide. This operation requires permission for the bedrock:InvokeModel action. For troubleshooting some of the common errors you might encounter when using the InvokeModel API, see Troubleshooting Amazon Bedrock API Error Codes in the Amazon Bedrock User Guide.",
  "parameters": [
    {
      "name": "body",
      "type": "bytes or seekable file-like object",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "contentType",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "accept",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "modelId",
      "type": "string",
      "required": true,
      "description": "The unique identifier of the model to invoke to run inference. The modelId to provide depends on the type of model or throughput that you use: If you use a base model, specify the model ID or its ARN. For a list of model IDs for base models, see Amazon Bedrock base model IDs (on-demand throughput) in the Amazon Bedrock User Guide. If you use an inference profile, specify the inference profile ID or its ARN. For a list of inference profile IDs, see Supported Regions and models for cross-region inference in the Amazon Bedrock User Guide. If you use a provisioned model, specify the ARN of the Provisioned Throughput. For more information, see Run inference using a Provisioned Throughput in the Amazon Bedrock User Guide. If you use a custom model, first purchase Provisioned Throughput for it. Then specify the ARN of the resulting provisioned model. For more information, see Use a custom model in Amazon Bedrock in the Amazon Bedrock User Guide. If you use an imported model, specify the ARN of the imported model. You can get the model ARN from a successful call to CreateModelImportJob or from the Imported models page in the Amazon Bedrock console.",
      "nested_params": []
    },
    {
      "name": "trace",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "guardrailIdentifier",
      "type": "string",
      "required": false,
      "description": "The unique identifier of the guardrail that you want to use. If you don't provide a value, no guardrail is applied to the invocation. An error will be thrown in the following situations. You don't provide a guardrail identifier but you specify the amazon-bedrock-guardrailConfig field in the request body. You enable the guardrail but the contentType isn't application/json. You provide a guardrail identifier, but guardrailVersion isn't specified.",
      "nested_params": []
    },
    {
      "name": "guardrailVersion",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "performanceConfigLatency",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "body",
          "type": "StreamingBody",
          "description": "Inference response from the model in the format specified in the contentType header. To see the format and content of the request and response bodies for different models, refer to Inference parameters.",
          "nested_items": []
        },
        {
          "name": "contentType",
          "type": "string",
          "description": "The MIME type of the inference result.",
          "nested_items": []
        },
        {
          "name": "performanceConfigLatency",
          "type": "string",
          "description": "Model performance settings for the request.",
          "nested_items": []
        }
      ]
    }
  ]
}