{
  "method_name": "create_route_calculator",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/location/client/create_route_calculator.html",
  "description": "Creates a route calculator resource in your Amazon Web Services account. You can send requests to a route calculator resource to estimate travel time, distance, and get directions. A route calculator sources traffic and road network data from your chosen data provider.",
  "parameters": [
    {
      "name": "CalculatorName",
      "type": "string",
      "required": true,
      "description": "The name of the route calculator resource. Requirements: Can use alphanumeric characters (A---Z, a---z, 0---9) , hyphens (-), periods (.), and underscores (_). Must be a unique Route calculator resource name. No spaces allowed. For example, ExampleRouteCalculator.",
      "nested_params": []
    },
    {
      "name": "DataSource",
      "type": "string",
      "required": true,
      "description": "Specifies the data provider of traffic and road network data. Valid values include: Esri --- For additional information about Esri's coverage in your region of interest, see Esri details on street networks and traffic coverage. Route calculators that use Esri as a data source only calculate routes that are shorter than 400 km. Grab --- Grab provides routing functionality for Southeast Asia. For additional information about GrabMaps' coverage, see GrabMaps countries and areas covered. Here --- For additional information about HERE Technologies' coverage in your region of interest, see HERE car routing coverage and HERE truck routing coverage. For additional information , see Data providers on the Amazon Location Service Developer Guide.",
      "nested_params": []
    },
    {
      "name": "PricingPlan",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "dict",
      "required": false,
      "description": "Applies one or more tags to the route calculator resource. A tag is a key-value pair helps manage, identify, search, and filter your resources by labelling them. For example: { \"tag1\" : \"value1\", \"tag2\" : \"value2\"} Format: \"key\" : \"value\" Restrictions: Maximum 50 tags per resource Each resource tag must be unique with a maximum of one value. Maximum key length: 128 Unicode characters in UTF-8 Maximum value length: 256 Unicode characters in UTF-8 Can use alphanumeric characters (A---Z, a---z, 0---9), and the following characters: + - = . _ : / @. Cannot use 'aws:' as a prefix for a key. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "CalculatorName",
          "type": "string",
          "description": "The name of the route calculator resource.",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "For example, ExampleRouteCalculator.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "CalculatorArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) for the route calculator resource. Use the ARN when you specify a resource across all Amazon Web Services.",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "Format example: arn:aws:geo:region:account-id:route-calculator/ExampleCalculator.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "CreateTime",
          "type": "datetime",
          "description": "The timestamp when the route calculator resource was created in ISO 8601 format: YYYY-MM-DDThh:mm:ss.sssZ.",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "For example, 2020---07-2T12:15:20.000Z+01:00",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}