{
  "method_name": "create_map",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/location/client/create_map.html",
  "description": "Creates a map resource in your Amazon Web Services account, which provides map tiles of different styles sourced from global location data providers.",
  "parameters": [
    {
      "name": "MapName",
      "type": "string",
      "required": true,
      "description": "The name for the map resource. Requirements: Must contain only alphanumeric characters (A---Z, a---z, 0---9), hyphens (-), periods (.), and underscores (_). Must be a unique map resource name. No spaces allowed. For example, ExampleMap.",
      "nested_params": []
    },
    {
      "name": "Configuration",
      "type": "dict",
      "required": true,
      "description": "Specifies the MapConfiguration, including the map style, for the map resource that you create. The map style defines the look of maps and the data provider for your map resource. Specifies the map style selected from an available data provider. Valid Esri map styles: VectorEsriDarkGrayCanvas --- The Esri Dark Gray Canvas map style. A vector basemap with a dark gray, neutral background with minimal colors, labels, and features that's designed to draw attention to your thematic content. RasterEsriImagery --- The Esri Imagery map style. A raster basemap that provides one meter or better satellite and aerial imagery in many parts of the world and lower resolution satellite imagery worldwide. VectorEsriLightGrayCanvas --- The Esri Light Gray Canvas map style, which provides a detailed vector basemap with a light gray, neutral background style with minimal colors, labels, and features that's designed to draw attention to your thematic content. VectorEsriTopographic --- The Esri Light map style, which provides a detailed vector basemap with a classic Esri map style. VectorEsriStreets --- The Esri Street Map style, which provides a detailed vector basemap for the world symbolized with a classic Esri street map style. The vector tile layer is similar in content and style to the World Street Map raster map. VectorEsriNavigation --- The Esri Navigation map style, which provides a detailed basemap for the world symbolized with a custom navigation map style that's designed for use during the day in mobile devices. Valid HERE Technologies map styles: VectorHereContrast --- The HERE Contrast (Berlin) map style is a high contrast detailed base map of the world that blends 3D and 2D rendering. VectorHereExplore --- A default HERE map style containing a neutral, global map and its features including roads, buildings, landmarks, and water features. It also now includes a fully designed map of Japan. VectorHereExploreTruck --- A global map containing truck restrictions and attributes (e.g. width / height / HAZMAT) symbolized with highlighted segments and icons on top of HERE Explore to support use cases within transport and logistics. RasterHereExploreSatellite --- A global map containing high resolution satellite imagery. HybridHereExploreSatellite --- A global map displaying the road network, street names, and city labels over satellite imagery. This style will automatically retrieve both raster and vector tiles, and your charges will be based on total tiles retrieved. Valid GrabMaps map styles: VectorGrabStandardLight --- The Grab Standard Light map style provides a basemap with detailed land use coloring, area names, roads, landmarks, and points of interest covering Southeast Asia. VectorGrabStandardDark --- The Grab Standard Dark map style provides a dark variation of the standard basemap covering Southeast Asia. Valid Open Data map styles: VectorOpenDataStandardLight --- The Open Data Standard Light map style provides a detailed basemap for the world suitable for website and mobile application use. The map includes highways major roads, minor roads, railways, water features, cities, parks, landmarks, building footprints, and administrative boundaries. VectorOpenDataStandardDark --- Open Data Standard Dark is a dark-themed map style that provides a detailed basemap for the world suitable for website and mobile application use. VectorOpenDataVisualizationLight --- The Open Data Visualization Light map style is a light-themed style with muted colors and fewer features that aids in understanding overlaid data. VectorOpenDataVisualizationDark --- The Open Data Visualization Dark map style is a dark-themed style with muted colors and fewer features that aids in understanding overlaid data. PoliticalView (string) --- Specifies the political view for the style. Leave unset to not use a political view, or, for styles that support specific political views, you can choose a view, such as IND for the Indian view. Default is unset. CustomLayers (list) --- Specifies the custom layers for the style. Leave unset to not enable any custom layer, or, for styles that support custom layers, you can enable layer(s), such as POI layer for the VectorEsriNavigation style. (string) ---",
      "nested_params": [
        {
          "name": "Style",
          "type": "string",
          "required": false,
          "description": "Specifies the map style selected from an available data provider. Valid Esri map styles:",
          "nested_params": []
        },
        {
          "name": "PoliticalView",
          "type": "string",
          "required": false,
          "description": "Specifies the political view for the style. Leave unset to not use a political view, or, for styles that support specific political views, you can choose a view, such as IND for the Indian view. Default is unset.",
          "nested_params": []
        },
        {
          "name": "CustomLayers",
          "type": "list",
          "required": false,
          "description": "Specifies the custom layers for the style. Leave unset to not enable any custom layer, or, for styles that support custom layers, you can enable layer(s), such as POI layer for the VectorEsriNavigation style. Default is unset.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "PricingPlan",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "dict",
      "required": false,
      "description": "Applies one or more tags to the map resource. A tag is a key-value pair helps manage, identify, search, and filter your resources by labelling them. Format: \"key\" : \"value\" Restrictions: Maximum 50 tags per resource Each resource tag must be unique with a maximum of one value. Maximum key length: 128 Unicode characters in UTF-8 Maximum value length: 256 Unicode characters in UTF-8 Can use alphanumeric characters (A---Z, a---z, 0---9), and the following characters: + - = . _ : / @. Cannot use 'aws:' as a prefix for a key. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "MapName",
          "type": "string",
          "description": "The name of the map resource.",
          "nested_items": []
        },
        {
          "name": "MapArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) for the map resource. Used to specify a resource across all Amazon Web Services.",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "Format example: arn:aws:geo:region:account-id:map/ExampleMap.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "CreateTime",
          "type": "datetime",
          "description": "The timestamp for when the map resource was created in ISO 8601 format: YYYY-MM-DDThh:mm:ss.sssZ.",
          "nested_items": []
        }
      ]
    }
  ]
}