{
  "method_name": "create_place_index",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/location/client/create_place_index.html",
  "description": "Creates a place index resource in your Amazon Web Services account. Use a place index resource to geocode addresses and other text queries by using the SearchPlaceIndexForText operation, and reverse geocode coordinates by using the SearchPlaceIndexForPosition operation, and enable autosuggestions by using the SearchPlaceIndexForSuggestions operation.",
  "parameters": [
    {
      "name": "IndexName",
      "type": "string",
      "required": true,
      "description": "The name of the place index resource. Requirements: Contain only alphanumeric characters (A---Z, a---z, 0---9), hyphens (-), periods (.), and underscores (_). Must be a unique place index resource name. No spaces allowed. For example, ExamplePlaceIndex.",
      "nested_params": []
    },
    {
      "name": "DataSource",
      "type": "string",
      "required": true,
      "description": "Specifies the geospatial data provider for the new place index. Valid values include: Esri --- For additional information about Esri's coverage in your region of interest, see Esri details on geocoding coverage. Grab --- Grab provides place index functionality for Southeast Asia. For additional information about GrabMaps' coverage, see GrabMaps countries and areas covered. Here --- For additional information about HERE Technologies' coverage in your region of interest, see HERE details on goecoding coverage. For additional information , see Data providers on the Amazon Location Service Developer Guide.",
      "nested_params": []
    },
    {
      "name": "PricingPlan",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DataSourceConfiguration",
      "type": "dict",
      "required": false,
      "description": "Specifies the data storage option requesting Places. IntendedUse (string) --- Specifies how the results of an operation will be stored by the caller. Valid values include: SingleUse specifies that the results won't be stored. Storage specifies that the result can be cached or stored in a database. Default value: SingleUse.",
      "nested_params": [
        {
          "name": "IntendedUse",
          "type": "string",
          "required": false,
          "description": "Specifies how the results of an operation will be stored by the caller. Valid values include:",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Tags",
      "type": "dict",
      "required": false,
      "description": "Applies one or more tags to the place index resource. A tag is a key-value pair that helps you manage, identify, search, and filter your resources. Format: \"key\" : \"value\" Restrictions: Maximum 50 tags per resource. Each tag key must be unique and must have exactly one associated value. Maximum key length: 128 Unicode characters in UTF-8. Maximum value length: 256 Unicode characters in UTF-8. Can use alphanumeric characters (A---Z, a---z, 0---9), and the following characters: + - = . _ : / @ Cannot use 'aws:' as a prefix for a key. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "IndexName",
          "type": "string",
          "description": "The name for the place index resource.",
          "nested_items": []
        },
        {
          "name": "IndexArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) for the place index resource. Used to specify a resource across Amazon Web Services.",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "Format example: arn:aws:geo:region:account-id:place-index/ExamplePlaceIndex.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "CreateTime",
          "type": "datetime",
          "description": "The timestamp for when the place index resource was created in ISO 8601 format: YYYY-MM-DDThh:mm:ss.sssZ.",
          "nested_items": []
        }
      ]
    }
  ]
}