{
  "method_name": "update_tracker",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/location/client/update_tracker.html",
  "description": "Updates the specified properties of a given tracker resource.",
  "parameters": [
    {
      "name": "TrackerName",
      "type": "string",
      "required": true,
      "description": "The name of the tracker resource to update.",
      "nested_params": []
    },
    {
      "name": "PricingPlan",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "PricingPlanDataSource",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "PositionFiltering",
      "type": "string",
      "required": false,
      "description": "Updates the position filtering for the tracker resource. Valid values: TimeBased - Location updates are evaluated against linked geofence collections, but not every location update is stored. If your update frequency is more often than 30 seconds, only one update per 30 seconds is stored for each unique device ID. DistanceBased - If the device has moved less than 30 m (98.4 ft), location updates are ignored. Location updates within this distance are neither evaluated against linked geofence collections, nor stored. This helps control costs by reducing the number of geofence evaluations and historical device positions to paginate through. Distance-based filtering can also reduce the effects of GPS noise when displaying device trajectories on a map. AccuracyBased - If the device has moved less than the measured accuracy, location updates are ignored. For example, if two consecutive updates from a device have a horizontal accuracy of 5 m and 10 m, the second update is ignored if the device has moved less than 15 m. Ignored location updates are neither evaluated against linked geofence collections, nor stored. This helps educe the effects of GPS noise when displaying device trajectories on a map, and can help control costs by reducing the number of geofence evaluations.",
      "nested_params": []
    },
    {
      "name": "EventBridgeEnabled",
      "type": "boolean",
      "required": false,
      "description": "Whether to enable position UPDATE events from this tracker to be sent to EventBridge.",
      "nested_params": []
    },
    {
      "name": "KmsKeyEnableGeospatialQueries",
      "type": "boolean",
      "required": false,
      "description": "Enables GeospatialQueries for a tracker that uses a Amazon Web Services KMS customer managed key. This parameter is only used if you are using a KMS customer managed key.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "TrackerName",
          "type": "string",
          "description": "The name of the updated tracker resource.",
          "nested_items": []
        },
        {
          "name": "TrackerArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the updated tracker resource. Used to specify a resource across AWS.",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "Format example: arn:aws:geo:region:account-id:tracker/ExampleTracker.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "UpdateTime",
          "type": "datetime",
          "description": "The timestamp for when the tracker resource was last updated in ISO 8601 format: YYYY-MM-DDThh:mm:ss.sssZ.",
          "nested_items": []
        }
      ]
    }
  ]
}