{
  "method_name": "list_third_party_firewall_firewall_policies",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/fms/client/list_third_party_firewall_firewall_policies.html",
  "description": "Retrieves a list of all of the third-party firewall policies that are associated with the third-party firewall administrator's account.",
  "parameters": [
    {
      "name": "ThirdPartyFirewall",
      "type": "string",
      "required": true,
      "description": "The name of the third-party firewall vendor.",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "If the previous response included a NextToken element, the specified third-party firewall vendor is associated with more third-party firewall policies. To get more third-party firewall policies, submit another ListThirdPartyFirewallFirewallPoliciesRequest request. For the value of NextToken, specify the value of NextToken from the previous response. If the previous response didn't include a NextToken element, there are no more third-party firewall policies to get.",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": true,
      "description": "The maximum number of third-party firewall policies that you want Firewall Manager to return. If the specified third-party firewall vendor is associated with more than MaxResults firewall policies, the response includes a NextToken element. NextToken contains an encrypted token that identifies the first third-party firewall policies that Firewall Manager will return if you submit another request.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ThirdPartyFirewallFirewallPolicies",
          "type": "list",
          "description": "A list that contains one ThirdPartyFirewallFirewallPolicies element for each third-party firewall policies that the specified third-party firewall vendor is associated with. Each ThirdPartyFirewallFirewallPolicies element contains the firewall policy name and ID.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "FirewallPolicyId",
                  "type": "string",
                  "description": "The ID of the specified firewall policy.",
                  "nested_items": []
                },
                {
                  "name": "FirewallPolicyName",
                  "type": "string",
                  "description": "The name of the specified firewall policy.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The value that you will use for NextToken in the next ListThirdPartyFirewallFirewallPolicies request.",
          "nested_items": []
        }
      ]
    }
  ]
}