{
  "method_name": "put_admin_account",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/fms/client/put_admin_account.html",
  "description": "Creates or updates an Firewall Manager administrator account. The account must be a member of the organization that was onboarded to Firewall Manager by  AssociateAdminAccount. Only the organization's management account can create an Firewall Manager administrator account. When you create an Firewall Manager administrator account, the service checks to see if the account is already a delegated administrator within Organizations. If the account isn't a delegated administrator, Firewall Manager calls Organizations to delegate the account within Organizations. For more information about administrator accounts within Organizations, see Managing the Amazon Web Services Accounts in Your Organization.",
  "parameters": [
    {
      "name": "AdminAccount",
      "type": "string",
      "required": true,
      "description": "The Amazon Web Services account ID to add as an Firewall Manager administrator account. The account must be a member of the organization that was onboarded to Firewall Manager by  AssociateAdminAccount. For more information about Organizations, see Managing the Amazon Web Services Accounts in Your Organization.",
      "nested_params": []
    },
    {
      "name": "AdminScope",
      "type": "dict",
      "required": false,
      "description": "Configures the resources that the specified Firewall Manager administrator can manage. As a best practice, set the administrative scope according to the principles of least privilege. Only grant the administrator the specific resources or permissions that they need to perform the duties of their role. AccountScope (dict) --- Defines the accounts that the specified Firewall Manager administrator can apply policies to. Accounts (list) --- The list of accounts within the organization that the specified Firewall Manager administrator either can or cannot apply policies to, based on the value of ExcludeSpecifiedAccounts. If ExcludeSpecifiedAccounts is set to true, then the Firewall Manager administrator can apply policies to all members of the organization except for the accounts in this list. If ExcludeSpecifiedAccounts is set to false, then the Firewall Manager administrator can only apply policies to the accounts in this list. (string) --- AllAccountsEnabled (boolean) --- A boolean value that indicates if the administrator can apply policies to all accounts within an organization. If true, the administrator can apply policies to all accounts within the organization. You can either enable management of all accounts through this operation, or you can specify a list of accounts to manage in AccountScope$Accounts. You cannot specify both. ExcludeSpecifiedAccounts (boolean) --- A boolean value that excludes the accounts in AccountScope$Accounts from the administrator's scope. If true, the Firewall Manager administrator can apply policies to all members of the organization except for the accounts listed in AccountScope$Accounts. You can either specify a list of accounts to exclude by AccountScope$Accounts, or you can enable management of all accounts by AccountScope$AllAccountsEnabled. OrganizationalUnitScope (dict) --- Defines the Organizations organizational units that the specified Firewall Manager administrator can apply policies to. For more information about OUs in Organizations, see Managing organizational units (OUs) in the Organizations User Guide. OrganizationalUnits (list) --- The list of OUs within the organization that the specified Firewall Manager administrator either can or cannot apply policies to, based on the value of OrganizationalUnitScope$ExcludeSpecifiedOrganizationalUnits. If OrganizationalUnitScope$ExcludeSpecifiedOrganizationalUnits is set to true, then the Firewall Manager administrator can apply policies to all OUs in the organization except for the OUs in this list. If OrganizationalUnitScope$ExcludeSpecifiedOrganizationalUnits is set to false, then the Firewall Manager administrator can only apply policies to the OUs in this list. (string) --- AllOrganizationalUnitsEnabled (boolean) --- A boolean value that indicates if the administrator can apply policies to all OUs within an organization. If true, the administrator can manage all OUs within the organization. You can either enable management of all OUs through this operation, or you can specify OUs to manage in OrganizationalUnitScope$OrganizationalUnits. ExcludeSpecifiedOrganizationalUnits (boolean) --- A boolean value that excludes the OUs in OrganizationalUnitScope$OrganizationalUnits from the administrator's scope. If true, the Firewall Manager administrator can apply policies to all OUs in the organization except for the OUs listed in OrganizationalUnitScope$OrganizationalUnits. You can either specify a list of OUs to exclude by OrganizationalUnitScope$OrganizationalUnits, or you can enable management of all OUs by OrganizationalUnitScope$AllOrganizationalUnitsEnabled. RegionScope (dict) --- Defines the Amazon Web Services Regions that the specified Firewall Manager administrator can perform actions in. Regions (list) --- The Amazon Web Services Regions that the specified Firewall Manager administrator can perform actions in. (string) --- AllRegionsEnabled (boolean) --- Allows the specified Firewall Manager administrator to manage all Amazon Web Services Regions. PolicyTypeScope (dict) --- Defines the Firewall Manager policy types that the specified Firewall Manager administrator can create and manage. PolicyTypes (list) --- The list of policy types that the specified Firewall Manager administrator can manage. (string) --- AllPolicyTypesEnabled (boolean) --- Allows the specified Firewall Manager administrator to manage all Firewall Manager policy types, except for third-party policy types. Third-party policy types can only be managed by the Firewall Manager default administrator.",
      "nested_params": [
        {
          "name": "AccountScope",
          "type": "dict",
          "required": false,
          "description": "Defines the accounts that the specified Firewall Manager administrator can apply policies to.",
          "nested_params": [
            {
              "name": "Accounts",
              "type": "list",
              "required": false,
              "description": "The list of accounts within the organization that the specified Firewall Manager administrator either can or cannot apply policies to, based on the value of ExcludeSpecifiedAccounts. If ExcludeSpecifiedAccounts is set to true, then the Firewall Manager administrator can apply policies to all members of the organization except for the accounts in this list. If ExcludeSpecifiedAccounts is set to false, then the Firewall Manager administrator can only apply policies to the accounts in this list.",
              "nested_params": []
            },
            {
              "name": "AllAccountsEnabled",
              "type": "boolean",
              "required": false,
              "description": "A boolean value that indicates if the administrator can apply policies to all accounts within an organization. If true, the administrator can apply policies to all accounts within the organization. You can either enable management of all accounts through this operation, or you can specify a list of accounts to manage in AccountScope$Accounts. You cannot specify both.",
              "nested_params": []
            },
            {
              "name": "ExcludeSpecifiedAccounts",
              "type": "boolean",
              "required": false,
              "description": "A boolean value that excludes the accounts in AccountScope$Accounts from the administrator's scope. If true, the Firewall Manager administrator can apply policies to all members of the organization except for the accounts listed in AccountScope$Accounts. You can either specify a list of accounts to exclude by AccountScope$Accounts, or you can enable management of all accounts by AccountScope$AllAccountsEnabled. You cannot specify both.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "OrganizationalUnitScope",
          "type": "dict",
          "required": false,
          "description": "Defines the Organizations organizational units that the specified Firewall Manager administrator can apply policies to. For more information about OUs in Organizations, see Managing organizational units (OUs) in the Organizations User Guide.",
          "nested_params": [
            {
              "name": "OrganizationalUnits",
              "type": "list",
              "required": false,
              "description": "The list of OUs within the organization that the specified Firewall Manager administrator either can or cannot apply policies to, based on the value of OrganizationalUnitScope$ExcludeSpecifiedOrganizationalUnits. If OrganizationalUnitScope$ExcludeSpecifiedOrganizationalUnits is set to true, then the Firewall Manager administrator can apply policies to all OUs in the organization except for the OUs in this list. If OrganizationalUnitScope$ExcludeSpecifiedOrganizationalUnits is set to false, then the Firewall Manager administrator can only apply policies to the OUs in this list.",
              "nested_params": []
            },
            {
              "name": "AllOrganizationalUnitsEnabled",
              "type": "boolean",
              "required": false,
              "description": "A boolean value that indicates if the administrator can apply policies to all OUs within an organization. If true, the administrator can manage all OUs within the organization. You can either enable management of all OUs through this operation, or you can specify OUs to manage in OrganizationalUnitScope$OrganizationalUnits. You cannot specify both.",
              "nested_params": []
            },
            {
              "name": "ExcludeSpecifiedOrganizationalUnits",
              "type": "boolean",
              "required": false,
              "description": "A boolean value that excludes the OUs in OrganizationalUnitScope$OrganizationalUnits from the administrator's scope. If true, the Firewall Manager administrator can apply policies to all OUs in the organization except for the OUs listed in OrganizationalUnitScope$OrganizationalUnits. You can either specify a list of OUs to exclude by OrganizationalUnitScope$OrganizationalUnits, or you can enable management of all OUs by OrganizationalUnitScope$AllOrganizationalUnitsEnabled. You cannot specify both.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "RegionScope",
          "type": "dict",
          "required": false,
          "description": "Defines the Amazon Web Services Regions that the specified Firewall Manager administrator can perform actions in.",
          "nested_params": [
            {
              "name": "Regions",
              "type": "list",
              "required": false,
              "description": "The Amazon Web Services Regions that the specified Firewall Manager administrator can perform actions in.",
              "nested_params": []
            },
            {
              "name": "AllRegionsEnabled",
              "type": "boolean",
              "required": false,
              "description": "Allows the specified Firewall Manager administrator to manage all Amazon Web Services Regions.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "PolicyTypeScope",
          "type": "dict",
          "required": false,
          "description": "Defines the Firewall Manager policy types that the specified Firewall Manager administrator can create and manage.",
          "nested_params": [
            {
              "name": "PolicyTypes",
              "type": "list",
              "required": false,
              "description": "The list of policy types that the specified Firewall Manager administrator can manage.",
              "nested_params": []
            },
            {
              "name": "AllPolicyTypesEnabled",
              "type": "boolean",
              "required": false,
              "description": "Allows the specified Firewall Manager administrator to manage all Firewall Manager policy types, except for third-party policy types. Third-party policy types can only be managed by the Firewall Manager default administrator.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}