{
  "method_name": "put_resource_set",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/fms/client/put_resource_set.html",
  "description": "Creates the resource set. An Firewall Manager resource set defines the resources to import into an Firewall Manager policy from another Amazon Web Services service.",
  "parameters": [
    {
      "name": "ResourceSet",
      "type": "dict",
      "required": true,
      "description": "Details about the resource set to be created or updated.> Id (string) --- A unique identifier for the resource set. This ID is returned in the responses to create and list commands. You provide it to operations like update and delete. The descriptive name of the resource set. You can't change the name of a resource set after you create it. Description (string) --- A description of the resource set. UpdateToken (string) --- An optional token that you can use for optimistic locking. Firewall Manager returns a token to your requests that access the resource set. The token marks the state of the resource set resource at the time of the request. Update tokens are not allowed when creating a resource set. After creation, each subsequent update call to the resource set requires the update token. To make an unconditional change to the resource set, omit the token in your update request. Without the token, Firewall Manager performs your updates regardless of whether the resource set has changed since you last retrieved it. To make a conditional change to the resource set, provide the token in your update request. Firewall Manager uses the token to ensure that the resource set hasn't changed since you last retrieved it. If it has changed, the operation fails with an InvalidTokenException. If this happens, retrieve the resource set again to get a current copy of it with a new token. Reapply your changes as needed, then try the operation again using the new token. Determines the resources that can be associated to the resource set. Depending on your setting for max results and the number of resource sets, a single call might not return the full list. (string) --- LastUpdateTime (datetime) --- The last time that the resource set was changed. ResourceSetStatus (string) --- Indicates whether the resource set is in or out of an admin's Region scope. ACTIVE - The administrator can manage and delete the resource set. OUT_OF_ADMIN_SCOPE - The administrator can view the resource set, but they can't edit or delete the resource set. Existing protections stay in place. Any new resource that come into scope of the resource set won't be protected.",
      "nested_params": [
        {
          "name": "Id",
          "type": "string",
          "required": false,
          "description": "A unique identifier for the resource set. This ID is returned in the responses to create and list commands. You provide it to operations like update and delete.",
          "nested_params": []
        },
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The descriptive name of the resource set. You can't change the name of a resource set after you create it.",
          "nested_params": []
        },
        {
          "name": "Description",
          "type": "string",
          "required": false,
          "description": "A description of the resource set.",
          "nested_params": []
        },
        {
          "name": "UpdateToken",
          "type": "string",
          "required": false,
          "description": "An optional token that you can use for optimistic locking. Firewall Manager returns a token to your requests that access the resource set. The token marks the state of the resource set resource at the time of the request. Update tokens are not allowed when creating a resource set. After creation, each subsequent update call to the resource set requires the update token. To make an unconditional change to the resource set, omit the token in your update request. Without the token, Firewall Manager performs your updates regardless of whether the resource set has changed since you last retrieved it. To make a conditional change to the resource set, provide the token in your update request. Firewall Manager uses the token to ensure that the resource set hasn't changed since you last retrieved it. If it has changed, the operation fails with an InvalidTokenException. If this happens, retrieve the resource set again to get a current copy of it with a new token. Reapply your changes as needed, then try the operation again using the new token.",
          "nested_params": []
        },
        {
          "name": "ResourceTypeList",
          "type": "list",
          "required": false,
          "description": "Determines the resources that can be associated to the resource set. Depending on your setting for max results and the number of resource sets, a single call might not return the full list.",
          "nested_params": []
        },
        {
          "name": "LastUpdateTime",
          "type": "datetime",
          "required": false,
          "description": "The last time that the resource set was changed.",
          "nested_params": []
        },
        {
          "name": "ResourceSetStatus",
          "type": "string",
          "required": false,
          "description": "Indicates whether the resource set is in or out of an admin's Region scope.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "TagList",
      "type": "list",
      "required": true,
      "description": "Retrieves the tags associated with the specified resource set. Tags are key:value pairs that you can use to categorize and manage your resources, for purposes like billing. For example, you might set the tag key to 'customer' and the value to the customer name or ID. You can specify one or more tags to add to each Amazon Web Services resource, up to 50 tags for a resource. (dict) --- A collection of key:value pairs associated with an Amazon Web Services resource. The key:value pair can be anything you define. Typically, the tag key represents a category (such as 'environment') and the tag value represents a specific value within that category (such as 'test,' 'development,' or 'production'). You can add up to 50 tags to each Amazon Web Services resource. Part of the key:value pair that defines a tag. You can use a tag key to describe a category of information, such as 'customer.' Tag keys are case-sensitive. You can use a tag value to describe a specific value within a category, such as 'companyA' or 'companyB.' Tag values are case-sensitive.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "Part of the key:value pair that defines a tag. You can use a tag key to describe a category of information, such as 'customer.' Tag keys are case-sensitive.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "Part of the key:value pair that defines a tag. You can use a tag value to describe a specific value within a category, such as 'companyA' or 'companyB.' Tag values are case-sensitive.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ResourceSet",
          "type": "dict",
          "description": "Details about the resource set.",
          "nested_items": [
            {
              "name": "Id",
              "type": "string",
              "description": "A unique identifier for the resource set. This ID is returned in the responses to create and list commands. You provide it to operations like update and delete.",
              "nested_items": []
            },
            {
              "name": "Name",
              "type": "string",
              "description": "The descriptive name of the resource set. You can't change the name of a resource set after you create it.",
              "nested_items": []
            },
            {
              "name": "Description",
              "type": "string",
              "description": "A description of the resource set.",
              "nested_items": []
            },
            {
              "name": "UpdateToken",
              "type": "string",
              "description": "An optional token that you can use for optimistic locking. Firewall Manager returns a token to your requests that access the resource set. The token marks the state of the resource set resource at the time of the request. Update tokens are not allowed when creating a resource set. After creation, each subsequent update call to the resource set requires the update token.",
              "nested_items": []
            },
            {
              "name": "ResourceTypeList",
              "type": "list",
              "description": "Determines the resources that can be associated to the resource set. Depending on your setting for max results and the number of resource sets, a single call might not return the full list.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "LastUpdateTime",
              "type": "datetime",
              "description": "The last time that the resource set was changed.",
              "nested_items": []
            },
            {
              "name": "ResourceSetStatus",
              "type": "string",
              "description": "Indicates whether the resource set is in or out of an admin's Region scope.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "ACTIVE - The administrator can manage and delete the resource set.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "OUT_OF_ADMIN_SCOPE - The administrator can view the resource set, but they can't edit or delete the resource set. Existing protections stay in place. Any new resource that come into scope of the resource set won't be protected.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "ResourceSetArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the resource set.",
          "nested_items": []
        }
      ]
    }
  ]
}