{
  "method_name": "create_alias",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/gamelift/client/create_alias.html",
  "description": "Creates an alias for a fleet. In most situations, you can use an alias ID in place of a fleet ID. An alias provides a level of abstraction for a fleet that is useful when redirecting player traffic from one fleet to another, such as when updating your game build. Amazon GameLift supports two types of routing strategies for aliases: simple and terminal. A simple alias points to an active fleet. A terminal alias is used to display messaging or link to a URL instead of routing players to an active fleet. For example, you might use a terminal alias when a game version is no longer supported and you want to direct players to an upgrade site. To create a fleet alias, specify an alias name, routing strategy, and optional description. Each simple alias can point to only one fleet, but a fleet can have multiple aliases. If successful, a new alias record is returned, including an alias ID and an ARN. You can reassign an alias to another fleet by calling UpdateAlias. All APIs by task.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "A descriptive label that is associated with an alias. Alias names do not need to be unique.",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "RoutingStrategy",
      "type": "dict",
      "required": true,
      "description": "The routing configuration, including routing type and fleet target, for the alias. Type (string) --- The type of routing strategy for the alias. Possible routing types include the following: SIMPLE - The alias resolves to one specific fleet. Use this type when routing to active fleets. TERMINAL - The alias does not resolve to a fleet but instead can be used to display a message to the user. A terminal alias throws a TerminalRoutingStrategyException with the message embedded. FleetId (string) --- A unique identifier for the fleet that the alias points to. This value is the fleet ID, not the fleet ARN. Message (string) --- The message text to be used with a terminal routing strategy.",
      "nested_params": [
        {
          "name": "Type",
          "type": "string",
          "required": false,
          "description": "The type of routing strategy for the alias. Possible routing types include the following:",
          "nested_params": [
            {
              "name": "SIMPLE",
              "type": "",
              "required": false,
              "description": "",
              "nested_params": []
            },
            {
              "name": "TERMINAL",
              "type": "",
              "required": false,
              "description": "",
              "nested_params": []
            }
          ]
        },
        {
          "name": "FleetId",
          "type": "string",
          "required": false,
          "description": "A unique identifier for the fleet that the alias points to. This value is the fleet ID, not the fleet ARN.",
          "nested_params": []
        },
        {
          "name": "Message",
          "type": "string",
          "required": false,
          "description": "The message text to be used with a terminal routing strategy.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "A list of labels to assign to the new alias resource. Tags are developer-defined key-value pairs. Tagging Amazon Web Services resources are useful for resource management, access management and cost allocation. For more information, see Tagging Amazon Web Services Resources in the Amazon Web Services General Reference. (dict) --- A label that you can assign to a Amazon GameLift resource. Tagging Amazon Web Services Resources in the Amazon Web Services General Reference Amazon Web Services Tagging Strategies All APIs by task The key for a developer-defined key value pair for tagging an Amazon Web Services resource. The value for a developer-defined key value pair for tagging an Amazon Web Services resource.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key for a developer-defined key value pair for tagging an Amazon Web Services resource.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value for a developer-defined key value pair for tagging an Amazon Web Services resource.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "AliasId",
              "type": "string",
              "description": "A unique identifier for the alias. Alias IDs are unique within a Region.",
              "nested_items": []
            },
            {
              "name": "Name",
              "type": "string",
              "description": "A descriptive label that is associated with an alias. Alias names do not need to be unique.",
              "nested_items": []
            },
            {
              "name": "AliasArn",
              "type": "string",
              "description": "The Amazon Resource Name ( ARN) that is assigned to a Amazon GameLift alias resource and uniquely identifies it. ARNs are unique across all Regions. Format is arn:aws:gamelift:<region>::alias/alias-a1234567-b8c9-0d1e-2fa3-b45c6d7e8912. In a GameLift alias ARN, the resource ID matches the alias ID value.",
              "nested_items": []
            },
            {
              "name": "Description",
              "type": "string",
              "description": "A human-readable description of an alias.",
              "nested_items": []
            },
            {
              "name": "RoutingStrategy",
              "type": "dict",
              "description": "The routing configuration, including routing type and fleet target, for the alias.",
              "nested_items": [
                {
                  "name": "Type",
                  "type": "string",
                  "description": "The type of routing strategy for the alias.",
                  "nested_items": [
                    {
                      "name": "SIMPLE",
                      "type": "",
                      "description": "",
                      "nested_items": []
                    },
                    {
                      "name": "TERMINAL",
                      "type": "",
                      "description": "",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "FleetId",
                  "type": "string",
                  "description": "A unique identifier for the fleet that the alias points to. This value is the fleet ID, not the fleet ARN.",
                  "nested_items": []
                },
                {
                  "name": "Message",
                  "type": "string",
                  "description": "The message text to be used with a terminal routing strategy.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "CreationTime",
              "type": "datetime",
              "description": "A time stamp indicating when this data object was created. Format is a number expressed in Unix time as milliseconds (for example \"1469498468.057\").",
              "nested_items": []
            },
            {
              "name": "LastUpdatedTime",
              "type": "datetime",
              "description": "The time that this data object was last modified. Format is a number expressed in Unix time as milliseconds (for example \"1469498468.057\").",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}