{
  "method_name": "create_location",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/gamelift/client/create_location.html",
  "description": "Creates a custom location for use in an Anywhere fleet.",
  "parameters": [
    {
      "name": "LocationName",
      "type": "string",
      "required": true,
      "description": "A descriptive name for the custom location.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "A list of labels to assign to the new resource. Tags are developer-defined key-value pairs. Tagging Amazon Web Services resources are useful for resource management, access management, and cost allocation. For more information, see Tagging Amazon Web Services Resources in the Amazon Web Services General Rareference. (dict) --- A label that you can assign to a Amazon GameLift resource. Tagging Amazon Web Services Resources in the Amazon Web Services General Reference Amazon Web Services Tagging Strategies All APIs by task The key for a developer-defined key value pair for tagging an Amazon Web Services resource. The value for a developer-defined key value pair for tagging an Amazon Web Services resource.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key for a developer-defined key value pair for tagging an Amazon Web Services resource.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value for a developer-defined key value pair for tagging an Amazon Web Services resource.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "LocationName",
              "type": "string",
              "description": "The location's name.",
              "nested_items": []
            },
            {
              "name": "LocationArn",
              "type": "string",
              "description": "The Amazon Resource Name ( ARN) that is assigned to a Amazon GameLift location resource and uniquely identifies it. ARNs are unique across all Regions. Format is arn:aws:gamelift:<region>::location/location-a1234567-b8c9-0d1e-2fa3-b45c6d7e8912.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}