{
  "method_name": "create_build",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/gamelift/client/create_build.html",
  "description": "Creates a new Amazon GameLift build resource for your game server binary files. Combine game server binaries into a zip file for use with Amazon GameLift. You can use the CreateBuild operation in the following scenarios: If successful, this operation creates a new build resource with a unique build ID and places it in INITIALIZED status. A build must be in READY status before you can create fleets with it. Uploading Your Game. Create a Build with Files in Amazon S3 All APIs by task.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Version",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "StorageLocation",
      "type": "dict",
      "required": false,
      "description": "Information indicating where your game build files are stored. Use this parameter only when creating a build with files stored in an Amazon S3 bucket that you own. The storage location must specify an Amazon S3 bucket name and key. The location must also specify a role ARN that you set up to allow Amazon GameLift to access your Amazon S3 bucket. The S3 bucket and your new build must be in the same Region. If a StorageLocation is specified, the size of your file can be found in your Amazon S3 bucket. Amazon GameLift will report a SizeOnDisk of 0. Bucket (string) --- An Amazon S3 bucket identifier. Thename of the S3 bucket. Key (string) --- The name of the zip file that contains the build files or script files. RoleArn (string) --- The Amazon Resource Name ( ARN) for an IAM role that allows Amazon GameLift to access the S3 bucket. ObjectVersion (string) --- The version of the file, if object versioning is turned on for the bucket. Amazon GameLift uses this information when retrieving files from an S3 bucket that you own. Use this parameter to specify a specific version of the file. If not set, the latest version of the file is retrieved.",
      "nested_params": [
        {
          "name": "Bucket",
          "type": "string",
          "required": false,
          "description": "An Amazon S3 bucket identifier. Thename of the S3 bucket.",
          "nested_params": []
        },
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The name of the zip file that contains the build files or script files.",
          "nested_params": []
        },
        {
          "name": "RoleArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name ( ARN) for an IAM role that allows Amazon GameLift to access the S3 bucket.",
          "nested_params": []
        },
        {
          "name": "ObjectVersion",
          "type": "string",
          "required": false,
          "description": "The version of the file, if object versioning is turned on for the bucket. Amazon GameLift uses this information when retrieving files from an S3 bucket that you own. Use this parameter to specify a specific version of the file. If not set, the latest version of the file is retrieved.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "OperatingSystem",
      "type": "string",
      "required": false,
      "description": "The operating system that your game server binaries run on. This value determines the type of fleet resources that you use for this build. If your game build contains multiple executables, they all must run on the same operating system. You must specify a valid operating system in this request. There is no default value. You can't change a build's operating system later.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "A list of labels to assign to the new build resource. Tags are developer defined key-value pairs. Tagging Amazon Web Services resources are useful for resource management, access management and cost allocation. For more information, see Tagging Amazon Web Services Resources in the Amazon Web Services General Reference. Once the resource is created, you can use TagResource, UntagResource, and ListTagsForResource to add, remove, and view tags. The maximum tag limit may be lower than stated. See the Amazon Web Services General Reference for actual tagging limits. (dict) --- A label that you can assign to a Amazon GameLift resource. Tagging Amazon Web Services Resources in the Amazon Web Services General Reference Amazon Web Services Tagging Strategies All APIs by task The key for a developer-defined key value pair for tagging an Amazon Web Services resource. The value for a developer-defined key value pair for tagging an Amazon Web Services resource.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key for a developer-defined key value pair for tagging an Amazon Web Services resource.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value for a developer-defined key value pair for tagging an Amazon Web Services resource.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ServerSdkVersion",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "BuildId",
              "type": "string",
              "description": "A unique identifier for the build.",
              "nested_items": []
            },
            {
              "name": "BuildArn",
              "type": "string",
              "description": "The Amazon Resource Name ( ARN) that is assigned to a Amazon GameLift build resource and uniquely identifies it. ARNs are unique across all Regions. Format is arn:aws:gamelift:<region>::build/build-a1234567-b8c9-0d1e-2fa3-b45c6d7e8912. In a GameLift build ARN, the resource ID matches the BuildId value.",
              "nested_items": []
            },
            {
              "name": "Name",
              "type": "string",
              "description": "A descriptive label that is associated with a build. Build names do not need to be unique. It can be set using CreateBuild or UpdateBuild.",
              "nested_items": []
            },
            {
              "name": "Version",
              "type": "string",
              "description": "Version information that is associated with a build or script. Version strings do not need to be unique.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "Current status of the build.",
              "nested_items": [
                {
                  "name": "INITIALIZED",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "READY",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "FAILED",
                  "type": "",
                  "description": "",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "SizeOnDisk",
              "type": "integer",
              "description": "File size of the uploaded game build, expressed in bytes. When the build status is INITIALIZED or when using a custom Amazon S3 storage location, this value is 0.",
              "nested_items": []
            },
            {
              "name": "OperatingSystem",
              "type": "string",
              "description": "Operating system that the game server binaries are built to run on. This value determines the type of fleet resources that you can use for this build.",
              "nested_items": []
            },
            {
              "name": "CreationTime",
              "type": "datetime",
              "description": "A time stamp indicating when this data object was created. Format is a number expressed in Unix time as milliseconds (for example \"1469498468.057\").",
              "nested_items": []
            },
            {
              "name": "ServerSdkVersion",
              "type": "string",
              "description": "The Amazon GameLift Server SDK version used to develop your game server.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "UploadCredentials",
          "type": "dict",
          "description": "This element is returned only when the operation is called without a storage location. It contains credentials to use when you are uploading a build file to an Amazon S3 bucket that is owned by Amazon GameLift. Credentials have a limited life span. To refresh these credentials, call RequestUploadCredentials.",
          "nested_items": [
            {
              "name": "AccessKeyId",
              "type": "string",
              "description": "The access key ID that identifies the temporary security credentials.",
              "nested_items": []
            },
            {
              "name": "SecretAccessKey",
              "type": "string",
              "description": "The secret access key that can be used to sign requests.",
              "nested_items": []
            },
            {
              "name": "SessionToken",
              "type": "string",
              "description": "The token that users must pass to the service API to use the temporary credentials.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "StorageLocation",
          "type": "dict",
          "description": "Amazon S3 location for your game build file, including bucket name and key.",
          "nested_items": [
            {
              "name": "Bucket",
              "type": "string",
              "description": "An Amazon S3 bucket identifier. Thename of the S3 bucket.",
              "nested_items": []
            },
            {
              "name": "Key",
              "type": "string",
              "description": "The name of the zip file that contains the build files or script files.",
              "nested_items": []
            },
            {
              "name": "RoleArn",
              "type": "string",
              "description": "The Amazon Resource Name ( ARN) for an IAM role that allows Amazon GameLift to access the S3 bucket.",
              "nested_items": []
            },
            {
              "name": "ObjectVersion",
              "type": "string",
              "description": "The version of the file, if object versioning is turned on for the bucket. Amazon GameLift uses this information when retrieving files from an S3 bucket that you own. Use this parameter to specify a specific version of the file. If not set, the latest version of the file is retrieved.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}