{
  "method_name": "describe_fleet_port_settings",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/gamelift/client/describe_fleet_port_settings.html",
  "description": "Retrieves a fleet's inbound connection permissions. Connection permissions specify IP addresses and port settings that incoming traffic can use to access server processes in the fleet. Game server processes that are running in the fleet must use a port that falls within this range. Use this operation in the following ways: If successful, a set of IpPermission objects is returned for the requested fleet ID. When specifying a location, this operation returns a pending status. If the requested fleet has been deleted, the result set is empty. Setting up Amazon GameLift fleets.",
  "parameters": [
    {
      "name": "FleetId",
      "type": "string",
      "required": true,
      "description": "A unique identifier for the fleet to retrieve port settings for. You can use either the fleet ID or ARN value.",
      "nested_params": []
    },
    {
      "name": "Location",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "FleetId",
          "type": "string",
          "description": "A unique identifier for the fleet that was requested.",
          "nested_items": []
        },
        {
          "name": "FleetArn",
          "type": "string",
          "description": "The Amazon Resource Name ( ARN) that is assigned to a Amazon GameLift fleet resource and uniquely identifies it. ARNs are unique across all Regions. Format is arn:aws:gamelift:<region>::fleet/fleet-a1234567-b8c9-0d1e-2fa3-b45c6d7e8912.",
          "nested_items": []
        },
        {
          "name": "InboundPermissions",
          "type": "list",
          "description": "The port settings for the requested fleet ID.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "FromPort",
                  "type": "integer",
                  "description": "A starting value for a range of allowed port numbers.",
                  "nested_items": []
                },
                {
                  "name": "ToPort",
                  "type": "integer",
                  "description": "An ending value for a range of allowed port numbers. Port numbers are end-inclusive. This value must be equal to or greater than FromPort.",
                  "nested_items": []
                },
                {
                  "name": "IpRange",
                  "type": "string",
                  "description": "A range of allowed IP addresses. This value must be expressed in CIDR notation. Example: ' 000.000.000.000/[subnet mask]' or optionally the shortened version ' 0.0.0.0/[subnet mask]'.",
                  "nested_items": []
                },
                {
                  "name": "Protocol",
                  "type": "string",
                  "description": "The network communication protocol used by the fleet.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "UpdateStatus",
          "type": "string",
          "description": "The current status of updates to the fleet's port settings in the requested fleet location. A status of PENDING_UPDATE indicates that an update was requested for the fleet but has not yet been completed for the location.",
          "nested_items": []
        },
        {
          "name": "Location",
          "type": "string",
          "description": "The requested fleet location, expressed as an Amazon Web Services Region code, such as us-west-2.",
          "nested_items": []
        }
      ]
    }
  ]
}