{
  "method_name": "list_scripts",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/gamelift/client/list_scripts.html",
  "description": "Retrieves script records for all Realtime scripts that are associated with the Amazon Web Services account in use. Amazon GameLift Amazon GameLift Realtime. All APIs by task.",
  "parameters": [
    {
      "name": "Limit",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Scripts",
          "type": "list",
          "description": "A set of properties describing the requested script.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ScriptId",
                  "type": "string",
                  "description": "A unique identifier for the Realtime script.",
                  "nested_items": []
                },
                {
                  "name": "ScriptArn",
                  "type": "string",
                  "description": "The Amazon Resource Name ( ARN) that is assigned to a Amazon GameLift script resource and uniquely identifies it. ARNs are unique across all Regions. In a GameLift script ARN, the resource ID matches the ScriptId value.",
                  "nested_items": []
                },
                {
                  "name": "Name",
                  "type": "string",
                  "description": "A descriptive label that is associated with a script. Script names do not need to be unique.",
                  "nested_items": []
                },
                {
                  "name": "Version",
                  "type": "string",
                  "description": "Version information that is associated with a build or script. Version strings do not need to be unique.",
                  "nested_items": []
                },
                {
                  "name": "SizeOnDisk",
                  "type": "integer",
                  "description": "The file size of the uploaded Realtime script, expressed in bytes. When files are uploaded from an S3 location, this value remains at '0'.",
                  "nested_items": []
                },
                {
                  "name": "CreationTime",
                  "type": "datetime",
                  "description": "A time stamp indicating when this data object was created. Format is a number expressed in Unix time as milliseconds (for example \"1469498468.057\").",
                  "nested_items": []
                },
                {
                  "name": "StorageLocation",
                  "type": "dict",
                  "description": "The location of the Amazon S3 bucket where a zipped file containing your Realtime scripts is stored. The storage location must specify the Amazon S3 bucket name, the zip file name (the 'key'), and a role ARN that allows Amazon GameLift to access the Amazon S3 storage location. The S3 bucket must be in the same Region where you want to create a new script. By default, Amazon GameLift uploads the latest version of the zip file; if you have S3 object versioning turned on, you can use the ObjectVersion parameter to specify an earlier version.",
                  "nested_items": [
                    {
                      "name": "Bucket",
                      "type": "string",
                      "description": "An Amazon S3 bucket identifier. Thename of the S3 bucket.",
                      "nested_items": []
                    },
                    {
                      "name": "Key",
                      "type": "string",
                      "description": "The name of the zip file that contains the build files or script files.",
                      "nested_items": []
                    },
                    {
                      "name": "RoleArn",
                      "type": "string",
                      "description": "The Amazon Resource Name ( ARN) for an IAM role that allows Amazon GameLift to access the S3 bucket.",
                      "nested_items": []
                    },
                    {
                      "name": "ObjectVersion",
                      "type": "string",
                      "description": "The version of the file, if object versioning is turned on for the bucket. Amazon GameLift uses this information when retrieving files from an S3 bucket that you own. Use this parameter to specify a specific version of the file. If not set, the latest version of the file is retrieved.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "A token that indicates where to resume retrieving results on the next call to this operation. If no token is returned, these results represent the end of the list.",
          "nested_items": []
        }
      ]
    }
  ]
}