{
  "method_name": "stop_fleet_actions",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/gamelift/client/stop_fleet_actions.html",
  "description": "Suspends certain types of activity in a fleet location. Currently, this operation is used to stop auto-scaling activity. For multi-location fleets, fleet actions are managed separately for each location. Stopping fleet actions has several potential purposes. It allows you to temporarily stop auto-scaling activity but retain your scaling policies for use in the future. For multi-location fleets, you can set up fleet-wide auto-scaling, and then opt out of it for certain locations. This operation can be used in the following ways: If successful, Amazon GameLift no longer initiates scaling events except in response to manual changes using UpdateFleetCapacity. To restart fleet actions again, call StartFleetActions. Setting up Amazon GameLift Fleets.",
  "parameters": [
    {
      "name": "FleetId",
      "type": "string",
      "required": true,
      "description": "A unique identifier for the fleet to stop actions on. You can use either the fleet ID or ARN value.",
      "nested_params": []
    },
    {
      "name": "Actions",
      "type": "list",
      "required": true,
      "description": "List of actions to suspend on the fleet. (string) ---",
      "nested_params": []
    },
    {
      "name": "Location",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "FleetId",
          "type": "string",
          "description": "A unique identifier for the fleet to stop actions on.",
          "nested_items": []
        },
        {
          "name": "FleetArn",
          "type": "string",
          "description": "The Amazon Resource Name ( ARN) that is assigned to a Amazon GameLift fleet resource and uniquely identifies it. ARNs are unique across all Regions. Format is arn:aws:gamelift:<region>::fleet/fleet-a1234567-b8c9-0d1e-2fa3-b45c6d7e8912.",
          "nested_items": []
        }
      ]
    }
  ]
}