{
  "method_name": "confirm_forgot_password",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cognito-idp/client/confirm_forgot_password.html",
  "description": "This public API operation accepts a confirmation code that Amazon Cognito sent to a user and accepts a new password for that user.",
  "parameters": [
    {
      "name": "ClientId",
      "type": "string",
      "required": true,
      "description": "The ID of the app client where the user wants to reset their password. This parameter is an identifier of the client application that users are resetting their password from, but this operation resets users' irrespective of the app clients they sign in to.",
      "nested_params": []
    },
    {
      "name": "SecretHash",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Username",
      "type": "string",
      "required": true,
      "description": "The name of the user that you want to query or modify. The value of this parameter is typically your user's username, but it can be any of their alias attributes. If username isn't an alias attribute in your user pool, this value must be the sub of a local user or the username of a user from a third-party IdP.",
      "nested_params": []
    },
    {
      "name": "ConfirmationCode",
      "type": "string",
      "required": true,
      "description": "The confirmation code that your user pool delivered when your user requested to reset their password.",
      "nested_params": []
    },
    {
      "name": "Password",
      "type": "string",
      "required": true,
      "description": "The new password that your user wants to set.",
      "nested_params": []
    },
    {
      "name": "AnalyticsMetadata",
      "type": "dict",
      "required": false,
      "description": "Information that supports analytics outcomes with Amazon Pinpoint, including the user's endpoint ID. The endpoint ID is a destination for Amazon Pinpoint push notifications, for example a device identifier, email address, or phone number. AnalyticsEndpointId (string) --- The endpoint ID. Information that you want to pass to Amazon Pinpoint about where to send notifications.",
      "nested_params": [
        {
          "name": "AnalyticsEndpointId",
          "type": "string",
          "required": false,
          "description": "The endpoint ID. Information that you want to pass to Amazon Pinpoint about where to send notifications.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "UserContextData",
      "type": "dict",
      "required": false,
      "description": "Contextual data about your user session like the device fingerprint, IP address, or location. Amazon Cognito threat protection evaluates the risk of an authentication event based on the context that your app generates and passes to Amazon Cognito when it makes API requests. For more information, see Collecting data for threat protection in applications. IpAddress (string) --- The source IP address of your user's device. EncodedData (string) --- Encoded device-fingerprint details that your app collected with the Amazon Cognito context data collection library. For more information, see Adding user device and session data to API requests.",
      "nested_params": [
        {
          "name": "IpAddress",
          "type": "string",
          "required": false,
          "description": "The source IP address of your user's device.",
          "nested_params": []
        },
        {
          "name": "EncodedData",
          "type": "string",
          "required": false,
          "description": "Encoded device-fingerprint details that your app collected with the Amazon Cognito context data collection library. For more information, see Adding user device and session data to API requests.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ClientMetadata",
      "type": "dict",
      "required": false,
      "description": "A map of custom key-value pairs that you can provide as input for any custom workflows that this action triggers. You create custom workflows by assigning Lambda functions to user pool triggers. When you use the ConfirmForgotPassword API action, Amazon Cognito invokes the function that is assigned to the post confirmation trigger. When Amazon Cognito invokes this function, it passes a JSON payload, which the function receives as input. This payload contains a clientMetadata attribute, which provides the data that you assigned to the ClientMetadata parameter in your ConfirmForgotPassword request. In your function code in Lambda, you can process the clientMetadata value to enhance your workflow for your specific needs. For more information, see Using Lambda triggers in the Amazon Cognito Developer Guide. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}