{
  "method_name": "create_group",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cognito-idp/client/create_group.html",
  "description": "Creates a new group in the specified user pool. For more information about user pool groups, see Adding groups to a user pool.",
  "parameters": [
    {
      "name": "GroupName",
      "type": "string",
      "required": true,
      "description": "A name for the group. This name must be unique in your user pool.",
      "nested_params": []
    },
    {
      "name": "UserPoolId",
      "type": "string",
      "required": true,
      "description": "The ID of the user pool where you want to create a user group.",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "RoleArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Precedence",
      "type": "integer",
      "required": false,
      "description": "A non-negative integer value that specifies the precedence of this group relative to the other groups that a user can belong to in the user pool. Zero is the highest precedence value. Groups with lower Precedence values take precedence over groups with higher or null Precedence values. If a user belongs to two or more groups, it is the group with the lowest precedence value whose role ARN is given in the user's tokens for the cognito:roles and cognito:preferred_role claims. Two groups can have the same Precedence value. If this happens, neither group takes precedence over the other. If two groups with the same Precedence have the same role ARN, that role is used in the cognito:preferred_role claim in tokens for users in each group. If the two groups have different role ARNs, the cognito:preferred_role claim isn't set in users' tokens. The default Precedence value is null. The maximum Precedence value is 2^31-1.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "GroupName",
              "type": "string",
              "description": "The name of the group.",
              "nested_items": []
            },
            {
              "name": "UserPoolId",
              "type": "string",
              "description": "The ID of the user pool that contains the group.",
              "nested_items": []
            },
            {
              "name": "Description",
              "type": "string",
              "description": "A friendly description of the group.",
              "nested_items": []
            },
            {
              "name": "RoleArn",
              "type": "string",
              "description": "The ARN of the IAM role associated with the group. If a group has the highest priority of a user's groups, users who authenticate with an identity pool get credentials for the RoleArn that's associated with the group.",
              "nested_items": []
            },
            {
              "name": "Precedence",
              "type": "integer",
              "description": "A non-negative integer value that specifies the precedence of this group relative to the other groups that a user can belong to in the user pool. Zero is the highest precedence value. Groups with lower Precedence values take precedence over groups with higher ornull Precedence values. If a user belongs to two or more groups, it is the group with the lowest precedence value whose role ARN is given in the user's tokens for the cognito:roles and cognito:preferred_role claims.",
              "nested_items": []
            },
            {
              "name": "LastModifiedDate",
              "type": "datetime",
              "description": "The date and time when the item was modified. Amazon Cognito returns this timestamp in UNIX epoch time format. Your SDK might render the output in a human-readable format like ISO 8601 or a Java Date object.",
              "nested_items": []
            },
            {
              "name": "CreationDate",
              "type": "datetime",
              "description": "The date and time when the item was created. Amazon Cognito returns this timestamp in UNIX epoch time format. Your SDK might render the output in a human-readable format like ISO 8601 or a Java Date object.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}