{
  "method_name": "resend_confirmation_code",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cognito-idp/client/resend_confirmation_code.html",
  "description": "Resends the code that confirms a new account for a user who has signed up in your user pool. Amazon Cognito sends confirmation codes to the user attribute in the AutoVerifiedAttributes property of your user pool. When you prompt new users for the confirmation code, include a 'Resend code' option that generates a call to this API operation.",
  "parameters": [
    {
      "name": "ClientId",
      "type": "string",
      "required": true,
      "description": "The ID of the user pool app client where the user signed up.",
      "nested_params": []
    },
    {
      "name": "SecretHash",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "UserContextData",
      "type": "dict",
      "required": false,
      "description": "Contextual data about your user session like the device fingerprint, IP address, or location. Amazon Cognito threat protection evaluates the risk of an authentication event based on the context that your app generates and passes to Amazon Cognito when it makes API requests. For more information, see Collecting data for threat protection in applications. IpAddress (string) --- The source IP address of your user's device. EncodedData (string) --- Encoded device-fingerprint details that your app collected with the Amazon Cognito context data collection library. For more information, see Adding user device and session data to API requests.",
      "nested_params": [
        {
          "name": "IpAddress",
          "type": "string",
          "required": false,
          "description": "The source IP address of your user's device.",
          "nested_params": []
        },
        {
          "name": "EncodedData",
          "type": "string",
          "required": false,
          "description": "Encoded device-fingerprint details that your app collected with the Amazon Cognito context data collection library. For more information, see Adding user device and session data to API requests.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Username",
      "type": "string",
      "required": true,
      "description": "The name of the user that you want to query or modify. The value of this parameter is typically your user's username, but it can be any of their alias attributes. If username isn't an alias attribute in your user pool, this value must be the sub of a local user or the username of a user from a third-party IdP.",
      "nested_params": []
    },
    {
      "name": "AnalyticsMetadata",
      "type": "dict",
      "required": false,
      "description": "Information that supports analytics outcomes with Amazon Pinpoint, including the user's endpoint ID. The endpoint ID is a destination for Amazon Pinpoint push notifications, for example a device identifier, email address, or phone number. AnalyticsEndpointId (string) --- The endpoint ID. Information that you want to pass to Amazon Pinpoint about where to send notifications.",
      "nested_params": [
        {
          "name": "AnalyticsEndpointId",
          "type": "string",
          "required": false,
          "description": "The endpoint ID. Information that you want to pass to Amazon Pinpoint about where to send notifications.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ClientMetadata",
      "type": "dict",
      "required": false,
      "description": "A map of custom key-value pairs that you can provide as input for any custom workflows that this action triggers. You create custom workflows by assigning Lambda functions to user pool triggers. When you use the ResendConfirmationCode API action, Amazon Cognito invokes the function that is assigned to the custom message trigger. When Amazon Cognito invokes this function, it passes a JSON payload, which the function receives as input. This payload contains a clientMetadata attribute, which provides the data that you assigned to the ClientMetadata parameter in your ResendConfirmationCode request. In your function code in Lambda, you can process the clientMetadata value to enhance your workflow for your specific needs. For more information, see Using Lambda triggers in the Amazon Cognito Developer Guide. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "CodeDeliveryDetails",
          "type": "dict",
          "description": "Information about the phone number or email address that Amazon Cognito sent the confirmation code to.",
          "nested_items": [
            {
              "name": "Destination",
              "type": "string",
              "description": "The email address or phone number destination where Amazon Cognito sent the code.",
              "nested_items": []
            },
            {
              "name": "DeliveryMedium",
              "type": "string",
              "description": "The method that Amazon Cognito used to send the code.",
              "nested_items": []
            },
            {
              "name": "AttributeName",
              "type": "string",
              "description": "The name of the attribute that Amazon Cognito verifies with the code.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}