{
  "method_name": "sign_up",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cognito-idp/client/sign_up.html",
  "description": "Registers a user with an app client and requests a user name, password, and user attributes in the user pool. You might receive a LimitExceeded exception in response to this request if you have exceeded a rate quota for email or SMS messages, and if your user pool automatically verifies email addresses or phone numbers. When you get this exception in the response, the user is successfully created and is in an UNCONFIRMED state.",
  "parameters": [
    {
      "name": "ClientId",
      "type": "string",
      "required": true,
      "description": "The ID of the app client where the user wants to sign up.",
      "nested_params": []
    },
    {
      "name": "SecretHash",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Username",
      "type": "string",
      "required": true,
      "description": "The username of the user that you want to sign up. The value of this parameter is typically a username, but can be any alias attribute in your user pool.",
      "nested_params": []
    },
    {
      "name": "Password",
      "type": "string",
      "required": false,
      "description": "The user's proposed password. The password must comply with the password requirements of your user pool. Users can sign up without a password when your user pool supports passwordless sign-in with email or SMS OTPs. To create a user with no password, omit this parameter or submit a blank value. You can only create a passwordless user when passwordless sign-in is available.",
      "nested_params": []
    },
    {
      "name": "UserAttributes",
      "type": "list",
      "required": true,
      "description": "An array of name-value pairs representing user attributes. For custom attributes, include a custom: prefix in the attribute name, for example custom:department. (dict) --- The name and value of a user attribute. The name of the attribute. Value (string) --- The value of the attribute.",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name of the attribute.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value of the attribute.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ValidationData",
      "type": "list",
      "required": true,
      "description": "Temporary user attributes that contribute to the outcomes of your pre sign-up Lambda trigger. This set of key-value pairs are for custom validation of information that you collect from your users but don't need to retain. Your Lambda function can analyze this additional data and act on it. Your function can automatically confirm and verify select users or perform external API operations like logging user attributes and validation data to Amazon CloudWatch Logs. For more information about the pre sign-up Lambda trigger, see Pre sign-up Lambda trigger. (dict) --- The name and value of a user attribute. The name of the attribute. Value (string) --- The value of the attribute.",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name of the attribute.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value of the attribute.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "AnalyticsMetadata",
      "type": "dict",
      "required": false,
      "description": "Information that supports analytics outcomes with Amazon Pinpoint, including the user's endpoint ID. The endpoint ID is a destination for Amazon Pinpoint push notifications, for example a device identifier, email address, or phone number. AnalyticsEndpointId (string) --- The endpoint ID. Information that you want to pass to Amazon Pinpoint about where to send notifications.",
      "nested_params": [
        {
          "name": "AnalyticsEndpointId",
          "type": "string",
          "required": false,
          "description": "The endpoint ID. Information that you want to pass to Amazon Pinpoint about where to send notifications.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "UserContextData",
      "type": "dict",
      "required": false,
      "description": "Contextual data about your user session like the device fingerprint, IP address, or location. Amazon Cognito threat protection evaluates the risk of an authentication event based on the context that your app generates and passes to Amazon Cognito when it makes API requests. For more information, see Collecting data for threat protection in applications. IpAddress (string) --- The source IP address of your user's device. EncodedData (string) --- Encoded device-fingerprint details that your app collected with the Amazon Cognito context data collection library. For more information, see Adding user device and session data to API requests.",
      "nested_params": [
        {
          "name": "IpAddress",
          "type": "string",
          "required": false,
          "description": "The source IP address of your user's device.",
          "nested_params": []
        },
        {
          "name": "EncodedData",
          "type": "string",
          "required": false,
          "description": "Encoded device-fingerprint details that your app collected with the Amazon Cognito context data collection library. For more information, see Adding user device and session data to API requests.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ClientMetadata",
      "type": "dict",
      "required": false,
      "description": "A map of custom key-value pairs that you can provide as input for any custom workflows that this action triggers. You create custom workflows by assigning Lambda functions to user pool triggers. When you use the SignUp API action, Amazon Cognito invokes any functions that are assigned to the following triggers: pre sign-up, custom message, and post confirmation. When Amazon Cognito invokes any of these functions, it passes a JSON payload, which the function receives as input. This payload contains a clientMetadata attribute, which provides the data that you assigned to the ClientMetadata parameter in your SignUp request. In your function code in Lambda, you can process the clientMetadata value to enhance your workflow for your specific needs. For more information, see Using Lambda triggers in the Amazon Cognito Developer Guide. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "UserConfirmed",
          "type": "boolean",
          "description": "Indicates whether the user was automatically confirmed. You can auto-confirm users with a pre sign-up Lambda trigger.",
          "nested_items": []
        },
        {
          "name": "CodeDeliveryDetails",
          "type": "dict",
          "description": "In user pools that automatically verify and confirm new users, Amazon Cognito sends users a message with a code or link that confirms ownership of the phone number or email address that they entered. The CodeDeliveryDetails object is information about the delivery destination for that link or code.",
          "nested_items": [
            {
              "name": "Destination",
              "type": "string",
              "description": "The email address or phone number destination where Amazon Cognito sent the code.",
              "nested_items": []
            },
            {
              "name": "DeliveryMedium",
              "type": "string",
              "description": "The method that Amazon Cognito used to send the code.",
              "nested_items": []
            },
            {
              "name": "AttributeName",
              "type": "string",
              "description": "The name of the attribute that Amazon Cognito verifies with the code.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "UserSub",
          "type": "string",
          "description": "The unique identifier of the new user, for example a1b2c3d4-5678-90ab-cdef-EXAMPLE11111.",
          "nested_items": []
        },
        {
          "name": "Session",
          "type": "string",
          "description": "A session Id that you can pass to ConfirmSignUp when you want to immediately sign in your user with the USER_AUTH flow after they complete sign-up.",
          "nested_items": []
        }
      ]
    }
  ]
}