{
  "method_name": "create_key",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/payment-cryptography/client/create_key.html",
  "description": "Creates an Amazon Web Services Payment Cryptography key, a logical representation of a cryptographic key, that is unique in your account and Amazon Web Services Region. You use keys for cryptographic functions such as encryption and decryption. In addition to the key material used in cryptographic operations, an Amazon Web Services Payment Cryptography key includes metadata such as the key ARN, key usage, key origin, creation date, description, and key state. When you create a key, you specify both immutable and mutable data about the key. The immutable data contains key attributes that define the scope and cryptographic operations that you can perform using the key, for example key class (example: SYMMETRIC_KEY), key algorithm (example: TDES_2KEY), key usage (example: TR31_P0_PIN_ENCRYPTION_KEY) and key modes of use (example: Encrypt). Amazon Web Services Payment Cryptography binds key attributes to keys using key blocks when you store or export them. Amazon Web Services Payment Cryptography stores the key contents wrapped and never stores or transmits them in the clear. For information about valid combinations of key attributes, see Understanding key attributes in the Amazon Web Services Payment Cryptography User Guide. The mutable data contained within a key includes usage timestamp and key deletion timestamp and can be modified after creation. You can use the CreateKey operation to generate an ECC (Elliptic Curve Cryptography) key pair used for establishing an ECDH (Elliptic Curve Diffie-Hellman) key agreement between two parties. In the ECDH key agreement process, both parties generate their own ECC key pair with key usage K3 and exchange the public keys. Each party then use their private key, the received public key from the other party, and the key derivation parameters including key derivation function, hash algorithm, derivation data, and key algorithm to derive a shared key. To maintain the single-use principle of cryptographic keys in payments, ECDH derived keys should not be used for multiple purposes, such as a TR31_P0_PIN_ENCRYPTION_KEY and TR31_K1_KEY_BLOCK_PROTECTION_KEY. When creating ECC key pairs in Amazon Web Services Payment Cryptography you can optionally set the DeriveKeyUsage parameter, which defines the key usage bound to the symmetric key that will be derived using the ECC key pair. Cross-account use: This operation can't be used across different Amazon Web Services accounts.",
  "parameters": [
    {
      "name": "KeyAttributes",
      "type": "dict",
      "required": true,
      "description": "The role of the key, the algorithm it supports, and the cryptographic operations allowed with the key. This data is immutable after the key is created. The cryptographic usage of an Amazon Web Services Payment Cryptography key as deï¬\u0081ned in section A.5.2 of the TR-31 spec. The type of Amazon Web Services Payment Cryptography key to create, which determines the classiï¬\u0081cation of the cryptographic method and whether Amazon Web Services Payment Cryptography key contains a symmetric key or an asymmetric key pair. The key algorithm to be use during creation of an Amazon Web Services Payment Cryptography key. For symmetric keys, Amazon Web Services Payment Cryptography supports AES and TDES algorithms. For asymmetric keys, Amazon Web Services Payment Cryptography supports RSA and ECC_NIST algorithms. The list of cryptographic operations that you can perform using the key. Encrypt (boolean) --- Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to encrypt data. Decrypt (boolean) --- Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to decrypt data. Wrap (boolean) --- Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to wrap other keys. Unwrap (boolean) --- Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to unwrap other keys. Generate (boolean) --- Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to generate and verify other card and PIN verification keys. Sign (boolean) --- Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used for signing. Verify (boolean) --- Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to verify signatures. DeriveKey (boolean) --- Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to derive new keys. NoRestrictions (boolean) --- Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key has no special restrictions other than the restrictions implied by KeyUsage.",
      "nested_params": [
        {
          "name": "KeyUsage",
          "type": "string",
          "required": false,
          "description": "The cryptographic usage of an Amazon Web Services Payment Cryptography key as deï¬\u0081ned in section A.5.2 of the TR-31 spec.",
          "nested_params": []
        },
        {
          "name": "KeyClass",
          "type": "string",
          "required": false,
          "description": "The type of Amazon Web Services Payment Cryptography key to create, which determines the classiï¬\u0081cation of the cryptographic method and whether Amazon Web Services Payment Cryptography key contains a symmetric key or an asymmetric key pair.",
          "nested_params": []
        },
        {
          "name": "KeyAlgorithm",
          "type": "string",
          "required": false,
          "description": "The key algorithm to be use during creation of an Amazon Web Services Payment Cryptography key. For symmetric keys, Amazon Web Services Payment Cryptography supports AES and TDES algorithms. For asymmetric keys, Amazon Web Services Payment Cryptography supports RSA and ECC_NIST algorithms.",
          "nested_params": []
        },
        {
          "name": "KeyModesOfUse",
          "type": "dict",
          "required": false,
          "description": "The list of cryptographic operations that you can perform using the key.",
          "nested_params": [
            {
              "name": "Encrypt",
              "type": "boolean",
              "required": false,
              "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to encrypt data.",
              "nested_params": []
            },
            {
              "name": "Decrypt",
              "type": "boolean",
              "required": false,
              "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to decrypt data.",
              "nested_params": []
            },
            {
              "name": "Wrap",
              "type": "boolean",
              "required": false,
              "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to wrap other keys.",
              "nested_params": []
            },
            {
              "name": "Unwrap",
              "type": "boolean",
              "required": false,
              "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to unwrap other keys.",
              "nested_params": []
            },
            {
              "name": "Generate",
              "type": "boolean",
              "required": false,
              "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to generate and verify other card and PIN verification keys.",
              "nested_params": []
            },
            {
              "name": "Sign",
              "type": "boolean",
              "required": false,
              "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used for signing.",
              "nested_params": []
            },
            {
              "name": "Verify",
              "type": "boolean",
              "required": false,
              "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to verify signatures.",
              "nested_params": []
            },
            {
              "name": "DeriveKey",
              "type": "boolean",
              "required": false,
              "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to derive new keys.",
              "nested_params": []
            },
            {
              "name": "NoRestrictions",
              "type": "boolean",
              "required": false,
              "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key has no special restrictions other than the restrictions implied by KeyUsage.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "KeyCheckValueAlgorithm",
      "type": "string",
      "required": false,
      "description": "The algorithm that Amazon Web Services Payment Cryptography uses to calculate the key check value (KCV). It is used to validate the key integrity. For TDES keys, the KCV is computed by encrypting 8 bytes, each with value of zero, with the key to be checked and retaining the 3 highest order bytes of the encrypted result. For AES keys, the KCV is computed using a CMAC algorithm where the input data is 16 bytes of zero and retaining the 3 highest order bytes of the encrypted result.",
      "nested_params": []
    },
    {
      "name": "Exportable",
      "type": "boolean",
      "required": true,
      "description": "Specifies whether the key is exportable from the service.",
      "nested_params": []
    },
    {
      "name": "Enabled",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "Assigns one or more tags to the Amazon Web Services Payment Cryptography key. Use this parameter to tag a key when it is created. To tag an existing Amazon Web Services Payment Cryptography key, use the TagResource operation. Each tag consists of a tag key and a tag value. Both the tag key and the tag value are required, but the tag value can be an empty (null) string. You can't have more than one tag on an Amazon Web Services Payment Cryptography key with the same tag key. (dict) --- A structure that contains information about a tag. The key of the tag. The value of the tag.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key of the tag.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value of the tag.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "DeriveKeyUsage",
      "type": "string",
      "required": false,
      "description": "The intended cryptographic usage of keys derived from the ECC key pair to be created. After creating an ECC key pair, you cannot change the intended cryptographic usage of keys derived from it using ECDH.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "KeyArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the key.",
              "nested_items": []
            },
            {
              "name": "KeyAttributes",
              "type": "dict",
              "description": "The role of the key, the algorithm it supports, and the cryptographic operations allowed with the key. This data is immutable after the key is created.",
              "nested_items": [
                {
                  "name": "KeyUsage",
                  "type": "string",
                  "description": "The cryptographic usage of an Amazon Web Services Payment Cryptography key as deï¬\u0081ned in section A.5.2 of the TR-31 spec.",
                  "nested_items": []
                },
                {
                  "name": "KeyClass",
                  "type": "string",
                  "description": "The type of Amazon Web Services Payment Cryptography key to create, which determines the classiï¬\u0081cation of the cryptographic method and whether Amazon Web Services Payment Cryptography key contains a symmetric key or an asymmetric key pair.",
                  "nested_items": []
                },
                {
                  "name": "KeyAlgorithm",
                  "type": "string",
                  "description": "The key algorithm to be use during creation of an Amazon Web Services Payment Cryptography key.",
                  "nested_items": []
                },
                {
                  "name": "KeyModesOfUse",
                  "type": "dict",
                  "description": "The list of cryptographic operations that you can perform using the key.",
                  "nested_items": [
                    {
                      "name": "Encrypt",
                      "type": "boolean",
                      "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to encrypt data.",
                      "nested_items": []
                    },
                    {
                      "name": "Decrypt",
                      "type": "boolean",
                      "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to decrypt data.",
                      "nested_items": []
                    },
                    {
                      "name": "Wrap",
                      "type": "boolean",
                      "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to wrap other keys.",
                      "nested_items": []
                    },
                    {
                      "name": "Unwrap",
                      "type": "boolean",
                      "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to unwrap other keys.",
                      "nested_items": []
                    },
                    {
                      "name": "Generate",
                      "type": "boolean",
                      "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to generate and verify other card and PIN verification keys.",
                      "nested_items": []
                    },
                    {
                      "name": "Sign",
                      "type": "boolean",
                      "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used for signing.",
                      "nested_items": []
                    },
                    {
                      "name": "Verify",
                      "type": "boolean",
                      "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to verify signatures.",
                      "nested_items": []
                    },
                    {
                      "name": "DeriveKey",
                      "type": "boolean",
                      "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to derive new keys.",
                      "nested_items": []
                    },
                    {
                      "name": "NoRestrictions",
                      "type": "boolean",
                      "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key has no special restrictions other than the restrictions implied by KeyUsage.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "KeyCheckValue",
              "type": "string",
              "description": "The key check value (KCV) is used to check if all parties holding a given key have the same key or to detect that a key has changed.",
              "nested_items": []
            },
            {
              "name": "KeyCheckValueAlgorithm",
              "type": "string",
              "description": "The algorithm that Amazon Web Services Payment Cryptography uses to calculate the key check value (KCV). It is used to validate the key integrity.",
              "nested_items": []
            },
            {
              "name": "Enabled",
              "type": "boolean",
              "description": "Specifies whether the key is enabled.",
              "nested_items": []
            },
            {
              "name": "Exportable",
              "type": "boolean",
              "description": "Specifies whether the key is exportable. This data is immutable after the key is created.",
              "nested_items": []
            },
            {
              "name": "KeyState",
              "type": "string",
              "description": "The state of key that is being created or deleted.",
              "nested_items": []
            },
            {
              "name": "KeyOrigin",
              "type": "string",
              "description": "The source of the key material. For keys created within Amazon Web Services Payment Cryptography, the value is AWS_PAYMENT_CRYPTOGRAPHY. For keys imported into Amazon Web Services Payment Cryptography, the value is EXTERNAL.",
              "nested_items": []
            },
            {
              "name": "CreateTimestamp",
              "type": "datetime",
              "description": "The date and time when the key was created.",
              "nested_items": []
            },
            {
              "name": "UsageStartTimestamp",
              "type": "datetime",
              "description": "The date and time after which Amazon Web Services Payment Cryptography will start using the key material for cryptographic operations.",
              "nested_items": []
            },
            {
              "name": "UsageStopTimestamp",
              "type": "datetime",
              "description": "The date and time after which Amazon Web Services Payment Cryptography will stop using the key material for cryptographic operations.",
              "nested_items": []
            },
            {
              "name": "DeletePendingTimestamp",
              "type": "datetime",
              "description": "The date and time after which Amazon Web Services Payment Cryptography will delete the key. This value is present only when KeyState is DELETE_PENDING and the key is scheduled for deletion.",
              "nested_items": []
            },
            {
              "name": "DeleteTimestamp",
              "type": "datetime",
              "description": "The date and time after which Amazon Web Services Payment Cryptography will delete the key. This value is present only when when the KeyState is DELETE_COMPLETE and the Amazon Web Services Payment Cryptography key is deleted.",
              "nested_items": []
            },
            {
              "name": "DeriveKeyUsage",
              "type": "string",
              "description": "The cryptographic usage of an ECDH derived key as deï¬\u0081ned in section A.5.2 of the TR-31 spec.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}