{
  "method_name": "get_parameters_for_export",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/payment-cryptography/client/get_parameters_for_export.html",
  "description": "Gets the export token and the signing key certificate to initiate a TR-34 key export from Amazon Web Services Payment Cryptography. The signing key certificate signs the wrapped key under export within the TR-34 key payload. The export token and signing key certificate must be in place and operational before calling ExportKey. The export token expires in 30 days. You can use the same export token to export multiple keys from your service account. Cross-account use: This operation can't be used across different Amazon Web Services accounts.",
  "parameters": [
    {
      "name": "KeyMaterialType",
      "type": "string",
      "required": true,
      "description": "The key block format type (for example, TR-34 or TR-31) to use during key material export. Export token is only required for a TR-34 key export, TR34_KEY_BLOCK. Export token is not required for TR-31 key export.",
      "nested_params": []
    },
    {
      "name": "SigningKeyAlgorithm",
      "type": "string",
      "required": true,
      "description": "The signing key algorithm to generate a signing key certificate. This certificate signs the wrapped key under export within the TR-34 key block. RSA_2048 is the only signing key algorithm allowed.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "SigningKeyCertificate",
          "type": "string",
          "description": "The signing key certificate in PEM format (base64 encoded) of the public key for signature within the TR-34 key block. The certificate expires after 30 days.",
          "nested_items": []
        },
        {
          "name": "SigningKeyCertificateChain",
          "type": "string",
          "description": "The root certificate authority (CA) that signed the signing key certificate in PEM format (base64 encoded).",
          "nested_items": []
        },
        {
          "name": "SigningKeyAlgorithm",
          "type": "string",
          "description": "The algorithm of the signing key certificate for use in TR-34 key block generation. RSA_2048 is the only signing key algorithm allowed.",
          "nested_items": []
        },
        {
          "name": "ExportToken",
          "type": "string",
          "description": "The export token to initiate key export from Amazon Web Services Payment Cryptography. The export token expires after 30 days. You can use the same export token to export multiple keys from the same service account.",
          "nested_items": []
        },
        {
          "name": "ParametersValidUntilTimestamp",
          "type": "datetime",
          "description": "The validity period of the export token.",
          "nested_items": []
        }
      ]
    }
  ]
}