{
  "method_name": "get_key",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/payment-cryptography/client/get_key.html",
  "description": "Gets the key material for an Amazon Web Services Payment Cryptography key, including the immutable and mutable data specified when the key was created. Cross-account use: This operation can't be used across different Amazon Web Services accounts.",
  "parameters": [
    {
      "name": "KeyIdentifier",
      "type": "string",
      "required": true,
      "description": "The KeyARN of the Amazon Web Services Payment Cryptography key.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "KeyArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the key.",
              "nested_items": []
            },
            {
              "name": "KeyAttributes",
              "type": "dict",
              "description": "The role of the key, the algorithm it supports, and the cryptographic operations allowed with the key. This data is immutable after the key is created.",
              "nested_items": [
                {
                  "name": "KeyUsage",
                  "type": "string",
                  "description": "The cryptographic usage of an Amazon Web Services Payment Cryptography key as deï¬\u0081ned in section A.5.2 of the TR-31 spec.",
                  "nested_items": []
                },
                {
                  "name": "KeyClass",
                  "type": "string",
                  "description": "The type of Amazon Web Services Payment Cryptography key to create, which determines the classiï¬\u0081cation of the cryptographic method and whether Amazon Web Services Payment Cryptography key contains a symmetric key or an asymmetric key pair.",
                  "nested_items": []
                },
                {
                  "name": "KeyAlgorithm",
                  "type": "string",
                  "description": "The key algorithm to be use during creation of an Amazon Web Services Payment Cryptography key.",
                  "nested_items": []
                },
                {
                  "name": "KeyModesOfUse",
                  "type": "dict",
                  "description": "The list of cryptographic operations that you can perform using the key.",
                  "nested_items": [
                    {
                      "name": "Encrypt",
                      "type": "boolean",
                      "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to encrypt data.",
                      "nested_items": []
                    },
                    {
                      "name": "Decrypt",
                      "type": "boolean",
                      "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to decrypt data.",
                      "nested_items": []
                    },
                    {
                      "name": "Wrap",
                      "type": "boolean",
                      "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to wrap other keys.",
                      "nested_items": []
                    },
                    {
                      "name": "Unwrap",
                      "type": "boolean",
                      "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to unwrap other keys.",
                      "nested_items": []
                    },
                    {
                      "name": "Generate",
                      "type": "boolean",
                      "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to generate and verify other card and PIN verification keys.",
                      "nested_items": []
                    },
                    {
                      "name": "Sign",
                      "type": "boolean",
                      "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used for signing.",
                      "nested_items": []
                    },
                    {
                      "name": "Verify",
                      "type": "boolean",
                      "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to verify signatures.",
                      "nested_items": []
                    },
                    {
                      "name": "DeriveKey",
                      "type": "boolean",
                      "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key can be used to derive new keys.",
                      "nested_items": []
                    },
                    {
                      "name": "NoRestrictions",
                      "type": "boolean",
                      "description": "Speciï¬\u0081es whether an Amazon Web Services Payment Cryptography key has no special restrictions other than the restrictions implied by KeyUsage.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "KeyCheckValue",
              "type": "string",
              "description": "The key check value (KCV) is used to check if all parties holding a given key have the same key or to detect that a key has changed.",
              "nested_items": []
            },
            {
              "name": "KeyCheckValueAlgorithm",
              "type": "string",
              "description": "The algorithm that Amazon Web Services Payment Cryptography uses to calculate the key check value (KCV). It is used to validate the key integrity.",
              "nested_items": []
            },
            {
              "name": "Enabled",
              "type": "boolean",
              "description": "Specifies whether the key is enabled.",
              "nested_items": []
            },
            {
              "name": "Exportable",
              "type": "boolean",
              "description": "Specifies whether the key is exportable. This data is immutable after the key is created.",
              "nested_items": []
            },
            {
              "name": "KeyState",
              "type": "string",
              "description": "The state of key that is being created or deleted.",
              "nested_items": []
            },
            {
              "name": "KeyOrigin",
              "type": "string",
              "description": "The source of the key material. For keys created within Amazon Web Services Payment Cryptography, the value is AWS_PAYMENT_CRYPTOGRAPHY. For keys imported into Amazon Web Services Payment Cryptography, the value is EXTERNAL.",
              "nested_items": []
            },
            {
              "name": "CreateTimestamp",
              "type": "datetime",
              "description": "The date and time when the key was created.",
              "nested_items": []
            },
            {
              "name": "UsageStartTimestamp",
              "type": "datetime",
              "description": "The date and time after which Amazon Web Services Payment Cryptography will start using the key material for cryptographic operations.",
              "nested_items": []
            },
            {
              "name": "UsageStopTimestamp",
              "type": "datetime",
              "description": "The date and time after which Amazon Web Services Payment Cryptography will stop using the key material for cryptographic operations.",
              "nested_items": []
            },
            {
              "name": "DeletePendingTimestamp",
              "type": "datetime",
              "description": "The date and time after which Amazon Web Services Payment Cryptography will delete the key. This value is present only when KeyState is DELETE_PENDING and the key is scheduled for deletion.",
              "nested_items": []
            },
            {
              "name": "DeleteTimestamp",
              "type": "datetime",
              "description": "The date and time after which Amazon Web Services Payment Cryptography will delete the key. This value is present only when when the KeyState is DELETE_COMPLETE and the Amazon Web Services Payment Cryptography key is deleted.",
              "nested_items": []
            },
            {
              "name": "DeriveKeyUsage",
              "type": "string",
              "description": "The cryptographic usage of an ECDH derived key as deï¬\u0081ned in section A.5.2 of the TR-31 spec.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}