{
  "method_name": "get_parameters_for_import",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/payment-cryptography/client/get_parameters_for_import.html",
  "description": "Gets the import token and the wrapping key certificate in PEM format (base64 encoded) to initiate a TR-34 WrappedKeyBlock or a RSA WrappedKeyCryptogram import into Amazon Web Services Payment Cryptography. The wrapping key certificate wraps the key under import. The import token and wrapping key certificate must be in place and operational before calling ImportKey. The import token expires in 30 days. You can use the same import token to import multiple keys into your service account. Cross-account use: This operation can't be used across different Amazon Web Services accounts.",
  "parameters": [
    {
      "name": "KeyMaterialType",
      "type": "string",
      "required": true,
      "description": "The method to use for key material import. Import token is only required for TR-34 WrappedKeyBlock ( TR34_KEY_BLOCK) and RSA WrappedKeyCryptogram ( KEY_CRYPTOGRAM). Import token is not required for TR-31, root public key cerificate or trusted public key certificate.",
      "nested_params": []
    },
    {
      "name": "WrappingKeyAlgorithm",
      "type": "string",
      "required": true,
      "description": "The wrapping key algorithm to generate a wrapping key certificate. This certificate wraps the key under import. At this time, RSA_2048 is the allowed algorithm for TR-34 WrappedKeyBlock import. Additionally, RSA_2048, RSA_3072, RSA_4096 are the allowed algorithms for RSA WrappedKeyCryptogram import.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "WrappingKeyCertificate",
          "type": "string",
          "description": "The wrapping key certificate in PEM format (base64 encoded) of the wrapping key for use within the TR-34 key block. The certificate expires in 30 days.",
          "nested_items": []
        },
        {
          "name": "WrappingKeyCertificateChain",
          "type": "string",
          "description": "The Amazon Web Services Payment Cryptography root certificate authority (CA) that signed the wrapping key certificate in PEM format (base64 encoded).",
          "nested_items": []
        },
        {
          "name": "WrappingKeyAlgorithm",
          "type": "string",
          "description": "The algorithm of the wrapping key for use within TR-34 WrappedKeyBlock or RSA WrappedKeyCryptogram.",
          "nested_items": []
        },
        {
          "name": "ImportToken",
          "type": "string",
          "description": "The import token to initiate key import into Amazon Web Services Payment Cryptography. The import token expires after 30 days. You can use the same import token to import multiple keys to the same service account.",
          "nested_items": []
        },
        {
          "name": "ParametersValidUntilTimestamp",
          "type": "datetime",
          "description": "The validity period of the import token.",
          "nested_items": []
        }
      ]
    }
  ]
}