{
  "method_name": "tag_resource",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/payment-cryptography/client/tag_resource.html",
  "description": "Adds or edits tags on an Amazon Web Services Payment Cryptography key. Each tag consists of a tag key and a tag value, both of which are case-sensitive strings. The tag value can be an empty (null) string. To add a tag, specify a new tag key and a tag value. To edit a tag, specify an existing tag key and a new tag value. You can also add tags to an Amazon Web Services Payment Cryptography key when you create it with CreateKey. Cross-account use: This operation can't be used across different Amazon Web Services accounts.",
  "parameters": [
    {
      "name": "ResourceArn",
      "type": "string",
      "required": true,
      "description": "The KeyARN of the key whose tags are being updated.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "One or more tags. Each tag consists of a tag key and a tag value. The tag value can be an empty (null) string. You can't have more than one tag on an Amazon Web Services Payment Cryptography key with the same tag key. If you specify an existing tag key with a different tag value, Amazon Web Services Payment Cryptography replaces the current tag value with the new one. To use this parameter, you must have TagResource permission in an IAM policy. (dict) --- A structure that contains information about a tag. The key of the tag. The value of the tag.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key of the tag.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value of the tag.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}