{
  "method_name": "create_view",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/resource-explorer-2/client/create_view.html",
  "description": "Creates a view that users can query by using the  Search operation. Results from queries that you make using this view include only resources that match the view's Filters. For more information about Amazon Web Services Resource Explorer views, see Managing views in the Amazon Web Services Resource Explorer User Guide. Only the principals with an IAM identity-based policy that grants Allow to the Search action on a Resource with the Amazon resource name (ARN) of this view can  Search using views you create with this operation.",
  "parameters": [
    {
      "name": "ClientToken",
      "type": "string",
      "required": false,
      "description": "This value helps ensure idempotency. Resource Explorer uses this value to prevent the accidental creation of duplicate versions. We recommend that you generate a UUID-type value to ensure the uniqueness of your views. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "dict",
      "required": true,
      "description": "An array of strings that specify which resources are included in the results of queries made using this view. When you use this view in a  Search operation, the filter string is combined with the search's QueryString parameter using a logical AND operator. For information about the supported syntax, see Search query reference for Resource Explorer in the Amazon Web Services Resource Explorer User Guide. The string that contains the search keywords, prefixes, and operators to control the results that can be returned by a  Search operation. For more details, see Search query syntax.",
      "nested_params": [
        {
          "name": "FilterString",
          "type": "string",
          "required": false,
          "description": "The string that contains the search keywords, prefixes, and operators to control the results that can be returned by a  Search operation. For more details, see Search query syntax.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "IncludedProperties",
      "type": "list",
      "required": true,
      "description": "Specifies optional fields that you want included in search results from this view. It is a list of objects that each describe a field to include. The default is an empty list, with no optional fields included in the results. (dict) --- Information about an additional property that describes a resource, that you can optionally include in the view. This lets you view that property in search results, and filter your search results based on the value of the property. The name of the property that is included in this view. You can specify the following property names for this field: tags.",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name of the property that is included in this view. You can specify the following property names for this field:",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Scope",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "dict",
      "required": false,
      "description": "Tag key and value pairs that are attached to the view. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "ViewName",
      "type": "string",
      "required": true,
      "description": "The name of the new view. This name appears in the list of views in Resource Explorer. The name must be no more than 64 characters long, and can include letters, digits, and the dash (-) character. The name must be unique within its Amazon Web Services Region.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "FilterString",
                  "type": "string",
                  "description": "The string that contains the search keywords, prefixes, and operators to control the results that can be returned by a  Search operation. For more details, see Search query syntax.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "IncludedProperties",
              "type": "list",
              "description": "A structure that contains additional information about the view.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Name",
                      "type": "string",
                      "description": "The name of the property that is included in this view.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "tags.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "LastUpdatedAt",
              "type": "datetime",
              "description": "The date and time when this view was last modified.",
              "nested_items": []
            },
            {
              "name": "Owner",
              "type": "string",
              "description": "The Amazon Web Services account that owns this view.",
              "nested_items": []
            },
            {
              "name": "Scope",
              "type": "string",
              "description": "An Amazon resource name (ARN) of an Amazon Web Services account, an organization, or an organizational unit (OU) that specifies whether this view includes resources from only the specified Amazon Web Services account, all accounts in the specified organization, or all accounts in the specified OU.",
              "nested_items": []
            },
            {
              "name": "ViewArn",
              "type": "string",
              "description": "The Amazon resource name (ARN) of the view.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}