{
  "method_name": "list_resources",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/resource-explorer-2/client/list_resources.html",
  "description": "Returns a list of resources and their details that match the specified criteria. This query must use a view. If you don't explicitly specify a view, then Resource Explorer uses the default view for the Amazon Web Services Region in which you call this operation.",
  "parameters": [
    {
      "name": "Filters",
      "type": "dict",
      "required": true,
      "description": "An array of strings that specify which resources are included in the results of queries made using this view. When you use this view in a  Search operation, the filter string is combined with the search's QueryString parameter using a logical AND operator. For information about the supported syntax, see Search query reference for Resource Explorer in the Amazon Web Services Resource Explorer User Guide. The string that contains the search keywords, prefixes, and operators to control the results that can be returned by a  Search operation. For more details, see Search query syntax.",
      "nested_params": [
        {
          "name": "FilterString",
          "type": "string",
          "required": false,
          "description": "The string that contains the search keywords, prefixes, and operators to control the results that can be returned by a  Search operation. For more details, see Search query syntax.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "The maximum number of results that you want included on each page of the response. If you do not include this parameter, it defaults to a value appropriate to the operation. If additional items exist beyond those included in the current response, the NextToken response element is present and has a value (is not null). Include that value as the NextToken request parameter in the next call to the operation to get the next part of the results.",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "The parameter for receiving additional results if you receive a NextToken response in a previous request. A NextToken response indicates that more output is available. Set this parameter to the value of the previous call's NextToken response to indicate where the output should continue from. The pagination tokens expire after 24 hours.",
      "nested_params": []
    },
    {
      "name": "ViewArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "NextToken",
          "type": "string",
          "description": "If present, indicates that more output is available than is included in the current response. Use this value in the NextToken request parameter in a subsequent call to the operation to get the next part of the output. You should repeat this until the NextToken response element comes back as null. The pagination tokens expire after 24 hours.",
          "nested_items": []
        },
        {
          "name": "Resources",
          "type": "list",
          "description": "The list of structures that describe the resources that match the query.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Arn",
                  "type": "string",
                  "description": "The Amazon resource name (ARN) of the resource.",
                  "nested_items": []
                },
                {
                  "name": "LastReportedAt",
                  "type": "datetime",
                  "description": "The date and time that Resource Explorer last queried this resource and updated the index with the latest information about the resource.",
                  "nested_items": []
                },
                {
                  "name": "OwningAccountId",
                  "type": "string",
                  "description": "The Amazon Web Services account that owns the resource.",
                  "nested_items": []
                },
                {
                  "name": "Properties",
                  "type": "list",
                  "description": "A structure with additional type-specific details about the resource. These properties can be added by turning on integration between Resource Explorer and other Amazon Web Services services.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Data",
                          "type": "document",
                          "description": "Details about this property. The content of this field is a JSON object that varies based on the resource type.",
                          "nested_items": []
                        },
                        {
                          "name": "LastReportedAt",
                          "type": "datetime",
                          "description": "The date and time that the information about this resource property was last updated.",
                          "nested_items": []
                        },
                        {
                          "name": "Name",
                          "type": "string",
                          "description": "The name of this property of the resource.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "Region",
                  "type": "string",
                  "description": "The Amazon Web Services Region in which the resource was created and exists.",
                  "nested_items": []
                },
                {
                  "name": "ResourceType",
                  "type": "string",
                  "description": "The type of the resource.",
                  "nested_items": []
                },
                {
                  "name": "Service",
                  "type": "string",
                  "description": "The Amazon Web Services service that owns the resource and is responsible for creating and updating it.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "ViewArn",
          "type": "string",
          "description": "The Amazon resource name (ARN) of the view that this operation used to perform the search.",
          "nested_items": []
        }
      ]
    }
  ]
}