{
  "method_name": "describe_traffic_mirror_sessions",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/describe_traffic_mirror_sessions.html",
  "description": "Describes one or more Traffic Mirror sessions. By default, all Traffic Mirror sessions are described. Alternatively, you can filter the results.",
  "parameters": [
    {
      "name": "TrafficMirrorSessionIds",
      "type": "list",
      "required": false,
      "description": "The ID of the Traffic Mirror session. (string) ---",
      "nested_params": []
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": false,
      "description": "One or more filters. The possible values are: description: The Traffic Mirror session description. network-interface-id: The ID of the Traffic Mirror session network interface. owner-id: The ID of the account that owns the Traffic Mirror session. packet-length: The assigned number of packets to mirror. session-number: The assigned session number. traffic-mirror-filter-id: The ID of the Traffic Mirror filter. traffic-mirror-session-id: The ID of the Traffic Mirror session. traffic-mirror-target-id: The ID of the Traffic Mirror target. virtual-network-id: The virtual network ID of the Traffic Mirror session. (dict) --- A filter name and value pair that is used to return a more specific list of results from a describe operation. Filters can be used to match a set of resources by specific criteria, such as tags, attributes, or IDs. If you specify multiple filters, the filters are joined with an AND, and the request returns only results that match all of the specified filters. For more information, see List and filter using the CLI and API in the Amazon EC2 User Guide. Name (string) --- The name of the filter. Filter names are case-sensitive. Values (list) --- The filter values. Filter values are case-sensitive. If you specify multiple values for a filter, the values are joined with an OR, and the request returns all results that match any of the specified values. (string) ---",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "TrafficMirrorSessions",
          "type": "list",
          "description": "Describes one or more Traffic Mirror sessions. By default, all Traffic Mirror sessions are described. Alternatively, you can filter the results.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "TrafficMirrorSessionId",
                  "type": "string",
                  "description": "The ID for the Traffic Mirror session.",
                  "nested_items": []
                },
                {
                  "name": "TrafficMirrorTargetId",
                  "type": "string",
                  "description": "The ID of the Traffic Mirror target.",
                  "nested_items": []
                },
                {
                  "name": "TrafficMirrorFilterId",
                  "type": "string",
                  "description": "The ID of the Traffic Mirror filter.",
                  "nested_items": []
                },
                {
                  "name": "NetworkInterfaceId",
                  "type": "string",
                  "description": "The ID of the Traffic Mirror session's network interface.",
                  "nested_items": []
                },
                {
                  "name": "OwnerId",
                  "type": "string",
                  "description": "The ID of the account that owns the Traffic Mirror session.",
                  "nested_items": []
                },
                {
                  "name": "PacketLength",
                  "type": "integer",
                  "description": "The number of bytes in each packet to mirror. These are the bytes after the VXLAN header. To mirror a subset, set this to the length (in bytes) to mirror. For example, if you set this value to 100, then the first 100 bytes that meet the filter criteria are copied to the target. Do not specify this parameter when you want to mirror the entire packet.",
                  "nested_items": []
                },
                {
                  "name": "SessionNumber",
                  "type": "integer",
                  "description": "The session number determines the order in which sessions are evaluated when an interface is used by multiple sessions. The first session with a matching filter is the one that mirrors the packets.",
                  "nested_items": []
                },
                {
                  "name": "VirtualNetworkId",
                  "type": "integer",
                  "description": "The virtual network ID associated with the Traffic Mirror session.",
                  "nested_items": []
                },
                {
                  "name": "Description",
                  "type": "string",
                  "description": "The description of the Traffic Mirror session.",
                  "nested_items": []
                },
                {
                  "name": "Tags",
                  "type": "list",
                  "description": "The tags assigned to the Traffic Mirror session.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Key",
                          "type": "string",
                          "description": "The key of the tag.",
                          "nested_items": []
                        },
                        {
                          "name": "Value",
                          "type": "string",
                          "description": "The value of the tag.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The token to use to retrieve the next page of results. The value is null when there are no more results to return.",
          "nested_items": []
        }
      ]
    }
  ]
}