{
  "method_name": "get_password_data",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/get_password_data.html",
  "description": "Retrieves the encrypted administrator password for a running Windows instance. The Windows password is generated at boot by the EC2Config service or EC2Launch scripts (Windows Server 2016 and later). This usually only happens the first time an instance is launched. For more information, see EC2Config and EC2Launch in the Amazon EC2 User Guide. For the EC2Config service, the password is not generated for rebundled AMIs unless Ec2SetPassword is enabled before bundling. The password is encrypted using the key pair that you specified when you launched the instance. You must provide the corresponding key pair file. When you launch an instance, password generation and encryption may take a few minutes. If you try to retrieve the password before it's available, the output returns an empty string. We recommend that you wait up to 15 minutes after launching an instance before trying to retrieve the generated password.",
  "parameters": [
    {
      "name": "InstanceId",
      "type": "string",
      "required": true,
      "description": "The ID of the Windows instance.",
      "nested_params": []
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "InstanceId",
          "type": "string",
          "description": "The ID of the Windows instance.",
          "nested_items": []
        },
        {
          "name": "Timestamp",
          "type": "datetime",
          "description": "The time the data was last updated.",
          "nested_items": []
        },
        {
          "name": "PasswordData",
          "type": "string",
          "description": "The password of the instance. Returns an empty string if the password is not available.",
          "nested_items": []
        }
      ]
    }
  ]
}