{
  "method_name": "create_multicast_group",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iotwireless/client/create_multicast_group.html",
  "description": "Creates a multicast group.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ClientRequestToken",
      "type": "string",
      "required": false,
      "description": "Each resource must have a unique client request token. The client token is used to implement idempotency. It ensures that the request completes no more than one time. If you retry a request with the same token and the same parameters, the request will complete successfully. However, if you try to create a new resource using the same token but different parameters, an HTTP 409 conflict occurs. If you omit this value, AWS SDKs will automatically generate a unique client request. For more information about idempotency, see Ensuring idempotency in Amazon EC2 API requests. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "LoRaWAN",
      "type": "dict",
      "required": true,
      "description": "The LoRaWAN information that is to be used with the multicast group. RfRegion (string) --- Supported RfRegions DlClass (string) --- DlClass for LoRaWAM, valid values are ClassB and ClassC. ParticipatingGateways (dict) --- Specify the list of gateways to which you want to send the multicast downlink messages. The multicast message will be sent to each gateway in the list, with the transmission interval as the time interval between each message. GatewayList (list) --- The list of gateways that you want to use for sending the multicast downlink message. Each downlink message will be sent to all the gateways in the list in the order that you provided. If the gateway list is empty, then AWS IoT Core for LoRaWAN chooses the gateways that were most recently used by the devices to send an uplink message. (string) --- TransmissionInterval (integer) --- The duration of time in milliseconds for which AWS IoT Core for LoRaWAN will wait before transmitting the multicast payload to the next gateway in the list.",
      "nested_params": [
        {
          "name": "RfRegion",
          "type": "string",
          "required": false,
          "description": "Supported RfRegions.",
          "nested_params": []
        },
        {
          "name": "DlClass",
          "type": "string",
          "required": false,
          "description": "DlClass for LoRaWAM, valid values are ClassB and ClassC.",
          "nested_params": []
        },
        {
          "name": "ParticipatingGateways",
          "type": "dict",
          "required": false,
          "description": "Specify the list of gateways to which you want to send the multicast downlink messages. The multicast message will be sent to each gateway in the list, with the transmission interval as the time interval between each message.",
          "nested_params": [
            {
              "name": "GatewayList",
              "type": "list",
              "required": false,
              "description": "The list of gateways that you want to use for sending the multicast downlink message. Each downlink message will be sent to all the gateways in the list in the order that you provided. If the gateway list is empty, then AWS IoT Core for LoRaWAN chooses the gateways that were most recently used by the devices to send an uplink message.",
              "nested_params": []
            },
            {
              "name": "TransmissionInterval",
              "type": "integer",
              "required": false,
              "description": "The duration of time in milliseconds for which AWS IoT Core for LoRaWAN will wait before transmitting the multicast payload to the next gateway in the list.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "The tag to attach to the specified resource. Tags are metadata that you can use to manage a resource. (dict) --- A simple label consisting of a customer-defined key-value pair The tag's key value. The tag's value.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The tag's key value.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The tag's value.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Arn",
          "type": "string",
          "description": "The arn of the multicast group.",
          "nested_items": []
        },
        {
          "name": "Id",
          "type": "string",
          "description": "The ID of the multicast group.",
          "nested_items": []
        }
      ]
    }
  ]
}