{
  "method_name": "create_multi_region_endpoint",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sesv2/client/create_multi_region_endpoint.html",
  "description": "Creates a multi-region endpoint (global-endpoint). The primary region is going to be the AWS-Region where the operation is executed. The secondary region has to be provided in request's parameters. From the data flow standpoint there is no difference between primary and secondary regions - sending traffic will be split equally between the two. The primary region is the region where the resource has been created and where it can be managed.",
  "parameters": [
    {
      "name": "EndpointName",
      "type": "string",
      "required": true,
      "description": "The name of the multi-region endpoint (global-endpoint).",
      "nested_params": []
    },
    {
      "name": "Details",
      "type": "dict",
      "required": true,
      "description": "Contains details of a multi-region endpoint (global-endpoint) being created. A list of route configuration details. Must contain exactly one route configuration. (dict) --- An object that contains route configuration. Includes secondary region name. The name of an AWS-Region to be a secondary region for the multi-region endpoint (global-endpoint).",
      "nested_params": [
        {
          "name": "RoutesDetails",
          "type": "list",
          "required": false,
          "description": "A list of route configuration details. Must contain exactly one route configuration.",
          "nested_params": [
            {
              "name": "Region",
              "type": "string",
              "required": false,
              "description": "The name of an AWS-Region to be a secondary region for the multi-region endpoint (global-endpoint).",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "An array of objects that define the tags (keys and values) to associate with the multi-region endpoint (global-endpoint). (dict) --- An object that defines the tags that are associated with a resource. AÂ tagÂ is a label that you optionally define and associate with a resource. Tags can help you categorize and manage resources in different ways, such as by purpose, owner, environment, or other criteria. A resource can have as many as 50 tags. Each tag consists of a requiredÂ tag keyÂ and an associatedÂ tag value, both of which you define. A tag key is a general label that acts as a category for a more specific tag value. A tag value acts as a descriptor within a tag key. A tag key can contain as many as 128 characters. A tag value can contain as many as 256 characters. The characters can be Unicode letters, digits, white space, or one of the following symbols: _ . : / = + -. The following additional restrictions apply to tags: Tag keys and values are case sensitive. For each associated resource, each tag key must be unique and it can have only one value. TheÂ  aws:Â prefix is reserved for use by Amazon Web Services; you can't use it in any tag keys or values that you define. In addition, you can't edit or remove tag keys or values that use this prefix. Tags that use this prefix don't count against the limit of 50 tags per resource. You can associate tags with public or shared resources, but the tags are available only for your Amazon Web Services account, not any other accounts that share the resource. In addition, the tags are available only for resources that are located in the specified Amazon Web Services Region for your Amazon Web Services account. One part of a key-value pair that defines a tag. The maximum length of a tag key is 128 characters. The minimum length is 1 character. The optional part of a key-value pair that defines a tag. The maximum length of a tag value is 256 characters. The minimum length is 0 characters. If you don't want a resource to have a specific tag value, don't specify a value for this parameter. If you don't specify a value, Amazon SES sets the value to an empty string.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Status",
          "type": "string",
          "description": "A status of the multi-region endpoint (global-endpoint) right after the create request.",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "CREATING --- The resource is being provisioned.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "READY --- The resource is ready to use.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "FAILED --- The resource failed to be provisioned.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "DELETING --- The resource is being deleted as requested.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "EndpointId",
          "type": "string",
          "description": "The ID of the multi-region endpoint (global-endpoint).",
          "nested_items": []
        }
      ]
    }
  ]
}