{
  "method_name": "list_tags_for_resource",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sesv2/client/list_tags_for_resource.html",
  "description": "Retrieve a list of the tags (keys and values) that are associated with a specified resource. AÂ tagÂ is a label that you optionally define and associate with a resource. Each tag consists of a requiredÂ tag keyÂ and an optional associatedÂ tag value. A tag key is a general label that acts as a category for more specific tag values. A tag value acts as a descriptor within a tag key.",
  "parameters": [
    {
      "name": "ResourceArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the resource that you want to retrieve tag information for.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Tags",
          "type": "list",
          "description": "An array that lists all the tags that are associated with the resource. Each tag consists of a required tag key ( Key) and an associated tag value ( Value)",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "Tag keys and values are case sensitive.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "For each associated resource, each tag key must be unique and it can have only one value.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "TheÂ  aws:Â prefix is reserved for use by Amazon Web Services; you can't use it in any tag keys or values that you define. In addition, you can't edit or remove tag keys or values that use this prefix. Tags that use this prefix don't count against the limit of 50 tags per resource.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "You can associate tags with public or shared resources, but the tags are available only for your Amazon Web Services account, not any other accounts that share the resource. In addition, the tags are available only for resources that are located in the specified Amazon Web Services Region for your Amazon Web Services account.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}