{
  "method_name": "put_configuration_set_vdm_options",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sesv2/client/put_configuration_set_vdm_options.html",
  "description": "Specify VDM preferences for email that you send using the configuration set. You can execute this operation no more than once per second.",
  "parameters": [
    {
      "name": "ConfigurationSetName",
      "type": "string",
      "required": true,
      "description": "The name of the configuration set.",
      "nested_params": []
    },
    {
      "name": "VdmOptions",
      "type": "dict",
      "required": false,
      "description": "The VDM options to apply to the configuration set. DashboardOptions (dict) --- Specifies additional settings for your VDM configuration as applicable to the Dashboard. EngagementMetrics (string) --- Specifies the status of your VDM engagement metrics collection. Can be one of the following: ENABLED --- Amazon SES enables engagement metrics for the configuration set. DISABLED --- Amazon SES disables engagement metrics for the configuration set. GuardianOptions (dict) --- Specifies additional settings for your VDM configuration as applicable to the Guardian. OptimizedSharedDelivery (string) --- Specifies the status of your VDM optimized shared delivery. Can be one of the following: ENABLED --- Amazon SES enables optimized shared delivery for the configuration set. DISABLED --- Amazon SES disables optimized shared delivery for the configuration set.",
      "nested_params": [
        {
          "name": "DashboardOptions",
          "type": "dict",
          "required": false,
          "description": "Specifies additional settings for your VDM configuration as applicable to the Dashboard.",
          "nested_params": [
            {
              "name": "EngagementMetrics",
              "type": "string",
              "required": false,
              "description": "Specifies the status of your VDM engagement metrics collection. Can be one of the following:",
              "nested_params": []
            }
          ]
        },
        {
          "name": "GuardianOptions",
          "type": "dict",
          "required": false,
          "description": "Specifies additional settings for your VDM configuration as applicable to the Guardian.",
          "nested_params": [
            {
              "name": "OptimizedSharedDelivery",
              "type": "string",
              "required": false,
              "description": "Specifies the status of your VDM optimized shared delivery. Can be one of the following:",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}