{
  "method_name": "send_bulk_email",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sesv2/client/send_bulk_email.html",
  "description": "Composes an email message to multiple destinations.",
  "parameters": [
    {
      "name": "FromEmailAddress",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "FromEmailAddressIdentityArn",
      "type": "string",
      "required": false,
      "description": "This parameter is used only for sending authorization. It is the ARN of the identity that is associated with the sending authorization policy that permits you to use the email address specified in the FromEmailAddress parameter. For example, if the owner of example.com (which has ARN arn:aws:ses:us-east-1:123456789012:identity/example.com) attaches a policy to it that authorizes you to use sender@example.com, then you would specify the FromEmailAddressIdentityArn to be arn:aws:ses:us-east-1:123456789012:identity/example.com, and the FromEmailAddress to be sender@example.com. For more information about sending authorization, see the Amazon SES Developer Guide.",
      "nested_params": []
    },
    {
      "name": "ReplyToAddresses",
      "type": "list",
      "required": false,
      "description": "The 'Reply-to' email addresses for the message. When the recipient replies to the message, each Reply-to address receives the reply. (string) ---",
      "nested_params": []
    },
    {
      "name": "FeedbackForwardingEmailAddress",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "FeedbackForwardingEmailAddressIdentityArn",
      "type": "string",
      "required": false,
      "description": "This parameter is used only for sending authorization. It is the ARN of the identity that is associated with the sending authorization policy that permits you to use the email address specified in the FeedbackForwardingEmailAddress parameter. For example, if the owner of example.com (which has ARN arn:aws:ses:us-east-1:123456789012:identity/example.com) attaches a policy to it that authorizes you to use feedback@example.com, then you would specify the FeedbackForwardingEmailAddressIdentityArn to be arn:aws:ses:us-east-1:123456789012:identity/example.com, and the FeedbackForwardingEmailAddress to be feedback@example.com. For more information about sending authorization, see the Amazon SES Developer Guide.",
      "nested_params": []
    },
    {
      "name": "DefaultEmailTags",
      "type": "list",
      "required": true,
      "description": "A list of tags, in the form of name/value pairs, to apply to an email that you send using the SendEmail operation. Tags correspond to characteristics of the email that you define, so that you can publish email sending events. (dict) --- Contains the name and value of a tag that you apply to an email. You can use message tags when you publish email sending events. The name of the message tag. The message tag name has to meet the following criteria: It can only contain ASCII letters (a---z, A---Z), numbers (0---9), underscores (_), or dashes (-). It can contain no more than 256 characters. The value of the message tag. The message tag value has to meet the following criteria: It can only contain ASCII letters (a---z, A---Z), numbers (0---9), underscores (_), or dashes (-). It can contain no more than 256 characters.",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name of the message tag. The message tag name has to meet the following criteria:",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value of the message tag. The message tag value has to meet the following criteria:",
          "nested_params": []
        }
      ]
    },
    {
      "name": "DefaultContent",
      "type": "dict",
      "required": true,
      "description": "An object that contains the body of the message. You can specify a template message. Template (dict) --- The template to use for the bulk email message. TemplateName (string) --- The name of the template. You will refer to this name when you send email using the SendEmail or SendBulkEmail operations. TemplateArn (string) --- The Amazon Resource Name (ARN) of the template. TemplateContent (dict) --- The content of the template. Subject (string) --- The subject line of the email. Text (string) --- The email body that will be visible to recipients whose email clients do not display HTML. Html (string) --- The HTML body of the email. TemplateData (string) --- An object that defines the values to use for message variables in the template. This object is a set of key-value pairs. Each key defines a message variable in the template. The corresponding value defines the value to use for that variable. Headers (list) --- The list of message headers that will be added to the email message. (dict) --- Contains the name and value of a message header that you add to an email. The name of the message header. The message header name has to meet the following criteria: Can contain any printable ASCII character (33 - 126) except for colon (:). Can contain no more than 126 characters. The value of the message header. The message header value has to meet the following criteria: Can contain any printable ASCII character. Can contain no more than 870 characters. Attachments (list) --- The List of attachments to include in your email. All recipients will receive the same attachments. (dict) --- Contains metadata and attachment raw content. The raw data of the attachment. It needs to be base64-encoded if you are accessing Amazon SES directly through the HTTPS interface. If you are accessing Amazon SES using an Amazon Web Services SDK, the SDK takes care of the base 64-encoding for you. ContentDisposition (string) --- A standard descriptor indicating how the attachment should be rendered in the email. Supported values: ATTACHMENT or INLINE. The file name for the attachment as it will appear in the email. Amazon SES restricts certain file extensions. To ensure attachments are accepted, check the Unsupported attachment types in the Amazon SES Developer Guide. ContentDescription (string) --- A brief description of the attachment content. ContentId (string) --- Unique identifier for the attachment, used for referencing attachments with INLINE disposition in HTML content. ContentTransferEncoding (string) --- Specifies how the attachment is encoded. Supported values: BASE64, QUOTED_PRINTABLE, SEVEN_BIT. ContentType (string) --- The MIME type of the attachment.",
      "nested_params": [
        {
          "name": "Template",
          "type": "dict",
          "required": false,
          "description": "The template to use for the bulk email message.",
          "nested_params": [
            {
              "name": "TemplateName",
              "type": "string",
              "required": false,
              "description": "The name of the template. You will refer to this name when you send email using the SendEmail or SendBulkEmail operations.",
              "nested_params": []
            },
            {
              "name": "TemplateArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of the template.",
              "nested_params": []
            },
            {
              "name": "TemplateContent",
              "type": "dict",
              "required": false,
              "description": "The content of the template.",
              "nested_params": [
                {
                  "name": "Subject",
                  "type": "string",
                  "required": false,
                  "description": "The subject line of the email.",
                  "nested_params": []
                },
                {
                  "name": "Text",
                  "type": "string",
                  "required": false,
                  "description": "The email body that will be visible to recipients whose email clients do not display HTML.",
                  "nested_params": []
                },
                {
                  "name": "Html",
                  "type": "string",
                  "required": false,
                  "description": "The HTML body of the email.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "TemplateData",
              "type": "string",
              "required": false,
              "description": "An object that defines the values to use for message variables in the template. This object is a set of key-value pairs. Each key defines a message variable in the template. The corresponding value defines the value to use for that variable.",
              "nested_params": []
            },
            {
              "name": "Headers",
              "type": "list",
              "required": false,
              "description": "The list of message headers that will be added to the email message.",
              "nested_params": [
                {
                  "name": "Name",
                  "type": "string",
                  "required": false,
                  "description": "The name of the message header. The message header name has to meet the following criteria:",
                  "nested_params": []
                },
                {
                  "name": "Value",
                  "type": "string",
                  "required": false,
                  "description": "The value of the message header. The message header value has to meet the following criteria:",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Attachments",
              "type": "list",
              "required": false,
              "description": "The List of attachments to include in your email. All recipients will receive the same attachments.",
              "nested_params": [
                {
                  "name": "RawContent",
                  "type": "bytes",
                  "required": false,
                  "description": "The raw data of the attachment. It needs to be base64-encoded if you are accessing Amazon SES directly through the HTTPS interface. If you are accessing Amazon SES using an Amazon Web Services SDK, the SDK takes care of the base 64-encoding for you.",
                  "nested_params": []
                },
                {
                  "name": "ContentDisposition",
                  "type": "string",
                  "required": false,
                  "description": "A standard descriptor indicating how the attachment should be rendered in the email. Supported values: ATTACHMENT or INLINE.",
                  "nested_params": []
                },
                {
                  "name": "FileName",
                  "type": "string",
                  "required": false,
                  "description": "The file name for the attachment as it will appear in the email. Amazon SES restricts certain file extensions. To ensure attachments are accepted, check the Unsupported attachment types in the Amazon SES Developer Guide.",
                  "nested_params": []
                },
                {
                  "name": "ContentDescription",
                  "type": "string",
                  "required": false,
                  "description": "A brief description of the attachment content.",
                  "nested_params": []
                },
                {
                  "name": "ContentId",
                  "type": "string",
                  "required": false,
                  "description": "Unique identifier for the attachment, used for referencing attachments with INLINE disposition in HTML content.",
                  "nested_params": []
                },
                {
                  "name": "ContentTransferEncoding",
                  "type": "string",
                  "required": false,
                  "description": "Specifies how the attachment is encoded. Supported values: BASE64, QUOTED_PRINTABLE, SEVEN_BIT.",
                  "nested_params": []
                },
                {
                  "name": "ContentType",
                  "type": "string",
                  "required": false,
                  "description": "The MIME type of the attachment.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "BulkEmailEntries",
      "type": "list",
      "required": true,
      "description": "The list of bulk email entry objects. (dict) --- Represents the destination of the message, consisting of To:, CC:, and BCC: fields. ToAddresses (list) --- An array that contains the email addresses of the 'To' recipients for the email. (string) --- CcAddresses (list) --- An array that contains the email addresses of the 'CC' (carbon copy) recipients for the email. (string) --- BccAddresses (list) --- An array that contains the email addresses of the 'BCC' (blind carbon copy) recipients for the email. (string) --- ReplacementTags (list) --- A list of tags, in the form of name/value pairs, to apply to an email that you send using the SendBulkTemplatedEmail operation. Tags correspond to characteristics of the email that you define, so that you can publish email sending events. (dict) --- Contains the name and value of a tag that you apply to an email. You can use message tags when you publish email sending events. The name of the message tag. The message tag name has to meet the following criteria: It can only contain ASCII letters (a---z, A---Z), numbers (0---9), underscores (_), or dashes (-). It can contain no more than 256 characters. The value of the message tag. The message tag value has to meet the following criteria: It can only contain ASCII letters (a---z, A---Z), numbers (0---9), underscores (_), or dashes (-). ReplacementEmailContent (dict) --- The ReplacementEmailContent associated with a BulkEmailEntry. ReplacementTemplate (dict) --- The ReplacementTemplate associated with ReplacementEmailContent. ReplacementTemplateData (string) --- A list of replacement values to apply to the template. This parameter is a JSON object, typically consisting of key-value pairs in which the keys correspond to replacement tags in the email template. ReplacementHeaders (list) --- The list of message headers associated with the BulkEmailEntry data type. Headers Not Present in BulkEmailEntry: If a header is specified in Template but not in BulkEmailEntry, the header from Template will be added to the outgoing email. Headers Present in BulkEmailEntry: If a header is specified in BulkEmailEntry, it takes precedence over any header of the same name specified in Template: If the header is also defined within Template, the value from BulkEmailEntry will replace the header's value in the email. If the header is not defined within Template, it will simply be added to the email as specified in BulkEmailEntry. (dict) --- Contains the name and value of a message header that you add to an email. The name of the message header. The message header name has to meet the following criteria: Can contain any printable ASCII character (33 - 126) except for colon (:). Can contain no more than 126 characters. The value of the message header. The message header value has to meet the following criteria: Can contain any printable ASCII character. Can contain no more than 870 characters.",
      "nested_params": [
        {
          "name": "Destination",
          "type": "dict",
          "required": false,
          "description": "Represents the destination of the message, consisting of To:, CC:, and BCC: fields.",
          "nested_params": [
            {
              "name": "ToAddresses",
              "type": "list",
              "required": false,
              "description": "An array that contains the email addresses of the 'To' recipients for the email.",
              "nested_params": []
            },
            {
              "name": "CcAddresses",
              "type": "list",
              "required": false,
              "description": "An array that contains the email addresses of the 'CC' (carbon copy) recipients for the email.",
              "nested_params": []
            },
            {
              "name": "BccAddresses",
              "type": "list",
              "required": false,
              "description": "An array that contains the email addresses of the 'BCC' (blind carbon copy) recipients for the email.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ReplacementTags",
          "type": "list",
          "required": false,
          "description": "A list of tags, in the form of name/value pairs, to apply to an email that you send using the SendBulkTemplatedEmail operation. Tags correspond to characteristics of the email that you define, so that you can publish email sending events.",
          "nested_params": [
            {
              "name": "Name",
              "type": "string",
              "required": false,
              "description": "The name of the message tag. The message tag name has to meet the following criteria:",
              "nested_params": []
            },
            {
              "name": "Value",
              "type": "string",
              "required": false,
              "description": "The value of the message tag. The message tag value has to meet the following criteria:",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ReplacementEmailContent",
          "type": "dict",
          "required": false,
          "description": "The ReplacementEmailContent associated with a BulkEmailEntry.",
          "nested_params": [
            {
              "name": "ReplacementTemplate",
              "type": "dict",
              "required": false,
              "description": "The ReplacementTemplate associated with ReplacementEmailContent.",
              "nested_params": [
                {
                  "name": "ReplacementTemplateData",
                  "type": "string",
                  "required": false,
                  "description": "A list of replacement values to apply to the template. This parameter is a JSON object, typically consisting of key-value pairs in which the keys correspond to replacement tags in the email template.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "ReplacementHeaders",
          "type": "list",
          "required": false,
          "description": "The list of message headers associated with the BulkEmailEntry data type.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ConfigurationSetName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "EndpointId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "BulkEmailEntryResults",
          "type": "list",
          "description": "One object per intended recipient. Check each response object and retry any messages with a failure status.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Status",
                  "type": "string",
                  "description": "The status of a message sent using the SendBulkTemplatedEmail operation.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "SUCCESS: Amazon SES accepted the message, and will attempt to deliver it to the recipients.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "MESSAGE_REJECTED: The message was rejected because it contained a virus.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "MAIL_FROM_DOMAIN_NOT_VERIFIED: The sender's email address or domain was not verified.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "CONFIGURATION_SET_DOES_NOT_EXIST: The configuration set you specified does not exist.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "TEMPLATE_DOES_NOT_EXIST: The template you specified does not exist.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "ACCOUNT_SUSPENDED: Your account has been shut down because of issues related to your email sending practices.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "ACCOUNT_THROTTLED: The number of emails you can send has been reduced because your account has exceeded its allocated sending limit.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "ACCOUNT_DAILY_QUOTA_EXCEEDED: You have reached or exceeded the maximum number of emails you can send from your account in a 24-hour period.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "INVALID_SENDING_POOL_NAME: The configuration set you specified refers to an IP pool that does not exist.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "ACCOUNT_SENDING_PAUSED: Email sending for the Amazon SES account was disabled using the UpdateAccountSendingEnabled operation.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "CONFIGURATION_SET_SENDING_PAUSED: Email sending for this configuration set was disabled using the UpdateConfigurationSetSendingEnabled operation.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "INVALID_PARAMETER_VALUE: One or more of the parameters you specified when calling this operation was invalid. See the error message for additional information.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "TRANSIENT_FAILURE: Amazon SES was unable to process your request because of a temporary issue.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "FAILED: Amazon SES was unable to process your request. See the error message for additional information.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Error",
                  "type": "string",
                  "description": "A description of an error that prevented a message being sent using the SendBulkTemplatedEmail operation.",
                  "nested_items": []
                },
                {
                  "name": "MessageId",
                  "type": "string",
                  "description": "The unique message identifier returned from the SendBulkTemplatedEmail operation.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}