{
  "method_name": "start_device_authorization",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sso-oidc/client/start_device_authorization.html",
  "description": "Initiates device authorization by requesting a pair of verification codes from the authorization service.",
  "parameters": [
    {
      "name": "clientId",
      "type": "string",
      "required": true,
      "description": "The unique identifier string for the client that is registered with IAM Identity Center. This value should come from the persisted result of the  RegisterClient API operation.",
      "nested_params": []
    },
    {
      "name": "clientSecret",
      "type": "string",
      "required": true,
      "description": "A secret string that is generated for the client. This value should come from the persisted result of the  RegisterClient API operation.",
      "nested_params": []
    },
    {
      "name": "startUrl",
      "type": "string",
      "required": true,
      "description": "The URL for the Amazon Web Services access portal. For more information, see Using the Amazon Web Services access portal in the IAM Identity Center User Guide.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "deviceCode",
          "type": "string",
          "description": "The short-lived code that is used by the device when polling for a session token.",
          "nested_items": []
        },
        {
          "name": "userCode",
          "type": "string",
          "description": "A one-time user verification code. This is needed to authorize an in-use device.",
          "nested_items": []
        },
        {
          "name": "verificationUri",
          "type": "string",
          "description": "The URI of the verification page that takes the userCode to authorize the device.",
          "nested_items": []
        },
        {
          "name": "verificationUriComplete",
          "type": "string",
          "description": "An alternate URL that the client can use to automatically launch a browser. This process skips the manual step in which the user visits the verification page and enters their code.",
          "nested_items": []
        },
        {
          "name": "expiresIn",
          "type": "integer",
          "description": "Indicates the number of seconds in which the verification code will become invalid.",
          "nested_items": []
        },
        {
          "name": "interval",
          "type": "integer",
          "description": "Indicates the number of seconds the client must wait between attempts when polling for a session.",
          "nested_items": []
        }
      ]
    }
  ]
}