{
  "method_name": "delete_model",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/lookoutvision/client/delete_model.html",
  "description": "Deletes an Amazon Lookout for Vision model. You can't delete a running model. To stop a running model, use the  StopModel operation. It might take a few seconds to delete a model. To determine if a model has been deleted, call  ListModels and check if the version of the model ( ModelVersion) is in the Models array. This operation requires permissions to perform the lookoutvision:DeleteModel operation.",
  "parameters": [
    {
      "name": "ProjectName",
      "type": "string",
      "required": true,
      "description": "The name of the project that contains the model that you want to delete.",
      "nested_params": []
    },
    {
      "name": "ModelVersion",
      "type": "string",
      "required": true,
      "description": "The version of the model that you want to delete.",
      "nested_params": []
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": false,
      "description": "ClientToken is an idempotency token that ensures a call to DeleteModel completes only once. You choose the value to pass. For example, an issue might prevent you from getting a response from DeleteModel. In this case, safely retry your call to DeleteModel by using the same ClientToken parameter value. If you don't supply a value for ClientToken, the AWS SDK you are using inserts a value for you. This prevents retries after a network error from making multiple model deletion requests. You'll need to provide your own value for other use cases. An error occurs if the other input parameters are not the same as in the first request. Using a different value for ClientToken is considered a new call to DeleteModel. An idempotency token is active for 8 hours. This field is autopopulated if not provided.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ModelArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the model that was deleted.",
          "nested_items": []
        }
      ]
    }
  ]
}