{
  "method_name": "detect_anomalies",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/lookoutvision/client/detect_anomalies.html",
  "description": "Detects anomalies in an image that you supply. The response from DetectAnomalies includes a boolean prediction that the image contains one or more anomalies and a confidence value for the prediction. If the model is an image segmentation model, the response also includes segmentation information for each type of anomaly found in the image. For more information, see Detecting anomalies in an image in the Amazon Lookout for Vision developer guide. This operation requires permissions to perform the lookoutvision:DetectAnomalies operation.",
  "parameters": [
    {
      "name": "ProjectName",
      "type": "string",
      "required": true,
      "description": "The name of the project that contains the model version that you want to use.",
      "nested_params": []
    },
    {
      "name": "ModelVersion",
      "type": "string",
      "required": true,
      "description": "The version of the model that you want to use.",
      "nested_params": []
    },
    {
      "name": "Body",
      "type": "bytes or seekable file-like object",
      "required": true,
      "description": "The unencrypted image bytes that you want to analyze.",
      "nested_params": []
    },
    {
      "name": "ContentType",
      "type": "string",
      "required": true,
      "description": "The type of the image passed in Body. Valid values are image/png (PNG format images) and image/jpeg (JPG format images).",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "DetectAnomalyResult",
          "type": "dict",
          "description": "The results of the DetectAnomalies operation.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Type",
                  "type": "string",
                  "description": "The type of the image.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "IsAnomalous",
              "type": "boolean",
              "description": "True if Amazon Lookout for Vision classifies the image as containing an anomaly, otherwise false.",
              "nested_items": []
            },
            {
              "name": "Confidence",
              "type": "float",
              "description": "The confidence that Lookout for Vision has in the accuracy of the classification in IsAnomalous.",
              "nested_items": []
            },
            {
              "name": "Anomalies",
              "type": "list",
              "description": "If the model is an image segmentation model, Anomalies contains a list of anomaly types found in the image. There is one entry for each type of anomaly found (even if multiple instances of an anomaly type exist on the image). The first element in the list is always an anomaly type representing the image background (--\u0098background') and shouldn't be considered an anomaly. Amazon Lookout for Vision automatically add the background anomaly type to the response, and you don't need to declare a background anomaly type in your dataset.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Name",
                      "type": "string",
                      "description": "The name of an anomaly type found in an image. Name maps to an anomaly type in the training dataset, apart from the anomaly type background. The service automatically inserts the background anomaly type into the response from DetectAnomalies.",
                      "nested_items": []
                    },
                    {
                      "name": "PixelAnomaly",
                      "type": "dict",
                      "description": "Information about the pixel mask that covers an anomaly type.",
                      "nested_items": [
                        {
                          "name": "TotalPercentageArea",
                          "type": "float",
                          "description": "The percentage area of the image that the anomaly type covers.",
                          "nested_items": []
                        },
                        {
                          "name": "Color",
                          "type": "string",
                          "description": "A hex color value for the mask that covers an anomaly type. Each anomaly type has a different mask color. The color maps to the color of the anomaly type used in the training dataset.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "AnomalyMask",
              "type": "bytes",
              "description": "If the model is an image segmentation model, AnomalyMask contains pixel masks that covers all anomaly types found on the image. Each anomaly type has a different mask color. To map a color to an anomaly type, see the color field of the  PixelAnomaly object.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}