{
  "method_name": "create_dataset",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/rekognition/client/create_dataset.html",
  "description": "Creates a new Amazon Rekognition Custom Labels dataset. You can create a dataset by using an Amazon Sagemaker format manifest file or by copying an existing Amazon Rekognition Custom Labels dataset. To create a training dataset for a project, specify TRAIN for the value of DatasetType. To create the test dataset for a project, specify TEST for the value of DatasetType. The response from CreateDataset is the Amazon Resource Name (ARN) for the dataset. Creating a dataset takes a while to complete. Use  DescribeDataset to check the current status. The dataset created successfully if the value of Status is CREATE_COMPLETE. To check if any non-terminal errors occurred, call  ListDatasetEntries and check for the presence of errors lists in the JSON Lines. Dataset creation fails if a terminal error occurs ( Status = CREATE_FAILED). Currently, you can't access the terminal error information. For more information, see Creating dataset in the Amazon Rekognition Custom Labels Developer Guide. This operation requires permissions to perform the rekognition:CreateDataset action. If you want to copy an existing dataset, you also require permission to perform the rekognition:ListDatasetEntries action.",
  "parameters": [
    {
      "name": "DatasetSource",
      "type": "dict",
      "required": false,
      "description": "The source files for the dataset. You can specify the ARN of an existing dataset or specify the Amazon S3 bucket location of an Amazon Sagemaker format manifest file. If you don't specify datasetSource, an empty dataset is created. To add labeled images to the dataset, You can use the console or call  UpdateDatasetEntries. GroundTruthManifest (dict) --- The S3 bucket that contains an Amazon Sagemaker Ground Truth format manifest file. S3Object (dict) --- Provides the S3 bucket name and object name. The region for the S3 bucket containing the S3 object must match the region you use for Amazon Rekognition operations. For Amazon Rekognition to process an S3 object, the user must have permission to access the S3 object. For more information, see How Amazon Rekognition works with IAM in the Amazon Rekognition Developer Guide. Bucket (string) --- Name of the S3 bucket. Name (string) --- S3 object key name. Version (string) --- If the bucket is versioning enabled, you can specify the object version. DatasetArn (string) --- The ARN of an Amazon Rekognition Custom Labels dataset that you want to copy.",
      "nested_params": [
        {
          "name": "GroundTruthManifest",
          "type": "dict",
          "required": false,
          "description": "The S3 bucket that contains an Amazon Sagemaker Ground Truth format manifest file.",
          "nested_params": [
            {
              "name": "S3Object",
              "type": "dict",
              "required": false,
              "description": "Provides the S3 bucket name and object name. The region for the S3 bucket containing the S3 object must match the region you use for Amazon Rekognition operations. For Amazon Rekognition to process an S3 object, the user must have permission to access the S3 object. For more information, see How Amazon Rekognition works with IAM in the Amazon Rekognition Developer Guide.",
              "nested_params": [
                {
                  "name": "Bucket",
                  "type": "string",
                  "required": false,
                  "description": "Name of the S3 bucket.",
                  "nested_params": []
                },
                {
                  "name": "Name",
                  "type": "string",
                  "required": false,
                  "description": "S3 object key name.",
                  "nested_params": []
                },
                {
                  "name": "Version",
                  "type": "string",
                  "required": false,
                  "description": "If the bucket is versioning enabled, you can specify the object version.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "DatasetArn",
          "type": "string",
          "required": false,
          "description": "The ARN of an Amazon Rekognition Custom Labels dataset that you want to copy.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "DatasetType",
      "type": "string",
      "required": true,
      "description": "The type of the dataset. Specify TRAIN to create a training dataset. Specify TEST to create a test dataset.",
      "nested_params": []
    },
    {
      "name": "ProjectArn",
      "type": "string",
      "required": true,
      "description": "The ARN of the Amazon Rekognition Custom Labels project to which you want to asssign the dataset.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "dict",
      "required": false,
      "description": "A set of tags (key-value pairs) that you want to attach to the dataset. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "DatasetArn",
          "type": "string",
          "description": "The ARN of the created Amazon Rekognition Custom Labels dataset.",
          "nested_items": []
        }
      ]
    }
  ]
}