{
  "method_name": "create_collection",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/rekognition/client/create_collection.html",
  "description": "Creates a collection in an AWS Region. You can add faces to the collection using the  IndexFaces operation. For example, you might create collections, one for each of your application users. A user can then index faces using the IndexFaces operation and persist results in a specific collection. Then, a user can search the collection for faces in the user-specific container. When you create a collection, it is associated with the latest version of the face model version. This operation requires permissions to perform the rekognition:CreateCollection action. If you want to tag your collection, you also require permission to perform the rekognition:TagResource operation.",
  "parameters": [
    {
      "name": "CollectionId",
      "type": "string",
      "required": true,
      "description": "ID for the collection that you are creating.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "dict",
      "required": false,
      "description": "A set of tags (key-value pairs) that you want to attach to the collection. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "StatusCode",
          "type": "integer",
          "description": "HTTP status code indicating the result of the operation.",
          "nested_items": []
        },
        {
          "name": "CollectionArn",
          "type": "string",
          "description": "Amazon Resource Name (ARN) of the collection. You can use this to manage permissions on your resources.",
          "nested_items": []
        },
        {
          "name": "FaceModelVersion",
          "type": "string",
          "description": "Version number of the face detection model associated with the collection you are creating.",
          "nested_items": []
        }
      ]
    }
  ]
}