{
  "method_name": "describe_stream_processor",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/rekognition/client/describe_stream_processor.html",
  "description": "Provides information about a stream processor created by  CreateStreamProcessor. You can get information about the input and output streams, the input parameters for the face recognition being performed, and the current status of the stream processor.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "Name of the stream processor for which you want information.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Name",
          "type": "string",
          "description": "Name of the stream processor.",
          "nested_items": []
        },
        {
          "name": "StreamProcessorArn",
          "type": "string",
          "description": "ARN of the stream processor.",
          "nested_items": []
        },
        {
          "name": "Status",
          "type": "string",
          "description": "Current status of the stream processor.",
          "nested_items": []
        },
        {
          "name": "StatusMessage",
          "type": "string",
          "description": "Detailed status message about the stream processor.",
          "nested_items": []
        },
        {
          "name": "CreationTimestamp",
          "type": "datetime",
          "description": "Date and time the stream processor was created.",
          "nested_items": []
        },
        {
          "name": "LastUpdateTimestamp",
          "type": "datetime",
          "description": "The time, in Unix format, the stream processor was last updated. For example, when the stream processor moves from a running state to a failed state, or when the user starts or stops the stream processor.",
          "nested_items": []
        },
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "KinesisVideoStream",
              "type": "dict",
              "description": "The Kinesis video stream input stream for the source streaming video.",
              "nested_items": [
                {
                  "name": "Arn",
                  "type": "string",
                  "description": "ARN of the Kinesis video stream stream that streams the source video.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "KinesisDataStream",
              "type": "dict",
              "description": "The Amazon Kinesis Data Streams stream to which the Amazon Rekognition stream processor streams the analysis results.",
              "nested_items": [
                {
                  "name": "Arn",
                  "type": "string",
                  "description": "ARN of the output Amazon Kinesis Data Streams stream.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "S3Destination",
              "type": "dict",
              "description": "The Amazon S3 bucket location to which Amazon Rekognition publishes the detailed inference results of a video analysis operation.",
              "nested_items": [
                {
                  "name": "Bucket",
                  "type": "string",
                  "description": "The name of the Amazon S3 bucket you want to associate with the streaming video project. You must be the owner of the Amazon S3 bucket.",
                  "nested_items": []
                },
                {
                  "name": "KeyPrefix",
                  "type": "string",
                  "description": "The prefix value of the location within the bucket that you want the information to be published to. For more information, see Using prefixes.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "RoleArn",
          "type": "string",
          "description": "ARN of the IAM role that allows access to the stream processor.",
          "nested_items": []
        },
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "FaceSearch",
              "type": "dict",
              "description": "Face search settings to use on a streaming video.",
              "nested_items": [
                {
                  "name": "CollectionId",
                  "type": "string",
                  "description": "The ID of a collection that contains faces that you want to search for.",
                  "nested_items": []
                },
                {
                  "name": "FaceMatchThreshold",
                  "type": "float",
                  "description": "Minimum face match confidence score that must be met to return a result for a recognized face. The default is 80. 0 is the lowest confidence. 100 is the highest confidence. Values between 0 and 100 are accepted, and values lower than 80 are set to 80.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "ConnectedHome",
              "type": "dict",
              "description": "Label detection settings to use on a streaming video. Defining the settings is required in the request parameter for  CreateStreamProcessor. Including this setting in the CreateStreamProcessor request enables you to use the stream processor for label detection. You can then select what you want the stream processor to detect, such as people or pets. When the stream processor has started, one notification is sent for each object class specified. For example, if packages and pets are selected, one SNS notification is published the first time a package is detected and one SNS notification is published the first time a pet is detected, as well as an end-of-session summary.",
              "nested_items": [
                {
                  "name": "Labels",
                  "type": "list",
                  "description": "Specifies what you want to detect in the video, such as people, packages, or pets. The current valid labels you can include in this list are: 'PERSON', 'PET', 'PACKAGE', and 'ALL'.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "MinConfidence",
                  "type": "float",
                  "description": "The minimum confidence required to label an object in the video.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NotificationChannel",
          "type": "dict",
          "description": "The Amazon Simple Notification Service topic to which Amazon Rekognition publishes the object detection results and completion status of a video analysis operation.",
          "nested_items": [
            {
              "name": "SNSTopicArn",
              "type": "string",
              "description": "The Amazon Resource Number (ARN) of the Amazon Amazon Simple Notification Service topic to which Amazon Rekognition posts the completion status.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "KmsKeyId",
          "type": "string",
          "description": "The identifier for your AWS Key Management Service key (AWS KMS key). This is an optional parameter for label detection stream processors.",
          "nested_items": []
        },
        {
          "name": "RegionsOfInterest",
          "type": "list",
          "description": "Specifies locations in the frames where Amazon Rekognition checks for objects or people. This is an optional parameter for label detection stream processors.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "BoundingBox",
                  "type": "dict",
                  "description": "The box representing a region of interest on screen.",
                  "nested_items": [
                    {
                      "name": "Width",
                      "type": "float",
                      "description": "Width of the bounding box as a ratio of the overall image width.",
                      "nested_items": []
                    },
                    {
                      "name": "Height",
                      "type": "float",
                      "description": "Height of the bounding box as a ratio of the overall image height.",
                      "nested_items": []
                    },
                    {
                      "name": "Left",
                      "type": "float",
                      "description": "Left coordinate of the bounding box as a ratio of overall image width.",
                      "nested_items": []
                    },
                    {
                      "name": "Top",
                      "type": "float",
                      "description": "Top coordinate of the bounding box as a ratio of overall image height.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Polygon",
                  "type": "list",
                  "description": "Specifies a shape made up of up to 10 Point objects to define a region of interest.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "X",
                          "type": "float",
                          "description": "The value of the X coordinate for a point on a Polygon.",
                          "nested_items": []
                        },
                        {
                          "name": "Y",
                          "type": "float",
                          "description": "The value of the Y coordinate for a point on a Polygon.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "DataSharingPreference",
          "type": "dict",
          "description": "Shows whether you are sharing data with Rekognition to improve model performance. You can choose this option at the account level or on a per-stream basis. Note that if you opt out at the account level this setting is ignored on individual streams.",
          "nested_items": [
            {
              "name": "OptIn",
              "type": "boolean",
              "description": "If this option is set to true, you choose to share data with Rekognition to improve model performance.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}