{
  "method_name": "start_media_analysis_job",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/rekognition/client/start_media_analysis_job.html",
  "description": "Initiates a new media analysis job. Accepts a manifest file in an Amazon S3 bucket. The output is a manifest file and a summary of the manifest stored in the Amazon S3 bucket.",
  "parameters": [
    {
      "name": "ClientRequestToken",
      "type": "string",
      "required": false,
      "description": "Idempotency token used to prevent the accidental creation of duplicate versions. If you use the same token with multiple StartMediaAnalysisJobRequest requests, the same response is returned. Use ClientRequestToken to prevent the same request from being processed more than once. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "JobName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "OperationsConfig",
      "type": "dict",
      "required": true,
      "description": "Configuration options for the media analysis job to be created. DetectModerationLabels (dict) --- Contains configuration options for a DetectModerationLabels job. MinConfidence (float) --- Specifies the minimum confidence level for the moderation labels to return. Amazon Rekognition doesn't return any labels with a confidence level lower than this specified value. ProjectVersion (string) --- Specifies the custom moderation model to be used during the label detection job. If not provided the pre-trained model is used.",
      "nested_params": [
        {
          "name": "DetectModerationLabels",
          "type": "dict",
          "required": false,
          "description": "Contains configuration options for a DetectModerationLabels job.",
          "nested_params": [
            {
              "name": "MinConfidence",
              "type": "float",
              "required": false,
              "description": "Specifies the minimum confidence level for the moderation labels to return. Amazon Rekognition doesn't return any labels with a confidence level lower than this specified value.",
              "nested_params": []
            },
            {
              "name": "ProjectVersion",
              "type": "string",
              "required": false,
              "description": "Specifies the custom moderation model to be used during the label detection job. If not provided the pre-trained model is used.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "Input",
      "type": "dict",
      "required": true,
      "description": "Input data to be analyzed by the job. Provides the S3 bucket name and object name. The region for the S3 bucket containing the S3 object must match the region you use for Amazon Rekognition operations. For Amazon Rekognition to process an S3 object, the user must have permission to access the S3 object. For more information, see How Amazon Rekognition works with IAM in the Amazon Rekognition Developer Guide. Bucket (string) --- Name of the S3 bucket. Name (string) --- S3 object key name. Version (string) --- If the bucket is versioning enabled, you can specify the object version.",
      "nested_params": [
        {
          "name": "S3Object",
          "type": "dict",
          "required": false,
          "description": "Provides the S3 bucket name and object name. The region for the S3 bucket containing the S3 object must match the region you use for Amazon Rekognition operations. For Amazon Rekognition to process an S3 object, the user must have permission to access the S3 object. For more information, see How Amazon Rekognition works with IAM in the Amazon Rekognition Developer Guide.",
          "nested_params": [
            {
              "name": "Bucket",
              "type": "string",
              "required": false,
              "description": "Name of the S3 bucket.",
              "nested_params": []
            },
            {
              "name": "Name",
              "type": "string",
              "required": false,
              "description": "S3 object key name.",
              "nested_params": []
            },
            {
              "name": "Version",
              "type": "string",
              "required": false,
              "description": "If the bucket is versioning enabled, you can specify the object version.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "OutputConfig",
      "type": "dict",
      "required": true,
      "description": "The Amazon S3 bucket location to store the results. Specifies the Amazon S3 bucket to contain the output of the media analysis job. S3KeyPrefix (string) --- Specifies the Amazon S3 key prefix that comes after the name of the bucket you have designated for storage.",
      "nested_params": [
        {
          "name": "S3Bucket",
          "type": "string",
          "required": false,
          "description": "Specifies the Amazon S3 bucket to contain the output of the media analysis job.",
          "nested_params": []
        },
        {
          "name": "S3KeyPrefix",
          "type": "string",
          "required": false,
          "description": "Specifies the Amazon S3 key prefix that comes after the name of the bucket you have designated for storage.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "KmsKeyId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "JobId",
          "type": "string",
          "description": "Identifier for the created job.",
          "nested_items": []
        }
      ]
    }
  ]
}