{
  "method_name": "start_content_moderation",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/rekognition/client/start_content_moderation.html",
  "description": "Starts asynchronous detection of inappropriate, unwanted, or offensive content in a stored video. For a list of moderation labels in Amazon Rekognition, see Using the image and video moderation APIs. Amazon Rekognition Video can moderate content in a video stored in an Amazon S3 bucket. Use  Video to specify the bucket name and the filename of the video. StartContentModeration returns a job identifier ( JobId) which you use to get the results of the analysis. When content analysis is finished, Amazon Rekognition Video publishes a completion status to the Amazon Simple Notification Service topic that you specify in NotificationChannel. To get the results of the content analysis, first check that the status value published to the Amazon SNS topic is SUCCEEDED. If so, call  GetContentModeration and pass the job identifier ( JobId) from the initial call to StartContentModeration. For more information, see Moderating content in the Amazon Rekognition Developer Guide.",
  "parameters": [
    {
      "name": "Video",
      "type": "dict",
      "required": true,
      "description": "The video in which you want to detect inappropriate, unwanted, or offensive content. The video must be stored in an Amazon S3 bucket. S3Object (dict) --- The Amazon S3 bucket name and file name for the video. Bucket (string) --- Name of the S3 bucket. Name (string) --- S3 object key name. Version (string) --- If the bucket is versioning enabled, you can specify the object version.",
      "nested_params": [
        {
          "name": "S3Object",
          "type": "dict",
          "required": false,
          "description": "The Amazon S3 bucket name and file name for the video.",
          "nested_params": [
            {
              "name": "Bucket",
              "type": "string",
              "required": false,
              "description": "Name of the S3 bucket.",
              "nested_params": []
            },
            {
              "name": "Name",
              "type": "string",
              "required": false,
              "description": "S3 object key name.",
              "nested_params": []
            },
            {
              "name": "Version",
              "type": "string",
              "required": false,
              "description": "If the bucket is versioning enabled, you can specify the object version.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "MinConfidence",
      "type": "float",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ClientRequestToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NotificationChannel",
      "type": "dict",
      "required": true,
      "description": "The Amazon SNS topic ARN that you want Amazon Rekognition Video to publish the completion status of the content analysis to. The Amazon SNS topic must have a topic name that begins with AmazonRekognition if you are using the AmazonRekognitionServiceRole permissions policy to access the topic. The Amazon SNS topic to which Amazon Rekognition posts the completion status. The ARN of an IAM role that gives Amazon Rekognition publishing permissions to the Amazon SNS topic.",
      "nested_params": [
        {
          "name": "SNSTopicArn",
          "type": "string",
          "required": false,
          "description": "The Amazon SNS topic to which Amazon Rekognition posts the completion status.",
          "nested_params": []
        },
        {
          "name": "RoleArn",
          "type": "string",
          "required": false,
          "description": "The ARN of an IAM role that gives Amazon Rekognition publishing permissions to the Amazon SNS topic.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "JobTag",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "JobId",
          "type": "string",
          "description": "The identifier for the content analysis job. Use JobId to identify the job in a subsequent call to GetContentModeration.",
          "nested_items": []
        }
      ]
    }
  ]
}