{
  "method_name": "update_stream_processor",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/rekognition/client/update_stream_processor.html",
  "description": "Allows you to update a stream processor. You can change some settings and regions of interest and delete certain parameters.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "Name of the stream processor that you want to update.",
      "nested_params": []
    },
    {
      "name": "SettingsForUpdate",
      "type": "dict",
      "required": false,
      "description": "The stream processor settings that you want to update. Label detection settings can be updated to detect different labels with a different minimum confidence. ConnectedHomeForUpdate (dict) --- The label detection settings you want to use for your stream processor. Labels (list) --- Specifies what you want to detect in the video, such as people, packages, or pets. The current valid labels you can include in this list are: 'PERSON', 'PET', 'PACKAGE', and 'ALL'. (string) --- MinConfidence (float) --- The minimum confidence required to label an object in the video.",
      "nested_params": [
        {
          "name": "ConnectedHomeForUpdate",
          "type": "dict",
          "required": false,
          "description": "The label detection settings you want to use for your stream processor.",
          "nested_params": [
            {
              "name": "Labels",
              "type": "list",
              "required": false,
              "description": "Specifies what you want to detect in the video, such as people, packages, or pets. The current valid labels you can include in this list are: 'PERSON', 'PET', 'PACKAGE', and 'ALL'.",
              "nested_params": []
            },
            {
              "name": "MinConfidence",
              "type": "float",
              "required": false,
              "description": "The minimum confidence required to label an object in the video.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "RegionsOfInterestForUpdate",
      "type": "list",
      "required": false,
      "description": "Specifies locations in the frames where Amazon Rekognition checks for objects or people. This is an optional parameter for label detection stream processors. (dict) --- Specifies a location within the frame that Rekognition checks for objects of interest such as text, labels, or faces. It uses a BoundingBox or Polygon to set a region of the screen. A word, face, or label is included in the region if it is more than half in that region. If there is more than one region, the word, face, or label is compared with all regions of the screen. Any object of interest that is more than half in a region is kept in the results. BoundingBox (dict) --- The box representing a region of interest on screen. Width (float) --- Width of the bounding box as a ratio of the overall image width. Height (float) --- Height of the bounding box as a ratio of the overall image height. Left (float) --- Left coordinate of the bounding box as a ratio of overall image width. Top (float) --- Top coordinate of the bounding box as a ratio of overall image height. Polygon (list) --- Specifies a shape made up of up to 10 Point objects to define a region of interest. (dict) --- The X and Y coordinates of a point on an image or video frame. The X and Y values are ratios of the overall image size or video resolution. For example, if an input image is 700x200 and the values are X=0.5 and Y=0.25, then the point is at the (350,50) pixel coordinate on the image. An array of Point objects makes up a Polygon. A Polygon is returned by  DetectText and by  DetectCustomLabels Polygon represents a fine-grained polygon around a detected item. For more information, see Geometry in the Amazon Rekognition Developer Guide. X (float) --- The value of the X coordinate for a point on a Polygon. Y (float) --- The value of the Y coordinate for a point on a Polygon.",
      "nested_params": [
        {
          "name": "BoundingBox",
          "type": "dict",
          "required": false,
          "description": "The box representing a region of interest on screen.",
          "nested_params": [
            {
              "name": "Width",
              "type": "float",
              "required": false,
              "description": "Width of the bounding box as a ratio of the overall image width.",
              "nested_params": []
            },
            {
              "name": "Height",
              "type": "float",
              "required": false,
              "description": "Height of the bounding box as a ratio of the overall image height.",
              "nested_params": []
            },
            {
              "name": "Left",
              "type": "float",
              "required": false,
              "description": "Left coordinate of the bounding box as a ratio of overall image width.",
              "nested_params": []
            },
            {
              "name": "Top",
              "type": "float",
              "required": false,
              "description": "Top coordinate of the bounding box as a ratio of overall image height.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Polygon",
          "type": "list",
          "required": false,
          "description": "Specifies a shape made up of up to 10 Point objects to define a region of interest.",
          "nested_params": [
            {
              "name": "X",
              "type": "float",
              "required": false,
              "description": "The value of the X coordinate for a point on a Polygon.",
              "nested_params": []
            },
            {
              "name": "Y",
              "type": "float",
              "required": false,
              "description": "The value of the Y coordinate for a point on a Polygon.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "DataSharingPreferenceForUpdate",
      "type": "dict",
      "required": true,
      "description": "Shows whether you are sharing data with Rekognition to improve model performance. You can choose this option at the account level or on a per-stream basis. Note that if you opt out at the account level this setting is ignored on individual streams. If this option is set to true, you choose to share data with Rekognition to improve model performance.",
      "nested_params": [
        {
          "name": "OptIn",
          "type": "boolean",
          "required": false,
          "description": "If this option is set to true, you choose to share data with Rekognition to improve model performance.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ParametersToDelete",
      "type": "list",
      "required": false,
      "description": "A list of parameters you want to delete from the stream processor. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}