{
  "method_name": "create_db_proxy",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/rds/client/create_db_proxy.html",
  "description": "Creates a new DB proxy.",
  "parameters": [
    {
      "name": "DBProxyName",
      "type": "string",
      "required": true,
      "description": "The identifier for the proxy. This name must be unique for all proxies owned by your Amazon Web Services account in the specified Amazon Web Services Region. An identifier must begin with a letter and must contain only ASCII letters, digits, and hyphens; it can't end with a hyphen or contain two consecutive hyphens.",
      "nested_params": []
    },
    {
      "name": "EngineFamily",
      "type": "string",
      "required": true,
      "description": "The kinds of databases that the proxy can connect to. This value determines which database network protocol the proxy recognizes when it interprets network traffic to and from the database. For Aurora MySQL, RDS for MariaDB, and RDS for MySQL databases, specify MYSQL. For Aurora PostgreSQL and RDS for PostgreSQL databases, specify POSTGRESQL. For RDS for Microsoft SQL Server, specify SQLSERVER.",
      "nested_params": []
    },
    {
      "name": "Auth",
      "type": "list",
      "required": true,
      "description": "The authorization mechanism that the proxy uses. (dict) --- Specifies the details of authentication used by a proxy to log in as a specific database user. Description (string) --- A user-specified description about the authentication used by a proxy to log in as a specific database user. UserName (string) --- The name of the database user to which the proxy connects. AuthScheme (string) --- The type of authentication that the proxy uses for connections from the proxy to the underlying database. SecretArn (string) --- The Amazon Resource Name (ARN) representing the secret that the proxy uses to authenticate to the RDS DB instance or Aurora DB cluster. These secrets are stored within Amazon Secrets Manager. IAMAuth (string) --- A value that indicates whether to require or disallow Amazon Web Services Identity and Access Management (IAM) authentication for connections to the proxy. The ENABLED value is valid only for proxies with RDS for Microsoft SQL Server. ClientPasswordAuthType (string) --- The type of authentication the proxy uses for connections from clients. The following values are defaults for the corresponding engines: RDS for MySQL: MYSQL_CACHING_SHA2_PASSWORD RDS for SQL Server: SQL_SERVER_AUTHENTICATION RDS for PostgreSQL: POSTGRES_SCRAM_SHA2_256",
      "nested_params": [
        {
          "name": "Description",
          "type": "string",
          "required": false,
          "description": "A user-specified description about the authentication used by a proxy to log in as a specific database user.",
          "nested_params": []
        },
        {
          "name": "UserName",
          "type": "string",
          "required": false,
          "description": "The name of the database user to which the proxy connects.",
          "nested_params": []
        },
        {
          "name": "AuthScheme",
          "type": "string",
          "required": false,
          "description": "The type of authentication that the proxy uses for connections from the proxy to the underlying database.",
          "nested_params": []
        },
        {
          "name": "SecretArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) representing the secret that the proxy uses to authenticate to the RDS DB instance or Aurora DB cluster. These secrets are stored within Amazon Secrets Manager.",
          "nested_params": []
        },
        {
          "name": "IAMAuth",
          "type": "string",
          "required": false,
          "description": "A value that indicates whether to require or disallow Amazon Web Services Identity and Access Management (IAM) authentication for connections to the proxy. The ENABLED value is valid only for proxies with RDS for Microsoft SQL Server.",
          "nested_params": []
        },
        {
          "name": "ClientPasswordAuthType",
          "type": "string",
          "required": false,
          "description": "The type of authentication the proxy uses for connections from clients. The following values are defaults for the corresponding engines:",
          "nested_params": []
        }
      ]
    },
    {
      "name": "RoleArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the IAM role that the proxy uses to access secrets in Amazon Web Services Secrets Manager.",
      "nested_params": []
    },
    {
      "name": "VpcSubnetIds",
      "type": "list",
      "required": true,
      "description": "One or more VPC subnet IDs to associate with the new proxy. (string) ---",
      "nested_params": []
    },
    {
      "name": "VpcSecurityGroupIds",
      "type": "list",
      "required": false,
      "description": "One or more VPC security group IDs to associate with the new proxy. (string) ---",
      "nested_params": []
    },
    {
      "name": "RequireTLS",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "IdleClientTimeout",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DebugLogging",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": false,
      "description": "An optional set of key-value pairs to associate arbitrary data of your choosing with the proxy. (dict) --- Metadata assigned to an Amazon RDS resource consisting of a key-value pair. For more information, see Tagging Amazon RDS resources in the Amazon RDS User Guide or Tagging Amazon Aurora and Amazon RDS resources in the Amazon Aurora User Guide. Key (string) --- A key is the required name of the tag. The string value can be from 1 to 128 Unicode characters in length and can't be prefixed with aws: or rds:. The string can only contain only the set of Unicode letters, digits, white-space, --\u0098_', --\u0098.', --\u0098:', --\u0098/', --\u0098=', --\u0098+', --\u0098-', --\u0098@' (Java regex: '^([\\p{L}\\p{Z}\\p{N}_.:/=+\\-@]*)$'). Value (string) --- A value is the optional value of the tag. The string value can be from 1 to 256 Unicode characters in length and can't be prefixed with aws: or rds:. The string can only contain only the set of Unicode letters, digits, white-space, --\u0098_', --\u0098.', --\u0098:', --\u0098/', --\u0098=', --\u0098+', --\u0098-', --\u0098@' (Java regex: '^([\\p{L}\\p{Z}\\p{N}_.:/=+\\-@]*)$').",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "A key is the required name of the tag. The string value can be from 1 to 128 Unicode characters in length and can't be prefixed with aws: or rds:. The string can only contain only the set of Unicode letters, digits, white-space, --\u0098_', --\u0098.', --\u0098:', --\u0098/', --\u0098=', --\u0098+', --\u0098-', --\u0098@' (Java regex: '^([\\p{L}\\p{Z}\\p{N}_.:/=+\\-@]*)$').",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "A value is the optional value of the tag. The string value can be from 1 to 256 Unicode characters in length and can't be prefixed with aws: or rds:. The string can only contain only the set of Unicode letters, digits, white-space, --\u0098_', --\u0098.', --\u0098:', --\u0098/', --\u0098=', --\u0098+', --\u0098-', --\u0098@' (Java regex: '^([\\p{L}\\p{Z}\\p{N}_.:/=+\\-@]*)$').",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "DBProxyName",
              "type": "string",
              "description": "The identifier for the proxy. This name must be unique for all proxies owned by your Amazon Web Services account in the specified Amazon Web Services Region.",
              "nested_items": []
            },
            {
              "name": "DBProxyArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) for the proxy.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The current status of this proxy. A status of available means the proxy is ready to handle requests. Other values indicate that you must wait for the proxy to be ready, or take some action to resolve an issue.",
              "nested_items": []
            },
            {
              "name": "EngineFamily",
              "type": "string",
              "description": "The kinds of databases that the proxy can connect to. This value determines which database network protocol the proxy recognizes when it interprets network traffic to and from the database. MYSQL supports Aurora MySQL, RDS for MariaDB, and RDS for MySQL databases. POSTGRESQL supports Aurora PostgreSQL and RDS for PostgreSQL databases. SQLSERVER supports RDS for Microsoft SQL Server databases.",
              "nested_items": []
            },
            {
              "name": "VpcId",
              "type": "string",
              "description": "Provides the VPC ID of the DB proxy.",
              "nested_items": []
            },
            {
              "name": "VpcSecurityGroupIds",
              "type": "list",
              "description": "Provides a list of VPC security groups that the proxy belongs to.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "VpcSubnetIds",
              "type": "list",
              "description": "The EC2 subnet IDs for the proxy.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Auth",
              "type": "list",
              "description": "One or more data structures specifying the authorization mechanism to connect to the associated RDS DB instance or Aurora DB cluster.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Description",
                      "type": "string",
                      "description": "A user-specified description about the authentication used by a proxy to log in as a specific database user.",
                      "nested_items": []
                    },
                    {
                      "name": "UserName",
                      "type": "string",
                      "description": "The name of the database user to which the proxy connects.",
                      "nested_items": []
                    },
                    {
                      "name": "AuthScheme",
                      "type": "string",
                      "description": "The type of authentication that the proxy uses for connections from the proxy to the underlying database.",
                      "nested_items": []
                    },
                    {
                      "name": "SecretArn",
                      "type": "string",
                      "description": "The Amazon Resource Name (ARN) representing the secret that the proxy uses to authenticate to the RDS DB instance or Aurora DB cluster. These secrets are stored within Amazon Secrets Manager.",
                      "nested_items": []
                    },
                    {
                      "name": "IAMAuth",
                      "type": "string",
                      "description": "Whether to require or disallow Amazon Web Services Identity and Access Management (IAM) authentication for connections to the proxy.",
                      "nested_items": []
                    },
                    {
                      "name": "ClientPasswordAuthType",
                      "type": "string",
                      "description": "The type of authentication the proxy uses for connections from clients.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "RoleArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) for the IAM role that the proxy uses to access Amazon Secrets Manager.",
              "nested_items": []
            },
            {
              "name": "Endpoint",
              "type": "string",
              "description": "The endpoint that you can use to connect to the DB proxy. You include the endpoint value in the connection string for a database client application.",
              "nested_items": []
            },
            {
              "name": "RequireTLS",
              "type": "boolean",
              "description": "Indicates whether Transport Layer Security (TLS) encryption is required for connections to the proxy.",
              "nested_items": []
            },
            {
              "name": "IdleClientTimeout",
              "type": "integer",
              "description": "The number of seconds a connection to the proxy can have no activity before the proxy drops the client connection. The proxy keeps the underlying database connection open and puts it back into the connection pool for reuse by later connection requests.",
              "nested_items": []
            },
            {
              "name": "DebugLogging",
              "type": "boolean",
              "description": "Indicates whether the proxy includes detailed information about SQL statements in its logs. This information helps you to debug issues involving SQL behavior or the performance and scalability of the proxy connections. The debug information includes the text of SQL statements that you submit through the proxy. Thus, only enable this setting when needed for debugging, and only when you have security measures in place to safeguard any sensitive information that appears in the logs.",
              "nested_items": []
            },
            {
              "name": "CreatedDate",
              "type": "datetime",
              "description": "The date and time when the proxy was first created.",
              "nested_items": []
            },
            {
              "name": "UpdatedDate",
              "type": "datetime",
              "description": "The date and time when the proxy was last updated.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}