{
  "method_name": "describe_db_proxy_endpoints",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/rds/client/describe_db_proxy_endpoints.html",
  "description": "Returns information about DB proxy endpoints.",
  "parameters": [
    {
      "name": "DBProxyName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DBProxyEndpointName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": true,
      "description": "This parameter is not currently supported. (dict) --- A filter name and value pair that is used to return a more specific list of results from a describe operation. Filters can be used to match a set of resources by specific criteria, such as IDs. The filters supported by a describe operation are documented with the describe operation. The following actions can be filtered: DescribeDBClusterBacktracks DescribeDBClusterEndpoints DescribeDBClusters DescribeDBInstances DescribeDBRecommendations DescribeDBShardGroups DescribePendingMaintenanceActions The name of the filter. Filter names are case-sensitive. One or more filter values. Filter values are case-sensitive. (string) ---",
      "nested_params": []
    },
    {
      "name": "Marker",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxRecords",
      "type": "integer",
      "required": false,
      "description": "The maximum number of records to include in the response. If more records exist than the specified MaxRecords value, a pagination token called a marker is included in the response so that the remaining results can be retrieved. Default: 100 Constraints: Minimum 20, maximum 100.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "DBProxyEndpoints",
          "type": "list",
          "description": "The list of ProxyEndpoint objects returned by the API operation.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "DBProxyEndpointName",
                  "type": "string",
                  "description": "The name for the DB proxy endpoint. An identifier must begin with a letter and must contain only ASCII letters, digits, and hyphens; it can't end with a hyphen or contain two consecutive hyphens.",
                  "nested_items": []
                },
                {
                  "name": "DBProxyEndpointArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) for the DB proxy endpoint.",
                  "nested_items": []
                },
                {
                  "name": "DBProxyName",
                  "type": "string",
                  "description": "The identifier for the DB proxy that is associated with this DB proxy endpoint.",
                  "nested_items": []
                },
                {
                  "name": "Status",
                  "type": "string",
                  "description": "The current status of this DB proxy endpoint. A status of available means the endpoint is ready to handle requests. Other values indicate that you must wait for the endpoint to be ready, or take some action to resolve an issue.",
                  "nested_items": []
                },
                {
                  "name": "VpcId",
                  "type": "string",
                  "description": "Provides the VPC ID of the DB proxy endpoint.",
                  "nested_items": []
                },
                {
                  "name": "VpcSecurityGroupIds",
                  "type": "list",
                  "description": "Provides a list of VPC security groups that the DB proxy endpoint belongs to.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "VpcSubnetIds",
                  "type": "list",
                  "description": "The EC2 subnet IDs for the DB proxy endpoint.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Endpoint",
                  "type": "string",
                  "description": "The endpoint that you can use to connect to the DB proxy. You include the endpoint value in the connection string for a database client application.",
                  "nested_items": []
                },
                {
                  "name": "CreatedDate",
                  "type": "datetime",
                  "description": "The date and time when the DB proxy endpoint was first created.",
                  "nested_items": []
                },
                {
                  "name": "TargetRole",
                  "type": "string",
                  "description": "A value that indicates whether the DB proxy endpoint can be used for read/write or read-only operations.",
                  "nested_items": []
                },
                {
                  "name": "IsDefault",
                  "type": "boolean",
                  "description": "Indicates whether this endpoint is the default endpoint for the associated DB proxy. Default DB proxy endpoints always have read/write capability. Other endpoints that you associate with the DB proxy can be either read/write or read-only.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "Marker",
          "type": "string",
          "description": "An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by MaxRecords.",
          "nested_items": []
        }
      ]
    }
  ]
}