{
  "method_name": "describe_db_snapshot_tenant_databases",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/rds/client/describe_db_snapshot_tenant_databases.html",
  "description": "Describes the tenant databases that exist in a DB snapshot. This command only applies to RDS for Oracle DB instances in the multi-tenant configuration. You can use this command to inspect the tenant databases within a snapshot before restoring it. You can't directly interact with the tenant databases in a DB snapshot. If you restore a snapshot that was taken from DB instance using the multi-tenant configuration, you restore all its tenant databases.",
  "parameters": [
    {
      "name": "DBInstanceIdentifier",
      "type": "string",
      "required": false,
      "description": "The ID of the DB instance used to create the DB snapshots. This parameter isn't case-sensitive. Constraints: If supplied, must match the identifier of an existing DBInstance.",
      "nested_params": []
    },
    {
      "name": "DBSnapshotIdentifier",
      "type": "string",
      "required": false,
      "description": "The ID of a DB snapshot that contains the tenant databases to describe. This value is stored as a lowercase string. Constraints: If you specify this parameter, the value must match the ID of an existing DB snapshot. If you specify an automatic snapshot, you must also specify SnapshotType.",
      "nested_params": []
    },
    {
      "name": "SnapshotType",
      "type": "string",
      "required": false,
      "description": "The type of DB snapshots to be returned. You can specify one of the following values: automated --- All DB snapshots that have been automatically taken by Amazon RDS for my Amazon Web Services account. manual --- All DB snapshots that have been taken by my Amazon Web Services account. shared --- All manual DB snapshots that have been shared to my Amazon Web Services account. public --- All DB snapshots that have been marked as public. awsbackup --- All DB snapshots managed by the Amazon Web Services Backup service.",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": true,
      "description": "A filter that specifies one or more tenant databases to describe. Supported filters: tenant-db-name - Tenant database names. The results list only includes information about the tenant databases that match these tenant DB names. tenant-database-resource-id - Tenant database resource identifiers. The results list only includes information about the tenant databases contained within the DB snapshots. dbi-resource-id - DB instance resource identifiers. The results list only includes information about snapshots containing tenant databases contained within the DB instances identified by these resource identifiers. db-instance-id - Accepts DB instance identifiers and DB instance Amazon Resource Names (ARNs). db-snapshot-id - Accepts DB snapshot identifiers. snapshot-type - Accepts types of DB snapshots. (dict) --- A filter name and value pair that is used to return a more specific list of results from a describe operation. Filters can be used to match a set of resources by specific criteria, such as IDs. The filters supported by a describe operation are documented with the describe operation. The following actions can be filtered: DescribeDBClusterBacktracks DescribeDBClusterEndpoints DescribeDBClusters DescribeDBInstances DescribeDBRecommendations DescribeDBShardGroups DescribePendingMaintenanceActions The name of the filter. Filter names are case-sensitive. One or more filter values. Filter values are case-sensitive. (string) ---",
      "nested_params": []
    },
    {
      "name": "MaxRecords",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Marker",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DbiResourceId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Marker",
          "type": "string",
          "description": "An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by MaxRecords.",
          "nested_items": []
        },
        {
          "name": "DBSnapshotTenantDatabases",
          "type": "list",
          "description": "A list of DB snapshot tenant databases.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "DBSnapshotIdentifier",
                  "type": "string",
                  "description": "The identifier for the snapshot of the DB instance.",
                  "nested_items": []
                },
                {
                  "name": "DBInstanceIdentifier",
                  "type": "string",
                  "description": "The ID for the DB instance that contains the tenant databases.",
                  "nested_items": []
                },
                {
                  "name": "DbiResourceId",
                  "type": "string",
                  "description": "The resource identifier of the source CDB instance. This identifier can't be changed and is unique to an Amazon Web Services Region.",
                  "nested_items": []
                },
                {
                  "name": "EngineName",
                  "type": "string",
                  "description": "The name of the database engine.",
                  "nested_items": []
                },
                {
                  "name": "SnapshotType",
                  "type": "string",
                  "description": "The type of DB snapshot.",
                  "nested_items": []
                },
                {
                  "name": "TenantDatabaseCreateTime",
                  "type": "datetime",
                  "description": "The time the DB snapshot was taken, specified in Coordinated Universal Time (UTC). If you copy the snapshot, the creation time changes.",
                  "nested_items": []
                },
                {
                  "name": "TenantDBName",
                  "type": "string",
                  "description": "The name of the tenant database.",
                  "nested_items": []
                },
                {
                  "name": "MasterUsername",
                  "type": "string",
                  "description": "The master username of the tenant database.",
                  "nested_items": []
                },
                {
                  "name": "TenantDatabaseResourceId",
                  "type": "string",
                  "description": "The resource ID of the tenant database.",
                  "nested_items": []
                },
                {
                  "name": "CharacterSetName",
                  "type": "string",
                  "description": "The name of the character set of a tenant database.",
                  "nested_items": []
                },
                {
                  "name": "DBSnapshotTenantDatabaseARN",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) for the snapshot tenant database.",
                  "nested_items": []
                },
                {
                  "name": "NcharCharacterSetName",
                  "type": "string",
                  "description": "The NCHAR character set name of the tenant database.",
                  "nested_items": []
                },
                {
                  "name": "TagList",
                  "type": "list",
                  "description": "A list of tags.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Key",
                          "type": "string",
                          "description": "A key is the required name of the tag. The string value can be from 1 to 128 Unicode characters in length and can't be prefixed with aws: or rds:. The string can only contain only the set of Unicode letters, digits, white-space, --\u0098_', --\u0098.', --\u0098:', --\u0098/', --\u0098=', --\u0098+', --\u0098-', --\u0098@' (Java regex: '^([\\p{L}\\p{Z}\\p{N}_.:/=+\\-@]*)$').",
                          "nested_items": []
                        },
                        {
                          "name": "Value",
                          "type": "string",
                          "description": "A value is the optional value of the tag. The string value can be from 1 to 256 Unicode characters in length and can't be prefixed with aws: or rds:. The string can only contain only the set of Unicode letters, digits, white-space, --\u0098_', --\u0098.', --\u0098:', --\u0098/', --\u0098=', --\u0098+', --\u0098-', --\u0098@' (Java regex: '^([\\p{L}\\p{Z}\\p{N}_.:/=+\\-@]*)$').",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}