{
  "method_name": "describe_db_proxy_targets",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/rds/client/describe_db_proxy_targets.html",
  "description": "Returns information about DBProxyTarget objects. This API supports pagination.",
  "parameters": [
    {
      "name": "DBProxyName",
      "type": "string",
      "required": true,
      "description": "The identifier of the DBProxyTarget to describe.",
      "nested_params": []
    },
    {
      "name": "TargetGroupName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": true,
      "description": "This parameter is not currently supported. (dict) --- A filter name and value pair that is used to return a more specific list of results from a describe operation. Filters can be used to match a set of resources by specific criteria, such as IDs. The filters supported by a describe operation are documented with the describe operation. The following actions can be filtered: DescribeDBClusterBacktracks DescribeDBClusterEndpoints DescribeDBClusters DescribeDBInstances DescribeDBRecommendations DescribeDBShardGroups DescribePendingMaintenanceActions The name of the filter. Filter names are case-sensitive. One or more filter values. Filter values are case-sensitive. (string) ---",
      "nested_params": []
    },
    {
      "name": "Marker",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxRecords",
      "type": "integer",
      "required": false,
      "description": "The maximum number of records to include in the response. If more records exist than the specified MaxRecords value, a pagination token called a marker is included in the response so that the remaining results can be retrieved. Default: 100 Constraints: Minimum 20, maximum 100.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Targets",
          "type": "list",
          "description": "An arbitrary number of DBProxyTarget objects, containing details of the corresponding targets.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "TargetArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) for the RDS DB instance or Aurora DB cluster.",
                  "nested_items": []
                },
                {
                  "name": "Endpoint",
                  "type": "string",
                  "description": "The writer endpoint for the RDS DB instance or Aurora DB cluster.",
                  "nested_items": []
                },
                {
                  "name": "TrackedClusterId",
                  "type": "string",
                  "description": "The DB cluster identifier when the target represents an Aurora DB cluster. This field is blank when the target represents an RDS DB instance.",
                  "nested_items": []
                },
                {
                  "name": "RdsResourceId",
                  "type": "string",
                  "description": "The identifier representing the target. It can be the instance identifier for an RDS DB instance, or the cluster identifier for an Aurora DB cluster.",
                  "nested_items": []
                },
                {
                  "name": "Port",
                  "type": "integer",
                  "description": "The port that the RDS Proxy uses to connect to the target RDS DB instance or Aurora DB cluster.",
                  "nested_items": []
                },
                {
                  "name": "Type",
                  "type": "string",
                  "description": "Specifies the kind of database, such as an RDS DB instance or an Aurora DB cluster, that the target represents.",
                  "nested_items": []
                },
                {
                  "name": "Role",
                  "type": "string",
                  "description": "A value that indicates whether the target of the proxy can be used for read/write or read-only operations.",
                  "nested_items": []
                },
                {
                  "name": "TargetHealth",
                  "type": "dict",
                  "description": "Information about the connection health of the RDS Proxy target.",
                  "nested_items": [
                    {
                      "name": "State",
                      "type": "string",
                      "description": "The current state of the connection health lifecycle for the RDS Proxy target. The following is a typical lifecycle example for the states of an RDS Proxy target:",
                      "nested_items": []
                    },
                    {
                      "name": "Reason",
                      "type": "string",
                      "description": "The reason for the current health State of the RDS Proxy target.",
                      "nested_items": []
                    },
                    {
                      "name": "Description",
                      "type": "string",
                      "description": "A description of the health of the RDS Proxy target. If the State is AVAILABLE, a description is not included.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Marker",
          "type": "string",
          "description": "An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by MaxRecords.",
          "nested_items": []
        }
      ]
    }
  ]
}