{
  "method_name": "describe_account_attributes",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/rds/client/describe_account_attributes.html",
  "description": "Lists all of the attributes for a customer account. The attributes include Amazon RDS quotas for the account, such as the number of DB instances allowed. The description for a quota includes the quota name, current usage toward that quota, and the quota's maximum value. This command doesn't take any parameters.",
  "parameters": [],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "AccountQuotas",
          "type": "list",
          "description": "A list of AccountQuota objects. Within this list, each quota has a name, a count of usage toward the quota maximum, and a maximum value for the quota.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "AllocatedStorage - The total allocated storage per account, in GiB. The used value is the total allocated storage in the account, in GiB.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "AuthorizationsPerDBSecurityGroup - The number of ingress rules per DB security group. The used value is the highest number of ingress rules in a DB security group in the account. Other DB security groups in the account might have a lower number of ingress rules.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "CustomEndpointsPerDBCluster - The number of custom endpoints per DB cluster. The used value is the highest number of custom endpoints in a DB clusters in the account. Other DB clusters in the account might have a lower number of custom endpoints.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "DBClusterParameterGroups - The number of DB cluster parameter groups per account, excluding default parameter groups. The used value is the count of nondefault DB cluster parameter groups in the account.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "IAM",
                  "description": "DBClusterRoles - The number of associated Amazon Web Services Identity and Access Management (IAM) roles per DB cluster. The used value is the highest number of associated IAM roles for a DB cluster in the account. Other DB clusters in the account might have a lower number of associated IAM roles.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "DBClusters - The number of DB clusters per account. The used value is the count of DB clusters in the account.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "DBInstanceRoles - The number of associated IAM roles per DB instance. The used value is the highest number of associated IAM roles for a DB instance in the account. Other DB instances in the account might have a lower number of associated IAM roles.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "DBInstances - The number of DB instances per account. The used value is the count of the DB instances in the account. Amazon RDS DB instances, Amazon Aurora DB instances, Amazon Neptune instances, and Amazon DocumentDB instances apply to this quota.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "DBParameterGroups - The number of DB parameter groups per account, excluding default parameter groups. The used value is the count of nondefault DB parameter groups in the account.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "not VPC security groups",
                  "description": "DBSecurityGroups - The number of DB security groups (not VPC security groups) per account, excluding the default security group. The used value is the count of nondefault DB security groups in the account.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "DBSubnetGroups - The number of DB subnet groups per account. The used value is the count of the DB subnet groups in the account.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "EventSubscriptions - The number of event subscriptions per account. The used value is the count of the event subscriptions in the account.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "ManualClusterSnapshots - The number of manual DB cluster snapshots per account. The used value is the count of the manual DB cluster snapshots in the account.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "ManualSnapshots - The number of manual DB instance snapshots per account. The used value is the count of the manual DB instance snapshots in the account.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "OptionGroups - The number of DB option groups per account, excluding default option groups. The used value is the count of nondefault DB option groups in the account.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "ReadReplicasPerMaster - The number of read replicas per DB instance. The used value is the highest number of read replicas for a DB instance in the account. Other DB instances in the account might have a lower number of read replicas.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "ReservedDBInstances - The number of reserved DB instances per account. The used value is the count of the active reserved DB instances in the account.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "SubnetsPerDBSubnetGroup - The number of subnets per DB subnet group. The used value is highest number of subnets for a DB subnet group in the account. Other DB subnet groups in the account might have a lower number of subnets.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}