{
  "method_name": "describe_source_regions",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/rds/client/describe_source_regions.html",
  "description": "Returns a list of the source Amazon Web Services Regions where the current Amazon Web Services Region can create a read replica, copy a DB snapshot from, or replicate automated backups from. Use this operation to determine whether cross-Region features are supported between other Regions and your current Region. This operation supports pagination. To return information about the Regions that are enabled for your account, or all Regions, use the EC2 operation DescribeRegions. For more information, see DescribeRegions in the Amazon EC2 API Reference.",
  "parameters": [
    {
      "name": "RegionName",
      "type": "string",
      "required": false,
      "description": "The source Amazon Web Services Region name. For example, us-east-1. Constraints: Must specify a valid Amazon Web Services Region name.",
      "nested_params": []
    },
    {
      "name": "MaxRecords",
      "type": "integer",
      "required": false,
      "description": "The maximum number of records to include in the response. If more records exist than the specified MaxRecords value, a pagination token called a marker is included in the response so you can retrieve the remaining results. Default: 100 Constraints: Minimum 20, maximum 100.",
      "nested_params": []
    },
    {
      "name": "Marker",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": true,
      "description": "This parameter isn't currently supported. (dict) --- A filter name and value pair that is used to return a more specific list of results from a describe operation. Filters can be used to match a set of resources by specific criteria, such as IDs. The filters supported by a describe operation are documented with the describe operation. The following actions can be filtered: DescribeDBClusterBacktracks DescribeDBClusterEndpoints DescribeDBClusters DescribeDBInstances DescribeDBRecommendations DescribeDBShardGroups DescribePendingMaintenanceActions The name of the filter. Filter names are case-sensitive. One or more filter values. Filter values are case-sensitive. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Marker",
          "type": "string",
          "description": "An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by MaxRecords.",
          "nested_items": []
        },
        {
          "name": "SourceRegions",
          "type": "list",
          "description": "A list of SourceRegion instances that contains each source Amazon Web Services Region that the current Amazon Web Services Region can get a read replica or a DB snapshot from.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "RegionName",
                  "type": "string",
                  "description": "The name of the source Amazon Web Services Region.",
                  "nested_items": []
                },
                {
                  "name": "Endpoint",
                  "type": "string",
                  "description": "The endpoint for the source Amazon Web Services Region endpoint.",
                  "nested_items": []
                },
                {
                  "name": "Status",
                  "type": "string",
                  "description": "The status of the source Amazon Web Services Region.",
                  "nested_items": []
                },
                {
                  "name": "SupportsDBInstanceAutomatedBackupsReplication",
                  "type": "boolean",
                  "description": "Indicates whether the source Amazon Web Services Region supports replicating automated backups to the current Amazon Web Services Region.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}