{
  "method_name": "describe_pending_maintenance_actions",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/rds/client/describe_pending_maintenance_actions.html",
  "description": "Returns a list of resources (for example, DB instances) that have at least one pending maintenance action. This API follows an eventual consistency model. This means that the result of the DescribePendingMaintenanceActions command might not be immediately visible to all subsequent RDS commands. Keep this in mind when you use DescribePendingMaintenanceActions immediately after using a previous API command such as ApplyPendingMaintenanceActions.",
  "parameters": [
    {
      "name": "ResourceIdentifier",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": true,
      "description": "A filter that specifies one or more resources to return pending maintenance actions for. Supported filters: db-cluster-id - Accepts DB cluster identifiers and DB cluster Amazon Resource Names (ARNs). The results list only includes pending maintenance actions for the DB clusters identified by these ARNs. db-instance-id - Accepts DB instance identifiers and DB instance ARNs. The results list only includes pending maintenance actions for the DB instances identified by these ARNs. (dict) --- A filter name and value pair that is used to return a more specific list of results from a describe operation. Filters can be used to match a set of resources by specific criteria, such as IDs. The filters supported by a describe operation are documented with the describe operation. The following actions can be filtered: DescribeDBClusterBacktracks DescribeDBClusterEndpoints DescribeDBClusters DescribeDBInstances DescribeDBRecommendations DescribeDBShardGroups DescribePendingMaintenanceActions The name of the filter. Filter names are case-sensitive. One or more filter values. Filter values are case-sensitive. (string) ---",
      "nested_params": []
    },
    {
      "name": "Marker",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxRecords",
      "type": "integer",
      "required": false,
      "description": "The maximum number of records to include in the response. If more records exist than the specified MaxRecords value, a pagination token called a marker is included in the response so that you can retrieve the remaining results. Default: 100 Constraints: Minimum 20, maximum 100.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "PendingMaintenanceActions",
          "type": "list",
          "description": "A list of the pending maintenance actions for the resource.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ResourceIdentifier",
                  "type": "string",
                  "description": "The ARN of the resource that has pending maintenance actions.",
                  "nested_items": []
                },
                {
                  "name": "PendingMaintenanceActionDetails",
                  "type": "list",
                  "description": "A list that provides details about the pending maintenance actions for the resource.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Action",
                          "type": "string",
                          "description": "The type of pending maintenance action that is available for the resource.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "",
                              "description": "ca-certificate-rotation.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "db-upgrade.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "hardware-maintenance.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "os-upgrade.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "system-update.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "AutoAppliedAfterDate",
                          "type": "datetime",
                          "description": "The date of the maintenance window when the action is applied. The maintenance action is applied to the resource during its first maintenance window after this date.",
                          "nested_items": []
                        },
                        {
                          "name": "ForcedApplyDate",
                          "type": "datetime",
                          "description": "The date when the maintenance action is automatically applied.",
                          "nested_items": []
                        },
                        {
                          "name": "OptInStatus",
                          "type": "string",
                          "description": "Indicates the type of opt-in request that has been received for the resource.",
                          "nested_items": []
                        },
                        {
                          "name": "CurrentApplyDate",
                          "type": "datetime",
                          "description": "The effective date when the pending maintenance action is applied to the resource. This date takes into account opt-in requests received from the ApplyPendingMaintenanceAction API, the AutoAppliedAfterDate, and the ForcedApplyDate. This value is blank if an opt-in request has not been received and nothing has been specified as AutoAppliedAfterDate or ForcedApplyDate.",
                          "nested_items": []
                        },
                        {
                          "name": "Description",
                          "type": "string",
                          "description": "A description providing more detail about the maintenance action.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Marker",
          "type": "string",
          "description": "An optional pagination token provided by a previous DescribePendingMaintenanceActions request. If this parameter is specified, the response includes only records beyond the marker, up to a number of records specified by MaxRecords.",
          "nested_items": []
        }
      ]
    }
  ]
}