{
  "method_name": "describe_db_snapshot_attributes",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/rds/client/describe_db_snapshot_attributes.html",
  "description": "Returns a list of DB snapshot attribute names and values for a manual DB snapshot. When sharing snapshots with other Amazon Web Services accounts, DescribeDBSnapshotAttributes returns the restore attribute and a list of IDs for the Amazon Web Services accounts that are authorized to copy or restore the manual DB snapshot. If all is included in the list of values for the restore attribute, then the manual DB snapshot is public and can be copied or restored by all Amazon Web Services accounts. To add or remove access for an Amazon Web Services account to copy or restore a manual DB snapshot, or to make the manual DB snapshot public or private, use the ModifyDBSnapshotAttribute API action.",
  "parameters": [
    {
      "name": "DBSnapshotIdentifier",
      "type": "string",
      "required": true,
      "description": "The identifier for the DB snapshot to describe the attributes for.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "DBSnapshotAttributesResult",
          "type": "dict",
          "description": "Contains the results of a successful call to the DescribeDBSnapshotAttributes API action.",
          "nested_items": [
            {
              "name": "DBSnapshotIdentifier",
              "type": "string",
              "description": "The identifier of the manual DB snapshot that the attributes apply to.",
              "nested_items": []
            },
            {
              "name": "DBSnapshotAttributes",
              "type": "list",
              "description": "The list of attributes and values for the manual DB snapshot.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "AttributeName",
                      "type": "string",
                      "description": "The name of the manual DB snapshot attribute.",
                      "nested_items": []
                    },
                    {
                      "name": "AttributeValues",
                      "type": "list",
                      "description": "The value or values for the manual DB snapshot attribute.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}