{
  "method_name": "describe_db_cluster_backtracks",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/rds/client/describe_db_cluster_backtracks.html",
  "description": "Returns information about backtracks for a DB cluster. For more information on Amazon Aurora, see What is Amazon Aurora? in the Amazon Aurora User Guide.",
  "parameters": [
    {
      "name": "DBClusterIdentifier",
      "type": "string",
      "required": true,
      "description": "The DB cluster identifier of the DB cluster to be described. This parameter is stored as a lowercase string. Constraints: Must contain from 1 to 63 alphanumeric characters or hyphens. First character must be a letter. Can't end with a hyphen or contain two consecutive hyphens. Example: my-cluster1",
      "nested_params": []
    },
    {
      "name": "BacktrackIdentifier",
      "type": "string",
      "required": false,
      "description": "If specified, this value is the backtrack identifier of the backtrack to be described. Constraints: Must contain a valid universally unique identifier (UUID). For more information about UUIDs, see Universally unique identifier. Example: 123e4567-e89b-12d3-a456-426655440000",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": true,
      "description": "A filter that specifies one or more DB clusters to describe. Supported filters include the following: db-cluster-backtrack-id - Accepts backtrack identifiers. The results list includes information about only the backtracks identified by these identifiers. db-cluster-backtrack-status - Accepts any of the following backtrack status values: applying completed failed pending The results list includes information about only the backtracks identified by these values. (dict) --- A filter name and value pair that is used to return a more specific list of results from a describe operation. Filters can be used to match a set of resources by specific criteria, such as IDs. The filters supported by a describe operation are documented with the describe operation. The following actions can be filtered: DescribeDBClusterBacktracks DescribeDBClusterEndpoints DescribeDBClusters DescribeDBInstances DescribeDBRecommendations DescribeDBShardGroups DescribePendingMaintenanceActions The name of the filter. Filter names are case-sensitive. One or more filter values. Filter values are case-sensitive. (string) ---",
      "nested_params": []
    },
    {
      "name": "MaxRecords",
      "type": "integer",
      "required": false,
      "description": "The maximum number of records to include in the response. If more records exist than the specified MaxRecords value, a pagination token called a marker is included in the response so you can retrieve the remaining results. Default: 100 Constraints: Minimum 20, maximum 100.",
      "nested_params": []
    },
    {
      "name": "Marker",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Marker",
          "type": "string",
          "description": "A pagination token that can be used in a later DescribeDBClusterBacktracks request.",
          "nested_items": []
        },
        {
          "name": "DBClusterBacktracks",
          "type": "list",
          "description": "Contains a list of backtracks for the user.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "DBClusterIdentifier",
                  "type": "string",
                  "description": "Contains a user-supplied DB cluster identifier. This identifier is the unique key that identifies a DB cluster.",
                  "nested_items": []
                },
                {
                  "name": "BacktrackIdentifier",
                  "type": "string",
                  "description": "Contains the backtrack identifier.",
                  "nested_items": []
                },
                {
                  "name": "BacktrackTo",
                  "type": "datetime",
                  "description": "The timestamp of the time to which the DB cluster was backtracked.",
                  "nested_items": []
                },
                {
                  "name": "BacktrackedFrom",
                  "type": "datetime",
                  "description": "The timestamp of the time from which the DB cluster was backtracked.",
                  "nested_items": []
                },
                {
                  "name": "BacktrackRequestCreationTime",
                  "type": "datetime",
                  "description": "The timestamp of the time at which the backtrack was requested.",
                  "nested_items": []
                },
                {
                  "name": "Status",
                  "type": "string",
                  "description": "The status of the backtrack. This property returns one of the following values:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "applying - The backtrack is currently being applied to or rolled back from the DB cluster.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "completed - The backtrack has successfully been applied to or rolled back from the DB cluster.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "failed - An error occurred while the backtrack was applied to or rolled back from the DB cluster.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "pending - The backtrack is currently pending application to or rollback from the DB cluster.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}