{
  "method_name": "download_db_log_file_portion",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/rds/client/download_db_log_file_portion.html",
  "description": "Downloads all or a portion of the specified log file, up to 1 MB in size. This command doesn't apply to RDS Custom.",
  "parameters": [
    {
      "name": "DBInstanceIdentifier",
      "type": "string",
      "required": true,
      "description": "The customer-assigned name of the DB instance that contains the log files you want to list. Constraints: Must match the identifier of an existing DBInstance.",
      "nested_params": []
    },
    {
      "name": "LogFileName",
      "type": "string",
      "required": true,
      "description": "The name of the log file to be downloaded.",
      "nested_params": []
    },
    {
      "name": "Marker",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NumberOfLines",
      "type": "integer",
      "required": false,
      "description": "The number of lines to download. If the number of lines specified results in a file over 1 MB in size, the file is truncated at 1 MB in size. If the NumberOfLines parameter is specified, then the block of lines returned can be from the beginning or the end of the log file, depending on the value of the Marker parameter. If neither Marker or NumberOfLines are specified, the entire log file is returned up to a maximum of 10000 lines, starting with the most recent log entries first. If NumberOfLines is specified and Marker isn't specified, then the most recent lines from the end of the log file are returned. If Marker is specified as '0', then the specified number of lines from the beginning of the log file are returned. You can download the log file in blocks of lines by specifying the size of the block using the NumberOfLines parameter, and by specifying a value of '0' for the Marker parameter in your first request. Include the Marker value returned in the response as the Marker value for the next request, continuing until the AdditionalDataPending response element returns false.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "LogFileData",
          "type": "string",
          "description": "Entries from the specified log file.",
          "nested_items": []
        },
        {
          "name": "Marker",
          "type": "string",
          "description": "A pagination token that can be used in a later DownloadDBLogFilePortion request.",
          "nested_items": []
        },
        {
          "name": "AdditionalDataPending",
          "type": "boolean",
          "description": "A Boolean value that, if true, indicates there is more data to be downloaded.",
          "nested_items": []
        }
      ]
    }
  ]
}