{
  "method_name": "modify_db_proxy_target_group",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/rds/client/modify_db_proxy_target_group.html",
  "description": "Modifies the properties of a DBProxyTargetGroup.",
  "parameters": [
    {
      "name": "TargetGroupName",
      "type": "string",
      "required": true,
      "description": "The name of the target group to modify.",
      "nested_params": []
    },
    {
      "name": "DBProxyName",
      "type": "string",
      "required": true,
      "description": "The name of the proxy.",
      "nested_params": []
    },
    {
      "name": "ConnectionPoolConfig",
      "type": "dict",
      "required": false,
      "description": "The settings that determine the size and behavior of the connection pool for the target group. MaxConnectionsPercent (integer) --- The maximum size of the connection pool for each target in a target group. The value is expressed as a percentage of the max_connections setting for the RDS DB instance or Aurora DB cluster used by the target group. If you specify MaxIdleConnectionsPercent, then you must also include a value for this parameter. Default: 10 for RDS for Microsoft SQL Server, and 100 for all other engines Constraints: Must be between 1 and 100. MaxIdleConnectionsPercent (integer) --- A value that controls how actively the proxy closes idle database connections in the connection pool. With a high value, the proxy leaves a high percentage of idle database connections open. A low value causes the proxy to close more idle connections and return them to the database. If you specify this parameter, then you must also include a value for MaxConnectionsPercent. Default: The default value is half of the value of MaxConnectionsPercent. For example, if MaxConnectionsPercent is 80, then the default value of MaxIdleConnectionsPercent is 40. If the value of MaxConnectionsPercent isn't specified, then for SQL Server, MaxIdleConnectionsPercent is 5, and for all other engines, the default is 50. Constraints: Must be between 0 and the value of MaxConnectionsPercent. ConnectionBorrowTimeout (integer) --- The number of seconds for a proxy to wait for a connection to become available in the connection pool. This setting only applies when the proxy has opened its maximum number of connections and all connections are busy with client sessions. Default: 120 Constraints: Must be between 0 and 300. SessionPinningFilters (list) --- Each item in the list represents a class of SQL operations that normally cause all later statements in a session using a proxy to be pinned to the same underlying database connection. Including an item in the list exempts that class of SQL operations from the pinning behavior. Default: no session pinning filters (string) --- InitQuery (string) --- Add an initialization query, or modify the current one. You can specify one or more SQL statements for the proxy to run when opening each new database connection. The setting is typically used with SET statements to make sure that each connection has identical settings. Make sure the query added here is valid. This is an optional field, so you can choose to leave it empty. For including multiple variables in a single SET statement, use a comma separator. For example: SET variable1=value1, variable2=value2 Default: no initialization query.",
      "nested_params": [
        {
          "name": "MaxConnectionsPercent",
          "type": "integer",
          "required": false,
          "description": "The maximum size of the connection pool for each target in a target group. The value is expressed as a percentage of the max_connections setting for the RDS DB instance or Aurora DB cluster used by the target group. If you specify MaxIdleConnectionsPercent, then you must also include a value for this parameter. Default: 10 for RDS for Microsoft SQL Server, and 100 for all other engines Constraints:",
          "nested_params": []
        },
        {
          "name": "MaxIdleConnectionsPercent",
          "type": "integer",
          "required": false,
          "description": "A value that controls how actively the proxy closes idle database connections in the connection pool. The value is expressed as a percentage of the max_connections setting for the RDS DB instance or Aurora DB cluster used by the target group. With a high value, the proxy leaves a high percentage of idle database connections open. A low value causes the proxy to close more idle connections and return them to the database. If you specify this parameter, then you must also include a value for MaxConnectionsPercent. Default: The default value is half of the value of MaxConnectionsPercent. For example, if MaxConnectionsPercent is 80, then the default value of MaxIdleConnectionsPercent is 40. If the value of MaxConnectionsPercent isn't specified, then for SQL Server, MaxIdleConnectionsPercent is 5, and for all other engines, the default is 50. Constraints:",
          "nested_params": []
        },
        {
          "name": "ConnectionBorrowTimeout",
          "type": "integer",
          "required": false,
          "description": "The number of seconds for a proxy to wait for a connection to become available in the connection pool. This setting only applies when the proxy has opened its maximum number of connections and all connections are busy with client sessions. Default: 120 Constraints:",
          "nested_params": []
        },
        {
          "name": "SessionPinningFilters",
          "type": "list",
          "required": false,
          "description": "Each item in the list represents a class of SQL operations that normally cause all later statements in a session using a proxy to be pinned to the same underlying database connection. Including an item in the list exempts that class of SQL operations from the pinning behavior. Default: no session pinning filters.",
          "nested_params": []
        },
        {
          "name": "InitQuery",
          "type": "string",
          "required": false,
          "description": "Add an initialization query, or modify the current one. You can specify one or more SQL statements for the proxy to run when opening each new database connection. The setting is typically used with SET statements to make sure that each connection has identical settings. Make sure the query added here is valid. This is an optional field, so you can choose to leave it empty. For including multiple variables in a single SET statement, use a comma separator. For example: SET variable1=value1, variable2=value2 Default: no initialization query.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "NewName",
      "type": "string",
      "required": false,
      "description": "The new name for the modified DBProxyTarget. An identifier must begin with a letter and must contain only ASCII letters, digits, and hyphens; it can't end with a hyphen or contain two consecutive hyphens. You can't rename the default target group.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "DBProxyTargetGroup",
          "type": "dict",
          "description": "The settings of the modified DBProxyTarget.",
          "nested_items": [
            {
              "name": "DBProxyName",
              "type": "string",
              "description": "The identifier for the RDS proxy associated with this target group.",
              "nested_items": []
            },
            {
              "name": "TargetGroupName",
              "type": "string",
              "description": "The identifier for the target group. This name must be unique for all target groups owned by your Amazon Web Services account in the specified Amazon Web Services Region.",
              "nested_items": []
            },
            {
              "name": "TargetGroupArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) representing the target group.",
              "nested_items": []
            },
            {
              "name": "IsDefault",
              "type": "boolean",
              "description": "Indicates whether this target group is the first one used for connection requests by the associated proxy. Because each proxy is currently associated with a single target group, currently this setting is always true.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The current status of this target group. A status of available means the target group is correctly associated with a database. Other values indicate that you must wait for the target group to be ready, or take some action to resolve an issue.",
              "nested_items": []
            },
            {
              "name": "ConnectionPoolConfig",
              "type": "dict",
              "description": "The settings that determine the size and behavior of the connection pool for the target group.",
              "nested_items": [
                {
                  "name": "MaxConnectionsPercent",
                  "type": "integer",
                  "description": "The maximum size of the connection pool for each target in a target group. The value is expressed as a percentage of the max_connections setting for the RDS DB instance or Aurora DB cluster used by the target group.",
                  "nested_items": []
                },
                {
                  "name": "MaxIdleConnectionsPercent",
                  "type": "integer",
                  "description": "Controls how actively the proxy closes idle database connections in the connection pool. The value is expressed as a percentage of the max_connections setting for the RDS DB instance or Aurora DB cluster used by the target group. With a high value, the proxy leaves a high percentage of idle database connections open. A low value causes the proxy to close more idle connections and return them to the database.",
                  "nested_items": []
                },
                {
                  "name": "ConnectionBorrowTimeout",
                  "type": "integer",
                  "description": "The number of seconds for a proxy to wait for a connection to become available in the connection pool. Only applies when the proxy has opened its maximum number of connections and all connections are busy with client sessions.",
                  "nested_items": []
                },
                {
                  "name": "SessionPinningFilters",
                  "type": "list",
                  "description": "Each item in the list represents a class of SQL operations that normally cause all later statements in a session using a proxy to be pinned to the same underlying database connection. Including an item in the list exempts that class of SQL operations from the pinning behavior. This setting is only supported for MySQL engine family databases. Currently, the only allowed value is EXCLUDE_VARIABLE_SETS.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "InitQuery",
                  "type": "string",
                  "description": "One or more SQL statements for the proxy to run when opening each new database connection. The setting is typically used with SET statements to make sure that each connection has identical settings. The query added here must be valid. For including multiple variables in a single SET statement, use a comma separator. This is an optional field.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "CreatedDate",
              "type": "datetime",
              "description": "The date and time when the target group was first created.",
              "nested_items": []
            },
            {
              "name": "UpdatedDate",
              "type": "datetime",
              "description": "The date and time when the target group was last updated.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}