{
  "method_name": "create_sms_template",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/pinpoint/client/create_sms_template.html",
  "description": "Creates a message template for messages that are sent through the SMS channel.",
  "parameters": [
    {
      "name": "SMSTemplateRequest",
      "type": "dict",
      "required": true,
      "description": "Specifies the content and settings for a message template that can be used in text messages that are sent through the SMS channel. Body (string) --- The message body to use in text messages that are based on the message template. DefaultSubstitutions (string) --- A JSON object that specifies the default values to use for message variables in the message template. This object is a set of key-value pairs. Each key defines a message variable in the template. The corresponding value defines the default value for that variable. When you create a message that's based on the template, you can override these defaults with message-specific and address-specific variables and values. RecommenderId (string) --- The unique identifier for the recommender model to use for the message template. Amazon Pinpoint uses this value to determine how to retrieve and process data from a recommender model when it sends messages that use the template, if the template contains message variables for recommendation data. tags (dict) --- (Deprecated) A string-to-string map of key-value pairs that defines the tags to associate with the message template. Each tag consists of a required tag key and an associated tag value. (string) --- (string) --- TemplateDescription (string) --- A custom description of the message template.",
      "nested_params": [
        {
          "name": "Body",
          "type": "string",
          "required": false,
          "description": "The message body to use in text messages that are based on the message template.",
          "nested_params": []
        },
        {
          "name": "DefaultSubstitutions",
          "type": "string",
          "required": false,
          "description": "A JSON object that specifies the default values to use for message variables in the message template. This object is a set of key-value pairs. Each key defines a message variable in the template. The corresponding value defines the default value for that variable. When you create a message that's based on the template, you can override these defaults with message-specific and address-specific variables and values.",
          "nested_params": []
        },
        {
          "name": "RecommenderId",
          "type": "string",
          "required": false,
          "description": "The unique identifier for the recommender model to use for the message template. Amazon Pinpoint uses this value to determine how to retrieve and process data from a recommender model when it sends messages that use the template, if the template contains message variables for recommendation data.",
          "nested_params": []
        },
        {
          "name": "tags",
          "type": "dict",
          "required": false,
          "description": "(Deprecated) A string-to-string map of key-value pairs that defines the tags to associate with the message template. Each tag consists of a required tag key and an associated tag value.",
          "nested_params": []
        },
        {
          "name": "TemplateDescription",
          "type": "string",
          "required": false,
          "description": "A custom description of the message template.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "TemplateName",
      "type": "string",
      "required": true,
      "description": "The name of the message template. A template name must start with an alphanumeric character and can contain a maximum of 128 characters. The characters can be alphanumeric characters, underscores (_), or hyphens (-). Template names are case sensitive.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "CreateTemplateMessageBody",
          "type": "dict",
          "description": "Provides information about a request to create a message template.",
          "nested_items": [
            {
              "name": "Arn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the message template that was created.",
              "nested_items": []
            },
            {
              "name": "Message",
              "type": "string",
              "description": "The message that's returned from the API for the request to create the message template.",
              "nested_items": []
            },
            {
              "name": "RequestID",
              "type": "string",
              "description": "The unique identifier for the request to create the message template.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}