{
  "method_name": "create_voice_template",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/pinpoint/client/create_voice_template.html",
  "description": "Creates a message template for messages that are sent through the voice channel.",
  "parameters": [
    {
      "name": "TemplateName",
      "type": "string",
      "required": true,
      "description": "The name of the message template. A template name must start with an alphanumeric character and can contain a maximum of 128 characters. The characters can be alphanumeric characters, underscores (_), or hyphens (-). Template names are case sensitive.",
      "nested_params": []
    },
    {
      "name": "VoiceTemplateRequest",
      "type": "dict",
      "required": true,
      "description": "Specifies the content and settings for a message template that can be used in messages that are sent through the voice channel. Body (string) --- The text of the script to use in messages that are based on the message template, in plain text format. DefaultSubstitutions (string) --- A JSON object that specifies the default values to use for message variables in the message template. This object is a set of key-value pairs. Each key defines a message variable in the template. The corresponding value defines the default value for that variable. When you create a message that's based on the template, you can override these defaults with message-specific and address-specific variables and values. LanguageCode (string) --- The code for the language to use when synthesizing the text of the script in messages that are based on the message template. For a list of supported languages and the code for each one, see the Amazon Polly Developer Guide. tags (dict) --- (Deprecated) A string-to-string map of key-value pairs that defines the tags to associate with the message template. Each tag consists of a required tag key and an associated tag value. (string) --- (string) --- TemplateDescription (string) --- A custom description of the message template. VoiceId (string) --- The name of the voice to use when delivering messages that are based on the message template. For a list of supported voices, see the Amazon Polly Developer Guide.",
      "nested_params": [
        {
          "name": "Body",
          "type": "string",
          "required": false,
          "description": "The text of the script to use in messages that are based on the message template, in plain text format.",
          "nested_params": []
        },
        {
          "name": "DefaultSubstitutions",
          "type": "string",
          "required": false,
          "description": "A JSON object that specifies the default values to use for message variables in the message template. This object is a set of key-value pairs. Each key defines a message variable in the template. The corresponding value defines the default value for that variable. When you create a message that's based on the template, you can override these defaults with message-specific and address-specific variables and values.",
          "nested_params": []
        },
        {
          "name": "LanguageCode",
          "type": "string",
          "required": false,
          "description": "The code for the language to use when synthesizing the text of the script in messages that are based on the message template. For a list of supported languages and the code for each one, see the Amazon Polly Developer Guide.",
          "nested_params": []
        },
        {
          "name": "tags",
          "type": "dict",
          "required": false,
          "description": "(Deprecated) A string-to-string map of key-value pairs that defines the tags to associate with the message template. Each tag consists of a required tag key and an associated tag value.",
          "nested_params": []
        },
        {
          "name": "TemplateDescription",
          "type": "string",
          "required": false,
          "description": "A custom description of the message template.",
          "nested_params": []
        },
        {
          "name": "VoiceId",
          "type": "string",
          "required": false,
          "description": "The name of the voice to use when delivering messages that are based on the message template. For a list of supported voices, see the Amazon Polly Developer Guide.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "CreateTemplateMessageBody",
          "type": "dict",
          "description": "Provides information about a request to create a message template.",
          "nested_items": [
            {
              "name": "Arn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the message template that was created.",
              "nested_items": []
            },
            {
              "name": "Message",
              "type": "string",
              "description": "The message that's returned from the API for the request to create the message template.",
              "nested_items": []
            },
            {
              "name": "RequestID",
              "type": "string",
              "description": "The unique identifier for the request to create the message template.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}