{
  "method_name": "delete_event_stream",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/pinpoint/client/delete_event_stream.html",
  "description": "Deletes the event stream for an application.",
  "parameters": [
    {
      "name": "ApplicationId",
      "type": "string",
      "required": true,
      "description": "The unique identifier for the application. This identifier is displayed as the Project ID on the Amazon Pinpoint console.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "EventStream",
          "type": "dict",
          "description": "Specifies settings for publishing event data to an Amazon Kinesis data stream or an Amazon Kinesis Data Firehose delivery stream.",
          "nested_items": [
            {
              "name": "ApplicationId",
              "type": "string",
              "description": "The unique identifier for the application to publish event data for.",
              "nested_items": []
            },
            {
              "name": "DestinationStreamArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the Amazon Kinesis data stream or Amazon Kinesis Data Firehose delivery stream to publish event data to.",
              "nested_items": []
            },
            {
              "name": "ExternalId",
              "type": "string",
              "description": "(Deprecated) Your AWS account ID, which you assigned to an external ID key in an IAM trust policy. Amazon Pinpoint previously used this value to assume an IAM role when publishing event data, but we removed this requirement. We don't recommend use of external IDs for IAM roles that are assumed by Amazon Pinpoint.",
              "nested_items": []
            },
            {
              "name": "LastModifiedDate",
              "type": "string",
              "description": "The date, in ISO 8601 format, when the event stream was last modified.",
              "nested_items": []
            },
            {
              "name": "LastUpdatedBy",
              "type": "string",
              "description": "The IAM user who last modified the event stream.",
              "nested_items": []
            },
            {
              "name": "RoleArn",
              "type": "string",
              "description": "The AWS Identity and Access Management (IAM) role that authorizes Amazon Pinpoint to publish event data to the stream in your AWS account.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}