{
  "method_name": "get_segment_import_jobs",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/pinpoint/client/get_segment_import_jobs.html",
  "description": "Retrieves information about the status and settings of the import jobs for a segment.",
  "parameters": [
    {
      "name": "ApplicationId",
      "type": "string",
      "required": true,
      "description": "The unique identifier for the application. This identifier is displayed as the Project ID on the Amazon Pinpoint console.",
      "nested_params": []
    },
    {
      "name": "PageSize",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "SegmentId",
      "type": "string",
      "required": true,
      "description": "The unique identifier for the segment.",
      "nested_params": []
    },
    {
      "name": "Token",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ImportJobsResponse",
          "type": "dict",
          "description": "Provides information about the status and settings of all the import jobs that are associated with an application or segment. An import job is a job that imports endpoint definitions from one or more files.",
          "nested_items": [
            {
              "name": "Item",
              "type": "list",
              "description": "An array of responses, one for each import job that's associated with the application (Import Jobs resource) or segment (Segment Import Jobs resource).",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "ApplicationId",
                      "type": "string",
                      "description": "The unique identifier for the application that's associated with the import job.",
                      "nested_items": []
                    },
                    {
                      "name": "CompletedPieces",
                      "type": "integer",
                      "description": "The number of pieces that were processed successfully (completed) by the import job, as of the time of the request.",
                      "nested_items": []
                    },
                    {
                      "name": "CompletionDate",
                      "type": "string",
                      "description": "The date, in ISO 8601 format, when the import job was completed.",
                      "nested_items": []
                    },
                    {
                      "name": "CreationDate",
                      "type": "string",
                      "description": "The date, in ISO 8601 format, when the import job was created.",
                      "nested_items": []
                    },
                    {
                      "name": "Definition",
                      "type": "dict",
                      "description": "The resource settings that apply to the import job.",
                      "nested_items": [
                        {
                          "name": "DefineSegment",
                          "type": "boolean",
                          "description": "Specifies whether the import job creates a segment that contains the endpoints, when the endpoint definitions are imported.",
                          "nested_items": []
                        },
                        {
                          "name": "ExternalId",
                          "type": "string",
                          "description": "(Deprecated) Your AWS account ID, which you assigned to an external ID key in an IAM trust policy. Amazon Pinpoint previously used this value to assume an IAM role when importing endpoint definitions, but we removed this requirement. We don't recommend use of external IDs for IAM roles that are assumed by Amazon Pinpoint.",
                          "nested_items": []
                        },
                        {
                          "name": "Format",
                          "type": "string",
                          "description": "The format of the files that contain the endpoint definitions to import. Valid values are: CSV, for comma-separated values format; and, JSON, for newline-delimited JSON format.",
                          "nested_items": []
                        },
                        {
                          "name": "RegisterEndpoints",
                          "type": "boolean",
                          "description": "Specifies whether the import job registers the endpoints with Amazon Pinpoint, when the endpoint definitions are imported.",
                          "nested_items": []
                        },
                        {
                          "name": "RoleArn",
                          "type": "string",
                          "description": "The Amazon Resource Name (ARN) of the AWS Identity and Access Management (IAM) role that authorizes Amazon Pinpoint to access the Amazon S3 location to import endpoint definitions from.",
                          "nested_items": []
                        },
                        {
                          "name": "S3Url",
                          "type": "string",
                          "description": "The URL of the Amazon Simple Storage Service (Amazon S3) bucket that contains the endpoint definitions to import. This location can be a folder or a single file. If the location is a folder, Amazon Pinpoint imports endpoint definitions from the files in this location, including any subfolders that the folder contains.",
                          "nested_items": []
                        },
                        {
                          "name": "SegmentId",
                          "type": "string",
                          "description": "The identifier for the segment that the import job updates or adds endpoint definitions to, if the import job updates an existing segment.",
                          "nested_items": []
                        },
                        {
                          "name": "SegmentName",
                          "type": "string",
                          "description": "The custom name for the segment that's created by the import job, if the value of the DefineSegment property is true.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "FailedPieces",
                      "type": "integer",
                      "description": "The number of pieces that weren't processed successfully (failed) by the import job, as of the time of the request.",
                      "nested_items": []
                    },
                    {
                      "name": "Failures",
                      "type": "list",
                      "description": "An array of entries, one for each of the first 100 entries that weren't processed successfully (failed) by the import job, if any.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "Id",
                      "type": "string",
                      "description": "The unique identifier for the import job.",
                      "nested_items": []
                    },
                    {
                      "name": "JobStatus",
                      "type": "string",
                      "description": "The status of the import job. The job status is FAILED if Amazon Pinpoint wasn't able to process one or more pieces in the job.",
                      "nested_items": []
                    },
                    {
                      "name": "TotalFailures",
                      "type": "integer",
                      "description": "The total number of endpoint definitions that weren't processed successfully (failed) by the import job, typically because an error, such as a syntax error, occurred.",
                      "nested_items": []
                    },
                    {
                      "name": "TotalPieces",
                      "type": "integer",
                      "description": "The total number of pieces that must be processed to complete the import job. Each piece consists of an approximately equal portion of the endpoint definitions that are part of the import job.",
                      "nested_items": []
                    },
                    {
                      "name": "TotalProcessed",
                      "type": "integer",
                      "description": "The total number of endpoint definitions that were processed by the import job.",
                      "nested_items": []
                    },
                    {
                      "name": "Type",
                      "type": "string",
                      "description": "The job type. This value is IMPORT for import jobs.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "NextToken",
              "type": "string",
              "description": "The string to use in a subsequent request to get the next page of results in a paginated response. This value is null if there are no additional pages.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}