{
  "method_name": "get_voice_template",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/pinpoint/client/get_voice_template.html",
  "description": "Retrieves the content and settings of a message template for messages that are sent through the voice channel.",
  "parameters": [
    {
      "name": "TemplateName",
      "type": "string",
      "required": true,
      "description": "The name of the message template. A template name must start with an alphanumeric character and can contain a maximum of 128 characters. The characters can be alphanumeric characters, underscores (_), or hyphens (-). Template names are case sensitive.",
      "nested_params": []
    },
    {
      "name": "Version",
      "type": "string",
      "required": false,
      "description": "The unique identifier for the version of the message template to update, retrieve information about, or delete. To retrieve identifiers and other information for all the versions of a template, use the Template Versions resource. If specified, this value must match the identifier for an existing template version. If specified for an update operation, this value must match the identifier for the latest existing version of the template. This restriction helps ensure that race conditions don't occur. If you don't specify a value for this parameter, Amazon Pinpoint does the following: For a get operation, retrieves information about the active version of the template. For an update operation, saves the updates to (overwrites) the latest existing version of the template, if the create-new-version parameter isn't used or is set to false. For a delete operation, deletes the template, including all versions of the template.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "VoiceTemplateResponse",
          "type": "dict",
          "description": "Provides information about the content and settings for a message template that can be used in messages that are sent through the voice channel.",
          "nested_items": [
            {
              "name": "Arn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the message template.",
              "nested_items": []
            },
            {
              "name": "Body",
              "type": "string",
              "description": "The text of the script that's used in messages that are based on the message template, in plain text format.",
              "nested_items": []
            },
            {
              "name": "CreationDate",
              "type": "string",
              "description": "The date, in ISO 8601 format, when the message template was created.",
              "nested_items": []
            },
            {
              "name": "DefaultSubstitutions",
              "type": "string",
              "description": "The JSON object that specifies the default values that are used for message variables in the message template. This object is a set of key-value pairs. Each key defines a message variable in the template. The corresponding value defines the default value for that variable.",
              "nested_items": []
            },
            {
              "name": "LanguageCode",
              "type": "string",
              "description": "The code for the language that's used when synthesizing the text of the script in messages that are based on the message template. For a list of supported languages and the code for each one, see the Amazon Polly Developer Guide.",
              "nested_items": []
            },
            {
              "name": "LastModifiedDate",
              "type": "string",
              "description": "The date, in ISO 8601 format, when the message template was last modified.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "TemplateDescription",
              "type": "string",
              "description": "The custom description of the message template.",
              "nested_items": []
            },
            {
              "name": "TemplateName",
              "type": "string",
              "description": "The name of the message template.",
              "nested_items": []
            },
            {
              "name": "TemplateType",
              "type": "string",
              "description": "The type of channel that the message template is designed for. For a voice template, this value is VOICE.",
              "nested_items": []
            },
            {
              "name": "Version",
              "type": "string",
              "description": "The unique identifier, as an integer, for the active version of the message template, or the version of the template that you specified by using the version parameter in your request.",
              "nested_items": []
            },
            {
              "name": "VoiceId",
              "type": "string",
              "description": "The name of the voice that's used when delivering messages that are based on the message template. For a list of supported voices, see the Amazon Polly Developer Guide.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}