{
  "method_name": "get_export_job",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/pinpoint/client/get_export_job.html",
  "description": "Retrieves information about the status and settings of a specific export job for an application.",
  "parameters": [
    {
      "name": "ApplicationId",
      "type": "string",
      "required": true,
      "description": "The unique identifier for the application. This identifier is displayed as the Project ID on the Amazon Pinpoint console.",
      "nested_params": []
    },
    {
      "name": "JobId",
      "type": "string",
      "required": true,
      "description": "The unique identifier for the job.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ExportJobResponse",
          "type": "dict",
          "description": "Provides information about the status and settings of a job that exports endpoint definitions to a file. The file can be added directly to an Amazon Simple Storage Service (Amazon S3) bucket by using the Amazon Pinpoint API or downloaded directly to a computer by using the Amazon Pinpoint console.",
          "nested_items": [
            {
              "name": "ApplicationId",
              "type": "string",
              "description": "The unique identifier for the application that's associated with the export job.",
              "nested_items": []
            },
            {
              "name": "CompletedPieces",
              "type": "integer",
              "description": "The number of pieces that were processed successfully (completed) by the export job, as of the time of the request.",
              "nested_items": []
            },
            {
              "name": "CompletionDate",
              "type": "string",
              "description": "The date, in ISO 8601 format, when the export job was completed.",
              "nested_items": []
            },
            {
              "name": "CreationDate",
              "type": "string",
              "description": "The date, in ISO 8601 format, when the export job was created.",
              "nested_items": []
            },
            {
              "name": "Definition",
              "type": "dict",
              "description": "The resource settings that apply to the export job.",
              "nested_items": [
                {
                  "name": "RoleArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the AWS Identity and Access Management (IAM) role that authorized Amazon Pinpoint to access the Amazon S3 location where the endpoint definitions were exported to.",
                  "nested_items": []
                },
                {
                  "name": "S3UrlPrefix",
                  "type": "string",
                  "description": "The URL of the location in an Amazon Simple Storage Service (Amazon S3) bucket where the endpoint definitions were exported to. This location is typically a folder that contains multiple files. The URL should be in the following format: s3://bucket-name/folder-name/.",
                  "nested_items": []
                },
                {
                  "name": "SegmentId",
                  "type": "string",
                  "description": "The identifier for the segment that the endpoint definitions were exported from. If this value isn't present, Amazon Pinpoint exported definitions for all the endpoints that are associated with the application.",
                  "nested_items": []
                },
                {
                  "name": "SegmentVersion",
                  "type": "integer",
                  "description": "The version of the segment that the endpoint definitions were exported from.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "FailedPieces",
              "type": "integer",
              "description": "The number of pieces that weren't processed successfully (failed) by the export job, as of the time of the request.",
              "nested_items": []
            },
            {
              "name": "Failures",
              "type": "list",
              "description": "An array of entries, one for each of the first 100 entries that weren't processed successfully (failed) by the export job, if any.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Id",
              "type": "string",
              "description": "The unique identifier for the export job.",
              "nested_items": []
            },
            {
              "name": "JobStatus",
              "type": "string",
              "description": "The status of the export job. The job status is FAILED if Amazon Pinpoint wasn't able to process one or more pieces in the job.",
              "nested_items": []
            },
            {
              "name": "TotalFailures",
              "type": "integer",
              "description": "The total number of endpoint definitions that weren't processed successfully (failed) by the export job, typically because an error, such as a syntax error, occurred.",
              "nested_items": []
            },
            {
              "name": "TotalPieces",
              "type": "integer",
              "description": "The total number of pieces that must be processed to complete the export job. Each piece consists of an approximately equal portion of the endpoint definitions that are part of the export job.",
              "nested_items": []
            },
            {
              "name": "TotalProcessed",
              "type": "integer",
              "description": "The total number of endpoint definitions that were processed by the export job.",
              "nested_items": []
            },
            {
              "name": "Type",
              "type": "string",
              "description": "The job type. This value is EXPORT for export jobs.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}