{
  "method_name": "put_events",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/pinpoint/client/put_events.html",
  "description": "Creates a new event to record for endpoints, or creates or updates endpoint data that existing events are associated with.",
  "parameters": [
    {
      "name": "ApplicationId",
      "type": "string",
      "required": true,
      "description": "The unique identifier for the application. This identifier is displayed as the Project ID on the Amazon Pinpoint console.",
      "nested_params": []
    },
    {
      "name": "EventsRequest",
      "type": "dict",
      "required": true,
      "description": "Specifies a batch of events to process. The batch of events to process. For each item in a batch, the endpoint ID acts as a key that has an EventsBatch object as its value. (string) --- (dict) --- Specifies a batch of endpoints and events to process. A set of properties and attributes that are associated with the endpoint. Address (string) --- The unique identifier for the recipient, such as a device token, email address, or mobile phone number. Attributes (dict) --- One or more custom attributes that describe the endpoint by associating a name with an array of values. You can use these attributes as filter criteria when you create segments. (string) --- (list) --- (string) --- ChannelType (string) --- The channel that's used when sending messages or push notifications to the endpoint. Demographic (dict) --- The demographic information for the endpoint, such as the time zone and platform. AppVersion (string) --- The version of the app that's associated with the endpoint. Locale (string) --- The locale of the endpoint, in the following format: the ISO 639-1 alpha-2 code, followed by an underscore (_), followed by an ISO 3166-1 alpha-2 value. Make (string) --- The manufacturer of the endpoint device, such as apple or samsung. Model (string) --- The model name or number of the endpoint device, such as iPhone or SM-G900F. ModelVersion (string) --- The model version of the endpoint device. Platform (string) --- The platform of the endpoint device, such as ios. PlatformVersion (string) --- The platform version of the endpoint device. Timezone (string) --- The time zone of the endpoint, specified as a tz database name value, such as America/Los_Angeles. EffectiveDate (string) --- The date and time, in ISO 8601 format, when the endpoint was last updated. EndpointStatus (string) --- Specifies whether to send messages or push notifications to the endpoint. Valid values are: ACTIVE, messages are sent to the endpoint; and, INACTIVE, messages aren't sent to the endpoint. Amazon Pinpoint automatically sets this value to ACTIVE when you create an endpoint or update an existing endpoint. Amazon Pinpoint automatically sets this value to INACTIVE if you update another endpoint that has the same address specified by the Address property. Location (dict) --- The geographic information for the endpoint. City (string) --- The name of the city where the endpoint is located. Country (string) --- The two-character code, in ISO 3166-1 alpha-2 format, for the country or region where the endpoint is located. For example, US for the United States. Latitude (float) --- The latitude coordinate of the endpoint location, rounded to one decimal place. Longitude (float) --- The longitude coordinate of the endpoint location, rounded to one decimal place. PostalCode (string) --- The postal or ZIP code for the area where the endpoint is located. Region (string) --- The name of the region where the endpoint is located. For locations in the United States, this value is the name of a state. Metrics (dict) --- One or more custom metrics that your app reports to Amazon Pinpoint for the endpoint. (string) --- (float) --- OptOut (string) --- Specifies whether the user who's associated with the endpoint has opted out of receiving messages and push notifications from you. Possible values are: ALL, the user has opted out and doesn't want to receive any messages or push notifications; and, NONE, the user hasn't opted out and wants to receive all messages and push notifications. RequestId (string) --- A unique identifier that's generated each time the endpoint is updated. User (dict) --- One or more custom user attributes that your app reports to Amazon Pinpoint for the user who's associated with the endpoint. UserAttributes (dict) --- One or more custom attributes that describe the user by associating a name with an array of values. For example, the value of an attribute named Interests might be: ['Science', 'Music', 'Travel']. Attribute names are case sensitive. An attribute name can contain up to 50 characters. An attribute value can contain up to 100 characters. When you define the name of a custom attribute, avoid using the following characters: number sign (#), colon (:), question mark (?), backslash (), and slash (/). The Amazon Pinpoint console can't display attribute names that contain these characters. This restriction doesn't apply to attribute values. (string) --- (list) --- (string) --- UserId (string) --- The unique identifier for the user. A set of properties that are associated with the event. (string) --- (dict) --- Specifies information about an event that reports data to Amazon Pinpoint. AppPackageName (string) --- The package name of the app that's recording the event. AppTitle (string) --- The title of the app that's recording the event. AppVersionCode (string) --- The version number of the app that's recording the event. Attributes (dict) --- One or more custom attributes that are associated with the event. (string) --- (string) --- ClientSdkVersion (string) --- The version of the SDK that's running on the client device. The name of the event. Metrics (dict) --- One or more custom metrics that are associated with the event. (string) --- (float) --- SdkName (string) --- The name of the SDK that's being used to record the event. Session (dict) --- Information about the session in which the event occurred. Duration (integer) --- The duration of the session, in milliseconds. The unique identifier for the session. The date and time when the session began. StopTimestamp (string) --- The date and time when the session ended. The date and time, in ISO 8601 format, when the event occurred.",
      "nested_params": [
        {
          "name": "BatchItem",
          "type": "dict",
          "required": false,
          "description": "The batch of events to process. For each item in a batch, the endpoint ID acts as a key that has an EventsBatch object as its value.",
          "nested_params": [
            {
              "name": "Endpoint",
              "type": "dict",
              "required": false,
              "description": "A set of properties and attributes that are associated with the endpoint.",
              "nested_params": [
                {
                  "name": "Address",
                  "type": "string",
                  "required": false,
                  "description": "The unique identifier for the recipient, such as a device token, email address, or mobile phone number.",
                  "nested_params": []
                },
                {
                  "name": "Attributes",
                  "type": "dict",
                  "required": false,
                  "description": "One or more custom attributes that describe the endpoint by associating a name with an array of values. You can use these attributes as filter criteria when you create segments.",
                  "nested_params": []
                },
                {
                  "name": "ChannelType",
                  "type": "string",
                  "required": false,
                  "description": "The channel that's used when sending messages or push notifications to the endpoint.",
                  "nested_params": []
                },
                {
                  "name": "Demographic",
                  "type": "dict",
                  "required": false,
                  "description": "The demographic information for the endpoint, such as the time zone and platform.",
                  "nested_params": [
                    {
                      "name": "AppVersion",
                      "type": "string",
                      "required": false,
                      "description": "The version of the app that's associated with the endpoint.",
                      "nested_params": []
                    },
                    {
                      "name": "Locale",
                      "type": "string",
                      "required": false,
                      "description": "The locale of the endpoint, in the following format: the ISO 639-1 alpha-2 code, followed by an underscore (_), followed by an ISO 3166-1 alpha-2 value.",
                      "nested_params": []
                    },
                    {
                      "name": "Make",
                      "type": "string",
                      "required": false,
                      "description": "The manufacturer of the endpoint device, such as apple or samsung.",
                      "nested_params": []
                    },
                    {
                      "name": "Model",
                      "type": "string",
                      "required": false,
                      "description": "The model name or number of the endpoint device, such as iPhone or SM-G900F.",
                      "nested_params": []
                    },
                    {
                      "name": "ModelVersion",
                      "type": "string",
                      "required": false,
                      "description": "The model version of the endpoint device.",
                      "nested_params": []
                    },
                    {
                      "name": "Platform",
                      "type": "string",
                      "required": false,
                      "description": "The platform of the endpoint device, such as ios.",
                      "nested_params": []
                    },
                    {
                      "name": "PlatformVersion",
                      "type": "string",
                      "required": false,
                      "description": "The platform version of the endpoint device.",
                      "nested_params": []
                    },
                    {
                      "name": "Timezone",
                      "type": "string",
                      "required": false,
                      "description": "The time zone of the endpoint, specified as a tz database name value, such as America/Los_Angeles.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "EffectiveDate",
                  "type": "string",
                  "required": false,
                  "description": "The date and time, in ISO 8601 format, when the endpoint was last updated.",
                  "nested_params": []
                },
                {
                  "name": "EndpointStatus",
                  "type": "string",
                  "required": false,
                  "description": "Specifies whether to send messages or push notifications to the endpoint. Valid values are: ACTIVE, messages are sent to the endpoint; and, INACTIVE, messages aren't sent to the endpoint. Amazon Pinpoint automatically sets this value to ACTIVE when you create an endpoint or update an existing endpoint. Amazon Pinpoint automatically sets this value to INACTIVE if you update another endpoint that has the same address specified by the Address property.",
                  "nested_params": []
                },
                {
                  "name": "Location",
                  "type": "dict",
                  "required": false,
                  "description": "The geographic information for the endpoint.",
                  "nested_params": [
                    {
                      "name": "City",
                      "type": "string",
                      "required": false,
                      "description": "The name of the city where the endpoint is located.",
                      "nested_params": []
                    },
                    {
                      "name": "Country",
                      "type": "string",
                      "required": false,
                      "description": "The two-character code, in ISO 3166-1 alpha-2 format, for the country or region where the endpoint is located. For example, US for the United States.",
                      "nested_params": []
                    },
                    {
                      "name": "Latitude",
                      "type": "float",
                      "required": false,
                      "description": "The latitude coordinate of the endpoint location, rounded to one decimal place.",
                      "nested_params": []
                    },
                    {
                      "name": "Longitude",
                      "type": "float",
                      "required": false,
                      "description": "The longitude coordinate of the endpoint location, rounded to one decimal place.",
                      "nested_params": []
                    },
                    {
                      "name": "PostalCode",
                      "type": "string",
                      "required": false,
                      "description": "The postal or ZIP code for the area where the endpoint is located.",
                      "nested_params": []
                    },
                    {
                      "name": "Region",
                      "type": "string",
                      "required": false,
                      "description": "The name of the region where the endpoint is located. For locations in the United States, this value is the name of a state.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "Metrics",
                  "type": "dict",
                  "required": false,
                  "description": "One or more custom metrics that your app reports to Amazon Pinpoint for the endpoint.",
                  "nested_params": []
                },
                {
                  "name": "OptOut",
                  "type": "string",
                  "required": false,
                  "description": "Specifies whether the user who's associated with the endpoint has opted out of receiving messages and push notifications from you. Possible values are: ALL, the user has opted out and doesn't want to receive any messages or push notifications; and, NONE, the user hasn't opted out and wants to receive all messages and push notifications.",
                  "nested_params": []
                },
                {
                  "name": "RequestId",
                  "type": "string",
                  "required": false,
                  "description": "A unique identifier that's generated each time the endpoint is updated.",
                  "nested_params": []
                },
                {
                  "name": "User",
                  "type": "dict",
                  "required": false,
                  "description": "One or more custom user attributes that your app reports to Amazon Pinpoint for the user who's associated with the endpoint.",
                  "nested_params": [
                    {
                      "name": "UserAttributes",
                      "type": "dict",
                      "required": false,
                      "description": "One or more custom attributes that describe the user by associating a name with an array of values. For example, the value of an attribute named Interests might be: ['Science', 'Music', 'Travel']. You can use these attributes as filter criteria when you create segments. Attribute names are case sensitive. An attribute name can contain up to 50 characters. An attribute value can contain up to 100 characters. When you define the name of a custom attribute, avoid using the following characters: number sign (#), colon (:), question mark (?), backslash (), and slash (/). The Amazon Pinpoint console can't display attribute names that contain these characters. This restriction doesn't apply to attribute values.",
                      "nested_params": []
                    },
                    {
                      "name": "UserId",
                      "type": "string",
                      "required": false,
                      "description": "The unique identifier for the user.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "Events",
              "type": "dict",
              "required": false,
              "description": "A set of properties that are associated with the event.",
              "nested_params": [
                {
                  "name": "AppPackageName",
                  "type": "string",
                  "required": false,
                  "description": "The package name of the app that's recording the event.",
                  "nested_params": []
                },
                {
                  "name": "AppTitle",
                  "type": "string",
                  "required": false,
                  "description": "The title of the app that's recording the event.",
                  "nested_params": []
                },
                {
                  "name": "AppVersionCode",
                  "type": "string",
                  "required": false,
                  "description": "The version number of the app that's recording the event.",
                  "nested_params": []
                },
                {
                  "name": "Attributes",
                  "type": "dict",
                  "required": false,
                  "description": "One or more custom attributes that are associated with the event.",
                  "nested_params": []
                },
                {
                  "name": "ClientSdkVersion",
                  "type": "string",
                  "required": false,
                  "description": "The version of the SDK that's running on the client device.",
                  "nested_params": []
                },
                {
                  "name": "EventType",
                  "type": "string",
                  "required": false,
                  "description": "The name of the event.",
                  "nested_params": []
                },
                {
                  "name": "Metrics",
                  "type": "dict",
                  "required": false,
                  "description": "One or more custom metrics that are associated with the event.",
                  "nested_params": []
                },
                {
                  "name": "SdkName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the SDK that's being used to record the event.",
                  "nested_params": []
                },
                {
                  "name": "Session",
                  "type": "dict",
                  "required": false,
                  "description": "Information about the session in which the event occurred.",
                  "nested_params": [
                    {
                      "name": "Duration",
                      "type": "integer",
                      "required": false,
                      "description": "The duration of the session, in milliseconds.",
                      "nested_params": []
                    },
                    {
                      "name": "Id",
                      "type": "string",
                      "required": false,
                      "description": "The unique identifier for the session.",
                      "nested_params": []
                    },
                    {
                      "name": "StartTimestamp",
                      "type": "string",
                      "required": false,
                      "description": "The date and time when the session began.",
                      "nested_params": []
                    },
                    {
                      "name": "StopTimestamp",
                      "type": "string",
                      "required": false,
                      "description": "The date and time when the session ended.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "Timestamp",
                  "type": "string",
                  "required": false,
                  "description": "The date and time, in ISO 8601 format, when the event occurred.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "EventsResponse",
          "type": "dict",
          "description": "Provides information about endpoints and the events that they're associated with.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "EndpointItemResponse",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "EndpointItemResponse",
                          "type": "dict",
                          "description": "The response that was received after the endpoint data was accepted.",
                          "nested_items": [
                            {
                              "name": "Message",
                              "type": "string",
                              "description": "The custom message that's returned in the response as a result of processing the endpoint data.",
                              "nested_items": []
                            },
                            {
                              "name": "StatusCode",
                              "type": "integer",
                              "description": "The status code that's returned in the response as a result of processing the endpoint data.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "EventsItemResponse",
                          "type": "dict",
                          "description": "A multipart response object that contains a key and a value for each event in the request. In each object, the event ID is the key and an EventItemResponse object is the value.",
                          "nested_items": [
                            {
                              "name": "Message",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "Message",
                                      "type": "string",
                                      "description": "A custom message that's returned in the response as a result of processing the event.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "StatusCode",
                                      "type": "integer",
                                      "description": "The status code that's returned in the response as a result of processing the event. Possible values are: 202, for events that were accepted; and, 400, for events that weren't valid.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}