{
  "method_name": "remove_attributes",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/pinpoint/client/remove_attributes.html",
  "description": "Removes one or more custom attributes, of the same attribute type, from the application. Existing endpoints still have the attributes but Amazon Pinpoint will stop capturing new or changed values for these attributes.",
  "parameters": [
    {
      "name": "ApplicationId",
      "type": "string",
      "required": true,
      "description": "The unique identifier for the application. This identifier is displayed as the Project ID on the Amazon Pinpoint console.",
      "nested_params": []
    },
    {
      "name": "AttributeType",
      "type": "string",
      "required": true,
      "description": "The type of attribute or attributes to remove. Valid values are: endpoint-custom-attributes - Custom attributes that describe endpoints, such as the date when an associated user opted in or out of receiving communications from you through a specific type of channel. endpoint-metric-attributes - Custom metrics that your app reports to Amazon Pinpoint for endpoints, such as the number of app sessions or the number of items left in a cart. endpoint-user-attributes - Custom attributes that describe users, such as first name, last name, and age.",
      "nested_params": []
    },
    {
      "name": "UpdateAttributesRequest",
      "type": "dict",
      "required": true,
      "description": "Specifies one or more attributes to remove from all the endpoints that are associated with an application. Blacklist (list) --- An array of the attributes to remove from all the endpoints that are associated with the application. The array can specify the complete, exact name of each attribute to remove or it can specify a glob pattern that an attribute name must match in order for the attribute to be removed. (string) ---",
      "nested_params": [
        {
          "name": "Blacklist",
          "type": "list",
          "required": false,
          "description": "An array of the attributes to remove from all the endpoints that are associated with the application. The array can specify the complete, exact name of each attribute to remove or it can specify a glob pattern that an attribute name must match in order for the attribute to be removed.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "AttributesResource",
          "type": "dict",
          "description": "Provides information about the type and the names of attributes that were removed from all the endpoints that are associated with an application.",
          "nested_items": [
            {
              "name": "ApplicationId",
              "type": "string",
              "description": "The unique identifier for the application.",
              "nested_items": []
            },
            {
              "name": "AttributeType",
              "type": "string",
              "description": "The type of attribute or attributes that were removed from the endpoints. Valid values are:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "endpoint-custom-attributes - Custom attributes that describe endpoints.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "endpoint-metric-attributes - Custom metrics that your app reports to Amazon Pinpoint for endpoints.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "endpoint-user-attributes - Custom attributes that describe users.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Attributes",
              "type": "list",
              "description": "An array that specifies the names of the attributes that were removed from the endpoints.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}