{
  "method_name": "update_application_settings",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/pinpoint/client/update_application_settings.html",
  "description": "Updates the settings for an application.",
  "parameters": [
    {
      "name": "ApplicationId",
      "type": "string",
      "required": true,
      "description": "The unique identifier for the application. This identifier is displayed as the Project ID on the Amazon Pinpoint console.",
      "nested_params": []
    },
    {
      "name": "WriteApplicationSettingsRequest",
      "type": "dict",
      "required": true,
      "description": "Specifies the default settings for an application. CampaignHook (dict) --- The settings for the AWS Lambda function to invoke by default as a code hook for campaigns in the application. You can use this hook to customize segments that are used by campaigns in the application. To override these settings and define custom settings for a specific campaign, use the CampaignHook object of the Campaign resource. LambdaFunctionName (string) --- The name or Amazon Resource Name (ARN) of the AWS Lambda function that Amazon Pinpoint invokes to customize a segment for a campaign. Mode (string) --- The mode that Amazon Pinpoint uses to invoke the AWS Lambda function. Possible values are: FILTER - Invoke the function to customize the segment that's used by a campaign. DELIVERY - (Deprecated) Previously, invoked the function to send a campaign through a custom channel. This functionality is not supported anymore. To send a campaign through a custom channel, use the CustomDeliveryConfiguration and CampaignCustomMessage objects of the campaign. WebUrl (string) --- The web URL that Amazon Pinpoint calls to invoke the AWS Lambda function over HTTPS. CloudWatchMetricsEnabled (boolean) --- Specifies whether to enable application-related alarms in Amazon CloudWatch. EventTaggingEnabled (boolean) --- Limits (dict) --- The default sending limits for campaigns in the application. To override these limits and define custom limits for a specific campaign or journey, use the Campaign resource or the Journey resource, respectively. Daily (integer) --- The maximum number of messages that a campaign can send to a single endpoint during a 24-hour period. For an application, this value specifies the default limit for the number of messages that campaigns and journeys can send to a single endpoint during a 24-hour period. The maximum value is 100. MaximumDuration (integer) --- The maximum amount of time, in seconds, that a campaign can attempt to deliver a message after the scheduled start time for the campaign. The minimum value is 60 seconds. MessagesPerSecond (integer) --- The maximum number of messages that a campaign can send each second. For an application, this value specifies the default limit for the number of messages that campaigns can send each second. The minimum value is 1. The maximum value is 20,000. Total (integer) --- The maximum number of messages that a campaign can send to a single endpoint during the course of the campaign. If a campaign recurs, this setting applies to all runs of the campaign. Session (integer) --- The maximum total number of messages that the campaign can send per user session. QuietTime (dict) --- The default quiet time for campaigns in the application. Quiet time is a specific time range when messages aren't sent to endpoints, if all the following conditions are met: The EndpointDemographic.Timezone property of the endpoint is set to a valid value. The current time in the endpoint's time zone is later than or equal to the time specified by the QuietTime.Start property for the application (or a campaign or journey that has custom quiet time settings). The current time in the endpoint's time zone is earlier than or equal to the time specified by the QuietTime.End property for the application (or a campaign or journey that has custom quiet time settings). If any of the preceding conditions isn't met, the endpoint will receive messages from a campaign or journey, even if quiet time is enabled. To override the default quiet time settings for a specific campaign or journey, use the Campaign resource or the Journey resource to define a custom quiet time for the campaign or journey. End (string) --- The specific time when quiet time ends. This value has to use 24-hour notation and be in HH:MM format, where HH is the hour (with a leading zero, if applicable) and MM is the minutes. For example, use 02:30 to represent 2:30 AM, or 14:30 to represent 2:30 PM. Start (string) --- The specific time when quiet time begins. JourneyLimits (dict) --- The default sending limits for journeys in the application. These limits apply to each journey for the application but can be overridden, on a per journey basis, with the JourneyLimits resource. DailyCap (integer) --- The daily number of messages that an endpoint can receive from all journeys. If set to 0, this limit will not apply. TimeframeCap (dict) --- The default maximum number of messages that can be sent to an endpoint during the specified timeframe for all journeys. Cap (integer) --- The maximum number of messages that all journeys can send to an endpoint during the specified timeframe. Days (integer) --- The length of the timeframe in days. The maximum value is 30. TotalCap (integer) --- The default maximum number of messages that a single journey can sent to a single endpoint. If set to 0, this limit will not apply.",
      "nested_params": [
        {
          "name": "CampaignHook",
          "type": "dict",
          "required": false,
          "description": "The settings for the AWS Lambda function to invoke by default as a code hook for campaigns in the application. You can use this hook to customize segments that are used by campaigns in the application. To override these settings and define custom settings for a specific campaign, use the CampaignHook object of the Campaign resource.",
          "nested_params": [
            {
              "name": "LambdaFunctionName",
              "type": "string",
              "required": false,
              "description": "The name or Amazon Resource Name (ARN) of the AWS Lambda function that Amazon Pinpoint invokes to customize a segment for a campaign.",
              "nested_params": []
            },
            {
              "name": "Mode",
              "type": "string",
              "required": false,
              "description": "The mode that Amazon Pinpoint uses to invoke the AWS Lambda function. Possible values are:",
              "nested_params": []
            },
            {
              "name": "WebUrl",
              "type": "string",
              "required": false,
              "description": "The web URL that Amazon Pinpoint calls to invoke the AWS Lambda function over HTTPS.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "CloudWatchMetricsEnabled",
          "type": "boolean",
          "required": false,
          "description": "Specifies whether to enable application-related alarms in Amazon CloudWatch.",
          "nested_params": []
        },
        {
          "name": "EventTaggingEnabled",
          "type": "boolean",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "Limits",
          "type": "dict",
          "required": false,
          "description": "The default sending limits for campaigns in the application. To override these limits and define custom limits for a specific campaign or journey, use the Campaign resource or the Journey resource, respectively.",
          "nested_params": [
            {
              "name": "Daily",
              "type": "integer",
              "required": false,
              "description": "The maximum number of messages that a campaign can send to a single endpoint during a 24-hour period. For an application, this value specifies the default limit for the number of messages that campaigns and journeys can send to a single endpoint during a 24-hour period. The maximum value is 100.",
              "nested_params": []
            },
            {
              "name": "MaximumDuration",
              "type": "integer",
              "required": false,
              "description": "The maximum amount of time, in seconds, that a campaign can attempt to deliver a message after the scheduled start time for the campaign. The minimum value is 60 seconds.",
              "nested_params": []
            },
            {
              "name": "MessagesPerSecond",
              "type": "integer",
              "required": false,
              "description": "The maximum number of messages that a campaign can send each second. For an application, this value specifies the default limit for the number of messages that campaigns can send each second. The minimum value is 1. The maximum value is 20,000.",
              "nested_params": []
            },
            {
              "name": "Total",
              "type": "integer",
              "required": false,
              "description": "The maximum number of messages that a campaign can send to a single endpoint during the course of the campaign. If a campaign recurs, this setting applies to all runs of the campaign. The maximum value is 100.",
              "nested_params": []
            },
            {
              "name": "Session",
              "type": "integer",
              "required": false,
              "description": "The maximum total number of messages that the campaign can send per user session.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "QuietTime",
          "type": "dict",
          "required": false,
          "description": "The default quiet time for campaigns in the application. Quiet time is a specific time range when messages aren't sent to endpoints, if all the following conditions are met:",
          "nested_params": []
        },
        {
          "name": "JourneyLimits",
          "type": "dict",
          "required": false,
          "description": "The default sending limits for journeys in the application. These limits apply to each journey for the application but can be overridden, on a per journey basis, with the JourneyLimits resource.",
          "nested_params": [
            {
              "name": "DailyCap",
              "type": "integer",
              "required": false,
              "description": "The daily number of messages that an endpoint can receive from all journeys. The maximum value is 100. If set to 0, this limit will not apply.",
              "nested_params": []
            },
            {
              "name": "TimeframeCap",
              "type": "dict",
              "required": false,
              "description": "The default maximum number of messages that can be sent to an endpoint during the specified timeframe for all journeys.",
              "nested_params": [
                {
                  "name": "Cap",
                  "type": "integer",
                  "required": false,
                  "description": "The maximum number of messages that all journeys can send to an endpoint during the specified timeframe. The maximum value is 100. If set to 0, this limit will not apply.",
                  "nested_params": []
                },
                {
                  "name": "Days",
                  "type": "integer",
                  "required": false,
                  "description": "The length of the timeframe in days. The maximum value is 30. If set to 0, this limit will not apply.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "TotalCap",
              "type": "integer",
              "required": false,
              "description": "The default maximum number of messages that a single journey can sent to a single endpoint. The maximum value is 100. If set to 0, this limit will not apply.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ApplicationSettingsResource",
          "type": "dict",
          "description": "Provides information about an application, including the default settings for an application.",
          "nested_items": [
            {
              "name": "ApplicationId",
              "type": "string",
              "description": "The unique identifier for the application. This identifier is displayed as the Project ID on the Amazon Pinpoint console.",
              "nested_items": []
            },
            {
              "name": "CampaignHook",
              "type": "dict",
              "description": "The settings for the AWS Lambda function to invoke by default as a code hook for campaigns in the application. You can use this hook to customize segments that are used by campaigns in the application.",
              "nested_items": [
                {
                  "name": "LambdaFunctionName",
                  "type": "string",
                  "description": "The name or Amazon Resource Name (ARN) of the AWS Lambda function that Amazon Pinpoint invokes to customize a segment for a campaign.",
                  "nested_items": []
                },
                {
                  "name": "Mode",
                  "type": "string",
                  "description": "The mode that Amazon Pinpoint uses to invoke the AWS Lambda function. Possible values are:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "FILTER - Invoke the function to customize the segment that's used by a campaign.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "Deprecated",
                      "description": "DELIVERY - (Deprecated) Previously, invoked the function to send a campaign through a custom channel. This functionality is not supported anymore. To send a campaign through a custom channel, use the CustomDeliveryConfiguration and CampaignCustomMessage objects of the campaign.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "WebUrl",
                  "type": "string",
                  "description": "The web URL that Amazon Pinpoint calls to invoke the AWS Lambda function over HTTPS.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "LastModifiedDate",
              "type": "string",
              "description": "The date and time, in ISO 8601 format, when the application's settings were last modified.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Daily",
                  "type": "integer",
                  "description": "The maximum number of messages that a campaign can send to a single endpoint during a 24-hour period. For an application, this value specifies the default limit for the number of messages that campaigns and journeys can send to a single endpoint during a 24-hour period. The maximum value is 100.",
                  "nested_items": []
                },
                {
                  "name": "MaximumDuration",
                  "type": "integer",
                  "description": "The maximum amount of time, in seconds, that a campaign can attempt to deliver a message after the scheduled start time for the campaign. The minimum value is 60 seconds.",
                  "nested_items": []
                },
                {
                  "name": "MessagesPerSecond",
                  "type": "integer",
                  "description": "The maximum number of messages that a campaign can send each second. For an application, this value specifies the default limit for the number of messages that campaigns can send each second. The minimum value is 1. The maximum value is 20,000.",
                  "nested_items": []
                },
                {
                  "name": "Total",
                  "type": "integer",
                  "description": "The maximum number of messages that a campaign can send to a single endpoint during the course of the campaign. If a campaign recurs, this setting applies to all runs of the campaign. The maximum value is 100.",
                  "nested_items": []
                },
                {
                  "name": "Session",
                  "type": "integer",
                  "description": "The maximum total number of messages that the campaign can send per user session.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "QuietTime",
              "type": "dict",
              "description": "The default quiet time for campaigns in the application. Quiet time is a specific time range when messages aren't sent to endpoints, if all the following conditions are met:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "The EndpointDemographic.Timezone property of the endpoint is set to a valid value.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "or a campaign or journey that has custom quiet time settings",
                  "description": "The current time in the endpoint's time zone is later than or equal to the time specified by the QuietTime.Start property for the application (or a campaign or journey that has custom quiet time settings).",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "or a campaign or journey that has custom quiet time settings",
                  "description": "The current time in the endpoint's time zone is earlier than or equal to the time specified by the QuietTime.End property for the application (or a campaign or journey that has custom quiet time settings).",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "JourneyLimits",
              "type": "dict",
              "description": "The default sending limits for journeys in the application. These limits apply to each journey for the application but can be overridden, on a per journey basis, with the JourneyLimits resource.",
              "nested_items": [
                {
                  "name": "DailyCap",
                  "type": "integer",
                  "description": "The daily number of messages that an endpoint can receive from all journeys. The maximum value is 100. If set to 0, this limit will not apply.",
                  "nested_items": []
                },
                {
                  "name": "TimeframeCap",
                  "type": "dict",
                  "description": "The default maximum number of messages that can be sent to an endpoint during the specified timeframe for all journeys.",
                  "nested_items": [
                    {
                      "name": "Cap",
                      "type": "integer",
                      "description": "The maximum number of messages that all journeys can send to an endpoint during the specified timeframe. The maximum value is 100. If set to 0, this limit will not apply.",
                      "nested_items": []
                    },
                    {
                      "name": "Days",
                      "type": "integer",
                      "description": "The length of the timeframe in days. The maximum value is 30. If set to 0, this limit will not apply.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "TotalCap",
                  "type": "integer",
                  "description": "The default maximum number of messages that a single journey can sent to a single endpoint. The maximum value is 100. If set to 0, this limit will not apply.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}