{
  "method_name": "update_push_template",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/pinpoint/client/update_push_template.html",
  "description": "Updates an existing message template for messages that are sent through a push notification channel.",
  "parameters": [
    {
      "name": "CreateNewVersion",
      "type": "boolean",
      "required": false,
      "description": "Specifies whether to save the updates as a new version of the message template. Valid values are: true, save the updates as a new version; and, false, save the updates to (overwrite) the latest existing version of the template. If you don't specify a value for this parameter, Amazon Pinpoint saves the updates to (overwrites) the latest existing version of the template. If you specify a value of true for this parameter, don't specify a value for the version parameter. Otherwise, an error will occur.",
      "nested_params": []
    },
    {
      "name": "PushNotificationTemplateRequest",
      "type": "dict",
      "required": true,
      "description": "Specifies the content and settings for a message template that can be used in messages that are sent through a push notification channel. ADM (dict) --- The message template to use for the ADM (Amazon Device Messaging) channel. This message template overrides the default template for push notification channels (DefaultPushNotificationTemplate). Action (string) --- The action to occur if a recipient taps a push notification that's based on the message template. Valid values are: OPEN_APP - Your app opens or it becomes the foreground app if it was sent to the background. This is the default action. DEEP_LINK - Your app opens and displays a designated user interface in the app. This action uses the deep-linking features of the Android platform. URL - The default mobile browser on the recipient's device opens and loads the web page at a URL that you specify. Body (string) --- The message body to use in a push notification that's based on the message template. ImageIconUrl (string) --- The URL of the large icon image to display in the content view of a push notification that's based on the message template. ImageUrl (string) --- The URL of an image to display in a push notification that's based on the message template. RawContent (string) --- The raw, JSON-formatted string to use as the payload for a push notification that's based on the message template. If specified, this value overrides all other content for the message template. SmallImageIconUrl (string) --- The URL of the small icon image to display in the status bar and the content view of a push notification that's based on the message template. Sound (string) --- The sound to play when a recipient receives a push notification that's based on the message template. You can use the default stream or specify the file name of a sound resource that's bundled in your app. On an Android platform, the sound file must reside in /res/raw/. Title (string) --- The title to use in a push notification that's based on the message template. This title appears above the notification message on a recipient's device. Url (string) --- The URL to open in a recipient's default mobile browser, if a recipient taps a push notification that's based on the message template and the value of the Action property is URL. APNS (dict) --- The message template to use for the APNs (Apple Push Notification service) channel. This setting uses the deep-linking features of the iOS platform. Body (string) --- The message body to use in push notifications that are based on the message template. MediaUrl (string) --- The URL of an image or video to display in push notifications that are based on the message template. RawContent (string) --- The raw, JSON-formatted string to use as the payload for push notifications that are based on the message template. Sound (string) --- The key for the sound to play when the recipient receives a push notification that's based on the message template. The value for this key is the name of a sound file in your app's main bundle or the Library/Sounds folder in your app's data container. If the sound file can't be found or you specify default for the value, the system plays the default alert sound. Title (string) --- The title to use in push notifications that are based on the message template. Url (string) --- The URL to open in the recipient's default mobile browser, if a recipient taps a push notification that's based on the message template and the value of the Action property is URL. Baidu (dict) --- The message template to use for the Baidu (Baidu Cloud Push) channel. Default (dict) --- The default message template to use for push notification channels. This setting uses the deep-linking features of the iOS and Android platforms. For an iOS platform, this value is the key for the name of a sound file in your app's main bundle or the Library/Sounds folder in your app's data container. DefaultSubstitutions (string) --- A JSON object that specifies the default values to use for message variables in the message template. This object is a set of key-value pairs. Each key defines a message variable in the template. The corresponding value defines the default value for that variable. When you create a message that's based on the template, you can override these defaults with message-specific and address-specific variables and values. GCM (dict) --- The message template to use for the GCM channel, which is used to send notifications through the Firebase Cloud Messaging (FCM), formerly Google Cloud Messaging (GCM), service. RecommenderId (string) --- The unique identifier for the recommender model to use for the message template. Amazon Pinpoint uses this value to determine how to retrieve and process data from a recommender model when it sends messages that use the template, if the template contains message variables for recommendation data. tags (dict) --- (Deprecated) A string-to-string map of key-value pairs that defines the tags to associate with the message template. Each tag consists of a required tag key and an associated tag value. (string) --- (string) --- TemplateDescription (string) --- A custom description of the message template.",
      "nested_params": [
        {
          "name": "ADM",
          "type": "dict",
          "required": false,
          "description": "The message template to use for the ADM (Amazon Device Messaging) channel. This message template overrides the default template for push notification channels (DefaultPushNotificationTemplate).",
          "nested_params": [
            {
              "name": "Action",
              "type": "string",
              "required": false,
              "description": "The action to occur if a recipient taps a push notification that's based on the message template. Valid values are:",
              "nested_params": []
            },
            {
              "name": "Body",
              "type": "string",
              "required": false,
              "description": "The message body to use in a push notification that's based on the message template.",
              "nested_params": []
            },
            {
              "name": "ImageIconUrl",
              "type": "string",
              "required": false,
              "description": "The URL of the large icon image to display in the content view of a push notification that's based on the message template.",
              "nested_params": []
            },
            {
              "name": "ImageUrl",
              "type": "string",
              "required": false,
              "description": "The URL of an image to display in a push notification that's based on the message template.",
              "nested_params": []
            },
            {
              "name": "RawContent",
              "type": "string",
              "required": false,
              "description": "The raw, JSON-formatted string to use as the payload for a push notification that's based on the message template. If specified, this value overrides all other content for the message template.",
              "nested_params": []
            },
            {
              "name": "SmallImageIconUrl",
              "type": "string",
              "required": false,
              "description": "The URL of the small icon image to display in the status bar and the content view of a push notification that's based on the message template.",
              "nested_params": []
            },
            {
              "name": "Sound",
              "type": "string",
              "required": false,
              "description": "The sound to play when a recipient receives a push notification that's based on the message template. You can use the default stream or specify the file name of a sound resource that's bundled in your app. On an Android platform, the sound file must reside in /res/raw/.",
              "nested_params": []
            },
            {
              "name": "Title",
              "type": "string",
              "required": false,
              "description": "The title to use in a push notification that's based on the message template. This title appears above the notification message on a recipient's device.",
              "nested_params": []
            },
            {
              "name": "Url",
              "type": "string",
              "required": false,
              "description": "The URL to open in a recipient's default mobile browser, if a recipient taps a push notification that's based on the message template and the value of the Action property is URL.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "APNS",
          "type": "dict",
          "required": false,
          "description": "The message template to use for the APNs (Apple Push Notification service) channel. This message template overrides the default template for push notification channels (DefaultPushNotificationTemplate).",
          "nested_params": [
            {
              "name": "Action",
              "type": "string",
              "required": false,
              "description": "The action to occur if a recipient taps a push notification that's based on the message template. Valid values are:",
              "nested_params": []
            },
            {
              "name": "Body",
              "type": "string",
              "required": false,
              "description": "The message body to use in push notifications that are based on the message template.",
              "nested_params": []
            },
            {
              "name": "MediaUrl",
              "type": "string",
              "required": false,
              "description": "The URL of an image or video to display in push notifications that are based on the message template.",
              "nested_params": []
            },
            {
              "name": "RawContent",
              "type": "string",
              "required": false,
              "description": "The raw, JSON-formatted string to use as the payload for push notifications that are based on the message template. If specified, this value overrides all other content for the message template.",
              "nested_params": []
            },
            {
              "name": "Sound",
              "type": "string",
              "required": false,
              "description": "The key for the sound to play when the recipient receives a push notification that's based on the message template. The value for this key is the name of a sound file in your app's main bundle or the Library/Sounds folder in your app's data container. If the sound file can't be found or you specify default for the value, the system plays the default alert sound.",
              "nested_params": []
            },
            {
              "name": "Title",
              "type": "string",
              "required": false,
              "description": "The title to use in push notifications that are based on the message template. This title appears above the notification message on a recipient's device.",
              "nested_params": []
            },
            {
              "name": "Url",
              "type": "string",
              "required": false,
              "description": "The URL to open in the recipient's default mobile browser, if a recipient taps a push notification that's based on the message template and the value of the Action property is URL.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Baidu",
          "type": "dict",
          "required": false,
          "description": "The message template to use for the Baidu (Baidu Cloud Push) channel. This message template overrides the default template for push notification channels (DefaultPushNotificationTemplate).",
          "nested_params": [
            {
              "name": "Action",
              "type": "string",
              "required": false,
              "description": "The action to occur if a recipient taps a push notification that's based on the message template. Valid values are:",
              "nested_params": []
            },
            {
              "name": "Body",
              "type": "string",
              "required": false,
              "description": "The message body to use in a push notification that's based on the message template.",
              "nested_params": []
            },
            {
              "name": "ImageIconUrl",
              "type": "string",
              "required": false,
              "description": "The URL of the large icon image to display in the content view of a push notification that's based on the message template.",
              "nested_params": []
            },
            {
              "name": "ImageUrl",
              "type": "string",
              "required": false,
              "description": "The URL of an image to display in a push notification that's based on the message template.",
              "nested_params": []
            },
            {
              "name": "RawContent",
              "type": "string",
              "required": false,
              "description": "The raw, JSON-formatted string to use as the payload for a push notification that's based on the message template. If specified, this value overrides all other content for the message template.",
              "nested_params": []
            },
            {
              "name": "SmallImageIconUrl",
              "type": "string",
              "required": false,
              "description": "The URL of the small icon image to display in the status bar and the content view of a push notification that's based on the message template.",
              "nested_params": []
            },
            {
              "name": "Sound",
              "type": "string",
              "required": false,
              "description": "The sound to play when a recipient receives a push notification that's based on the message template. You can use the default stream or specify the file name of a sound resource that's bundled in your app. On an Android platform, the sound file must reside in /res/raw/.",
              "nested_params": []
            },
            {
              "name": "Title",
              "type": "string",
              "required": false,
              "description": "The title to use in a push notification that's based on the message template. This title appears above the notification message on a recipient's device.",
              "nested_params": []
            },
            {
              "name": "Url",
              "type": "string",
              "required": false,
              "description": "The URL to open in a recipient's default mobile browser, if a recipient taps a push notification that's based on the message template and the value of the Action property is URL.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Default",
          "type": "dict",
          "required": false,
          "description": "The default message template to use for push notification channels.",
          "nested_params": [
            {
              "name": "Action",
              "type": "string",
              "required": false,
              "description": "The action to occur if a recipient taps a push notification that's based on the message template. Valid values are:",
              "nested_params": []
            },
            {
              "name": "Body",
              "type": "string",
              "required": false,
              "description": "The message body to use in push notifications that are based on the message template.",
              "nested_params": []
            },
            {
              "name": "Sound",
              "type": "string",
              "required": false,
              "description": "The sound to play when a recipient receives a push notification that's based on the message template. You can use the default stream or specify the file name of a sound resource that's bundled in your app. On an Android platform, the sound file must reside in /res/raw/. For an iOS platform, this value is the key for the name of a sound file in your app's main bundle or the Library/Sounds folder in your app's data container. If the sound file can't be found or you specify default for the value, the system plays the default alert sound.",
              "nested_params": []
            },
            {
              "name": "Title",
              "type": "string",
              "required": false,
              "description": "The title to use in push notifications that are based on the message template. This title appears above the notification message on a recipient's device.",
              "nested_params": []
            },
            {
              "name": "Url",
              "type": "string",
              "required": false,
              "description": "The URL to open in a recipient's default mobile browser, if a recipient taps a push notification that's based on the message template and the value of the Action property is URL.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "DefaultSubstitutions",
          "type": "string",
          "required": false,
          "description": "A JSON object that specifies the default values to use for message variables in the message template. This object is a set of key-value pairs. Each key defines a message variable in the template. The corresponding value defines the default value for that variable. When you create a message that's based on the template, you can override these defaults with message-specific and address-specific variables and values.",
          "nested_params": []
        },
        {
          "name": "GCM",
          "type": "dict",
          "required": false,
          "description": "The message template to use for the GCM channel, which is used to send notifications through the Firebase Cloud Messaging (FCM), formerly Google Cloud Messaging (GCM), service. This message template overrides the default template for push notification channels (DefaultPushNotificationTemplate).",
          "nested_params": [
            {
              "name": "Action",
              "type": "string",
              "required": false,
              "description": "The action to occur if a recipient taps a push notification that's based on the message template. Valid values are:",
              "nested_params": []
            },
            {
              "name": "Body",
              "type": "string",
              "required": false,
              "description": "The message body to use in a push notification that's based on the message template.",
              "nested_params": []
            },
            {
              "name": "ImageIconUrl",
              "type": "string",
              "required": false,
              "description": "The URL of the large icon image to display in the content view of a push notification that's based on the message template.",
              "nested_params": []
            },
            {
              "name": "ImageUrl",
              "type": "string",
              "required": false,
              "description": "The URL of an image to display in a push notification that's based on the message template.",
              "nested_params": []
            },
            {
              "name": "RawContent",
              "type": "string",
              "required": false,
              "description": "The raw, JSON-formatted string to use as the payload for a push notification that's based on the message template. If specified, this value overrides all other content for the message template.",
              "nested_params": []
            },
            {
              "name": "SmallImageIconUrl",
              "type": "string",
              "required": false,
              "description": "The URL of the small icon image to display in the status bar and the content view of a push notification that's based on the message template.",
              "nested_params": []
            },
            {
              "name": "Sound",
              "type": "string",
              "required": false,
              "description": "The sound to play when a recipient receives a push notification that's based on the message template. You can use the default stream or specify the file name of a sound resource that's bundled in your app. On an Android platform, the sound file must reside in /res/raw/.",
              "nested_params": []
            },
            {
              "name": "Title",
              "type": "string",
              "required": false,
              "description": "The title to use in a push notification that's based on the message template. This title appears above the notification message on a recipient's device.",
              "nested_params": []
            },
            {
              "name": "Url",
              "type": "string",
              "required": false,
              "description": "The URL to open in a recipient's default mobile browser, if a recipient taps a push notification that's based on the message template and the value of the Action property is URL.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "RecommenderId",
          "type": "string",
          "required": false,
          "description": "The unique identifier for the recommender model to use for the message template. Amazon Pinpoint uses this value to determine how to retrieve and process data from a recommender model when it sends messages that use the template, if the template contains message variables for recommendation data.",
          "nested_params": []
        },
        {
          "name": "tags",
          "type": "dict",
          "required": false,
          "description": "(Deprecated) A string-to-string map of key-value pairs that defines the tags to associate with the message template. Each tag consists of a required tag key and an associated tag value.",
          "nested_params": []
        },
        {
          "name": "TemplateDescription",
          "type": "string",
          "required": false,
          "description": "A custom description of the message template.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "TemplateName",
      "type": "string",
      "required": true,
      "description": "The name of the message template. A template name must start with an alphanumeric character and can contain a maximum of 128 characters. The characters can be alphanumeric characters, underscores (_), or hyphens (-). Template names are case sensitive.",
      "nested_params": []
    },
    {
      "name": "Version",
      "type": "string",
      "required": false,
      "description": "The unique identifier for the version of the message template to update, retrieve information about, or delete. To retrieve identifiers and other information for all the versions of a template, use the Template Versions resource. If specified, this value must match the identifier for an existing template version. If specified for an update operation, this value must match the identifier for the latest existing version of the template. This restriction helps ensure that race conditions don't occur. If you don't specify a value for this parameter, Amazon Pinpoint does the following: For a get operation, retrieves information about the active version of the template. For an update operation, saves the updates to (overwrites) the latest existing version of the template, if the create-new-version parameter isn't used or is set to false. For a delete operation, deletes the template, including all versions of the template.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "MessageBody",
          "type": "dict",
          "description": "Provides information about an API request or response.",
          "nested_items": [
            {
              "name": "Message",
              "type": "string",
              "description": "The message that's returned from the API.",
              "nested_items": []
            },
            {
              "name": "RequestID",
              "type": "string",
              "description": "The unique identifier for the request or response.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}