{
  "method_name": "put_bucket_logging",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3/client/put_bucket_logging.html",
  "description": "Set the logging parameters for a bucket and to specify permissions for who can view and modify the logging parameters. All logs are saved to buckets in the same Amazon Web Services Region as the source bucket. To set the logging status of a bucket, you must be the bucket owner. The bucket owner is automatically granted FULL_CONTROL to all logs. You use the Grantee request element to grant access to other people. The Permissions request element specifies the kind of access the grantee has to the logs. You can specify the person (grantee) to whom you're assigning access rights (by using request elements) in the following ways. For examples of how to specify these grantee values in JSON format, see the Amazon Web Services CLI example in Enabling Amazon S3 server access logging in the Amazon S3 User Guide. To enable logging, you use LoggingEnabled and its children request elements. To disable logging, you use an empty BucketLoggingStatus request element: <BucketLoggingStatus xmlns=\"http://doc.s3.amazonaws.com/2006-03-01\" /> For more information about server access logging, see Server Access Logging in the Amazon S3 User Guide. For more information about creating a bucket, see CreateBucket. For more information about returning the logging status of a bucket, see GetBucketLogging. The following operations are related to PutBucketLogging:",
  "parameters": [
    {
      "name": "Bucket",
      "type": "string",
      "required": true,
      "description": "The name of the bucket for which to set the logging parameters.",
      "nested_params": []
    },
    {
      "name": "BucketLoggingStatus",
      "type": "dict",
      "required": true,
      "description": "Container for logging status information. LoggingEnabled (dict) --- Describes where logs are stored and the prefix that Amazon S3 assigns to all log object keys for a bucket. For more information, see PUT Bucket logging in the Amazon S3 API Reference. Specifies the bucket where you want Amazon S3 to store server access logs. You can have your logs delivered to any bucket that you own, including the same bucket that is being logged. You can also configure multiple buckets to deliver their logs to the same target bucket. In this case, you should choose a different TargetPrefix for each source bucket so that the delivered log files can be distinguished by key. TargetGrants (list) --- Container for granting information. Buckets that use the bucket owner enforced setting for Object Ownership don't support target grants. For more information, see Permissions for server access log delivery in the Amazon S3 User Guide. (dict) --- Container for granting information. For more information, see Permissions server access log delivery in the Amazon S3 User Guide. Grantee (dict) --- Container for the person being granted permissions. DisplayName (string) --- Screen name of the grantee. EmailAddress (string) --- Email address of the grantee. ID (string) --- The canonical user ID of the grantee. Type of grantee URI (string) --- URI of the grantee group. Permission (string) --- Logging permissions assigned to the grantee for the bucket. A prefix for all log object keys. If you store log files from multiple Amazon S3 buckets in a single bucket, you can use a prefix to distinguish which log files came from which bucket. TargetObjectKeyFormat (dict) --- Amazon S3 key format for log objects. SimplePrefix (dict) --- To use the simple format for S3 keys for log objects. To specify SimplePrefix format, set SimplePrefix to {}. PartitionedPrefix (dict) --- Partitioned S3 key for log objects. PartitionDateSource (string) --- Specifies the partition date source for the partitioned prefix. PartitionDateSource can be EventTime or DeliveryTime. For DeliveryTime, the time in the log file names corresponds to the delivery time for the log files. For EventTime, The logs delivered are for a specific day only. The year, month, and day correspond to the day on which the event occurred, and the hour, minutes and seconds are set to 00 in the key.",
      "nested_params": [
        {
          "name": "LoggingEnabled",
          "type": "dict",
          "required": false,
          "description": "Describes where logs are stored and the prefix that Amazon S3 assigns to all log object keys for a bucket. For more information, see PUT Bucket logging in the Amazon S3 API Reference.",
          "nested_params": [
            {
              "name": "TargetBucket",
              "type": "string",
              "required": false,
              "description": "Specifies the bucket where you want Amazon S3 to store server access logs. You can have your logs delivered to any bucket that you own, including the same bucket that is being logged. You can also configure multiple buckets to deliver their logs to the same target bucket. In this case, you should choose a different TargetPrefix for each source bucket so that the delivered log files can be distinguished by key.",
              "nested_params": []
            },
            {
              "name": "TargetGrants",
              "type": "list",
              "required": false,
              "description": "Container for granting information. Buckets that use the bucket owner enforced setting for Object Ownership don't support target grants. For more information, see Permissions for server access log delivery in the Amazon S3 User Guide.",
              "nested_params": [
                {
                  "name": "Grantee",
                  "type": "dict",
                  "required": false,
                  "description": "Container for the person being granted permissions.",
                  "nested_params": [
                    {
                      "name": "DisplayName",
                      "type": "string",
                      "required": false,
                      "description": "Screen name of the grantee.",
                      "nested_params": []
                    },
                    {
                      "name": "EmailAddress",
                      "type": "string",
                      "required": false,
                      "description": "Email address of the grantee.",
                      "nested_params": []
                    },
                    {
                      "name": "ID",
                      "type": "string",
                      "required": false,
                      "description": "The canonical user ID of the grantee.",
                      "nested_params": []
                    },
                    {
                      "name": "Type",
                      "type": "string",
                      "required": false,
                      "description": "Type of grantee.",
                      "nested_params": []
                    },
                    {
                      "name": "URI",
                      "type": "string",
                      "required": false,
                      "description": "URI of the grantee group.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "Permission",
                  "type": "string",
                  "required": false,
                  "description": "Logging permissions assigned to the grantee for the bucket.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "TargetPrefix",
              "type": "string",
              "required": false,
              "description": "A prefix for all log object keys. If you store log files from multiple Amazon S3 buckets in a single bucket, you can use a prefix to distinguish which log files came from which bucket.",
              "nested_params": []
            },
            {
              "name": "TargetObjectKeyFormat",
              "type": "dict",
              "required": false,
              "description": "Amazon S3 key format for log objects.",
              "nested_params": [
                {
                  "name": "SimplePrefix",
                  "type": "dict",
                  "required": false,
                  "description": "To use the simple format for S3 keys for log objects. To specify SimplePrefix format, set SimplePrefix to {}.",
                  "nested_params": []
                },
                {
                  "name": "PartitionedPrefix",
                  "type": "dict",
                  "required": false,
                  "description": "Partitioned S3 key for log objects.",
                  "nested_params": [
                    {
                      "name": "PartitionDateSource",
                      "type": "string",
                      "required": false,
                      "description": "Specifies the partition date source for the partitioned prefix. PartitionDateSource can be EventTime or DeliveryTime. For DeliveryTime, the time in the log file names corresponds to the delivery time for the log files. For EventTime, The logs delivered are for a specific day only. The year, month, and day correspond to the day on which the event occurred, and the hour, minutes and seconds are set to 00 in the key.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "ChecksumAlgorithm",
      "type": "string",
      "required": false,
      "description": "Indicates the algorithm used to create the checksum for the request when you use the SDK. This header will not provide any additional functionality if you don't use the SDK. When you send this header, there must be a corresponding x-amz-checksum or x-amz-trailer header sent. Otherwise, Amazon S3 fails the request with the HTTP status code 400 Bad Request. For more information, see Checking object integrity in the Amazon S3 User Guide. If you provide an individual checksum, Amazon S3 ignores any provided ChecksumAlgorithm parameter.",
      "nested_params": []
    },
    {
      "name": "ExpectedBucketOwner",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}