{
  "method_name": "put_bucket_metrics_configuration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3/client/put_bucket_metrics_configuration.html",
  "description": "Sets a metrics configuration (specified by the metrics configuration ID) for the bucket. You can have up to 1,000 metrics configurations per bucket. If you're updating an existing metrics configuration, note that this is a full replacement of the existing metrics configuration. If you don't include the elements you want to keep, they are erased. To use this operation, you must have permissions to perform the s3:PutMetricsConfiguration action. The bucket owner has this permission by default. The bucket owner can grant this permission to others. For more information about permissions, see Permissions Related to Bucket Subresource Operations and Managing Access Permissions to Your Amazon S3 Resources. For information about CloudWatch request metrics for Amazon S3, see Monitoring Metrics with Amazon CloudWatch. The following operations are related to PutBucketMetricsConfiguration: PutBucketMetricsConfiguration has the following special error:",
  "parameters": [
    {
      "name": "Bucket",
      "type": "string",
      "required": true,
      "description": "The name of the bucket for which the metrics configuration is set.",
      "nested_params": []
    },
    {
      "name": "Id",
      "type": "string",
      "required": true,
      "description": "The ID used to identify the metrics configuration. The ID has a 64 character limit and can only contain letters, numbers, periods, dashes, and underscores.",
      "nested_params": []
    },
    {
      "name": "MetricsConfiguration",
      "type": "dict",
      "required": true,
      "description": "Specifies the metrics configuration. The ID used to identify the metrics configuration. The ID has a 64 character limit and can only contain letters, numbers, periods, dashes, and underscores. Filter (dict) --- Specifies a metrics configuration filter. The metrics configuration will only include objects that meet the filter's criteria. A filter must be a prefix, an object tag, an access point ARN, or a conjunction (MetricsAndOperator). Prefix (string) --- The prefix used when evaluating a metrics filter. Tag (dict) --- The tag used when evaluating a metrics filter. Name of the object key. Value of the tag. AccessPointArn (string) --- The access point ARN used when evaluating a metrics filter. And (dict) --- A conjunction (logical AND) of predicates, which is used in evaluating a metrics filter. The operator must have at least two predicates, and an object must match all of the predicates in order for the filter to apply. Prefix (string) --- The prefix used when evaluating an AND predicate. Tags (list) --- The list of tags used when evaluating an AND predicate. (dict) --- A container of a key value name pair. AccessPointArn (string) --- The access point ARN used when evaluating an AND predicate.",
      "nested_params": [
        {
          "name": "Id",
          "type": "string",
          "required": false,
          "description": "The ID used to identify the metrics configuration. The ID has a 64 character limit and can only contain letters, numbers, periods, dashes, and underscores.",
          "nested_params": []
        },
        {
          "name": "Filter",
          "type": "dict",
          "required": false,
          "description": "Specifies a metrics configuration filter. The metrics configuration will only include objects that meet the filter's criteria. A filter must be a prefix, an object tag, an access point ARN, or a conjunction (MetricsAndOperator).",
          "nested_params": [
            {
              "name": "Prefix",
              "type": "string",
              "required": false,
              "description": "The prefix used when evaluating a metrics filter.",
              "nested_params": []
            },
            {
              "name": "Tag",
              "type": "dict",
              "required": false,
              "description": "The tag used when evaluating a metrics filter.",
              "nested_params": [
                {
                  "name": "Key",
                  "type": "string",
                  "required": false,
                  "description": "Name of the object key.",
                  "nested_params": []
                },
                {
                  "name": "Value",
                  "type": "string",
                  "required": false,
                  "description": "Value of the tag.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "AccessPointArn",
              "type": "string",
              "required": false,
              "description": "The access point ARN used when evaluating a metrics filter.",
              "nested_params": []
            },
            {
              "name": "And",
              "type": "dict",
              "required": false,
              "description": "A conjunction (logical AND) of predicates, which is used in evaluating a metrics filter. The operator must have at least two predicates, and an object must match all of the predicates in order for the filter to apply.",
              "nested_params": [
                {
                  "name": "Prefix",
                  "type": "string",
                  "required": false,
                  "description": "The prefix used when evaluating an AND predicate.",
                  "nested_params": []
                },
                {
                  "name": "Tags",
                  "type": "list",
                  "required": false,
                  "description": "The list of tags used when evaluating an AND predicate.",
                  "nested_params": [
                    {
                      "name": "Key",
                      "type": "string",
                      "required": false,
                      "description": "Name of the object key.",
                      "nested_params": []
                    },
                    {
                      "name": "Value",
                      "type": "string",
                      "required": false,
                      "description": "Value of the tag.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "AccessPointArn",
                  "type": "string",
                  "required": false,
                  "description": "The access point ARN used when evaluating an AND predicate.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "ExpectedBucketOwner",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}