{
  "method_name": "create_export",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/bcm-data-exports/client/create_export.html",
  "description": "Creates a data export and specifies the data query, the delivery preference, and any optional resource tags. A DataQuery consists of both a QueryStatement and TableConfigurations. The QueryStatement is an SQL statement. Data Exports only supports a limited subset of the SQL syntax. For more information on the SQL syntax that is supported, see Data query. To view the available tables and columns, see the Data Exports table dictionary. The TableConfigurations is a collection of specified TableProperties for the table being queried in the QueryStatement. TableProperties are additional configurations you can provide to change the data and schema of a table. Each table can have different TableProperties. However, tables are not required to have any TableProperties. Each table property has a default value that it assumes if not specified. For more information on table configurations, see Data query. To view the table properties available for each table, see the Data Exports table dictionary or use the ListTables API to get a response of all tables and their available properties.",
  "parameters": [
    {
      "name": "Export",
      "type": "dict",
      "required": true,
      "description": "The details of the export, including data query, name, description, and destination configuration. The data query for this specific data export. The query statement. TableConfigurations (dict) --- The table configuration. (string) --- (dict) --- (string) --- (string) --- Description (string) --- The description for this specific data export. The destination configuration for this specific data export. An object that describes the destination of the data exports file. The name of the Amazon S3 bucket used as the destination of a data export file. The output configuration for the data export. The compression type for the data export. The file format for the data export. The output type for the data export. The rule to follow when generating a version of the data export file. You have the choice to overwrite the previous version or to be delivered in addition to the previous versions. Overwriting exports can save on Amazon S3 storage costs. Creating new export versions allows you to track the changes in cost and usage data over time. The S3 path prefix you want prepended to the name of your data export. The S3 bucket Region. ExportArn (string) --- The Amazon Resource Name (ARN) for this export. The name of this specific data export. The cadence for Amazon Web Services to update the export in your S3 bucket. The frequency that data exports are updated. The export refreshes each time the source data updates, up to three times daily.",
      "nested_params": [
        {
          "name": "DataQuery",
          "type": "dict",
          "required": false,
          "description": "The data query for this specific data export.",
          "nested_params": [
            {
              "name": "QueryStatement",
              "type": "string",
              "required": false,
              "description": "The query statement.",
              "nested_params": []
            },
            {
              "name": "TableConfigurations",
              "type": "dict",
              "required": false,
              "description": "The table configuration.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Description",
          "type": "string",
          "required": false,
          "description": "The description for this specific data export.",
          "nested_params": []
        },
        {
          "name": "DestinationConfigurations",
          "type": "dict",
          "required": false,
          "description": "The destination configuration for this specific data export.",
          "nested_params": [
            {
              "name": "S3Destination",
              "type": "dict",
              "required": false,
              "description": "An object that describes the destination of the data exports file.",
              "nested_params": [
                {
                  "name": "S3Bucket",
                  "type": "string",
                  "required": false,
                  "description": "The name of the Amazon S3 bucket used as the destination of a data export file.",
                  "nested_params": []
                },
                {
                  "name": "S3OutputConfigurations",
                  "type": "dict",
                  "required": false,
                  "description": "The output configuration for the data export.",
                  "nested_params": [
                    {
                      "name": "Compression",
                      "type": "string",
                      "required": false,
                      "description": "The compression type for the data export.",
                      "nested_params": []
                    },
                    {
                      "name": "Format",
                      "type": "string",
                      "required": false,
                      "description": "The file format for the data export.",
                      "nested_params": []
                    },
                    {
                      "name": "OutputType",
                      "type": "string",
                      "required": false,
                      "description": "The output type for the data export.",
                      "nested_params": []
                    },
                    {
                      "name": "Overwrite",
                      "type": "string",
                      "required": false,
                      "description": "The rule to follow when generating a version of the data export file. You have the choice to overwrite the previous version or to be delivered in addition to the previous versions. Overwriting exports can save on Amazon S3 storage costs. Creating new export versions allows you to track the changes in cost and usage data over time.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "S3Prefix",
                  "type": "string",
                  "required": false,
                  "description": "The S3 path prefix you want prepended to the name of your data export.",
                  "nested_params": []
                },
                {
                  "name": "S3Region",
                  "type": "string",
                  "required": false,
                  "description": "The S3 bucket Region.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "ExportArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) for this export.",
          "nested_params": []
        },
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name of this specific data export.",
          "nested_params": []
        },
        {
          "name": "RefreshCadence",
          "type": "dict",
          "required": false,
          "description": "The cadence for Amazon Web Services to update the export in your S3 bucket.",
          "nested_params": [
            {
              "name": "Frequency",
              "type": "string",
              "required": false,
              "description": "The frequency that data exports are updated. The export refreshes each time the source data updates, up to three times daily.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "ResourceTags",
      "type": "list",
      "required": true,
      "description": "An optional list of tags to associate with the specified export. Each tag consists of a key and a value, and each key must be unique for the resource. (dict) --- The tag structure that contains a tag key and value. The key that's associated with the tag. The value that's associated with the tag.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key that's associated with the tag.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value that's associated with the tag.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ExportArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) for this export.",
          "nested_items": []
        }
      ]
    }
  ]
}