{
  "service_name": "SSOOIDC",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sso-oidc.html",
  "client": {
    "description": "A low-level client representing AWS SSO OIDC IAM Identity Center OpenID Connect (OIDC) is a web service that enables a client (such as CLI or a native application) to register with IAM Identity Center. The service also enables the client to fetch the userâ\u0080\u0099s access token upon successful authentication and authorization with IAM Identity Center. IAM Identity Center uses the sso and identitystore API namespaces. IAM Identity Center OpenID Connect uses the sso-oidc namespace. Before you begin using this guide, we recommend that you first review the following important information about how the IAM Identity Center OIDC service works. The IAM Identity Center OIDC service currently implements only the portions of the OAuth 2.0 Device Authorization Grant standard ( https://tools.ietf.org/html/rfc8628) that are necessary to enable single sign-on authentication with the CLI. With older versions of the CLI, the service only emits OIDC access tokens, so to obtain a new token, users must explicitly re-authenticate. To access the OIDC flow that supports token refresh and doesnâ\u0080\u0099t require re-authentication, update to the latest CLI version (1.27.10 for CLI V1 and 2.9.0 for CLI V2) with support for OIDC token refresh and configurable IAM Identity Center session durations. For more information, see Configure Amazon Web Services access portal session duration. The access tokens provided by this service grant access to all Amazon Web Services account entitlements assigned to an IAM Identity Center user, not just a particular application. The documentation in this guide does not describe the mechanism to convert the access token into Amazon Web Services Auth (â\u0080\u009csigv4â\u0080\u009d) credentials for use with IAM-protected Amazon Web Services service endpoints. For more information, see GetRoleCredentials in the IAM Identity Center Portal API Reference Guide. For general information about IAM Identity Center, see What is IAM Identity Center? in the IAM Identity Center User Guide.",
    "methods_names": [
      "can_paginate",
      "close",
      "create_token",
      "create_token_with_iam",
      "get_paginator",
      "get_waiter",
      "register_client",
      "start_device_authorization"
    ],
    "methods_links": [
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sso-oidc/client/can_paginate.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sso-oidc/client/close.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sso-oidc/client/create_token.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sso-oidc/client/create_token_with_iam.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sso-oidc/client/get_paginator.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sso-oidc/client/get_waiter.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sso-oidc/client/register_client.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sso-oidc/client/start_device_authorization.html"
    ]
  },
  "paginators": {
    "paginators_names": [],
    "paginators_links": []
  }
}