{
  "method_name": "put_insight_rule",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudwatch/client/put_insight_rule.html",
  "description": "Creates a Contributor Insights rule. Rules evaluate log events in a CloudWatch Logs log group, enabling you to find contributor data for the log events in that log group. For more information, see Using Contributor Insights to Analyze High-Cardinality Data. If you create a rule, delete it, and then re-create it with the same name, historical data from the first time the rule was created might not be available.",
  "parameters": [
    {
      "name": "RuleName",
      "type": "string",
      "required": true,
      "description": "A unique name for the rule.",
      "nested_params": []
    },
    {
      "name": "RuleState",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "RuleDefinition",
      "type": "string",
      "required": true,
      "description": "The definition of the rule, as a JSON object. For details on the valid syntax, see Contributor Insights Rule Syntax.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "A list of key-value pairs to associate with the Contributor Insights rule. You can associate as many as 50 tags with a rule. Tags can help you organize and categorize your resources. You can also use them to scope user permissions, by granting a user permission to access or change only the resources that have certain tag values. To be able to associate tags with a rule, you must have the cloudwatch:TagResource permission in addition to the cloudwatch:PutInsightRule permission. If you are using this operation to update an existing Contributor Insights rule, any tags you specify in this parameter are ignored. To change the tags of an existing rule, use TagResource. (dict) --- A key-value pair associated with a CloudWatch resource. A string that you can use to assign a value. The combination of tag keys and values can help you organize and categorize your resources. The value for the specified tag key.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "A string that you can use to assign a value. The combination of tag keys and values can help you organize and categorize your resources.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value for the specified tag key.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}