{
  "method_name": "set_alarm_state",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudwatch/client/set_alarm_state.html",
  "description": "Temporarily sets the state of an alarm for testing purposes. When the updated state differs from the previous value, the action configured for the appropriate state is invoked. For example, if your alarm is configured to send an Amazon SNS message when an alarm is triggered, temporarily changing the alarm state to ALARM sends an SNS message. Metric alarms returns to their actual state quickly, often within seconds. Because the metric alarm state change happens quickly, it is typically only visible in the alarm's History tab in the Amazon CloudWatch console or through DescribeAlarmHistory. If you use SetAlarmState on a composite alarm, the composite alarm is not guaranteed to return to its actual state. It returns to its actual state only once any of its children alarms change state. It is also reevaluated if you update its configuration. If an alarm triggers EC2 Auto Scaling policies or application Auto Scaling policies, you must include information in the StateReasonData parameter to enable the policy to take the correct action.",
  "parameters": [
    {
      "name": "AlarmName",
      "type": "string",
      "required": true,
      "description": "The name of the alarm.",
      "nested_params": []
    },
    {
      "name": "StateValue",
      "type": "string",
      "required": true,
      "description": "The value of the state.",
      "nested_params": []
    },
    {
      "name": "StateReason",
      "type": "string",
      "required": true,
      "description": "The reason that this alarm is set to this specific state, in text format.",
      "nested_params": []
    },
    {
      "name": "StateReasonData",
      "type": "string",
      "required": false,
      "description": "The reason that this alarm is set to this specific state, in JSON format. For SNS or EC2 alarm actions, this is just informational. But for EC2 Auto Scaling or application Auto Scaling alarm actions, the Auto Scaling policy uses the information in this field to take the correct action.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}