{
  "method_name": "analyze_document",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/textract/client/analyze_document.html",
  "description": "Analyzes an input document for relationships between detected items. The types of information returned are as follows: Selection elements such as check boxes and option buttons (radio buttons) can be detected in form data and in tables. A SELECTION_ELEMENT Block object contains information about a selection element, including the selection status. You can choose which type of analysis to perform by specifying the FeatureTypes list. The output is returned in a list of Block objects. AnalyzeDocument is a synchronous operation. To analyze documents asynchronously, use  StartDocumentAnalysis. For more information, see Document Text Analysis.",
  "parameters": [
    {
      "name": "Document",
      "type": "dict",
      "required": true,
      "description": "The input document as base64-encoded bytes or an Amazon S3 object. If you use the AWS CLI to call Amazon Textract operations, you can't pass image bytes. The document must be an image in JPEG, PNG, PDF, or TIFF format. If you're using an AWS SDK to call Amazon Textract, you might not need to base64-encode image bytes that are passed using the Bytes field. Bytes (bytes) --- A blob of base64-encoded document bytes. The maximum size of a document that's provided in a blob of bytes is 5 MB. The document bytes must be in PNG or JPEG format. If you're using an AWS SDK to call Amazon Textract, you might not need to base64-encode image bytes passed using the Bytes field. S3Object (dict) --- Identifies an S3 object as the document source. The maximum size of a document that's stored in an S3 bucket is 5 MB. Bucket (string) --- The name of the S3 bucket. Note that the # character is not valid in the file name. Name (string) --- The file name of the input document. Image files may be in PDF, TIFF, JPEG, or PNG format. Version (string) --- If the bucket has versioning enabled, you can specify the object version.",
      "nested_params": [
        {
          "name": "Bytes",
          "type": "bytes",
          "required": false,
          "description": "A blob of base64-encoded document bytes. The maximum size of a document that's provided in a blob of bytes is 5 MB. The document bytes must be in PNG or JPEG format. If you're using an AWS SDK to call Amazon Textract, you might not need to base64-encode image bytes passed using the Bytes field.",
          "nested_params": []
        },
        {
          "name": "S3Object",
          "type": "dict",
          "required": false,
          "description": "Identifies an S3 object as the document source. The maximum size of a document that's stored in an S3 bucket is 5 MB.",
          "nested_params": [
            {
              "name": "Bucket",
              "type": "string",
              "required": false,
              "description": "The name of the S3 bucket. Note that the # character is not valid in the file name.",
              "nested_params": []
            },
            {
              "name": "Name",
              "type": "string",
              "required": false,
              "description": "The file name of the input document. Image files may be in PDF, TIFF, JPEG, or PNG format.",
              "nested_params": []
            },
            {
              "name": "Version",
              "type": "string",
              "required": false,
              "description": "If the bucket has versioning enabled, you can specify the object version.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "FeatureTypes",
      "type": "list",
      "required": true,
      "description": "A list of the types of analysis to perform. Add TABLES to the list to return information about the tables that are detected in the input document. Add FORMS to return detected form data. Add SIGNATURES to return the locations of detected signatures. Add LAYOUT to the list to return information about the layout of the document. All lines and words detected in the document are included in the response (including text that isn't related to the value of FeatureTypes). (string) ---",
      "nested_params": []
    },
    {
      "name": "HumanLoopConfig",
      "type": "dict",
      "required": true,
      "description": "Sets the configuration for the human in the loop workflow for analyzing documents. The name of the human workflow used for this image. This should be kept unique within a region. The Amazon Resource Name (ARN) of the flow definition. DataAttributes (dict) --- Sets attributes of the input data. ContentClassifiers (list) --- Sets whether the input image is free of personally identifiable information or adult content. (string) ---",
      "nested_params": [
        {
          "name": "HumanLoopName",
          "type": "string",
          "required": false,
          "description": "The name of the human workflow used for this image. This should be kept unique within a region.",
          "nested_params": []
        },
        {
          "name": "FlowDefinitionArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the flow definition.",
          "nested_params": []
        },
        {
          "name": "DataAttributes",
          "type": "dict",
          "required": false,
          "description": "Sets attributes of the input data.",
          "nested_params": [
            {
              "name": "ContentClassifiers",
              "type": "list",
              "required": false,
              "description": "Sets whether the input image is free of personally identifiable information or adult content.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "QueriesConfig",
      "type": "dict",
      "required": true,
      "description": "Contains Queries and the alias for those Queries, as determined by the input. (dict) --- Each query contains the question you want to ask in the Text and the alias you want to associate. Question that Amazon Textract will apply to the document. An example would be 'What is the customer's SSN?' Alias (string) --- Alias attached to the query, for ease of location. Pages (list) --- Pages is a parameter that the user inputs to specify which pages to apply a query to. The following is a list of rules for using this parameter. If a page is not specified, it is set to [\"1\"] by default. The following characters are allowed in the parameter's string: 0 1 2 3 4 5 6 7 8 9 - *. No whitespace is allowed. When using * to indicate all pages, it must be the only element in the list. You can use page intervals, such as ['1-3', '1-1', '4-*']. Where * indicates last page of document. Specified pages must be greater than 0 and less than or equal to the number of pages in the document. (string) ---",
      "nested_params": [
        {
          "name": "Queries",
          "type": "list",
          "required": false,
          "description": "",
          "nested_params": [
            {
              "name": "Text",
              "type": "string",
              "required": false,
              "description": "Question that Amazon Textract will apply to the document. An example would be 'What is the customer's SSN?'",
              "nested_params": []
            },
            {
              "name": "Alias",
              "type": "string",
              "required": false,
              "description": "Alias attached to the query, for ease of location.",
              "nested_params": []
            },
            {
              "name": "Pages",
              "type": "list",
              "required": false,
              "description": "Pages is a parameter that the user inputs to specify which pages to apply a query to. The following is a list of rules for using this parameter.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "AdaptersConfig",
      "type": "dict",
      "required": true,
      "description": "Specifies the adapter to be used when analyzing a document. A list of adapters to be used when analyzing the specified document. (dict) --- An adapter selected for use when analyzing documents. Contains an adapter ID and a version number. Contains information on pages selected for analysis when analyzing documents asychronously. A unique identifier for the adapter resource. Pages (list) --- Pages is a parameter that the user inputs to specify which pages to apply an adapter to. The following is a list of rules for using this parameter. If a page is not specified, it is set to [\"1\"] by default. The following characters are allowed in the parameter's string: 0 1 2 3 4 5 6 7 8 9 - *. No whitespace is allowed. When using * to indicate all pages, it must be the only element in the list. You can use page intervals, such as [\"1-3\", \"1-1\", \"4-*\"]. Where * indicates last page of document. Specified pages must be greater than 0 and less than or equal to the number of pages in the document. (string) --- A string that identifies the version of the adapter.",
      "nested_params": [
        {
          "name": "Adapters",
          "type": "list",
          "required": false,
          "description": "A list of adapters to be used when analyzing the specified document.",
          "nested_params": [
            {
              "name": "AdapterId",
              "type": "string",
              "required": false,
              "description": "A unique identifier for the adapter resource.",
              "nested_params": []
            },
            {
              "name": "Pages",
              "type": "list",
              "required": false,
              "description": "Pages is a parameter that the user inputs to specify which pages to apply an adapter to. The following is a list of rules for using this parameter.",
              "nested_params": []
            },
            {
              "name": "Version",
              "type": "string",
              "required": false,
              "description": "A string that identifies the version of the adapter.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "DocumentMetadata",
          "type": "dict",
          "description": "Metadata about the analyzed document. An example is the number of pages.",
          "nested_items": [
            {
              "name": "Pages",
              "type": "integer",
              "description": "The number of pages that are detected in the document.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "Blocks",
          "type": "list",
          "description": "The items that are detected and analyzed by AnalyzeDocument.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "BlockType",
                  "type": "string",
                  "description": "The type of text item that's recognized. In operations for text detection, the following types are returned:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "PAGE - Contains a list of the LINE Block objects that are detected on a document page.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "WORD - A word detected on a document page. A word is one or more ISO basic Latin script characters that aren't separated by spaces.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "LINE - A string of space-delimited, contiguous words that are detected on a document page.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Confidence",
                  "type": "float",
                  "description": "The confidence score that Amazon Textract has in the accuracy of the recognized text and the accuracy of the geometry points around the recognized text.",
                  "nested_items": []
                },
                {
                  "name": "Text",
                  "type": "string",
                  "description": "The word or line of text that's recognized by Amazon Textract.",
                  "nested_items": []
                },
                {
                  "name": "TextType",
                  "type": "string",
                  "description": "The kind of text that Amazon Textract has detected. Can check for handwritten text and printed text.",
                  "nested_items": []
                },
                {
                  "name": "RowIndex",
                  "type": "integer",
                  "description": "The row in which a table cell is located. The first row position is 1. RowIndex isn't returned by DetectDocumentText and GetDocumentTextDetection.",
                  "nested_items": []
                },
                {
                  "name": "ColumnIndex",
                  "type": "integer",
                  "description": "The column in which a table cell appears. The first column position is 1. ColumnIndex isn't returned by DetectDocumentText and GetDocumentTextDetection.",
                  "nested_items": []
                },
                {
                  "name": "RowSpan",
                  "type": "integer",
                  "description": "The number of rows that a table cell spans. RowSpan isn't returned by DetectDocumentText and GetDocumentTextDetection.",
                  "nested_items": []
                },
                {
                  "name": "ColumnSpan",
                  "type": "integer",
                  "description": "The number of columns that a table cell spans. ColumnSpan isn't returned by DetectDocumentText and GetDocumentTextDetection.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "BoundingBox",
                      "type": "dict",
                      "description": "An axis-aligned coarse representation of the location of the recognized item on the document page.",
                      "nested_items": [
                        {
                          "name": "Width",
                          "type": "float",
                          "description": "The width of the bounding box as a ratio of the overall document page width.",
                          "nested_items": []
                        },
                        {
                          "name": "Height",
                          "type": "float",
                          "description": "The height of the bounding box as a ratio of the overall document page height.",
                          "nested_items": []
                        },
                        {
                          "name": "Left",
                          "type": "float",
                          "description": "The left coordinate of the bounding box as a ratio of overall document page width.",
                          "nested_items": []
                        },
                        {
                          "name": "Top",
                          "type": "float",
                          "description": "The top coordinate of the bounding box as a ratio of overall document page height.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "Polygon",
                      "type": "list",
                      "description": "Within the bounding box, a fine-grained polygon around the recognized item.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "X",
                              "type": "float",
                              "description": "The value of the X coordinate for a point on a Polygon.",
                              "nested_items": []
                            },
                            {
                              "name": "Y",
                              "type": "float",
                              "description": "The value of the Y coordinate for a point on a Polygon.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "RotationAngle",
                      "type": "float",
                      "description": "Provides a numerical value corresponding to the rotation of the text.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Id",
                  "type": "string",
                  "description": "The identifier for the recognized text. The identifier is only unique for a single operation.",
                  "nested_items": []
                },
                {
                  "name": "Relationships",
                  "type": "list",
                  "description": "A list of relationship objects that describe how blocks are related to each other. For example, a LINE block object contains a CHILD relationship type with the WORD blocks that make up the line of text. There aren't Relationship objects in the list for relationships that don't exist, such as when the current block has no child blocks.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Type",
                          "type": "string",
                          "description": "The type of relationship between the blocks in the IDs array and the current block. The following list describes the relationship types that can be returned.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "",
                              "description": "VALUE - A list that contains the ID of the VALUE block that's associated with the KEY of a key-value pair.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "CHILD - A list of IDs that identify blocks found within the current block object. For example, WORD blocks have a CHILD relationship to the LINE block type.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "MERGED_CELL - A list of IDs that identify each of the MERGED_CELL block types in a table.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "ANSWER - A list that contains the ID of the QUERY_RESULT block that's associated with the corresponding QUERY block.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "TABLE - A list of IDs that identify associated TABLE block types.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "TABLE_TITLE - A list that contains the ID for the TABLE_TITLE block type in a table.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "TABLE_FOOTER - A list of IDs that identify the TABLE_FOOTER block types in a table.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "Ids",
                          "type": "list",
                          "description": "An array of IDs for related blocks. You can get the type of the relationship from the Type element.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "EntityTypes",
                  "type": "list",
                  "description": "The type of entity.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "KEY - An identifier for a field on the document.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "VALUE - The field text.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "SelectionStatus",
                  "type": "string",
                  "description": "The selection status of a selection element, such as an option button or check box.",
                  "nested_items": []
                },
                {
                  "name": "Page",
                  "type": "integer",
                  "description": "The page on which a block was detected. Page is returned by synchronous and asynchronous operations. Page values greater than 1 are only returned for multipage documents that are in PDF or TIFF format. A scanned image (JPEG/PNG) provided to an asynchronous operation, even if it contains multiple document pages, is considered a single-page document. This means that for scanned images the value of Page is always 1.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Text",
                      "type": "string",
                      "description": "Question that Amazon Textract will apply to the document. An example would be 'What is the customer's SSN?'",
                      "nested_items": []
                    },
                    {
                      "name": "Alias",
                      "type": "string",
                      "description": "Alias attached to the query, for ease of location.",
                      "nested_items": []
                    },
                    {
                      "name": "Pages",
                      "type": "list",
                      "description": "Pages is a parameter that the user inputs to specify which pages to apply a query to. The following is a list of rules for using this parameter.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "If a page is not specified, it is set to [\"1\"] by default.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "The following characters are allowed in the parameter's string: 0 1 2 3 4 5 6 7 8 9 - *. No whitespace is allowed.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "When using * to indicate all pages, it must be the only element in the list.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "You can use page intervals, such as ['1-3', '1-1', '4-*']. Where * indicates last page of document.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "Specified pages must be greater than 0 and less than or equal to the number of pages in the document.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "HumanLoopActivationOutput",
          "type": "dict",
          "description": "Shows the results of the human in the loop evaluation.",
          "nested_items": [
            {
              "name": "HumanLoopArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the HumanLoop created.",
              "nested_items": []
            },
            {
              "name": "HumanLoopActivationReasons",
              "type": "list",
              "description": "Shows if and why human review was needed.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "HumanLoopActivationConditionsEvaluationResults",
              "type": "string",
              "description": "Shows the result of condition evaluations, including those conditions which activated a human review.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "AnalyzeDocumentModelVersion",
          "type": "string",
          "description": "The version of the model used to analyze the document.",
          "nested_items": []
        }
      ]
    }
  ]
}