{
  "method_name": "create_adapter_version",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/textract/client/create_adapter_version.html",
  "description": "Creates a new version of an adapter. Operates on a provided AdapterId and a specified dataset provided via the DatasetConfig argument. Requires that you specify an Amazon S3 bucket with the OutputConfig argument. You can provide an optional KMSKeyId, an optional ClientRequestToken, and optional tags.",
  "parameters": [
    {
      "name": "AdapterId",
      "type": "string",
      "required": true,
      "description": "A string containing a unique ID for the adapter that will receive a new version.",
      "nested_params": []
    },
    {
      "name": "ClientRequestToken",
      "type": "string",
      "required": false,
      "description": "Idempotent token is used to recognize the request. If the same token is used with multiple CreateAdapterVersion requests, the same session is returned. This token is employed to avoid unintentionally creating the same session multiple times. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "DatasetConfig",
      "type": "dict",
      "required": true,
      "description": "Specifies a dataset used to train a new adapter version. Takes a ManifestS3Object as the value. ManifestS3Object (dict) --- The S3 bucket name and file name that identifies the document. The AWS Region for the S3 bucket that contains the document must match the Region that you use for Amazon Textract operations. For Amazon Textract to process a file in an S3 bucket, the user must have permission to access the S3 bucket and file. Bucket (string) --- The name of the S3 bucket. Note that the # character is not valid in the file name. Name (string) --- The file name of the input document. Image files may be in PDF, TIFF, JPEG, or PNG format. Version (string) --- If the bucket has versioning enabled, you can specify the object version.",
      "nested_params": [
        {
          "name": "ManifestS3Object",
          "type": "dict",
          "required": false,
          "description": "The S3 bucket name and file name that identifies the document. The AWS Region for the S3 bucket that contains the document must match the Region that you use for Amazon Textract operations. For Amazon Textract to process a file in an S3 bucket, the user must have permission to access the S3 bucket and file.",
          "nested_params": [
            {
              "name": "Bucket",
              "type": "string",
              "required": false,
              "description": "The name of the S3 bucket. Note that the # character is not valid in the file name.",
              "nested_params": []
            },
            {
              "name": "Name",
              "type": "string",
              "required": false,
              "description": "The file name of the input document. Image files may be in PDF, TIFF, JPEG, or PNG format.",
              "nested_params": []
            },
            {
              "name": "Version",
              "type": "string",
              "required": false,
              "description": "If the bucket has versioning enabled, you can specify the object version.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "KMSKeyId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "OutputConfig",
      "type": "dict",
      "required": true,
      "description": "Sets whether or not your output will go to a user created bucket. Used to set the name of the bucket, and the prefix on the output file. OutputConfig is an optional parameter which lets you adjust where your output will be placed. By default, Amazon Textract will store the results internally and can only be accessed by the Get API operations. With OutputConfig enabled, you can set the name of the bucket the output will be sent to the file prefix of the results where you can download your results. Additionally, you can set the KMSKeyID parameter to a customer master key (CMK) to encrypt your output. Without this parameter set Amazon Textract will encrypt server-side using the AWS managed CMK for Amazon S3. Decryption of Customer Content is necessary for processing of the documents by Amazon Textract. If your account is opted out under an AI services opt out policy then all unencrypted Customer Content is immediately and permanently deleted after the Customer Content has been processed by the service. No copy of of the output is retained by Amazon Textract. For information about how to opt out, see Managing AI services opt-out policy. For more information on data privacy, see the Data Privacy FAQ. The name of the bucket your output will go to. S3Prefix (string) --- The prefix of the object key that the output will be saved to. When not enabled, the prefix will be 'textract_output'.",
      "nested_params": [
        {
          "name": "S3Bucket",
          "type": "string",
          "required": false,
          "description": "The name of the bucket your output will go to.",
          "nested_params": []
        },
        {
          "name": "S3Prefix",
          "type": "string",
          "required": false,
          "description": "The prefix of the object key that the output will be saved to. When not enabled, the prefix will be 'textract_output'.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Tags",
      "type": "dict",
      "required": false,
      "description": "A set of tags (key-value pairs) that you want to attach to the adapter version. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "AdapterId",
          "type": "string",
          "description": "A string containing the unique ID for the adapter that has received a new version.",
          "nested_items": []
        },
        {
          "name": "AdapterVersion",
          "type": "string",
          "description": "A string describing the new version of the adapter.",
          "nested_items": []
        }
      ]
    }
  ]
}