{
  "method_name": "get_document_analysis",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/textract/client/get_document_analysis.html",
  "description": "Gets the results for an Amazon Textract asynchronous operation that analyzes text in a document. You start asynchronous text analysis by calling  StartDocumentAnalysis, which returns a job identifier ( JobId). When the text analysis operation finishes, Amazon Textract publishes a completion status to the Amazon Simple Notification Service (Amazon SNS) topic that's registered in the initial call to StartDocumentAnalysis. To get the results of the text-detection operation, first check that the status value published to the Amazon SNS topic is SUCCEEDED. If so, call GetDocumentAnalysis, and pass the job identifier ( JobId) from the initial call to StartDocumentAnalysis. GetDocumentAnalysis returns an array of  Block objects. The following types of information are returned: Selection elements such as check boxes and option buttons (radio buttons) can be detected in form data and in tables. A SELECTION_ELEMENT Block object contains information about a selection element, including the selection status. Use the MaxResults parameter to limit the number of blocks that are returned. If there are more results than specified in MaxResults, the value of NextToken in the operation response contains a pagination token for getting the next set of results. To get the next page of results, call GetDocumentAnalysis, and populate the NextToken request parameter with the token value that's returned from the previous call to GetDocumentAnalysis. For more information, see Document Text Analysis.",
  "parameters": [
    {
      "name": "JobId",
      "type": "string",
      "required": true,
      "description": "A unique identifier for the text-detection job. The JobId is returned from StartDocumentAnalysis. A JobId value is only valid for 7 days.",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "DocumentMetadata",
          "type": "dict",
          "description": "Information about a document that Amazon Textract processed. DocumentMetadata is returned in every page of paginated responses from an Amazon Textract video operation.",
          "nested_items": [
            {
              "name": "Pages",
              "type": "integer",
              "description": "The number of pages that are detected in the document.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "JobStatus",
          "type": "string",
          "description": "The current status of the text detection job.",
          "nested_items": []
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "If the response is truncated, Amazon Textract returns this token. You can use this token in the subsequent request to retrieve the next set of text detection results.",
          "nested_items": []
        },
        {
          "name": "Blocks",
          "type": "list",
          "description": "The results of the text-analysis operation.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "BlockType",
                  "type": "string",
                  "description": "The type of text item that's recognized. In operations for text detection, the following types are returned:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "PAGE - Contains a list of the LINE Block objects that are detected on a document page.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "WORD - A word detected on a document page. A word is one or more ISO basic Latin script characters that aren't separated by spaces.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "LINE - A string of space-delimited, contiguous words that are detected on a document page.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Confidence",
                  "type": "float",
                  "description": "The confidence score that Amazon Textract has in the accuracy of the recognized text and the accuracy of the geometry points around the recognized text.",
                  "nested_items": []
                },
                {
                  "name": "Text",
                  "type": "string",
                  "description": "The word or line of text that's recognized by Amazon Textract.",
                  "nested_items": []
                },
                {
                  "name": "TextType",
                  "type": "string",
                  "description": "The kind of text that Amazon Textract has detected. Can check for handwritten text and printed text.",
                  "nested_items": []
                },
                {
                  "name": "RowIndex",
                  "type": "integer",
                  "description": "The row in which a table cell is located. The first row position is 1. RowIndex isn't returned by DetectDocumentText and GetDocumentTextDetection.",
                  "nested_items": []
                },
                {
                  "name": "ColumnIndex",
                  "type": "integer",
                  "description": "The column in which a table cell appears. The first column position is 1. ColumnIndex isn't returned by DetectDocumentText and GetDocumentTextDetection.",
                  "nested_items": []
                },
                {
                  "name": "RowSpan",
                  "type": "integer",
                  "description": "The number of rows that a table cell spans. RowSpan isn't returned by DetectDocumentText and GetDocumentTextDetection.",
                  "nested_items": []
                },
                {
                  "name": "ColumnSpan",
                  "type": "integer",
                  "description": "The number of columns that a table cell spans. ColumnSpan isn't returned by DetectDocumentText and GetDocumentTextDetection.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "BoundingBox",
                      "type": "dict",
                      "description": "An axis-aligned coarse representation of the location of the recognized item on the document page.",
                      "nested_items": [
                        {
                          "name": "Width",
                          "type": "float",
                          "description": "The width of the bounding box as a ratio of the overall document page width.",
                          "nested_items": []
                        },
                        {
                          "name": "Height",
                          "type": "float",
                          "description": "The height of the bounding box as a ratio of the overall document page height.",
                          "nested_items": []
                        },
                        {
                          "name": "Left",
                          "type": "float",
                          "description": "The left coordinate of the bounding box as a ratio of overall document page width.",
                          "nested_items": []
                        },
                        {
                          "name": "Top",
                          "type": "float",
                          "description": "The top coordinate of the bounding box as a ratio of overall document page height.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "Polygon",
                      "type": "list",
                      "description": "Within the bounding box, a fine-grained polygon around the recognized item.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "X",
                              "type": "float",
                              "description": "The value of the X coordinate for a point on a Polygon.",
                              "nested_items": []
                            },
                            {
                              "name": "Y",
                              "type": "float",
                              "description": "The value of the Y coordinate for a point on a Polygon.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "RotationAngle",
                      "type": "float",
                      "description": "Provides a numerical value corresponding to the rotation of the text.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Id",
                  "type": "string",
                  "description": "The identifier for the recognized text. The identifier is only unique for a single operation.",
                  "nested_items": []
                },
                {
                  "name": "Relationships",
                  "type": "list",
                  "description": "A list of relationship objects that describe how blocks are related to each other. For example, a LINE block object contains a CHILD relationship type with the WORD blocks that make up the line of text. There aren't Relationship objects in the list for relationships that don't exist, such as when the current block has no child blocks.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Type",
                          "type": "string",
                          "description": "The type of relationship between the blocks in the IDs array and the current block. The following list describes the relationship types that can be returned.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "",
                              "description": "VALUE - A list that contains the ID of the VALUE block that's associated with the KEY of a key-value pair.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "CHILD - A list of IDs that identify blocks found within the current block object. For example, WORD blocks have a CHILD relationship to the LINE block type.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "MERGED_CELL - A list of IDs that identify each of the MERGED_CELL block types in a table.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "ANSWER - A list that contains the ID of the QUERY_RESULT block that's associated with the corresponding QUERY block.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "TABLE - A list of IDs that identify associated TABLE block types.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "TABLE_TITLE - A list that contains the ID for the TABLE_TITLE block type in a table.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "TABLE_FOOTER - A list of IDs that identify the TABLE_FOOTER block types in a table.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "Ids",
                          "type": "list",
                          "description": "An array of IDs for related blocks. You can get the type of the relationship from the Type element.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "EntityTypes",
                  "type": "list",
                  "description": "The type of entity.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "KEY - An identifier for a field on the document.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "VALUE - The field text.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "SelectionStatus",
                  "type": "string",
                  "description": "The selection status of a selection element, such as an option button or check box.",
                  "nested_items": []
                },
                {
                  "name": "Page",
                  "type": "integer",
                  "description": "The page on which a block was detected. Page is returned by synchronous and asynchronous operations. Page values greater than 1 are only returned for multipage documents that are in PDF or TIFF format. A scanned image (JPEG/PNG) provided to an asynchronous operation, even if it contains multiple document pages, is considered a single-page document. This means that for scanned images the value of Page is always 1.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Text",
                      "type": "string",
                      "description": "Question that Amazon Textract will apply to the document. An example would be 'What is the customer's SSN?'",
                      "nested_items": []
                    },
                    {
                      "name": "Alias",
                      "type": "string",
                      "description": "Alias attached to the query, for ease of location.",
                      "nested_items": []
                    },
                    {
                      "name": "Pages",
                      "type": "list",
                      "description": "Pages is a parameter that the user inputs to specify which pages to apply a query to. The following is a list of rules for using this parameter.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "If a page is not specified, it is set to [\"1\"] by default.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "The following characters are allowed in the parameter's string: 0 1 2 3 4 5 6 7 8 9 - *. No whitespace is allowed.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "When using * to indicate all pages, it must be the only element in the list.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "You can use page intervals, such as ['1-3', '1-1', '4-*']. Where * indicates last page of document.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "Specified pages must be greater than 0 and less than or equal to the number of pages in the document.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Warnings",
          "type": "list",
          "description": "A list of warnings that occurred during the document-analysis operation.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ErrorCode",
                  "type": "string",
                  "description": "The error code for the warning.",
                  "nested_items": []
                },
                {
                  "name": "Pages",
                  "type": "list",
                  "description": "A list of the pages that the warning applies to.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "integer",
                      "description": "(integer) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "StatusMessage",
          "type": "string",
          "description": "Returns if the detection job could not be completed. Contains explanation for what error occured.",
          "nested_items": []
        },
        {
          "name": "AnalyzeDocumentModelVersion",
          "type": "string",
          "description": "",
          "nested_items": []
        }
      ]
    }
  ]
}