{
  "method_name": "set_identity_pool_roles",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cognito-identity/client/set_identity_pool_roles.html",
  "description": "Sets the roles for an identity pool. These roles are used when making calls to  GetCredentialsForIdentity action. You must use Amazon Web Services developer credentials to call this operation.",
  "parameters": [
    {
      "name": "IdentityPoolId",
      "type": "string",
      "required": true,
      "description": "An identity pool ID in the format REGION:GUID.",
      "nested_params": []
    },
    {
      "name": "Roles",
      "type": "dict",
      "required": true,
      "description": "The map of roles associated with this pool. For a given role, the key will be either 'authenticated' or 'unauthenticated' and the value will be the Role ARN. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "RoleMappings",
      "type": "dict",
      "required": true,
      "description": "How users for a specific identity provider are to mapped to roles. This is a string to  RoleMapping object map. The string identifies the identity provider, for example, graph.facebook.com or cognito-idp.us-east-1.amazonaws.com/us-east-1_abcdefghi:app_client_id. Up to 25 rules can be specified per identity provider. (string) --- (dict) --- A role mapping. The role mapping type. Token will use cognito:roles and cognito:preferred_role claims from the Cognito identity provider token to map groups to roles. Rules will attempt to match claims from the token to map to a role. AmbiguousRoleResolution (string) --- If you specify Token or Rules as the Type, AmbiguousRoleResolution is required. Specifies the action to be taken if either no rules match the claim value for the Rules type, or there is no cognito:preferred_role claim and there are multiple cognito:roles matches for the Token type. RulesConfiguration (dict) --- The rules to be used for mapping users to roles. If you specify Rules as the role mapping type, RulesConfiguration is required. An array of rules. You can specify up to 25 rules per identity provider. Rules are evaluated in order. The first one to match specifies the role. (dict) --- A rule that maps a claim name, a claim value, and a match type to a role ARN. The claim name that must be present in the token, for example, 'isAdmin' or 'paid'. The match condition that specifies how closely the claim value in the IdP token must match Value. A brief string that the claim must match, for example, 'paid' or 'yes'. The role ARN.",
      "nested_params": [
        {
          "name": "Type",
          "type": "string",
          "required": false,
          "description": "The role mapping type. Token will use cognito:roles and cognito:preferred_role claims from the Cognito identity provider token to map groups to roles. Rules will attempt to match claims from the token to map to a role.",
          "nested_params": []
        },
        {
          "name": "AmbiguousRoleResolution",
          "type": "string",
          "required": false,
          "description": "If you specify Token or Rules as the Type, AmbiguousRoleResolution is required. Specifies the action to be taken if either no rules match the claim value for the Rules type, or there is no cognito:preferred_role claim and there are multiple cognito:roles matches for the Token type.",
          "nested_params": []
        },
        {
          "name": "RulesConfiguration",
          "type": "dict",
          "required": false,
          "description": "The rules to be used for mapping users to roles. If you specify Rules as the role mapping type, RulesConfiguration is required.",
          "nested_params": [
            {
              "name": "Rules",
              "type": "list",
              "required": false,
              "description": "An array of rules. You can specify up to 25 rules per identity provider. Rules are evaluated in order. The first one to match specifies the role.",
              "nested_params": [
                {
                  "name": "Claim",
                  "type": "string",
                  "required": false,
                  "description": "The claim name that must be present in the token, for example, 'isAdmin' or 'paid'.",
                  "nested_params": []
                },
                {
                  "name": "MatchType",
                  "type": "string",
                  "required": false,
                  "description": "The match condition that specifies how closely the claim value in the IdP token must match Value.",
                  "nested_params": []
                },
                {
                  "name": "Value",
                  "type": "string",
                  "required": false,
                  "description": "A brief string that the claim must match, for example, 'paid' or 'yes'.",
                  "nested_params": []
                },
                {
                  "name": "RoleARN",
                  "type": "string",
                  "required": false,
                  "description": "The role ARN.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}