{
  "method_name": "create_alarm_model",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iotevents/client/create_alarm_model.html",
  "description": "Creates an alarm model to monitor an AWS IoT Events input attribute. You can use the alarm to get notified when the value is outside a specified range. For more information, see Create an alarm model in the AWS IoT Events Developer Guide.",
  "parameters": [
    {
      "name": "alarmModelName",
      "type": "string",
      "required": true,
      "description": "A unique name that helps you identify the alarm model. You can't change this name after you create the alarm model.",
      "nested_params": []
    },
    {
      "name": "alarmModelDescription",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "roleArn",
      "type": "string",
      "required": true,
      "description": "The ARN of the IAM role that allows the alarm to perform actions and access AWS resources. For more information, see Amazon Resource Names (ARNs) in the AWS General Reference.",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "list",
      "required": true,
      "description": "A list of key-value pairs that contain metadata for the alarm model. The tags help you manage the alarm model. For more information, see Tagging your AWS IoT Events resources in the AWS IoT Events Developer Guide. You can create up to 50 tags for one alarm model. (dict) --- Metadata that can be used to manage the resource. The tag's key. The tag's value.",
      "nested_params": [
        {
          "name": "key",
          "type": "string",
          "required": false,
          "description": "The tag's key.",
          "nested_params": []
        },
        {
          "name": "value",
          "type": "string",
          "required": false,
          "description": "The tag's value.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "key",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "severity",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "alarmRule",
      "type": "dict",
      "required": true,
      "description": "Defines when your alarm is invoked. simpleRule (dict) --- A rule that compares an input property value to a threshold value with a comparison operator. The value on the left side of the comparison operator. You can specify an AWS IoT Events input attribute as an input property. The comparison operator. The value on the right side of the comparison operator. You can enter a number or specify an AWS IoT Events input attribute.",
      "nested_params": [
        {
          "name": "simpleRule",
          "type": "dict",
          "required": false,
          "description": "A rule that compares an input property value to a threshold value with a comparison operator.",
          "nested_params": [
            {
              "name": "inputProperty",
              "type": "string",
              "required": false,
              "description": "The value on the left side of the comparison operator. You can specify an AWS IoT Events input attribute as an input property.",
              "nested_params": []
            },
            {
              "name": "comparisonOperator",
              "type": "string",
              "required": false,
              "description": "The comparison operator.",
              "nested_params": []
            },
            {
              "name": "threshold",
              "type": "string",
              "required": false,
              "description": "The value on the right side of the comparison operator. You can enter a number or specify an AWS IoT Events input attribute.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "alarmNotification",
      "type": "dict",
      "required": true,
      "description": "Contains information about one or more notification actions. notificationActions (list) --- Contains the notification settings of an alarm model. The settings apply to all alarms that were created based on this alarm model. (dict) --- Contains the notification settings of an alarm model. Specifies an AWS Lambda function to manage alarm notifications. You can create one or use the AWS Lambda function provided by AWS IoT Events. lambdaAction (dict) --- Calls a Lambda function, passing in information about the detector model instance and the event that triggered the action. The ARN of the Lambda function that is executed. payload (dict) --- You can configure the action payload when you send a message to a Lambda function. The content of the payload. You can use a string expression that includes quoted strings ( '<string>'), variables ( $variable.<variable-name>), input values ( $input.<input-name>.<path-to-datum>), string concatenations, and quoted strings that contain ${} as the content. The recommended maximum size of a content expression is 1 KB. The value of the payload type can be either STRING or JSON. smsConfigurations (list) --- Contains the configuration information of SMS notifications. (dict) --- Contains the configuration information of SMS notifications. senderId (string) --- The sender ID. additionalMessage (string) --- The message that you want to send. The message can be up to 200 characters. Specifies one or more recipients who receive the message. (dict) --- The information that identifies the recipient. ssoIdentity (dict) --- The AWS Single Sign-On (AWS SSO) authentication information. The ID of the AWS SSO identity store. userId (string) --- The user ID. emailConfigurations (list) --- Contains the configuration information of email notifications. (dict) --- Contains the configuration information of email notifications. The email address that sends emails. content (dict) --- Contains the subject and message of an email. subject (string) --- The subject of the email. Contains the information of one or more recipients who receive the emails. to (list) --- Specifies one or more recipients who receive the email. userId (string) --- The user ID.",
      "nested_params": [
        {
          "name": "notificationActions",
          "type": "list",
          "required": false,
          "description": "Contains the notification settings of an alarm model. The settings apply to all alarms that were created based on this alarm model.",
          "nested_params": [
            {
              "name": "action",
              "type": "dict",
              "required": false,
              "description": "Specifies an AWS Lambda function to manage alarm notifications. You can create one or use the AWS Lambda function provided by AWS IoT Events.",
              "nested_params": [
                {
                  "name": "lambdaAction",
                  "type": "dict",
                  "required": false,
                  "description": "Calls a Lambda function, passing in information about the detector model instance and the event that triggered the action.",
                  "nested_params": [
                    {
                      "name": "functionArn",
                      "type": "string",
                      "required": false,
                      "description": "The ARN of the Lambda function that is executed.",
                      "nested_params": []
                    },
                    {
                      "name": "payload",
                      "type": "dict",
                      "required": false,
                      "description": "You can configure the action payload when you send a message to a Lambda function.",
                      "nested_params": [
                        {
                          "name": "contentExpression",
                          "type": "string",
                          "required": false,
                          "description": "The content of the payload. You can use a string expression that includes quoted strings ( '<string>'), variables ( $variable.<variable-name>), input values ( $input.<input-name>.<path-to-datum>), string concatenations, and quoted strings that contain ${} as the content. The recommended maximum size of a content expression is 1 KB.",
                          "nested_params": []
                        },
                        {
                          "name": "type",
                          "type": "string",
                          "required": false,
                          "description": "The value of the payload type can be either STRING or JSON.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "smsConfigurations",
              "type": "list",
              "required": false,
              "description": "Contains the configuration information of SMS notifications.",
              "nested_params": [
                {
                  "name": "senderId",
                  "type": "string",
                  "required": false,
                  "description": "The sender ID.",
                  "nested_params": []
                },
                {
                  "name": "additionalMessage",
                  "type": "string",
                  "required": false,
                  "description": "The message that you want to send. The message can be up to 200 characters.",
                  "nested_params": []
                },
                {
                  "name": "recipients",
                  "type": "list",
                  "required": false,
                  "description": "Specifies one or more recipients who receive the message.",
                  "nested_params": [
                    {
                      "name": "ssoIdentity",
                      "type": "dict",
                      "required": false,
                      "description": "The AWS Single Sign-On (AWS SSO) authentication information.",
                      "nested_params": [
                        {
                          "name": "identityStoreId",
                          "type": "string",
                          "required": false,
                          "description": "The ID of the AWS SSO identity store.",
                          "nested_params": []
                        },
                        {
                          "name": "userId",
                          "type": "string",
                          "required": false,
                          "description": "The user ID.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "emailConfigurations",
              "type": "list",
              "required": false,
              "description": "Contains the configuration information of email notifications.",
              "nested_params": [
                {
                  "name": "from",
                  "type": "string",
                  "required": false,
                  "description": "The email address that sends emails.",
                  "nested_params": []
                },
                {
                  "name": "content",
                  "type": "dict",
                  "required": false,
                  "description": "Contains the subject and message of an email.",
                  "nested_params": [
                    {
                      "name": "subject",
                      "type": "string",
                      "required": false,
                      "description": "The subject of the email.",
                      "nested_params": []
                    },
                    {
                      "name": "additionalMessage",
                      "type": "string",
                      "required": false,
                      "description": "The message that you want to send. The message can be up to 200 characters.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "recipients",
                  "type": "dict",
                  "required": false,
                  "description": "Contains the information of one or more recipients who receive the emails.",
                  "nested_params": [
                    {
                      "name": "to",
                      "type": "list",
                      "required": false,
                      "description": "Specifies one or more recipients who receive the email.",
                      "nested_params": [
                        {
                          "name": "ssoIdentity",
                          "type": "dict",
                          "required": false,
                          "description": "The AWS Single Sign-On (AWS SSO) authentication information.",
                          "nested_params": [
                            {
                              "name": "identityStoreId",
                              "type": "string",
                              "required": false,
                              "description": "The ID of the AWS SSO identity store.",
                              "nested_params": []
                            },
                            {
                              "name": "userId",
                              "type": "string",
                              "required": false,
                              "description": "The user ID.",
                              "nested_params": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "alarmEventActions",
      "type": "dict",
      "required": true,
      "description": "Contains information about one or more alarm actions. alarmActions (list) --- Specifies one or more supported actions to receive notifications when the alarm state changes. (dict) --- Specifies one of the following actions to receive notifications when the alarm state changes. sns (dict) --- Information required to publish the Amazon SNS message. The ARN of the Amazon SNS target where the message is sent. payload (dict) --- You can configure the action payload when you send a message as an Amazon SNS push notification. The content of the payload. You can use a string expression that includes quoted strings ( '<string>'), variables ( $variable.<variable-name>), input values ( $input.<input-name>.<path-to-datum>), string concatenations, and quoted strings that contain ${} as the content. The recommended maximum size of a content expression is 1 KB. The value of the payload type can be either STRING or JSON. iotTopicPublish (dict) --- Information required to publish the MQTT message through the AWS IoT message broker. The MQTT topic of the message. You can use a string expression that includes variables ( $variable.<variable-name>) and input values ( $input.<input-name>.<path-to-datum>) as the topic string. payload (dict) --- You can configure the action payload when you publish a message to an AWS IoT Core topic. lambda (dict) --- Calls a Lambda function, passing in information about the detector model instance and the event that triggered the action. The ARN of the Lambda function that is executed. payload (dict) --- You can configure the action payload when you send a message to a Lambda function. iotEvents (dict) --- Sends an AWS IoT Events input, passing in information about the detector model instance and the event that triggered the action. The name of the AWS IoT Events input where the data is sent. payload (dict) --- You can configure the action payload when you send a message to an AWS IoT Events input. sqs (dict) --- Sends information about the detector model instance and the event that triggered the action to an Amazon SQS queue. The URL of the SQS queue where the data is written. useBase64 (boolean) --- Set this to TRUE if you want the data to be base-64 encoded before it is written to the queue. Otherwise, set this to FALSE. payload (dict) --- You can configure the action payload when you send a message to an Amazon SQS queue. firehose (dict) --- Sends information about the detector model instance and the event that triggered the action to an Amazon Kinesis Data Firehose delivery stream. The name of the Kinesis Data Firehose delivery stream where the data is written. separator (string) --- A character separator that is used to separate records written to the Kinesis Data Firehose delivery stream. Valid values are: --\u0098n' (newline), --\u0098t' (tab), --\u0098rn' (Windows newline), --\u0098,' (comma). payload (dict) --- You can configure the action payload when you send a message to an Amazon Kinesis Data Firehose delivery stream. dynamoDB (dict) --- Defines an action to write to the Amazon DynamoDB table that you created. The standard action payload contains all the information about the detector model instance and the event that triggered the action. You can customize the payload. One column of the DynamoDB table receives all attribute-value pairs in the payload that you specify. You must use expressions for all parameters in DynamoDBAction. The expressions accept literals, operators, functions, references, and substitution templates. For literal values, the expressions must contain single quotes. For example, the value for the hashKeyType parameter can be 'STRING'. For references, you must specify either variables or input values. For example, the value for the hashKeyField parameter can be $input.GreenhouseInput.name. For a substitution template, you must use ${}, and the template must be in single quotes. A substitution template can also contain a combination of literals, operators, functions, references, and substitution templates. In the following example, the value for the hashKeyValue parameter uses a substitution template. '${$input.GreenhouseInput.temperature * 6 / 5 + 32} in Fahrenheit' For a string concatenation, you must use +. A string concatenation can also contain a combination of literals, operators, functions, references, and substitution templates. In the following example, the value for the tableName parameter uses a string concatenation. 'GreenhouseTemperatureTable ' + $input.GreenhouseInput.date For more information, see Expressions in the AWS IoT Events Developer Guide. If the defined payload type is a string, DynamoDBAction writes non-JSON data to the DynamoDB table as binary data. The DynamoDB console displays the data as Base64-encoded text. The value for the payloadField parameter is <payload-field>_raw. hashKeyType (string) --- The data type for the hash key (also called the partition key). You can specify the following values: 'STRING' - The hash key is a string. 'NUMBER' - The hash key is a number. If you don't specify hashKeyType, the default value is 'STRING'. The name of the hash key (also called the partition key). The hashKeyField value must match the partition key of the target DynamoDB table. The value of the hash key (also called the partition key). rangeKeyType (string) --- The data type for the range key (also called the sort key), You can specify the following values: 'STRING' - The range key is a string. 'NUMBER' - The range key is number. If you don't specify rangeKeyField, the default value is 'STRING'. rangeKeyField (string) --- The name of the range key (also called the sort key). The rangeKeyField value must match the sort key of the target DynamoDB table. rangeKeyValue (string) --- The value of the range key (also called the sort key). operation (string) --- The type of operation to perform. You can specify the following values: 'INSERT' - Insert data as a new item into the DynamoDB table. This item uses the specified hash key as a partition key. If you specified a range key, the item uses the range key as a sort key. 'UPDATE' - Update an existing item of the DynamoDB table with new data. This item's partition key must match the specified hash key. If you specified a range key, the range key must match the item's sort key. 'DELETE' - Delete an existing item of the DynamoDB table. If you don't specify this parameter, AWS IoT Events triggers the 'INSERT' operation. payloadField (string) --- The name of the DynamoDB column that receives the action payload. If you don't specify this parameter, the name of the DynamoDB column is payload. The name of the DynamoDB table. The tableName value must match the table name of the target DynamoDB table. payload (dict) --- Information needed to configure the payload. By default, AWS IoT Events generates a standard payload in JSON for any action. This action payload contains all attribute-value pairs that have the information about the detector model instance and the event triggered the action. To configure the action payload, you can use contentExpression. dynamoDBv2 (dict) --- Defines an action to write to the Amazon DynamoDB table that you created. The default action payload contains all the information about the detector model instance and the event that triggered the action. A separate column of the DynamoDB table receives one attribute-value pair in the payload that you specify. You must use expressions for all parameters in DynamoDBv2Action. For example, the value for the tableName parameter can be 'GreenhouseTemperatureTable'. For example, the value for the tableName parameter can be $variable.ddbtableName. In the following example, the value for the contentExpression parameter in Payload uses a substitution template. '{\\\"sensorID\\\": \\\"${$input.GreenhouseInput.sensor_id}\\\", \\\"temperature\\\": \\\"${$input.GreenhouseInput.temperature * 9 / 5 + 32}\\\"}' For a string concatenation, you must use +. The value for the type parameter in Payload must be JSON. iotSiteWise (dict) --- Sends information about the detector model instance and the event that triggered the action to a specified asset property in AWS IoT SiteWise. You must use expressions for all parameters in IotSiteWiseAction. The expressions accept literals, operators, functions, references, and substitutions templates. For example, the value for the propertyAlias parameter can be '/company/windfarm/3/turbine/7/temperature'. For example, the value for the assetId parameter can be $input.TurbineInput.assetId1. In the following example, the value for the propertyAlias parameter uses a substitution template. 'company/windfarm/${$input.TemperatureInput.sensorData.windfarmID}/turbine/ ${$input.TemperatureInput.sensorData.turbineID}/temperature' You must specify either propertyAlias or both assetId and propertyId to identify the target asset property in AWS IoT SiteWise. For more information, see Expressions in the AWS IoT Events Developer Guide. entryId (string) --- A unique identifier for this entry. You can use the entry ID to track which data entry causes an error in case of failure. The default is a new unique identifier. assetId (string) --- The ID of the asset that has the specified property. propertyId (string) --- The ID of the asset property. propertyAlias (string) --- The alias of the asset property. propertyValue (dict) --- The value to send to the asset property. This value contains timestamp, quality, and value (TQV) information. value (dict) --- The value to send to an asset property. stringValue (string) --- The asset property value is a string. You must use an expression, and the evaluated result should be a string. integerValue (string) --- The asset property value is an integer. You must use an expression, and the evaluated result should be an integer. doubleValue (string) --- The asset property value is a double. You must use an expression, and the evaluated result should be a double. booleanValue (string) --- The asset property value is a Boolean value that must be 'TRUE' or 'FALSE'. You must use an expression, and the evaluated result should be a Boolean value. timestamp (dict) --- The timestamp associated with the asset property value. The default is the current event time. The timestamp, in seconds, in the Unix epoch format. The valid range is between 1-31556889864403199. offsetInNanos (string) --- The nanosecond offset converted from timeInSeconds. The valid range is between 0-999999999. quality (string) --- The quality of the asset property value. The value must be 'GOOD', 'BAD', or 'UNCERTAIN'.",
      "nested_params": [
        {
          "name": "alarmActions",
          "type": "list",
          "required": false,
          "description": "Specifies one or more supported actions to receive notifications when the alarm state changes.",
          "nested_params": [
            {
              "name": "sns",
              "type": "dict",
              "required": false,
              "description": "Information required to publish the Amazon SNS message.",
              "nested_params": [
                {
                  "name": "targetArn",
                  "type": "string",
                  "required": false,
                  "description": "The ARN of the Amazon SNS target where the message is sent.",
                  "nested_params": []
                },
                {
                  "name": "payload",
                  "type": "dict",
                  "required": false,
                  "description": "You can configure the action payload when you send a message as an Amazon SNS push notification.",
                  "nested_params": [
                    {
                      "name": "contentExpression",
                      "type": "string",
                      "required": false,
                      "description": "The content of the payload. You can use a string expression that includes quoted strings ( '<string>'), variables ( $variable.<variable-name>), input values ( $input.<input-name>.<path-to-datum>), string concatenations, and quoted strings that contain ${} as the content. The recommended maximum size of a content expression is 1 KB.",
                      "nested_params": []
                    },
                    {
                      "name": "type",
                      "type": "string",
                      "required": false,
                      "description": "The value of the payload type can be either STRING or JSON.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "iotTopicPublish",
              "type": "dict",
              "required": false,
              "description": "Information required to publish the MQTT message through the AWS IoT message broker.",
              "nested_params": [
                {
                  "name": "mqttTopic",
                  "type": "string",
                  "required": false,
                  "description": "The MQTT topic of the message. You can use a string expression that includes variables ( $variable.<variable-name>) and input values ( $input.<input-name>.<path-to-datum>) as the topic string.",
                  "nested_params": []
                },
                {
                  "name": "payload",
                  "type": "dict",
                  "required": false,
                  "description": "You can configure the action payload when you publish a message to an AWS IoT Core topic.",
                  "nested_params": [
                    {
                      "name": "contentExpression",
                      "type": "string",
                      "required": false,
                      "description": "The content of the payload. You can use a string expression that includes quoted strings ( '<string>'), variables ( $variable.<variable-name>), input values ( $input.<input-name>.<path-to-datum>), string concatenations, and quoted strings that contain ${} as the content. The recommended maximum size of a content expression is 1 KB.",
                      "nested_params": []
                    },
                    {
                      "name": "type",
                      "type": "string",
                      "required": false,
                      "description": "The value of the payload type can be either STRING or JSON.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "lambda",
              "type": "dict",
              "required": false,
              "description": "Calls a Lambda function, passing in information about the detector model instance and the event that triggered the action.",
              "nested_params": [
                {
                  "name": "functionArn",
                  "type": "string",
                  "required": false,
                  "description": "The ARN of the Lambda function that is executed.",
                  "nested_params": []
                },
                {
                  "name": "payload",
                  "type": "dict",
                  "required": false,
                  "description": "You can configure the action payload when you send a message to a Lambda function.",
                  "nested_params": [
                    {
                      "name": "contentExpression",
                      "type": "string",
                      "required": false,
                      "description": "The content of the payload. You can use a string expression that includes quoted strings ( '<string>'), variables ( $variable.<variable-name>), input values ( $input.<input-name>.<path-to-datum>), string concatenations, and quoted strings that contain ${} as the content. The recommended maximum size of a content expression is 1 KB.",
                      "nested_params": []
                    },
                    {
                      "name": "type",
                      "type": "string",
                      "required": false,
                      "description": "The value of the payload type can be either STRING or JSON.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "iotEvents",
              "type": "dict",
              "required": false,
              "description": "Sends an AWS IoT Events input, passing in information about the detector model instance and the event that triggered the action.",
              "nested_params": [
                {
                  "name": "inputName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the AWS IoT Events input where the data is sent.",
                  "nested_params": []
                },
                {
                  "name": "payload",
                  "type": "dict",
                  "required": false,
                  "description": "You can configure the action payload when you send a message to an AWS IoT Events input.",
                  "nested_params": [
                    {
                      "name": "contentExpression",
                      "type": "string",
                      "required": false,
                      "description": "The content of the payload. You can use a string expression that includes quoted strings ( '<string>'), variables ( $variable.<variable-name>), input values ( $input.<input-name>.<path-to-datum>), string concatenations, and quoted strings that contain ${} as the content. The recommended maximum size of a content expression is 1 KB.",
                      "nested_params": []
                    },
                    {
                      "name": "type",
                      "type": "string",
                      "required": false,
                      "description": "The value of the payload type can be either STRING or JSON.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "sqs",
              "type": "dict",
              "required": false,
              "description": "Sends information about the detector model instance and the event that triggered the action to an Amazon SQS queue.",
              "nested_params": [
                {
                  "name": "queueUrl",
                  "type": "string",
                  "required": false,
                  "description": "The URL of the SQS queue where the data is written.",
                  "nested_params": []
                },
                {
                  "name": "useBase64",
                  "type": "boolean",
                  "required": false,
                  "description": "Set this to TRUE if you want the data to be base-64 encoded before it is written to the queue. Otherwise, set this to FALSE.",
                  "nested_params": []
                },
                {
                  "name": "payload",
                  "type": "dict",
                  "required": false,
                  "description": "You can configure the action payload when you send a message to an Amazon SQS queue.",
                  "nested_params": [
                    {
                      "name": "contentExpression",
                      "type": "string",
                      "required": false,
                      "description": "The content of the payload. You can use a string expression that includes quoted strings ( '<string>'), variables ( $variable.<variable-name>), input values ( $input.<input-name>.<path-to-datum>), string concatenations, and quoted strings that contain ${} as the content. The recommended maximum size of a content expression is 1 KB.",
                      "nested_params": []
                    },
                    {
                      "name": "type",
                      "type": "string",
                      "required": false,
                      "description": "The value of the payload type can be either STRING or JSON.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "firehose",
              "type": "dict",
              "required": false,
              "description": "Sends information about the detector model instance and the event that triggered the action to an Amazon Kinesis Data Firehose delivery stream.",
              "nested_params": [
                {
                  "name": "deliveryStreamName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the Kinesis Data Firehose delivery stream where the data is written.",
                  "nested_params": []
                },
                {
                  "name": "separator",
                  "type": "string",
                  "required": false,
                  "description": "A character separator that is used to separate records written to the Kinesis Data Firehose delivery stream. Valid values are: --\u0098n' (newline), --\u0098t' (tab), --\u0098rn' (Windows newline), --\u0098,' (comma).",
                  "nested_params": []
                },
                {
                  "name": "payload",
                  "type": "dict",
                  "required": false,
                  "description": "You can configure the action payload when you send a message to an Amazon Kinesis Data Firehose delivery stream.",
                  "nested_params": [
                    {
                      "name": "contentExpression",
                      "type": "string",
                      "required": false,
                      "description": "The content of the payload. You can use a string expression that includes quoted strings ( '<string>'), variables ( $variable.<variable-name>), input values ( $input.<input-name>.<path-to-datum>), string concatenations, and quoted strings that contain ${} as the content. The recommended maximum size of a content expression is 1 KB.",
                      "nested_params": []
                    },
                    {
                      "name": "type",
                      "type": "string",
                      "required": false,
                      "description": "The value of the payload type can be either STRING or JSON.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "dynamoDB",
              "type": "dict",
              "required": false,
              "description": "Defines an action to write to the Amazon DynamoDB table that you created. The standard action payload contains all the information about the detector model instance and the event that triggered the action. You can customize the payload. One column of the DynamoDB table receives all attribute-value pairs in the payload that you specify. You must use expressions for all parameters in DynamoDBAction. The expressions accept literals, operators, functions, references, and substitution templates.",
              "nested_params": []
            },
            {
              "name": "dynamoDBv2",
              "type": "dict",
              "required": false,
              "description": "Defines an action to write to the Amazon DynamoDB table that you created. The default action payload contains all the information about the detector model instance and the event that triggered the action. You can customize the payload. A separate column of the DynamoDB table receives one attribute-value pair in the payload that you specify. You must use expressions for all parameters in DynamoDBv2Action. The expressions accept literals, operators, functions, references, and substitution templates.",
              "nested_params": []
            },
            {
              "name": "iotSiteWise",
              "type": "dict",
              "required": false,
              "description": "Sends information about the detector model instance and the event that triggered the action to a specified asset property in AWS IoT SiteWise. You must use expressions for all parameters in IotSiteWiseAction. The expressions accept literals, operators, functions, references, and substitutions templates.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "alarmCapabilities",
      "type": "dict",
      "required": true,
      "description": "Contains the configuration information of alarm state changes. initializationConfiguration (dict) --- Specifies the default alarm state. The configuration applies to all alarms that were created based on this alarm model. The value must be TRUE or FALSE. If FALSE, all alarm instances created based on the alarm model are activated. The default value is TRUE. acknowledgeFlow (dict) --- Specifies whether to get notified for alarm state changes. If TRUE, you receive a notification when the alarm state changes. You must choose to acknowledge the notification before the alarm state can return to NORMAL. If FALSE, you won't receive notifications. The alarm automatically changes to the NORMAL state when the input property value returns to the specified range.",
      "nested_params": [
        {
          "name": "initializationConfiguration",
          "type": "dict",
          "required": false,
          "description": "Specifies the default alarm state. The configuration applies to all alarms that were created based on this alarm model.",
          "nested_params": [
            {
              "name": "disabledOnInitialization",
              "type": "boolean",
              "required": false,
              "description": "The value must be TRUE or FALSE. If FALSE, all alarm instances created based on the alarm model are activated. The default value is TRUE.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "acknowledgeFlow",
          "type": "dict",
          "required": false,
          "description": "Specifies whether to get notified for alarm state changes.",
          "nested_params": [
            {
              "name": "enabled",
              "type": "boolean",
              "required": false,
              "description": "The value must be TRUE or FALSE. If TRUE, you receive a notification when the alarm state changes. You must choose to acknowledge the notification before the alarm state can return to NORMAL. If FALSE, you won't receive notifications. The alarm automatically changes to the NORMAL state when the input property value returns to the specified range.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "creationTime",
          "type": "datetime",
          "description": "The time the alarm model was created, in the Unix epoch format.",
          "nested_items": []
        },
        {
          "name": "alarmModelArn",
          "type": "string",
          "description": "The ARN of the alarm model. For more information, see Amazon Resource Names (ARNs) in the AWS General Reference.",
          "nested_items": []
        },
        {
          "name": "alarmModelVersion",
          "type": "string",
          "description": "The version of the alarm model.",
          "nested_items": []
        },
        {
          "name": "lastUpdateTime",
          "type": "datetime",
          "description": "The time the alarm model was last updated, in the Unix epoch format.",
          "nested_items": []
        },
        {
          "name": "status",
          "type": "string",
          "description": "The status of the alarm model. The status can be one of the following values:",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "ACTIVE - The alarm model is active and it's ready to evaluate data.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "ACTIVATING - AWS IoT Events is activating your alarm model. Activating an alarm model can take up to a few minutes.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "INACTIVE - The alarm model is inactive, so it isn't ready to evaluate data. Check your alarm model information and update the alarm model.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "FAILED - You couldn't create or update the alarm model. Check your alarm model information and try again.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}