{
  "method_name": "create_scope",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/networkflowmonitor/client/create_scope.html",
  "description": "Create a scope of resources that you want to be available for Network Flow Monitor to generate metrics for, when you have active agents on those resources sending metrics reports to the Network Flow Monitor backend. This call returns a scope ID to identify the scope. When you create a scope, you enable permissions for Network Flow Monitor. The scope is set to the resources for the Amazon Web Services that enables the feature.",
  "parameters": [
    {
      "name": "targets",
      "type": "list",
      "required": true,
      "description": "The targets to define the scope to be monitored. Currently, a target is an Amazon Web Services account. (dict) --- A target resource in a scope. The resource is identified by a Region and a target identifier, which includes a target ID and a target type. A target identifier is a pair of identifying information for a resource that is included in a target. A target identifier includes the target ID and the target type. The identifier for a target. accountId (string) --- The identifier for the account for a target. The type of a target. A target type is currently always ACCOUNT because a target is currently a single Amazon Web Services account. The Amazon Web Services Region where the target resource is located.",
      "nested_params": [
        {
          "name": "targetIdentifier",
          "type": "dict",
          "required": false,
          "description": "A target identifier is a pair of identifying information for a resource that is included in a target. A target identifier includes the target ID and the target type.",
          "nested_params": [
            {
              "name": "targetId",
              "type": "dict",
              "required": false,
              "description": "The identifier for a target.",
              "nested_params": [
                {
                  "name": "accountId",
                  "type": "string",
                  "required": false,
                  "description": "The identifier for the account for a target.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "targetType",
              "type": "string",
              "required": false,
              "description": "The type of a target. A target type is currently always ACCOUNT because a target is currently a single Amazon Web Services account.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "region",
          "type": "string",
          "required": false,
          "description": "The Amazon Web Services Region where the target resource is located.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "clientToken",
      "type": "string",
      "required": false,
      "description": "A unique, case-sensitive string of up to 64 ASCII characters that you specify to make an idempotent API request. Don't reuse the same client token for other API requests. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "dict",
      "required": false,
      "description": "The tags for a scope. You can add a maximum of 200 tags. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "scopeId",
          "type": "string",
          "description": "The identifier for the scope that includes the resources you want to get metrics for. A scope ID is an internally-generated identifier that includes all the resources for a specific root account.",
          "nested_items": []
        },
        {
          "name": "status",
          "type": "string",
          "description": "The status for a call to create a scope. The status can be one of the following: SUCCEEDED, IN_PROGRESS, or FAILED.",
          "nested_items": []
        },
        {
          "name": "scopeArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the scope.",
          "nested_items": []
        },
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}