{
  "method_name": "get_query_status_workload_insights_top_contributors_data",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/networkflowmonitor/client/get_query_status_workload_insights_top_contributors_data.html",
  "description": "Returns the current status of a query for the Network Flow Monitor query interface, for a specified query ID and monitor. This call returns the query status for the top contributors data for workload insights. When you start a query, use this call to check the status of the query to make sure that it has has SUCCEEDED before you review the results. Use the same query ID that you used for the corresponding API call to start the query, StartQueryWorkloadInsightsTopContributorsData. Top contributors in Network Flow Monitor are network flows with the highest values for a specific metric type. Top contributors can be across all workload insights, for a given scope, or for a specific monitor. Use the applicable call for the top contributors that you want to be returned. The top contributor network flows overall are for a specific metric type, for example, the number of retransmissions.",
  "parameters": [
    {
      "name": "scopeId",
      "type": "string",
      "required": true,
      "description": "The identifier for the scope that includes the resources you want to get data results for. A scope ID is an internally-generated identifier that includes all the resources for a specific root account. A scope ID is returned from a CreateScope API call.",
      "nested_params": []
    },
    {
      "name": "queryId",
      "type": "string",
      "required": true,
      "description": "The identifier for the query. A query ID is an internally-generated identifier for a specific query returned from an API call to start a query.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "status",
          "type": "string",
          "description": "The status of a query for top contributors data.",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "QUEUED: The query is scheduled to run.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "RUNNING: The query is in progress but not complete.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "SUCCEEDED: The query completed sucessfully.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "FAILED: The query failed due to an error.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "CANCELED: The query was canceled.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}