{
  "method_name": "get_query_status_workload_insights_top_contributors",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/networkflowmonitor/client/get_query_status_workload_insights_top_contributors.html",
  "description": "Return the data for a query with the Network Flow Monitor query interface. Specify the query that you want to return results for by providing a query ID and a monitor name. This query returns the top contributors for workload insights. When you start a query, use this call to check the status of the query to make sure that it has has SUCCEEDED before you review the results. Use the same query ID that you used for the corresponding API call to start the query, StartQueryWorkloadInsightsTopContributors. Top contributors in Network Flow Monitor are network flows with the highest values for a specific metric type. Top contributors can be across all workload insights, for a given scope, or for a specific monitor. Use the applicable call for the top contributors that you want to be returned.",
  "parameters": [
    {
      "name": "scopeId",
      "type": "string",
      "required": true,
      "description": "The identifier for the scope that includes the resources you want to get data results for. A scope ID is an internally-generated identifier that includes all the resources for a specific root account.",
      "nested_params": []
    },
    {
      "name": "queryId",
      "type": "string",
      "required": true,
      "description": "The identifier for the query. A query ID is an internally-generated identifier for a specific query returned from an API call to start a query.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "status",
          "type": "string",
          "description": "When you run a query, use this call to check the status of the query to make sure that the query has SUCCEEDED before you review the results.",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "QUEUED: The query is scheduled to run.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "RUNNING: The query is in progress but not complete.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "SUCCEEDED: The query completed sucessfully.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "FAILED: The query failed due to an error.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "CANCELED: The query was canceled.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}