{
  "method_name": "start_query_monitor_top_contributors",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/networkflowmonitor/client/start_query_monitor_top_contributors.html",
  "description": "Create a query that you can use with the Network Flow Monitor query interface to return the top contributors for a monitor. Specify the monitor that you want to create the query for. The call returns a query ID that you can use with GetQueryResultsMonitorTopContributors to run the query and return the top contributors for a specific monitor. Top contributors in Network Flow Monitor are network flows with the highest values for a specific metric type. Top contributors can be across all workload insights, for a given scope, or for a specific monitor. Use the applicable APIs for the top contributors that you want to be returned.",
  "parameters": [
    {
      "name": "monitorName",
      "type": "string",
      "required": true,
      "description": "The name of the monitor.",
      "nested_params": []
    },
    {
      "name": "startTime",
      "type": "datetime",
      "required": true,
      "description": "The timestamp that is the date and time beginning of the period that you want to retrieve results for with your query.",
      "nested_params": []
    },
    {
      "name": "endTime",
      "type": "datetime",
      "required": true,
      "description": "The timestamp that is the date and time end of the period that you want to retrieve results for with your query.",
      "nested_params": []
    },
    {
      "name": "metricName",
      "type": "string",
      "required": true,
      "description": "The metric that you want to query top contributors for. That is, you can specify a metric with this call and return the top contributor network flows, for that type of metric, for a monitor and (optionally) within a specific category, such as network flows between Availability Zones.",
      "nested_params": []
    },
    {
      "name": "destinationCategory",
      "type": "string",
      "required": true,
      "description": "The category that you want to query top contributors for, for a specific monitor. Destination categories can be one of the following: INTRA_AZ: Top contributor network flows within a single Availability Zone INTER_AZ: Top contributor network flows between Availability Zones INTER_VPC: Top contributor network flows between VPCs AMAZON_S3: Top contributor network flows to or from Amazon S3 AMAZON_DYNAMODB: Top contributor network flows to or from Amazon Dynamo DB UNCLASSIFIED: Top contributor network flows that do not have a bucket classification.",
      "nested_params": []
    },
    {
      "name": "limit",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "queryId",
          "type": "string",
          "description": "The identifier for the query. A query ID is an internally-generated identifier for a specific query returned from an API call to start a query.",
          "nested_items": []
        }
      ]
    }
  ]
}