{
  "method_name": "start_query_workload_insights_top_contributors_data",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/networkflowmonitor/client/start_query_workload_insights_top_contributors_data.html",
  "description": "Create a query with the Network Flow Monitor query interface that you can run to return data for workload insights top contributors. Specify the scope that you want to create a query for. The call returns a query ID that you can use with GetQueryResultsWorkloadInsightsTopContributorsData to run the query and return the data for the top contributors for the workload insights for a scope. Top contributors in Network Flow Monitor are network flows with the highest values for a specific metric type. Top contributors can be across all workload insights, for a given scope, or for a specific monitor. Use the applicable call for the top contributors that you want to be returned.",
  "parameters": [
    {
      "name": "scopeId",
      "type": "string",
      "required": true,
      "description": "The identifier for the scope that includes the resources you want to get data results for. A scope ID is an internally-generated identifier that includes all the resources for a specific root account.",
      "nested_params": []
    },
    {
      "name": "startTime",
      "type": "datetime",
      "required": true,
      "description": "The timestamp that is the date and time beginning of the period that you want to retrieve results for with your query.",
      "nested_params": []
    },
    {
      "name": "endTime",
      "type": "datetime",
      "required": true,
      "description": "The timestamp that is the date and time end of the period that you want to retrieve results for with your query.",
      "nested_params": []
    },
    {
      "name": "metricName",
      "type": "string",
      "required": true,
      "description": "The metric that you want to query top contributors for. That is, you can specify this metric to return the top contributor network flows, for this type of metric, for a monitor and (optionally) within a specific category, such as network flows between Availability Zones.",
      "nested_params": []
    },
    {
      "name": "destinationCategory",
      "type": "string",
      "required": true,
      "description": "The destination category for a top contributors. Destination categories can be one of the following: INTRA_AZ: Top contributor network flows within a single Availability Zone INTER_AZ: Top contributor network flows between Availability Zones INTER_VPC: Top contributor network flows between VPCs AWS_SERVICES: Top contributor network flows to or from Amazon Web Services services UNCLASSIFIED: Top contributor network flows that do not have a bucket classification.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "queryId",
          "type": "string",
          "description": "The identifier for the query. A query ID is an internally-generated identifier for a specific query returned from an API call to start a query.",
          "nested_items": []
        }
      ]
    }
  ]
}