{
  "method_name": "list_dead_letter_source_queues",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sqs/client/list_dead_letter_source_queues.html",
  "description": "Returns a list of your queues that have the RedrivePolicy queue attribute configured with a dead-letter queue. The ListDeadLetterSourceQueues methods supports pagination. Set parameter MaxResults in the request to specify the maximum number of results to be returned in the response. If you do not set MaxResults, the response includes a maximum of 1,000 results. If you set MaxResults and there are additional results to display, the response includes a value for NextToken. Use NextToken as a parameter in your next request to ListDeadLetterSourceQueues to receive the next page of results. For more information about using dead-letter queues, see Using Amazon SQS Dead-Letter Queues in the Amazon SQS Developer Guide.",
  "parameters": [
    {
      "name": "QueueUrl",
      "type": "string",
      "required": true,
      "description": "The URL of a dead-letter queue. Queue URLs and names are case-sensitive.",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "queueUrls",
          "type": "list",
          "description": "A list of source queue URLs that have the RedrivePolicy queue attribute configured with a dead-letter queue.",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": []
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "Pagination token to include in the next request. Token value is null if there are no additional results to request, or if you did not set MaxResults in the request.",
          "nested_items": []
        }
      ]
    }
  ]
}