{
  "method_name": "enable_federation",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudtrail/client/enable_federation.html",
  "description": "Enables Lake query federation on the specified event data store. Federating an event data store lets you view the metadata associated with the event data store in the Glue Data Catalog and run SQL queries against your event data using Amazon Athena. The table metadata stored in the Glue Data Catalog lets the Athena query engine know how to find, read, and process the data that you want to query. When you enable Lake query federation, CloudTrail creates a managed database named aws:cloudtrail (if the database doesn't already exist) and a managed federated table in the Glue Data Catalog. The event data store ID is used for the table name. CloudTrail registers the role ARN and event data store in Lake Formation, the service responsible for allowing fine-grained access control of the federated resources in the Glue Data Catalog. For more information about Lake query federation, see Federate an event data store.",
  "parameters": [
    {
      "name": "EventDataStore",
      "type": "string",
      "required": true,
      "description": "The ARN (or ID suffix of the ARN) of the event data store for which you want to enable Lake query federation.",
      "nested_params": []
    },
    {
      "name": "FederationRoleArn",
      "type": "string",
      "required": true,
      "description": "The ARN of the federation role to use for the event data store. Amazon Web Services services like Lake Formation use this federation role to access data for the federated event data store. The federation role must exist in your account and provide the required minimum permissions.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "EventDataStoreArn",
          "type": "string",
          "description": "The ARN of the event data store for which you enabled Lake query federation.",
          "nested_items": []
        },
        {
          "name": "FederationStatus",
          "type": "string",
          "description": "The federation status.",
          "nested_items": []
        },
        {
          "name": "FederationRoleArn",
          "type": "string",
          "description": "The ARN of the federation role.",
          "nested_items": []
        }
      ]
    }
  ]
}