{
  "method_name": "generate_query",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudtrail/client/generate_query.html",
  "description": "Generates a query from a natural language prompt. This operation uses generative artificial intelligence (generative AI) to produce a ready-to-use SQL query from the prompt. The prompt can be a question or a statement about the event data in your event data store. For example, you can enter prompts like 'What are my top errors in the past month?' and 'Give me a list of users that used SNS.' The prompt must be in English. For information about limitations, permissions, and supported Regions, see Create CloudTrail Lake queries from natural language prompts in the CloudTrail user guide.",
  "parameters": [
    {
      "name": "EventDataStores",
      "type": "list",
      "required": true,
      "description": "The ARN (or ID suffix of the ARN) of the event data store that you want to query. You can only specify one event data store. (string) ---",
      "nested_params": []
    },
    {
      "name": "Prompt",
      "type": "string",
      "required": true,
      "description": "The prompt that you want to use to generate the query. The prompt must be in English. For example prompts, see Example prompts in the CloudTrail user guide.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "QueryStatement",
          "type": "string",
          "description": "The SQL query statement generated from the prompt.",
          "nested_items": []
        },
        {
          "name": "QueryAlias",
          "type": "string",
          "description": "An alias that identifies the prompt. When you run the StartQuery operation, you can pass in either the QueryAlias or QueryStatement parameter.",
          "nested_items": []
        },
        {
          "name": "EventDataStoreOwnerAccountId",
          "type": "string",
          "description": "The account ID of the event data store owner.",
          "nested_items": []
        }
      ]
    }
  ]
}