{
  "method_name": "update_event_data_store",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudtrail/client/update_event_data_store.html",
  "description": "Updates an event data store. The required EventDataStore value is an ARN or the ID portion of the ARN. Other parameters are optional, but at least one optional parameter must be specified, or CloudTrail throws an error. RetentionPeriod is in days, and valid values are integers between 7 and 3653 if the BillingMode is set to EXTENDABLE_RETENTION_PRICING, or between 7 and 2557 if BillingMode is set to FIXED_RETENTION_PRICING. By default, TerminationProtection is enabled. For event data stores for CloudTrail events, AdvancedEventSelectors includes or excludes management, data, or network activity events in your event data store. For more information about AdvancedEventSelectors, see AdvancedEventSelectors. For event data stores for CloudTrail Insights events, Config configuration items, Audit Manager evidence, or non-Amazon Web Services events, AdvancedEventSelectors includes events of that type in your event data store.",
  "parameters": [
    {
      "name": "EventDataStore",
      "type": "string",
      "required": true,
      "description": "The ARN (or the ID suffix of the ARN) of the event data store that you want to update.",
      "nested_params": []
    },
    {
      "name": "Name",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "AdvancedEventSelectors",
      "type": "list",
      "required": true,
      "description": "The advanced event selectors used to select events for the event data store. You can configure up to five advanced event selectors for each event data store. (dict) --- Advanced event selectors let you create fine-grained selectors for CloudTrail management, data, and network activity events. They help you control costs by logging only those events that are important to you. For more information about configuring advanced event selectors, see the Logging data events, Logging network activity events, and Logging management events topics in the CloudTrail User Guide. You cannot apply both event selectors and advanced event selectors to a trail. For information about configurable advanced event selector fields, see AdvancedEventSelector in the CloudTrail API Reference. Name (string) --- An optional, descriptive name for an advanced event selector, such as 'Log data events for only two S3 buckets'. Contains all selector statements in an advanced event selector. (dict) --- A single selector statement in an advanced event selector. A field in a CloudTrail event record on which to filter events to be logged. For event data stores for CloudTrail Insights events, Config configuration items, Audit Manager evidence, or events outside of Amazon Web Services, the field is used only for selecting events as filtering is not supported. For more information, see AdvancedFieldSelector in the CloudTrail API Reference. Equals (list) --- An operator that includes events that match the exact value of the event record field specified as the value of Field. This is the only valid operator that you can use with the readOnly, eventCategory, and resources.type fields. (string) --- StartsWith (list) --- An operator that includes events that match the first few characters of the event record field specified as the value of Field. (string) --- EndsWith (list) --- An operator that includes events that match the last few characters of the event record field specified as the value of Field. (string) --- NotEquals (list) --- An operator that excludes events that match the exact value of the event record field specified as the value of Field. (string) --- NotStartsWith (list) --- An operator that excludes events that match the first few characters of the event record field specified as the value of Field. (string) --- NotEndsWith (list) --- An operator that excludes events that match the last few characters of the event record field specified as the value of Field. (string) ---",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "An optional, descriptive name for an advanced event selector, such as 'Log data events for only two S3 buckets'.",
          "nested_params": []
        },
        {
          "name": "FieldSelectors",
          "type": "list",
          "required": false,
          "description": "Contains all selector statements in an advanced event selector.",
          "nested_params": [
            {
              "name": "Field",
              "type": "string",
              "required": false,
              "description": "A field in a CloudTrail event record on which to filter events to be logged. For event data stores for CloudTrail Insights events, Config configuration items, Audit Manager evidence, or events outside of Amazon Web Services, the field is used only for selecting events as filtering is not supported. For more information, see AdvancedFieldSelector in the CloudTrail API Reference.",
              "nested_params": []
            },
            {
              "name": "Equals",
              "type": "list",
              "required": false,
              "description": "An operator that includes events that match the exact value of the event record field specified as the value of Field. This is the only valid operator that you can use with the readOnly, eventCategory, and resources.type fields.",
              "nested_params": []
            },
            {
              "name": "StartsWith",
              "type": "list",
              "required": false,
              "description": "An operator that includes events that match the first few characters of the event record field specified as the value of Field.",
              "nested_params": []
            },
            {
              "name": "EndsWith",
              "type": "list",
              "required": false,
              "description": "An operator that includes events that match the last few characters of the event record field specified as the value of Field.",
              "nested_params": []
            },
            {
              "name": "NotEquals",
              "type": "list",
              "required": false,
              "description": "An operator that excludes events that match the exact value of the event record field specified as the value of Field.",
              "nested_params": []
            },
            {
              "name": "NotStartsWith",
              "type": "list",
              "required": false,
              "description": "An operator that excludes events that match the first few characters of the event record field specified as the value of Field.",
              "nested_params": []
            },
            {
              "name": "NotEndsWith",
              "type": "list",
              "required": false,
              "description": "An operator that excludes events that match the last few characters of the event record field specified as the value of Field.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "MultiRegionEnabled",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "OrganizationEnabled",
      "type": "boolean",
      "required": false,
      "description": "Specifies whether an event data store collects events logged for an organization in Organizations.",
      "nested_params": []
    },
    {
      "name": "RetentionPeriod",
      "type": "integer",
      "required": false,
      "description": "The retention period of the event data store, in days. If BillingMode is set to EXTENDABLE_RETENTION_PRICING, you can set a retention period of up to 3653 days, the equivalent of 10 years. If BillingMode is set to FIXED_RETENTION_PRICING, you can set a retention period of up to 2557 days, the equivalent of seven years. CloudTrail Lake determines whether to retain an event by checking if the eventTime of the event is within the specified retention period. For example, if you set a retention period of 90 days, CloudTrail will remove events when the eventTime is older than 90 days.",
      "nested_params": []
    },
    {
      "name": "TerminationProtectionEnabled",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "KmsKeyId",
      "type": "string",
      "required": false,
      "description": "Specifies the KMS key ID to use to encrypt the events delivered by CloudTrail. The value can be an alias name prefixed by alias/, a fully specified ARN to an alias, a fully specified ARN to a key, or a globally unique identifier. CloudTrail also supports KMS multi-Region keys. For more information about multi-Region keys, see Using multi-Region keys in the Key Management Service Developer Guide. Examples: alias/MyAliasName arn:aws:kms:us-east-2:123456789012:alias/MyAliasName arn:aws:kms:us-east-2:123456789012:key/12345678-1234-1234-1234-123456789012 12345678-1234-1234-1234-123456789012",
      "nested_params": []
    },
    {
      "name": "BillingMode",
      "type": "string",
      "required": false,
      "description": "The billing mode for the event data store determines the cost for ingesting events and the default and maximum retention period for the event data store. The following are the possible values: EXTENDABLE_RETENTION_PRICING - This billing mode is generally recommended if you want a flexible retention period of up to 3653 days (about 10 years). The default retention period for this billing mode is 366 days. FIXED_RETENTION_PRICING - This billing mode is recommended if you expect to ingest more than 25 TB of event data per month and need a retention period of up to 2557 days (about 7 years). The default retention period for this billing mode is 2557 days. For more information about CloudTrail pricing, see CloudTrail Pricing and Managing CloudTrail Lake costs.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "EventDataStoreArn",
          "type": "string",
          "description": "The ARN of the event data store.",
          "nested_items": []
        },
        {
          "name": "Name",
          "type": "string",
          "description": "The name of the event data store.",
          "nested_items": []
        },
        {
          "name": "Status",
          "type": "string",
          "description": "The status of an event data store.",
          "nested_items": []
        },
        {
          "name": "AdvancedEventSelectors",
          "type": "list",
          "description": "The advanced event selectors that are applied to the event data store.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Name",
                  "type": "string",
                  "description": "An optional, descriptive name for an advanced event selector, such as 'Log data events for only two S3 buckets'.",
                  "nested_items": []
                },
                {
                  "name": "FieldSelectors",
                  "type": "list",
                  "description": "Contains all selector statements in an advanced event selector.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Field",
                          "type": "string",
                          "description": "A field in a CloudTrail event record on which to filter events to be logged. For event data stores for CloudTrail Insights events, Config configuration items, Audit Manager evidence, or events outside of Amazon Web Services, the field is used only for selecting events as filtering is not supported.",
                          "nested_items": []
                        },
                        {
                          "name": "Equals",
                          "type": "list",
                          "description": "An operator that includes events that match the exact value of the event record field specified as the value of Field. This is the only valid operator that you can use with the readOnly, eventCategory, and resources.type fields.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "StartsWith",
                          "type": "list",
                          "description": "An operator that includes events that match the first few characters of the event record field specified as the value of Field.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "EndsWith",
                          "type": "list",
                          "description": "An operator that includes events that match the last few characters of the event record field specified as the value of Field.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "NotEquals",
                          "type": "list",
                          "description": "An operator that excludes events that match the exact value of the event record field specified as the value of Field.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "NotStartsWith",
                          "type": "list",
                          "description": "An operator that excludes events that match the first few characters of the event record field specified as the value of Field.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "NotEndsWith",
                          "type": "list",
                          "description": "An operator that excludes events that match the last few characters of the event record field specified as the value of Field.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "MultiRegionEnabled",
          "type": "boolean",
          "description": "Indicates whether the event data store includes events from all Regions, or only from the Region in which it was created.",
          "nested_items": []
        },
        {
          "name": "OrganizationEnabled",
          "type": "boolean",
          "description": "Indicates whether an event data store is collecting logged events for an organization in Organizations.",
          "nested_items": []
        },
        {
          "name": "RetentionPeriod",
          "type": "integer",
          "description": "The retention period, in days.",
          "nested_items": []
        },
        {
          "name": "TerminationProtectionEnabled",
          "type": "boolean",
          "description": "Indicates whether termination protection is enabled for the event data store.",
          "nested_items": []
        },
        {
          "name": "CreatedTimestamp",
          "type": "datetime",
          "description": "The timestamp that shows when an event data store was first created.",
          "nested_items": []
        },
        {
          "name": "UpdatedTimestamp",
          "type": "datetime",
          "description": "The timestamp that shows when the event data store was last updated. UpdatedTimestamp is always either the same or newer than the time shown in CreatedTimestamp.",
          "nested_items": []
        },
        {
          "name": "KmsKeyId",
          "type": "string",
          "description": "Specifies the KMS key ID that encrypts the events delivered by CloudTrail. The value is a fully specified ARN to a KMS key in the following format.",
          "nested_items": []
        },
        {
          "name": "BillingMode",
          "type": "string",
          "description": "The billing mode for the event data store.",
          "nested_items": []
        },
        {
          "name": "FederationStatus",
          "type": "string",
          "description": "Indicates the Lake query federation status. The status is ENABLED if Lake query federation is enabled, or DISABLED if Lake query federation is disabled. You cannot delete an event data store if the FederationStatus is ENABLED.",
          "nested_items": []
        },
        {
          "name": "FederationRoleArn",
          "type": "string",
          "description": "If Lake query federation is enabled, provides the ARN of the federation role used to access the resources for the federated event data store.",
          "nested_items": []
        }
      ]
    }
  ]
}