{
  "method_name": "update_distribution",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/lightsail/client/update_distribution.html",
  "description": "Updates an existing Amazon Lightsail content delivery network (CDN) distribution. Use this action to update the configuration of your existing distribution.",
  "parameters": [
    {
      "name": "distributionName",
      "type": "string",
      "required": true,
      "description": "The name of the distribution to update. Use the GetDistributions action to get a list of distribution names that you can specify.",
      "nested_params": []
    },
    {
      "name": "origin",
      "type": "dict",
      "required": false,
      "description": "An object that describes the origin resource for the distribution, such as a Lightsail instance, bucket, or load balancer. The distribution pulls, caches, and serves content from the origin. name (string) --- The name of the origin resource. regionName (string) --- The AWS Region name of the origin resource. protocolPolicy (string) --- The protocol that your Amazon Lightsail distribution uses when establishing a connection with your origin to pull content. responseTimeout (integer) --- The amount of time, in seconds, that the distribution waits for a response after forwarding a request to the origin. The minimum timeout is 1 second, the maximum is 60 seconds, and the default (if you don't specify otherwise) is 30 seconds.",
      "nested_params": [
        {
          "name": "name",
          "type": "string",
          "required": false,
          "description": "The name of the origin resource.",
          "nested_params": []
        },
        {
          "name": "regionName",
          "type": "string",
          "required": false,
          "description": "The AWS Region name of the origin resource.",
          "nested_params": []
        },
        {
          "name": "protocolPolicy",
          "type": "string",
          "required": false,
          "description": "The protocol that your Amazon Lightsail distribution uses when establishing a connection with your origin to pull content.",
          "nested_params": []
        },
        {
          "name": "responseTimeout",
          "type": "integer",
          "required": false,
          "description": "The amount of time, in seconds, that the distribution waits for a response after forwarding a request to the origin. The minimum timeout is 1 second, the maximum is 60 seconds, and the default (if you don't specify otherwise) is 30 seconds.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "defaultCacheBehavior",
      "type": "dict",
      "required": false,
      "description": "An object that describes the default cache behavior for the distribution. behavior (string) --- The cache behavior of the distribution. The following cache behaviors can be specified: cache - This option is best for static sites. When specified, your distribution caches and serves your entire website as static content. This behavior is ideal for websites with static content that doesn't change depending on who views it, or for websites that don't use cookies, headers, or query strings to personalize content. dont-cache - This option is best for sites that serve a mix of static and dynamic content. When specified, your distribution caches and serve only the content that is specified in the distribution's CacheBehaviorPerPath parameter. This behavior is ideal for websites or web applications that use cookies, headers, and query strings to personalize content for individual users.",
      "nested_params": [
        {
          "name": "behavior",
          "type": "string",
          "required": false,
          "description": "The cache behavior of the distribution. The following cache behaviors can be specified:",
          "nested_params": []
        }
      ]
    },
    {
      "name": "cacheBehaviorSettings",
      "type": "dict",
      "required": false,
      "description": "An object that describes the cache behavior settings for the distribution. defaultTTL (integer) --- The default amount of time that objects stay in the distribution's cache before the distribution forwards another request to the origin to determine whether the content has been updated. minimumTTL (integer) --- The minimum amount of time that objects stay in the distribution's cache before the distribution forwards another request to the origin to determine whether the object has been updated. A value of 0 must be specified for minimumTTL if the distribution is configured to forward all headers to the origin. maximumTTL (integer) --- The maximum amount of time that objects stay in the distribution's cache before the distribution forwards another request to the origin to determine whether the object has been updated. The value specified applies only when the origin adds HTTP headers such as Cache-Control max-age, Cache-Control s-maxage, and Expires to objects. allowedHTTPMethods (string) --- The HTTP methods that are processed and forwarded to the distribution's origin. You can specify the following options: GET,HEAD - The distribution forwards the GET and HEAD methods. GET,HEAD,OPTIONS - The distribution forwards the GET, HEAD, and OPTIONS methods. GET,HEAD,OPTIONS,PUT,PATCH,POST,DELETE - The distribution forwards the GET, HEAD, OPTIONS, PUT, PATCH, POST, and DELETE methods. If you specify the third option, you might need to restrict access to your distribution's origin so users can't perform operations that you don't want them to. For example, you might not want users to have permission to delete objects from your origin. cachedHTTPMethods (string) --- The HTTP method responses that are cached by your distribution. You can specify the following options: GET,HEAD - The distribution caches responses to the GET and HEAD methods. GET,HEAD,OPTIONS - The distribution caches responses to the GET, HEAD, and OPTIONS methods. forwardedCookies (dict) --- An object that describes the cookies that are forwarded to the origin. Your content is cached based on the cookies that are forwarded. option (string) --- Specifies which cookies to forward to the distribution's origin for a cache behavior: all, none, or allow-list to forward only the cookies specified in the cookiesAllowList parameter. cookiesAllowList (list) --- The specific cookies to forward to your distribution's origin. (string) --- forwardedHeaders (dict) --- An object that describes the headers that are forwarded to the origin. Your content is cached based on the headers that are forwarded. option (string) --- The headers that you want your distribution to forward to your origin and base caching on. You can configure your distribution to do one of the following: all - Forward all headers to your origin. none - Forward only the default headers. allow-list - Forward only the headers you specify using the headersAllowList parameter. headersAllowList (list) --- The specific headers to forward to your distribution's origin. (string) --- forwardedQueryStrings (dict) --- An object that describes the query strings that are forwarded to the origin. Your content is cached based on the query strings that are forwarded. option (boolean) --- Indicates whether the distribution forwards and caches based on query strings. queryStringsAllowList (list) --- The specific query strings that the distribution forwards to the origin. Your distribution will cache content based on the specified query strings. If the option parameter is true, then your distribution forwards all query strings, regardless of what you specify using the queryStringsAllowList parameter. (string) ---",
      "nested_params": [
        {
          "name": "defaultTTL",
          "type": "integer",
          "required": false,
          "description": "The default amount of time that objects stay in the distribution's cache before the distribution forwards another request to the origin to determine whether the content has been updated.",
          "nested_params": []
        },
        {
          "name": "minimumTTL",
          "type": "integer",
          "required": false,
          "description": "The minimum amount of time that objects stay in the distribution's cache before the distribution forwards another request to the origin to determine whether the object has been updated. A value of 0 must be specified for minimumTTL if the distribution is configured to forward all headers to the origin.",
          "nested_params": []
        },
        {
          "name": "maximumTTL",
          "type": "integer",
          "required": false,
          "description": "The maximum amount of time that objects stay in the distribution's cache before the distribution forwards another request to the origin to determine whether the object has been updated. The value specified applies only when the origin adds HTTP headers such as Cache-Control max-age, Cache-Control s-maxage, and Expires to objects.",
          "nested_params": []
        },
        {
          "name": "allowedHTTPMethods",
          "type": "string",
          "required": false,
          "description": "The HTTP methods that are processed and forwarded to the distribution's origin. You can specify the following options:",
          "nested_params": []
        },
        {
          "name": "cachedHTTPMethods",
          "type": "string",
          "required": false,
          "description": "The HTTP method responses that are cached by your distribution. You can specify the following options:",
          "nested_params": []
        },
        {
          "name": "forwardedCookies",
          "type": "dict",
          "required": false,
          "description": "An object that describes the cookies that are forwarded to the origin. Your content is cached based on the cookies that are forwarded.",
          "nested_params": [
            {
              "name": "option",
              "type": "string",
              "required": false,
              "description": "Specifies which cookies to forward to the distribution's origin for a cache behavior: all, none, or allow-list to forward only the cookies specified in the cookiesAllowList parameter.",
              "nested_params": []
            },
            {
              "name": "cookiesAllowList",
              "type": "list",
              "required": false,
              "description": "The specific cookies to forward to your distribution's origin.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "forwardedHeaders",
          "type": "dict",
          "required": false,
          "description": "An object that describes the headers that are forwarded to the origin. Your content is cached based on the headers that are forwarded.",
          "nested_params": [
            {
              "name": "option",
              "type": "string",
              "required": false,
              "description": "The headers that you want your distribution to forward to your origin and base caching on. You can configure your distribution to do one of the following:",
              "nested_params": []
            },
            {
              "name": "headersAllowList",
              "type": "list",
              "required": false,
              "description": "The specific headers to forward to your distribution's origin.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "forwardedQueryStrings",
          "type": "dict",
          "required": false,
          "description": "An object that describes the query strings that are forwarded to the origin. Your content is cached based on the query strings that are forwarded.",
          "nested_params": [
            {
              "name": "option",
              "type": "boolean",
              "required": false,
              "description": "Indicates whether the distribution forwards and caches based on query strings.",
              "nested_params": []
            },
            {
              "name": "queryStringsAllowList",
              "type": "list",
              "required": false,
              "description": "The specific query strings that the distribution forwards to the origin. Your distribution will cache content based on the specified query strings. If the option parameter is true, then your distribution forwards all query strings, regardless of what you specify using the queryStringsAllowList parameter.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "cacheBehaviors",
      "type": "list",
      "required": false,
      "description": "An array of objects that describe the per-path cache behavior for the distribution. (dict) --- Describes the per-path cache behavior of an Amazon Lightsail content delivery network (CDN) distribution. A per-path cache behavior is used to override, or add an exception to, the default cache behavior of a distribution. For example, if the cacheBehavior is set to cache, then a per-path cache behavior can be used to specify a directory, file, or file type that your distribution will cache. Alternately, if the distribution's cacheBehavior is dont-cache, then a per-path cache behavior can be used to specify a directory, file, or file type that your distribution will not cache. path (string) --- The path to a directory or file to cached, or not cache. Use an asterisk symbol to specify wildcard directories ( path/to/assets/*), and file types ( *.html, *jpg, *js). Directories and file paths are case-sensitive. Examples: Specify the following to cache all files in the document root of an Apache web server running on a Lightsail instance. var/www/html/ Specify the following file to cache only the index page in the document root of an Apache web server. var/www/html/index.html Specify the following to cache only the .html files in the document root of an Apache web server. var/www/html/*.html Specify the following to cache only the .jpg, .png, and .gif files in the images sub-directory of the document root of an Apache web server. var/www/html/images/*.jpg var/www/html/images/*.png var/www/html/images/*.gif Specify the following to cache all files in the images sub-directory of the document root of an Apache web server. var/www/html/images/ behavior (string) --- The cache behavior for the specified path. You can specify one of the following per-path cache behaviors: cache - This behavior caches the specified path. dont-cache - This behavior doesn't cache the specified path.",
      "nested_params": [
        {
          "name": "path",
          "type": "string",
          "required": false,
          "description": "The path to a directory or file to cached, or not cache. Use an asterisk symbol to specify wildcard directories ( path/to/assets/*), and file types ( *.html, *jpg, *js). Directories and file paths are case-sensitive. Examples:",
          "nested_params": []
        },
        {
          "name": "behavior",
          "type": "string",
          "required": false,
          "description": "The cache behavior for the specified path. You can specify one of the following per-path cache behaviors:",
          "nested_params": []
        }
      ]
    },
    {
      "name": "isEnabled",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "viewerMinimumTlsProtocolVersion",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "certificateName",
      "type": "string",
      "required": false,
      "description": "The name of the SSL/TLS certificate that you want to attach to the distribution. Only certificates with a status of ISSUED can be attached to a distribution. Use the GetCertificates action to get a list of certificate names that you can specify.",
      "nested_params": []
    },
    {
      "name": "useDefaultCertificate",
      "type": "boolean",
      "required": false,
      "description": "Indicates whether the default SSL/TLS certificate is attached to the distribution. The default value is true. When true, the distribution uses the default domain name such as d111111abcdef8.cloudfront.net. Set this value to false to attach a new certificate to the distribution.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "operation",
          "type": "dict",
          "description": "An array of objects that describe the result of the action, such as the status of the request, the timestamp of the request, and the resources affected by the request.",
          "nested_items": [
            {
              "name": "id",
              "type": "string",
              "description": "The ID of the operation.",
              "nested_items": []
            },
            {
              "name": "resourceName",
              "type": "string",
              "description": "The resource name.",
              "nested_items": []
            },
            {
              "name": "resourceType",
              "type": "string",
              "description": "The resource type.",
              "nested_items": []
            },
            {
              "name": "createdAt",
              "type": "datetime",
              "description": "The timestamp when the operation was initialized ( 1479816991.349).",
              "nested_items": []
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "availabilityZone",
                  "type": "string",
                  "description": "The Availability Zone. Follows the format us-east-2a (case-sensitive).",
                  "nested_items": []
                },
                {
                  "name": "regionName",
                  "type": "string",
                  "description": "The Amazon Web Services Region name.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "isTerminal",
              "type": "boolean",
              "description": "A Boolean value indicating whether the operation is terminal.",
              "nested_items": []
            },
            {
              "name": "operationDetails",
              "type": "string",
              "description": "Details about the operation ( Debian-1GB-Ohio-1).",
              "nested_items": []
            },
            {
              "name": "operationType",
              "type": "string",
              "description": "The type of operation.",
              "nested_items": []
            },
            {
              "name": "status",
              "type": "string",
              "description": "The status of the operation.",
              "nested_items": []
            },
            {
              "name": "statusChangedAt",
              "type": "datetime",
              "description": "The timestamp when the status was changed ( 1479816991.349).",
              "nested_items": []
            },
            {
              "name": "errorCode",
              "type": "string",
              "description": "The error code.",
              "nested_items": []
            },
            {
              "name": "errorDetails",
              "type": "string",
              "description": "The error details.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}