{
  "method_name": "create_access_point_for_object_lambda",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3control/client/create_access_point_for_object_lambda.html",
  "description": "Creates an Object Lambda Access Point. For more information, see Transforming objects with Object Lambda Access Points in the Amazon S3 User Guide. The following actions are related to CreateAccessPointForObjectLambda:",
  "parameters": [
    {
      "name": "AccountId",
      "type": "string",
      "required": true,
      "description": "The Amazon Web Services account ID for owner of the specified Object Lambda Access Point.",
      "nested_params": []
    },
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "The name you want to assign to this Object Lambda Access Point.",
      "nested_params": []
    },
    {
      "name": "Configuration",
      "type": "dict",
      "required": true,
      "description": "Object Lambda Access Point configuration as a JSON document. Standard access point associated with the Object Lambda Access Point. CloudWatchMetricsEnabled (boolean) --- A container for whether the CloudWatch metrics configuration is enabled. AllowedFeatures (list) --- A container for allowed features. Valid inputs are GetObject-Range, GetObject-PartNumber, HeadObject-Range, and HeadObject-PartNumber. (string) --- A container for transformation configurations for an Object Lambda Access Point. (dict) --- A configuration used when creating an Object Lambda Access Point transformation. A container for the action of an Object Lambda Access Point configuration. Valid inputs are GetObject, ListObjects, HeadObject, and ListObjectsV2. (string) --- A container for the content transformation of an Object Lambda Access Point configuration. AwsLambda (dict) --- A container for an Lambda function. The Amazon Resource Name (ARN) of the Lambda function. FunctionPayload (string) --- Additional JSON that provides supplemental data to the Lambda function used to transform objects.",
      "nested_params": [
        {
          "name": "SupportingAccessPoint",
          "type": "string",
          "required": false,
          "description": "Standard access point associated with the Object Lambda Access Point.",
          "nested_params": []
        },
        {
          "name": "CloudWatchMetricsEnabled",
          "type": "boolean",
          "required": false,
          "description": "A container for whether the CloudWatch metrics configuration is enabled.",
          "nested_params": []
        },
        {
          "name": "AllowedFeatures",
          "type": "list",
          "required": false,
          "description": "A container for allowed features. Valid inputs are GetObject-Range, GetObject-PartNumber, HeadObject-Range, and HeadObject-PartNumber.",
          "nested_params": []
        },
        {
          "name": "TransformationConfigurations",
          "type": "list",
          "required": false,
          "description": "A container for transformation configurations for an Object Lambda Access Point.",
          "nested_params": [
            {
              "name": "Actions",
              "type": "list",
              "required": false,
              "description": "A container for the action of an Object Lambda Access Point configuration. Valid inputs are GetObject, ListObjects, HeadObject, and ListObjectsV2.",
              "nested_params": []
            },
            {
              "name": "ContentTransformation",
              "type": "dict",
              "required": false,
              "description": "A container for the content transformation of an Object Lambda Access Point configuration.",
              "nested_params": [
                {
                  "name": "AwsLambda",
                  "type": "dict",
                  "required": false,
                  "description": "A container for an Lambda function.",
                  "nested_params": [
                    {
                      "name": "FunctionArn",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Resource Name (ARN) of the Lambda function.",
                      "nested_params": []
                    },
                    {
                      "name": "FunctionPayload",
                      "type": "string",
                      "required": false,
                      "description": "Additional JSON that provides supplemental data to the Lambda function used to transform objects.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ObjectLambdaAccessPointArn",
          "type": "string",
          "description": "Specifies the ARN for the Object Lambda Access Point.",
          "nested_items": []
        },
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "Value",
              "type": "string",
              "description": "The alias value of the Object Lambda Access Point.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The status of the Object Lambda Access Point alias. If the status is PROVISIONING, the Object Lambda Access Point is provisioning the alias and the alias is not ready for use yet. If the status is READY, the Object Lambda Access Point alias is successfully provisioned and ready for use.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}