{
  "method_name": "get_access_point",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3control/client/get_access_point.html",
  "description": "Returns configuration information about the specified access point. All Amazon S3 on Outposts REST API requests for this action require an additional parameter of x-amz-outpost-id to be passed with the request. In addition, you must use an S3 on Outposts endpoint hostname prefix instead of s3-control. For an example of the request syntax for Amazon S3 on Outposts that uses the S3 on Outposts endpoint hostname prefix and the x-amz-outpost-id derived by using the access point ARN, see the Examples section. The following actions are related to GetAccessPoint:",
  "parameters": [
    {
      "name": "AccountId",
      "type": "string",
      "required": true,
      "description": "The Amazon Web Services account ID for the account that owns the specified access point.",
      "nested_params": []
    },
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "The name of the access point whose configuration information you want to retrieve. For using this parameter with Amazon S3 on Outposts with the REST API, you must specify the name and the x-amz-outpost-id as well. For using this parameter with S3 on Outposts with the Amazon Web Services SDK and CLI, you must specify the ARN of the access point accessed in the format arn:aws:s3-outposts:<Region>:<account-id>:outpost/<outpost-id>/accesspoint/<my-accesspoint-name>. For example, to access the access point reports-ap through Outpost my-outpost owned by account 123456789012 in Region us-west-2, use the URL encoding of arn:aws:s3-outposts:us-west-2:123456789012:outpost/my-outpost/accesspoint/reports-ap. The value must be URL encoded.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Name",
          "type": "string",
          "description": "The name of the specified access point.",
          "nested_items": []
        },
        {
          "name": "Bucket",
          "type": "string",
          "description": "The name of the bucket associated with the specified access point.",
          "nested_items": []
        },
        {
          "name": "NetworkOrigin",
          "type": "string",
          "description": "Indicates whether this access point allows access from the public internet. If VpcConfiguration is specified for this access point, then NetworkOrigin is VPC, and the access point doesn't allow access from the public internet. Otherwise, NetworkOrigin is Internet, and the access point allows access from the public internet, subject to the access point and bucket access policies.",
          "nested_items": []
        },
        {
          "name": "VpcConfiguration",
          "type": "dict",
          "description": "Contains the virtual private cloud (VPC) configuration for the specified access point.",
          "nested_items": [
            {
              "name": "VpcId",
              "type": "string",
              "description": "If this field is specified, this access point will only allow connections from the specified VPC ID.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "PublicAccessBlockConfiguration",
          "type": "dict",
          "description": "The PublicAccessBlock configuration that you want to apply to this Amazon S3 account. You can enable the configuration options in any combination. For more information about when Amazon S3 considers a bucket or object public, see The Meaning of 'Public' in the Amazon S3 User Guide.",
          "nested_items": [
            {
              "name": "BlockPublicAcls",
              "type": "boolean",
              "description": "Specifies whether Amazon S3 should block public access control lists (ACLs) for buckets in this account. Setting this element to TRUE causes the following behavior:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "PutBucketAcl and PutObjectAcl calls fail if the specified ACL is public.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "PUT Object calls fail if the request includes a public ACL.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "PUT Bucket calls fail if the request includes a public ACL.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "IgnorePublicAcls",
              "type": "boolean",
              "description": "Specifies whether Amazon S3 should ignore public ACLs for buckets in this account. Setting this element to TRUE causes Amazon S3 to ignore all public ACLs on buckets in this account and any objects that they contain.",
              "nested_items": []
            },
            {
              "name": "BlockPublicPolicy",
              "type": "boolean",
              "description": "Specifies whether Amazon S3 should block public bucket policies for buckets in this account. Setting this element to TRUE causes Amazon S3 to reject calls to PUT Bucket policy if the specified bucket policy allows public access.",
              "nested_items": []
            },
            {
              "name": "RestrictPublicBuckets",
              "type": "boolean",
              "description": "Specifies whether Amazon S3 should restrict public bucket policies for buckets in this account. Setting this element to TRUE restricts access to buckets with public policies to only Amazon Web Services service principals and authorized users within this account.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "CreationDate",
          "type": "datetime",
          "description": "The date and time when the specified access point was created.",
          "nested_items": []
        },
        {
          "name": "Alias",
          "type": "string",
          "description": "The name or alias of the access point.",
          "nested_items": []
        },
        {
          "name": "AccessPointArn",
          "type": "string",
          "description": "The ARN of the access point.",
          "nested_items": []
        },
        {
          "name": "Endpoints",
          "type": "dict",
          "description": "The VPC endpoint for the access point.",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "BucketAccountId",
          "type": "string",
          "description": "The Amazon Web Services account ID associated with the S3 bucket associated with this access point.",
          "nested_items": []
        },
        {
          "name": "DataSourceId",
          "type": "string",
          "description": "The unique identifier for the data source of the access point.",
          "nested_items": []
        },
        {
          "name": "DataSourceType",
          "type": "string",
          "description": "The type of the data source that the access point is attached to.",
          "nested_items": []
        }
      ]
    }
  ]
}