{
  "method_name": "get_data_access",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3control/client/get_data_access.html",
  "description": "Returns a temporary access credential from S3 Access Grants to the grantee or client application. The temporary credential is an Amazon Web Services STS token that grants them access to the S3 data. You must have the s3:GetDataAccess permission to use this operation. The IAM role that S3 Access Grants assumes must have the following permissions specified in the trust policy when registering the location: sts:AssumeRole, for directory users or groups sts:SetContext, and for IAM users or roles sts:SetSourceIdentity.",
  "parameters": [
    {
      "name": "AccountId",
      "type": "string",
      "required": true,
      "description": "The Amazon Web Services account ID of the S3 Access Grants instance.",
      "nested_params": []
    },
    {
      "name": "Target",
      "type": "string",
      "required": true,
      "description": "The S3 URI path of the data to which you are requesting temporary access credentials. If the requesting account has an access grant for this data, S3 Access Grants vends temporary access credentials in the response.",
      "nested_params": []
    },
    {
      "name": "Permission",
      "type": "string",
      "required": true,
      "description": "The type of permission granted to your S3 data, which can be set to one of the following values: READ --- Grant read-only access to the S3 data. WRITE --- Grant write-only access to the S3 data. READWRITE --- Grant both read and write access to the S3 data.",
      "nested_params": []
    },
    {
      "name": "DurationSeconds",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Privilege",
      "type": "string",
      "required": false,
      "description": "The scope of the temporary access credential that S3 Access Grants vends to the grantee or client application. Default --- The scope of the returned temporary access token is the scope of the grant that is closest to the target scope. Minimal --- The scope of the returned temporary access token is the same as the requested target scope as long as the requested scope is the same as or a subset of the grant scope.",
      "nested_params": []
    },
    {
      "name": "TargetType",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Credentials",
          "type": "dict",
          "description": "The temporary credential token that S3 Access Grants vends.",
          "nested_items": [
            {
              "name": "AccessKeyId",
              "type": "string",
              "description": "The unique access key ID of the Amazon Web Services STS temporary credential that S3 Access Grants vends to grantees and client applications.",
              "nested_items": []
            },
            {
              "name": "SecretAccessKey",
              "type": "string",
              "description": "The secret access key of the Amazon Web Services STS temporary credential that S3 Access Grants vends to grantees and client applications.",
              "nested_items": []
            },
            {
              "name": "SessionToken",
              "type": "string",
              "description": "The Amazon Web Services STS temporary credential that S3 Access Grants vends to grantees and client applications.",
              "nested_items": []
            },
            {
              "name": "Expiration",
              "type": "datetime",
              "description": "The expiration date and time of the temporary credential that S3 Access Grants vends to grantees and client applications.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "MatchedGrantTarget",
          "type": "string",
          "description": "The S3 URI path of the data to which you are being granted temporary access credentials.",
          "nested_items": []
        },
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "GranteeType",
              "type": "string",
              "description": "The type of the grantee to which access has been granted. It can be one of the following values:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "IAM - An IAM user or role.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "DIRECTORY_USER - Your corporate directory user. You can use this option if you have added your corporate identity directory to IAM Identity Center and associated the IAM Identity Center instance with your S3 Access Grants instance.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "DIRECTORY_GROUP - Your corporate directory group. You can use this option if you have added your corporate identity directory to IAM Identity Center and associated the IAM Identity Center instance with your S3 Access Grants instance.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "GranteeIdentifier",
              "type": "string",
              "description": "The unique identifier of the Grantee. If the grantee type is IAM, the identifier is the IAM Amazon Resource Name (ARN) of the user or role. If the grantee type is a directory user or group, the identifier is 128-bit universally unique identifier (UUID) in the format a1b2c3d4-5678-90ab-cdef-EXAMPLE11111. You can obtain this UUID from your Amazon Web Services IAM Identity Center instance.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}