{
  "method_name": "list_caller_access_grants",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3control/client/list_caller_access_grants.html",
  "description": "Use this API to list the access grants that grant the caller access to Amazon S3 data through S3 Access Grants. The caller (grantee) can be an Identity and Access Management (IAM) identity or Amazon Web Services Identity Center corporate directory identity. You must pass the Amazon Web Services account of the S3 data owner (grantor) in the request. You can, optionally, narrow the results by GrantScope, using a fragment of the data's S3 path, and S3 Access Grants will return only the grants with a path that contains the path fragment. You can also pass the AllowedByApplication filter in the request, which returns only the grants authorized for applications, whether the application is the caller's Identity Center application or any other application ( ALL). For more information, see List the caller's access grants in the Amazon S3 User Guide. You must have the s3:ListCallerAccessGrants permission to use this operation.",
  "parameters": [
    {
      "name": "AccountId",
      "type": "string",
      "required": true,
      "description": "The Amazon Web Services account ID of the S3 Access Grants instance.",
      "nested_params": []
    },
    {
      "name": "GrantScope",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "AllowedByApplication",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "NextToken",
          "type": "string",
          "description": "A pagination token that you can use to request the next page of results. Pass this value into a subsequent List Caller Access Grants request in order to retrieve the next page of results.",
          "nested_items": []
        },
        {
          "name": "CallerAccessGrantsList",
          "type": "list",
          "description": "A list of the caller's access grants that were created using S3 Access Grants and that grant the caller access to the S3 data of the Amazon Web Services account ID that was specified in the request.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Permission",
                  "type": "string",
                  "description": "The type of permission granted, which can be one of the following values:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "READ - Grants read-only access to the S3 data.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "WRITE - Grants write-only access to the S3 data.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "READWRITE - Grants both read and write access to the S3 data.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "GrantScope",
                  "type": "string",
                  "description": "The S3 path of the data to which you have been granted access.",
                  "nested_items": []
                },
                {
                  "name": "ApplicationArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of an Amazon Web Services IAM Identity Center application associated with your Identity Center instance. If the grant includes an application ARN, the grantee can only access the S3 data through this application.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}