{
  "method_name": "list_access_points",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3control/client/list_access_points.html",
  "description": "Returns a list of the access points. You can retrieve up to 1,000 access points per call. If the call returns more than 1,000 access points (or the number specified in maxResults, whichever is less), the response will include a continuation token that you can use to list the additional access points. Returns only access points attached to S3 buckets by default. To return all access points specify DataSourceType as ALL. All Amazon S3 on Outposts REST API requests for this action require an additional parameter of x-amz-outpost-id to be passed with the request. In addition, you must use an S3 on Outposts endpoint hostname prefix instead of s3-control. For an example of the request syntax for Amazon S3 on Outposts that uses the S3 on Outposts endpoint hostname prefix and the x-amz-outpost-id derived by using the access point ARN, see the Examples section. The following actions are related to ListAccessPoints:",
  "parameters": [
    {
      "name": "AccountId",
      "type": "string",
      "required": true,
      "description": "The Amazon Web Services account ID for the account that owns the specified access points.",
      "nested_params": []
    },
    {
      "name": "Bucket",
      "type": "string",
      "required": false,
      "description": "The name of the bucket whose associated access points you want to list. For using this parameter with Amazon S3 on Outposts with the REST API, you must specify the name and the x-amz-outpost-id as well. For using this parameter with S3 on Outposts with the Amazon Web Services SDK and CLI, you must specify the ARN of the bucket accessed in the format arn:aws:s3-outposts:<Region>:<account-id>:outpost/<outpost-id>/bucket/<my-bucket-name>. For example, to access the bucket reports through Outpost my-outpost owned by account 123456789012 in Region us-west-2, use the URL encoding of arn:aws:s3-outposts:us-west-2:123456789012:outpost/my-outpost/bucket/reports. The value must be URL encoded.",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DataSourceId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DataSourceType",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "AccessPointList",
          "type": "list",
          "description": "Contains identification and configuration information for one or more access points associated with the specified bucket.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The name of this access point.",
                  "nested_items": []
                },
                {
                  "name": "NetworkOrigin",
                  "type": "string",
                  "description": "Indicates whether this access point allows access from the public internet. If VpcConfiguration is specified for this access point, then NetworkOrigin is VPC, and the access point doesn't allow access from the public internet. Otherwise, NetworkOrigin is Internet, and the access point allows access from the public internet, subject to the access point and bucket access policies.",
                  "nested_items": []
                },
                {
                  "name": "VpcConfiguration",
                  "type": "dict",
                  "description": "The virtual private cloud (VPC) configuration for this access point, if one exists.",
                  "nested_items": [
                    {
                      "name": "VpcId",
                      "type": "string",
                      "description": "If this field is specified, this access point will only allow connections from the specified VPC ID.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Bucket",
                  "type": "string",
                  "description": "The name of the bucket associated with this access point.",
                  "nested_items": []
                },
                {
                  "name": "AccessPointArn",
                  "type": "string",
                  "description": "The ARN for the access point.",
                  "nested_items": []
                },
                {
                  "name": "Alias",
                  "type": "string",
                  "description": "The name or alias of the access point.",
                  "nested_items": []
                },
                {
                  "name": "BucketAccountId",
                  "type": "string",
                  "description": "The Amazon Web Services account ID associated with the S3 bucket associated with this access point.",
                  "nested_items": []
                },
                {
                  "name": "DataSourceId",
                  "type": "string",
                  "description": "A unique identifier for the data source of the access point.",
                  "nested_items": []
                },
                {
                  "name": "DataSourceType",
                  "type": "string",
                  "description": "The type of the data source that the access point is attached to.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "If the specified bucket has more access points than can be returned in one call to this API, this field contains a continuation token that you can provide in subsequent calls to this API to retrieve additional access points.",
          "nested_items": []
        }
      ]
    }
  ]
}