{
  "method_name": "list_multi_region_access_points",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3control/client/list_multi_region_access_points.html",
  "description": "Returns a list of the Multi-Region Access Points currently associated with the specified Amazon Web Services account. Each call can return up to 100 Multi-Region Access Points, the maximum number of Multi-Region Access Points that can be associated with a single account. This action will always be routed to the US West (Oregon) Region. For more information about the restrictions around working with Multi-Region Access Points, see Multi-Region Access Point restrictions and limitations in the Amazon S3 User Guide. The following actions are related to ListMultiRegionAccessPoint:",
  "parameters": [
    {
      "name": "AccountId",
      "type": "string",
      "required": true,
      "description": "The Amazon Web Services account ID for the owner of the Multi-Region Access Point.",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "AccessPoints",
          "type": "list",
          "description": "The list of Multi-Region Access Points associated with the user.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The name of the Multi-Region Access Point.",
                  "nested_items": []
                },
                {
                  "name": "Alias",
                  "type": "string",
                  "description": "The alias for the Multi-Region Access Point. For more information about the distinction between the name and the alias of an Multi-Region Access Point, see Rules for naming Amazon S3 Multi-Region Access Points.",
                  "nested_items": []
                },
                {
                  "name": "CreatedAt",
                  "type": "datetime",
                  "description": "When the Multi-Region Access Point create request was received.",
                  "nested_items": []
                },
                {
                  "name": "PublicAccessBlock",
                  "type": "dict",
                  "description": "The PublicAccessBlock configuration that you want to apply to this Amazon S3 account. You can enable the configuration options in any combination. For more information about when Amazon S3 considers a bucket or object public, see The Meaning of 'Public' in the Amazon S3 User Guide.",
                  "nested_items": [
                    {
                      "name": "BlockPublicAcls",
                      "type": "boolean",
                      "description": "Specifies whether Amazon S3 should block public access control lists (ACLs) for buckets in this account. Setting this element to TRUE causes the following behavior:",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "PutBucketAcl and PutObjectAcl calls fail if the specified ACL is public.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "PUT Object calls fail if the request includes a public ACL.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "PUT Bucket calls fail if the request includes a public ACL.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "IgnorePublicAcls",
                      "type": "boolean",
                      "description": "Specifies whether Amazon S3 should ignore public ACLs for buckets in this account. Setting this element to TRUE causes Amazon S3 to ignore all public ACLs on buckets in this account and any objects that they contain.",
                      "nested_items": []
                    },
                    {
                      "name": "BlockPublicPolicy",
                      "type": "boolean",
                      "description": "Specifies whether Amazon S3 should block public bucket policies for buckets in this account. Setting this element to TRUE causes Amazon S3 to reject calls to PUT Bucket policy if the specified bucket policy allows public access.",
                      "nested_items": []
                    },
                    {
                      "name": "RestrictPublicBuckets",
                      "type": "boolean",
                      "description": "Specifies whether Amazon S3 should restrict public bucket policies for buckets in this account. Setting this element to TRUE restricts access to buckets with public policies to only Amazon Web Services service principals and authorized users within this account.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Status",
                  "type": "string",
                  "description": "The current status of the Multi-Region Access Point.",
                  "nested_items": []
                },
                {
                  "name": "Regions",
                  "type": "list",
                  "description": "A collection of the Regions and buckets associated with the Multi-Region Access Point.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Bucket",
                          "type": "string",
                          "description": "The name of the bucket.",
                          "nested_items": []
                        },
                        {
                          "name": "Region",
                          "type": "string",
                          "description": "The name of the Region.",
                          "nested_items": []
                        },
                        {
                          "name": "BucketAccountId",
                          "type": "string",
                          "description": "The Amazon Web Services account ID that owns the Amazon S3 bucket that's associated with this Multi-Region Access Point.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "If the specified bucket has more Multi-Region Access Points than can be returned in one call to this action, this field contains a continuation token. You can use this token tin subsequent calls to this action to retrieve additional Multi-Region Access Points.",
          "nested_items": []
        }
      ]
    }
  ]
}