{
  "method_name": "list_storage_lens_groups",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3control/client/list_storage_lens_groups.html",
  "description": "Lists all the Storage Lens groups in the specified home Region. To use this operation, you must have the permission to perform the s3:ListStorageLensGroups action. For more information about the required Storage Lens Groups permissions, see Setting account permissions to use S3 Storage Lens groups. For information about Storage Lens groups errors, see List of Amazon S3 Storage Lens error codes.",
  "parameters": [
    {
      "name": "AccountId",
      "type": "string",
      "required": true,
      "description": "The Amazon Web Services account ID that owns the Storage Lens groups.",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "NextToken",
          "type": "string",
          "description": "If NextToken is returned, there are more Storage Lens groups results available. The value of NextToken is a unique pagination token for each page. Make the call again using the returned token to retrieve the next page. Keep all other arguments unchanged. Each pagination token expires after 24 hours.",
          "nested_items": []
        },
        {
          "name": "StorageLensGroupList",
          "type": "list",
          "description": "The list of Storage Lens groups that exist in the specified home Region.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Name",
                  "type": "string",
                  "description": "Contains the name of the Storage Lens group that exists in the specified home Region.",
                  "nested_items": []
                },
                {
                  "name": "StorageLensGroupArn",
                  "type": "string",
                  "description": "Contains the Amazon Resource Name (ARN) of the Storage Lens group. This property is read-only.",
                  "nested_items": []
                },
                {
                  "name": "HomeRegion",
                  "type": "string",
                  "description": "Contains the Amazon Web Services Region where the Storage Lens group was created.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}