{
  "method_name": "put_storage_lens_configuration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3control/client/put_storage_lens_configuration.html",
  "description": "Puts an Amazon S3 Storage Lens configuration. For more information about S3 Storage Lens, see Working with Amazon S3 Storage Lens in the Amazon S3 User Guide. For a complete list of S3 Storage Lens metrics, see S3 Storage Lens metrics glossary in the Amazon S3 User Guide.",
  "parameters": [
    {
      "name": "ConfigId",
      "type": "string",
      "required": true,
      "description": "The ID of the S3 Storage Lens configuration.",
      "nested_params": []
    },
    {
      "name": "AccountId",
      "type": "string",
      "required": true,
      "description": "The account ID of the requester.",
      "nested_params": []
    },
    {
      "name": "StorageLensConfiguration",
      "type": "dict",
      "required": true,
      "description": "The S3 Storage Lens configuration. A container for the Amazon S3 Storage Lens configuration ID. A container for all the account-level configurations of your S3 Storage Lens configuration. ActivityMetrics (dict) --- A container element for S3 Storage Lens activity metrics. IsEnabled (boolean) --- A container that indicates whether activity metrics are enabled. A container element for the S3 Storage Lens bucket-level configuration. ActivityMetrics (dict) --- A container for the bucket-level activity metrics for S3 Storage Lens. PrefixLevel (dict) --- A container for the prefix-level metrics for S3 Storage Lens. A container for the prefix-level storage metrics for S3 Storage Lens. IsEnabled (boolean) --- A container for whether prefix-level storage metrics are enabled. SelectionCriteria (dict) --- Delimiter (string) --- A container for the delimiter of the selection criteria being used. MaxDepth (integer) --- The max depth of the selection criteria MinStorageBytesPercentage (float) --- The minimum number of storage bytes percentage whose metrics will be selected. AdvancedCostOptimizationMetrics (dict) --- A container for bucket-level advanced cost-optimization metrics for S3 Storage Lens. IsEnabled (boolean) --- A container that indicates whether advanced cost-optimization metrics are enabled. AdvancedDataProtectionMetrics (dict) --- A container for bucket-level advanced data-protection metrics for S3 Storage Lens. IsEnabled (boolean) --- A container that indicates whether advanced data-protection metrics are enabled. DetailedStatusCodesMetrics (dict) --- A container for bucket-level detailed status code metrics for S3 Storage Lens. IsEnabled (boolean) --- A container that indicates whether detailed status code metrics are enabled. AdvancedCostOptimizationMetrics (dict) --- A container element for S3 Storage Lens advanced cost-optimization metrics. AdvancedDataProtectionMetrics (dict) --- A container element for S3 Storage Lens advanced data-protection metrics. DetailedStatusCodesMetrics (dict) --- A container element for detailed status code metrics. StorageLensGroupLevel (dict) --- A container element for S3 Storage Lens groups metrics. SelectionCriteria (dict) --- Indicates which Storage Lens group ARNs to include or exclude in the Storage Lens group aggregation. If this value is left null, then all Storage Lens groups are selected. Include (list) --- Indicates which Storage Lens group ARNs to include in the Storage Lens group aggregation. (string) --- Exclude (list) --- Indicates which Storage Lens group ARNs to exclude from the Storage Lens group aggregation. (string) --- Include (dict) --- A container for what is included in this configuration. This container can only be valid if there is no Exclude container submitted, and it's not empty. Buckets (list) --- A container for the S3 Storage Lens bucket includes. (string) --- Regions (list) --- A container for the S3 Storage Lens Region includes. (string) --- Exclude (dict) --- A container for what is excluded in this configuration. This container can only be valid if there is no Include container submitted, and it's not empty. Buckets (list) --- A container for the S3 Storage Lens bucket excludes. (string) --- Regions (list) --- A container for the S3 Storage Lens Region excludes. (string) --- DataExport (dict) --- A container to specify the properties of your S3 Storage Lens metrics export including, the destination, schema and format. S3BucketDestination (dict) --- A container for the bucket where the S3 Storage Lens metrics export will be located. The schema version of the export file. The account ID of the owner of the S3 Storage Lens metrics export bucket. The Amazon Resource Name (ARN) of the bucket. This property is read-only and follows the following format: arn:aws:s3:us-east-1:example-account-id:bucket/your-destination-bucket-name Prefix (string) --- The prefix of the destination bucket where the metrics export will be delivered. Encryption (dict) --- The container for the type encryption of the metrics exports in this bucket. SSES3 (dict) --- SSEKMS (dict) --- A container for the ARN of the SSE-KMS encryption. This property is read-only and follows the following format: arn:aws:kms:us-east-1:example-account-id:key/example-9a73-4afc-8d29-8f5900cef44e CloudWatchMetrics (dict) --- A container for enabling Amazon CloudWatch publishing for S3 Storage Lens metrics. A container that indicates whether CloudWatch publishing for S3 Storage Lens metrics is enabled. A value of true indicates that CloudWatch publishing for S3 Storage Lens metrics is enabled. A container for whether the S3 Storage Lens configuration is enabled. AwsOrg (dict) --- A container for the Amazon Web Services organization for this S3 Storage Lens configuration. A container for the Amazon Resource Name (ARN) of the Amazon Web Services organization. This property is read-only and follows the following format: arn:aws:organizations:us-east-1:example-account-id:organization/o-ex2l495dck StorageLensArn (string) --- The Amazon Resource Name (ARN) of the S3 Storage Lens configuration. This property is read-only and follows the following format: arn:aws:s3:us-east-1:example-account-id:storage-lens/your-dashboard-name.",
      "nested_params": [
        {
          "name": "Id",
          "type": "string",
          "required": false,
          "description": "A container for the Amazon S3 Storage Lens configuration ID.",
          "nested_params": []
        },
        {
          "name": "AccountLevel",
          "type": "dict",
          "required": false,
          "description": "A container for all the account-level configurations of your S3 Storage Lens configuration.",
          "nested_params": [
            {
              "name": "ActivityMetrics",
              "type": "dict",
              "required": false,
              "description": "A container element for S3 Storage Lens activity metrics.",
              "nested_params": [
                {
                  "name": "IsEnabled",
                  "type": "boolean",
                  "required": false,
                  "description": "A container that indicates whether activity metrics are enabled.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "BucketLevel",
              "type": "dict",
              "required": false,
              "description": "A container element for the S3 Storage Lens bucket-level configuration.",
              "nested_params": [
                {
                  "name": "ActivityMetrics",
                  "type": "dict",
                  "required": false,
                  "description": "A container for the bucket-level activity metrics for S3 Storage Lens.",
                  "nested_params": [
                    {
                      "name": "IsEnabled",
                      "type": "boolean",
                      "required": false,
                      "description": "A container that indicates whether activity metrics are enabled.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "PrefixLevel",
                  "type": "dict",
                  "required": false,
                  "description": "A container for the prefix-level metrics for S3 Storage Lens.",
                  "nested_params": [
                    {
                      "name": "StorageMetrics",
                      "type": "dict",
                      "required": false,
                      "description": "A container for the prefix-level storage metrics for S3 Storage Lens.",
                      "nested_params": [
                        {
                          "name": "IsEnabled",
                          "type": "boolean",
                          "required": false,
                          "description": "A container for whether prefix-level storage metrics are enabled.",
                          "nested_params": []
                        },
                        {
                          "name": "SelectionCriteria",
                          "type": "dict",
                          "required": false,
                          "description": "",
                          "nested_params": [
                            {
                              "name": "Delimiter",
                              "type": "string",
                              "required": false,
                              "description": "A container for the delimiter of the selection criteria being used.",
                              "nested_params": []
                            },
                            {
                              "name": "MaxDepth",
                              "type": "integer",
                              "required": false,
                              "description": "The max depth of the selection criteria.",
                              "nested_params": []
                            },
                            {
                              "name": "MinStorageBytesPercentage",
                              "type": "float",
                              "required": false,
                              "description": "The minimum number of storage bytes percentage whose metrics will be selected.",
                              "nested_params": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "AdvancedCostOptimizationMetrics",
                  "type": "dict",
                  "required": false,
                  "description": "A container for bucket-level advanced cost-optimization metrics for S3 Storage Lens.",
                  "nested_params": [
                    {
                      "name": "IsEnabled",
                      "type": "boolean",
                      "required": false,
                      "description": "A container that indicates whether advanced cost-optimization metrics are enabled.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "AdvancedDataProtectionMetrics",
                  "type": "dict",
                  "required": false,
                  "description": "A container for bucket-level advanced data-protection metrics for S3 Storage Lens.",
                  "nested_params": [
                    {
                      "name": "IsEnabled",
                      "type": "boolean",
                      "required": false,
                      "description": "A container that indicates whether advanced data-protection metrics are enabled.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "DetailedStatusCodesMetrics",
                  "type": "dict",
                  "required": false,
                  "description": "A container for bucket-level detailed status code metrics for S3 Storage Lens.",
                  "nested_params": [
                    {
                      "name": "IsEnabled",
                      "type": "boolean",
                      "required": false,
                      "description": "A container that indicates whether detailed status code metrics are enabled.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "AdvancedCostOptimizationMetrics",
              "type": "dict",
              "required": false,
              "description": "A container element for S3 Storage Lens advanced cost-optimization metrics.",
              "nested_params": [
                {
                  "name": "IsEnabled",
                  "type": "boolean",
                  "required": false,
                  "description": "A container that indicates whether advanced cost-optimization metrics are enabled.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "AdvancedDataProtectionMetrics",
              "type": "dict",
              "required": false,
              "description": "A container element for S3 Storage Lens advanced data-protection metrics.",
              "nested_params": [
                {
                  "name": "IsEnabled",
                  "type": "boolean",
                  "required": false,
                  "description": "A container that indicates whether advanced data-protection metrics are enabled.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "DetailedStatusCodesMetrics",
              "type": "dict",
              "required": false,
              "description": "A container element for detailed status code metrics.",
              "nested_params": [
                {
                  "name": "IsEnabled",
                  "type": "boolean",
                  "required": false,
                  "description": "A container that indicates whether detailed status code metrics are enabled.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "StorageLensGroupLevel",
              "type": "dict",
              "required": false,
              "description": "A container element for S3 Storage Lens groups metrics.",
              "nested_params": [
                {
                  "name": "SelectionCriteria",
                  "type": "dict",
                  "required": false,
                  "description": "Indicates which Storage Lens group ARNs to include or exclude in the Storage Lens group aggregation. If this value is left null, then all Storage Lens groups are selected.",
                  "nested_params": [
                    {
                      "name": "Include",
                      "type": "list",
                      "required": false,
                      "description": "Indicates which Storage Lens group ARNs to include in the Storage Lens group aggregation.",
                      "nested_params": []
                    },
                    {
                      "name": "Exclude",
                      "type": "list",
                      "required": false,
                      "description": "Indicates which Storage Lens group ARNs to exclude from the Storage Lens group aggregation.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Include",
          "type": "dict",
          "required": false,
          "description": "A container for what is included in this configuration. This container can only be valid if there is no Exclude container submitted, and it's not empty.",
          "nested_params": [
            {
              "name": "Buckets",
              "type": "list",
              "required": false,
              "description": "A container for the S3 Storage Lens bucket includes.",
              "nested_params": []
            },
            {
              "name": "Regions",
              "type": "list",
              "required": false,
              "description": "A container for the S3 Storage Lens Region includes.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Exclude",
          "type": "dict",
          "required": false,
          "description": "A container for what is excluded in this configuration. This container can only be valid if there is no Include container submitted, and it's not empty.",
          "nested_params": [
            {
              "name": "Buckets",
              "type": "list",
              "required": false,
              "description": "A container for the S3 Storage Lens bucket excludes.",
              "nested_params": []
            },
            {
              "name": "Regions",
              "type": "list",
              "required": false,
              "description": "A container for the S3 Storage Lens Region excludes.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "DataExport",
          "type": "dict",
          "required": false,
          "description": "A container to specify the properties of your S3 Storage Lens metrics export including, the destination, schema and format.",
          "nested_params": [
            {
              "name": "S3BucketDestination",
              "type": "dict",
              "required": false,
              "description": "A container for the bucket where the S3 Storage Lens metrics export will be located.",
              "nested_params": [
                {
                  "name": "Format",
                  "type": "string",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "OutputSchemaVersion",
                  "type": "string",
                  "required": false,
                  "description": "The schema version of the export file.",
                  "nested_params": []
                },
                {
                  "name": "AccountId",
                  "type": "string",
                  "required": false,
                  "description": "The account ID of the owner of the S3 Storage Lens metrics export bucket.",
                  "nested_params": []
                },
                {
                  "name": "Arn",
                  "type": "string",
                  "required": false,
                  "description": "The Amazon Resource Name (ARN) of the bucket. This property is read-only and follows the following format: arn:aws:s3:us-east-1:example-account-id:bucket/your-destination-bucket-name.",
                  "nested_params": []
                },
                {
                  "name": "Prefix",
                  "type": "string",
                  "required": false,
                  "description": "The prefix of the destination bucket where the metrics export will be delivered.",
                  "nested_params": []
                },
                {
                  "name": "Encryption",
                  "type": "dict",
                  "required": false,
                  "description": "The container for the type encryption of the metrics exports in this bucket.",
                  "nested_params": [
                    {
                      "name": "SSES3",
                      "type": "dict",
                      "required": false,
                      "description": "",
                      "nested_params": []
                    },
                    {
                      "name": "SSEKMS",
                      "type": "dict",
                      "required": false,
                      "description": "",
                      "nested_params": [
                        {
                          "name": "KeyId",
                          "type": "string",
                          "required": false,
                          "description": "A container for the ARN of the SSE-KMS encryption. This property is read-only and follows the following format: arn:aws:kms:us-east-1:example-account-id:key/example-9a73-4afc-8d29-8f5900cef44e.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "CloudWatchMetrics",
              "type": "dict",
              "required": false,
              "description": "A container for enabling Amazon CloudWatch publishing for S3 Storage Lens metrics.",
              "nested_params": [
                {
                  "name": "IsEnabled",
                  "type": "boolean",
                  "required": false,
                  "description": "A container that indicates whether CloudWatch publishing for S3 Storage Lens metrics is enabled. A value of true indicates that CloudWatch publishing for S3 Storage Lens metrics is enabled.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "IsEnabled",
          "type": "boolean",
          "required": false,
          "description": "A container for whether the S3 Storage Lens configuration is enabled.",
          "nested_params": []
        },
        {
          "name": "AwsOrg",
          "type": "dict",
          "required": false,
          "description": "A container for the Amazon Web Services organization for this S3 Storage Lens configuration.",
          "nested_params": [
            {
              "name": "Arn",
              "type": "string",
              "required": false,
              "description": "A container for the Amazon Resource Name (ARN) of the Amazon Web Services organization. This property is read-only and follows the following format: arn:aws:organizations:us-east-1:example-account-id:organization/o-ex2l495dck.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "StorageLensArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the S3 Storage Lens configuration. This property is read-only and follows the following format: arn:aws:s3:us-east-1:example-account-id:storage-lens/your-dashboard-name.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "The tag set of the S3 Storage Lens configuration. (dict) ---",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}