{
  "method_name": "put_bucket_lifecycle_configuration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3control/client/put_bucket_lifecycle_configuration.html",
  "description": "Creates a new lifecycle configuration for the S3 on Outposts bucket or replaces an existing lifecycle configuration. Outposts buckets only support lifecycle configurations that delete/expire objects after a certain period of time and abort incomplete multipart uploads. All Amazon S3 on Outposts REST API requests for this action require an additional parameter of x-amz-outpost-id to be passed with the request. In addition, you must use an S3 on Outposts endpoint hostname prefix instead of s3-control. For an example of the request syntax for Amazon S3 on Outposts that uses the S3 on Outposts endpoint hostname prefix and the x-amz-outpost-id derived by using the access point ARN, see the Examples section. The following actions are related to PutBucketLifecycleConfiguration:",
  "parameters": [
    {
      "name": "AccountId",
      "type": "string",
      "required": true,
      "description": "The Amazon Web Services account ID of the Outposts bucket.",
      "nested_params": []
    },
    {
      "name": "Bucket",
      "type": "string",
      "required": true,
      "description": "The name of the bucket for which to set the configuration.",
      "nested_params": []
    },
    {
      "name": "LifecycleConfiguration",
      "type": "dict",
      "required": true,
      "description": "Container for lifecycle rules. You can add as many as 1,000 rules. Rules (list) --- A lifecycle rule for individual objects in an Outposts bucket. (dict) --- The container for the Outposts bucket lifecycle rule. Expiration (dict) --- Specifies the expiration for the lifecycle of the object in the form of date, days and, whether the object has a delete marker. Date (datetime) --- Indicates at what date the object is to be deleted. Should be in GMT ISO 8601 format. Days (integer) --- Indicates the lifetime, in days, of the objects that are subject to the rule. The value must be a non-zero positive integer. ExpiredObjectDeleteMarker (boolean) --- Indicates whether Amazon S3 will remove a delete marker with no noncurrent versions. If set to true, the delete marker will be expired. If set to false, the policy takes no action. This cannot be specified with Days or Date in a Lifecycle Expiration Policy. To learn more about delete markers, see Working with delete markers. ID (string) --- Unique identifier for the rule. The value cannot be longer than 255 characters. Filter (dict) --- The container for the filter of lifecycle rule. Prefix (string) --- Prefix identifying one or more objects to which the rule applies. Tag (dict) --- A container for a key-value name pair. Key of the tag Value of the tag And (dict) --- The container for the AND condition for the lifecycle rule. Tags (list) --- All of these tags must exist in the object's tag set in order for the rule to apply. (dict) --- A container for a key-value name pair. Key of the tag Value of the tag ObjectSizeGreaterThan (integer) --- The non-inclusive minimum object size for the lifecycle rule. Setting this property to 7 means the rule applies to objects with a size that is greater than 7. ObjectSizeLessThan (integer) --- The non-inclusive maximum object size for the lifecycle rule. Setting this property to 77 means the rule applies to objects with a size that is less than 77. ObjectSizeGreaterThan (integer) --- Minimum object size to which the rule applies. ObjectSizeLessThan (integer) --- Maximum object size to which the rule applies. If --\u0098Enabled', the rule is currently being applied. If --\u0098Disabled', the rule is not currently being applied. Transitions (list) --- Specifies when an Amazon S3 object transitions to a specified storage class. (dict) --- Specifies when an object transitions to a specified storage class. For more information about Amazon S3 Lifecycle configuration rules, see Transitioning objects using Amazon S3 Lifecycle in the Amazon S3 User Guide. Date (datetime) --- Indicates when objects are transitioned to the specified storage class. The date value must be in ISO 8601 format. The time is always midnight UTC. Days (integer) --- Indicates the number of days after creation when objects are transitioned to the specified storage class. The value must be a positive integer. StorageClass (string) --- The storage class to which you want the object to transition. NoncurrentVersionTransitions (list) --- Specifies the transition rule for the lifecycle rule that describes when noncurrent objects transition to a specific storage class. If your bucket is versioning-enabled (or versioning is suspended), you can set this action to request that Amazon S3 transition noncurrent object versions to a specific storage class at a set period in the object's lifetime. (dict) --- The container for the noncurrent version transition. NoncurrentDays (integer) --- Specifies the number of days an object is noncurrent before Amazon S3 can perform the associated action. For information about the noncurrent days calculations, see How Amazon S3 Calculates How Long an Object Has Been Noncurrent in the Amazon S3 User Guide. StorageClass (string) --- The class of storage used to store the object. NoncurrentVersionExpiration (dict) --- The noncurrent version expiration of the lifecycle rule. For information about the noncurrent days calculations, see How Amazon S3 Calculates When an Object Became Noncurrent in the Amazon S3 User Guide. NewerNoncurrentVersions (integer) --- Specifies how many noncurrent versions S3 on Outposts will retain. If there are this many more recent noncurrent versions, S3 on Outposts will take the associated action. For more information about noncurrent versions, see Lifecycle configuration elements in the Amazon S3 User Guide. AbortIncompleteMultipartUpload (dict) --- Specifies the days since the initiation of an incomplete multipart upload that Amazon S3 waits before permanently removing all parts of the upload. For more information, see Aborting Incomplete Multipart Uploads Using a Bucket Lifecycle Configuration in the Amazon S3 User Guide. DaysAfterInitiation (integer) --- Specifies the number of days after which Amazon S3 aborts an incomplete multipart upload to the Outposts bucket.",
      "nested_params": [
        {
          "name": "Rules",
          "type": "list",
          "required": false,
          "description": "A lifecycle rule for individual objects in an Outposts bucket.",
          "nested_params": [
            {
              "name": "Expiration",
              "type": "dict",
              "required": false,
              "description": "Specifies the expiration for the lifecycle of the object in the form of date, days and, whether the object has a delete marker.",
              "nested_params": [
                {
                  "name": "Date",
                  "type": "datetime",
                  "required": false,
                  "description": "Indicates at what date the object is to be deleted. Should be in GMT ISO 8601 format.",
                  "nested_params": []
                },
                {
                  "name": "Days",
                  "type": "integer",
                  "required": false,
                  "description": "Indicates the lifetime, in days, of the objects that are subject to the rule. The value must be a non-zero positive integer.",
                  "nested_params": []
                },
                {
                  "name": "ExpiredObjectDeleteMarker",
                  "type": "boolean",
                  "required": false,
                  "description": "Indicates whether Amazon S3 will remove a delete marker with no noncurrent versions. If set to true, the delete marker will be expired. If set to false, the policy takes no action. This cannot be specified with Days or Date in a Lifecycle Expiration Policy. To learn more about delete markers, see Working with delete markers.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ID",
              "type": "string",
              "required": false,
              "description": "Unique identifier for the rule. The value cannot be longer than 255 characters.",
              "nested_params": []
            },
            {
              "name": "Filter",
              "type": "dict",
              "required": false,
              "description": "The container for the filter of lifecycle rule.",
              "nested_params": [
                {
                  "name": "Prefix",
                  "type": "string",
                  "required": false,
                  "description": "Prefix identifying one or more objects to which the rule applies.",
                  "nested_params": []
                },
                {
                  "name": "Tag",
                  "type": "dict",
                  "required": false,
                  "description": "A container for a key-value name pair.",
                  "nested_params": [
                    {
                      "name": "Key",
                      "type": "string",
                      "required": false,
                      "description": "Key of the tag.",
                      "nested_params": []
                    },
                    {
                      "name": "Value",
                      "type": "string",
                      "required": false,
                      "description": "Value of the tag.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "And",
                  "type": "dict",
                  "required": false,
                  "description": "The container for the AND condition for the lifecycle rule.",
                  "nested_params": [
                    {
                      "name": "Prefix",
                      "type": "string",
                      "required": false,
                      "description": "Prefix identifying one or more objects to which the rule applies.",
                      "nested_params": []
                    },
                    {
                      "name": "Tags",
                      "type": "list",
                      "required": false,
                      "description": "All of these tags must exist in the object's tag set in order for the rule to apply.",
                      "nested_params": [
                        {
                          "name": "Key",
                          "type": "string",
                          "required": false,
                          "description": "Key of the tag.",
                          "nested_params": []
                        },
                        {
                          "name": "Value",
                          "type": "string",
                          "required": false,
                          "description": "Value of the tag.",
                          "nested_params": []
                        }
                      ]
                    },
                    {
                      "name": "ObjectSizeGreaterThan",
                      "type": "integer",
                      "required": false,
                      "description": "The non-inclusive minimum object size for the lifecycle rule. Setting this property to 7 means the rule applies to objects with a size that is greater than 7.",
                      "nested_params": []
                    },
                    {
                      "name": "ObjectSizeLessThan",
                      "type": "integer",
                      "required": false,
                      "description": "The non-inclusive maximum object size for the lifecycle rule. Setting this property to 77 means the rule applies to objects with a size that is less than 77.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "ObjectSizeGreaterThan",
                  "type": "integer",
                  "required": false,
                  "description": "Minimum object size to which the rule applies.",
                  "nested_params": []
                },
                {
                  "name": "ObjectSizeLessThan",
                  "type": "integer",
                  "required": false,
                  "description": "Maximum object size to which the rule applies.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Status",
              "type": "string",
              "required": false,
              "description": "If --\u0098Enabled', the rule is currently being applied. If --\u0098Disabled', the rule is not currently being applied.",
              "nested_params": []
            },
            {
              "name": "Transitions",
              "type": "list",
              "required": false,
              "description": "Specifies when an Amazon S3 object transitions to a specified storage class.",
              "nested_params": [
                {
                  "name": "Date",
                  "type": "datetime",
                  "required": false,
                  "description": "Indicates when objects are transitioned to the specified storage class. The date value must be in ISO 8601 format. The time is always midnight UTC.",
                  "nested_params": []
                },
                {
                  "name": "Days",
                  "type": "integer",
                  "required": false,
                  "description": "Indicates the number of days after creation when objects are transitioned to the specified storage class. The value must be a positive integer.",
                  "nested_params": []
                },
                {
                  "name": "StorageClass",
                  "type": "string",
                  "required": false,
                  "description": "The storage class to which you want the object to transition.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "NoncurrentVersionTransitions",
              "type": "list",
              "required": false,
              "description": "Specifies the transition rule for the lifecycle rule that describes when noncurrent objects transition to a specific storage class. If your bucket is versioning-enabled (or versioning is suspended), you can set this action to request that Amazon S3 transition noncurrent object versions to a specific storage class at a set period in the object's lifetime.",
              "nested_params": [
                {
                  "name": "NoncurrentDays",
                  "type": "integer",
                  "required": false,
                  "description": "Specifies the number of days an object is noncurrent before Amazon S3 can perform the associated action. For information about the noncurrent days calculations, see How Amazon S3 Calculates How Long an Object Has Been Noncurrent in the Amazon S3 User Guide.",
                  "nested_params": []
                },
                {
                  "name": "StorageClass",
                  "type": "string",
                  "required": false,
                  "description": "The class of storage used to store the object.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "NoncurrentVersionExpiration",
              "type": "dict",
              "required": false,
              "description": "The noncurrent version expiration of the lifecycle rule.",
              "nested_params": [
                {
                  "name": "NoncurrentDays",
                  "type": "integer",
                  "required": false,
                  "description": "Specifies the number of days an object is noncurrent before Amazon S3 can perform the associated action. For information about the noncurrent days calculations, see How Amazon S3 Calculates When an Object Became Noncurrent in the Amazon S3 User Guide.",
                  "nested_params": []
                },
                {
                  "name": "NewerNoncurrentVersions",
                  "type": "integer",
                  "required": false,
                  "description": "Specifies how many noncurrent versions S3 on Outposts will retain. If there are this many more recent noncurrent versions, S3 on Outposts will take the associated action. For more information about noncurrent versions, see Lifecycle configuration elements in the Amazon S3 User Guide.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "AbortIncompleteMultipartUpload",
              "type": "dict",
              "required": false,
              "description": "Specifies the days since the initiation of an incomplete multipart upload that Amazon S3 waits before permanently removing all parts of the upload. For more information, see Aborting Incomplete Multipart Uploads Using a Bucket Lifecycle Configuration in the Amazon S3 User Guide.",
              "nested_params": [
                {
                  "name": "DaysAfterInitiation",
                  "type": "integer",
                  "required": false,
                  "description": "Specifies the number of days after which Amazon S3 aborts an incomplete multipart upload to the Outposts bucket.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}