{
  "method_name": "put_bucket_versioning",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3control/client/put_bucket_versioning.html",
  "description": "Sets the versioning state for an S3 on Outposts bucket. With S3 Versioning, you can save multiple distinct copies of your objects and recover from unintended user actions and application failures. You can set the versioning state to one of the following: If you've never set versioning on your bucket, it has no versioning state. In that case, a GetBucketVersioning request does not return a versioning state value. When you enable S3 Versioning, for each object in your bucket, you have a current version and zero or more noncurrent versions. You can configure your bucket S3 Lifecycle rules to expire noncurrent versions after a specified time period. For more information, see Creating and managing a lifecycle configuration for your S3 on Outposts bucket in the Amazon S3 User Guide. If you have an object expiration lifecycle configuration in your non-versioned bucket and you want to maintain the same permanent delete behavior when you enable versioning, you must add a noncurrent expiration policy. The noncurrent expiration lifecycle configuration will manage the deletes of the noncurrent object versions in the version-enabled bucket. For more information, see Versioning in the Amazon S3 User Guide. All Amazon S3 on Outposts REST API requests for this action require an additional parameter of x-amz-outpost-id to be passed with the request. In addition, you must use an S3 on Outposts endpoint hostname prefix instead of s3-control. For an example of the request syntax for Amazon S3 on Outposts that uses the S3 on Outposts endpoint hostname prefix and the x-amz-outpost-id derived by using the access point ARN, see the Examples section. The following operations are related to PutBucketVersioning for S3 on Outposts.",
  "parameters": [
    {
      "name": "AccountId",
      "type": "string",
      "required": true,
      "description": "The Amazon Web Services account ID of the S3 on Outposts bucket.",
      "nested_params": []
    },
    {
      "name": "Bucket",
      "type": "string",
      "required": true,
      "description": "The S3 on Outposts bucket to set the versioning state for.",
      "nested_params": []
    },
    {
      "name": "MFA",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "VersioningConfiguration",
      "type": "dict",
      "required": true,
      "description": "The root-level tag for the VersioningConfiguration parameters. MFADelete (string) --- Specifies whether MFA delete is enabled or disabled in the bucket versioning configuration for the S3 on Outposts bucket. Status (string) --- Sets the versioning state of the S3 on Outposts bucket.",
      "nested_params": [
        {
          "name": "MFADelete",
          "type": "string",
          "required": false,
          "description": "Specifies whether MFA delete is enabled or disabled in the bucket versioning configuration for the S3 on Outposts bucket.",
          "nested_params": []
        },
        {
          "name": "Status",
          "type": "string",
          "required": false,
          "description": "Sets the versioning state of the S3 on Outposts bucket.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}