{
  "method_name": "put_bucket_replication",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3control/client/put_bucket_replication.html",
  "description": "Creates a replication configuration or replaces an existing one. For information about S3 replication on Outposts configuration, see Replicating objects for S3 on Outposts in the Amazon S3 User Guide. Specify the replication configuration in the request body. In the replication configuration, you provide the following information: A replication configuration must include at least one rule and can contain a maximum of 100. Each rule identifies a subset of objects to replicate by filtering the objects in the source Outposts bucket. To choose additional subsets of objects to replicate, add a rule for each subset. To specify a subset of the objects in the source Outposts bucket to apply a replication rule to, add the Filter element as a child of the Rule element. You can filter objects based on an object key prefix, one or more object tags, or both. When you add the Filter element in the configuration, you must also add the following elements: DeleteMarkerReplication, Status, and Priority. Using PutBucketReplication on Outposts requires that both the source and destination buckets must have versioning enabled. For information about enabling versioning on a bucket, see Managing S3 Versioning for your S3 on Outposts bucket. For information about S3 on Outposts replication failure reasons, see Replication failure reasons in the Amazon S3 User Guide. Outposts buckets are encrypted at all times. All the objects in the source Outposts bucket are encrypted and can be replicated. Also, all the replicas in the destination Outposts bucket are encrypted with the same encryption key as the objects in the source Outposts bucket. To create a PutBucketReplication request, you must have s3-outposts:PutReplicationConfiguration permissions for the bucket. The Outposts bucket owner has this permission by default and can grant it to others. For more information about permissions, see Setting up IAM with S3 on Outposts and Managing access to S3 on Outposts buckets. All Amazon S3 on Outposts REST API requests for this action require an additional parameter of x-amz-outpost-id to be passed with the request. In addition, you must use an S3 on Outposts endpoint hostname prefix instead of s3-control. For an example of the request syntax for Amazon S3 on Outposts that uses the S3 on Outposts endpoint hostname prefix and the x-amz-outpost-id derived by using the access point ARN, see the Examples section. The following operations are related to PutBucketReplication:",
  "parameters": [
    {
      "name": "AccountId",
      "type": "string",
      "required": true,
      "description": "The Amazon Web Services account ID of the Outposts bucket.",
      "nested_params": []
    },
    {
      "name": "Bucket",
      "type": "string",
      "required": true,
      "description": "Specifies the S3 on Outposts bucket to set the configuration for. For using this parameter with Amazon S3 on Outposts with the REST API, you must specify the name and the x-amz-outpost-id as well. For using this parameter with S3 on Outposts with the Amazon Web Services SDK and CLI, you must specify the ARN of the bucket accessed in the format arn:aws:s3-outposts:<Region>:<account-id>:outpost/<outpost-id>/bucket/<my-bucket-name>. For example, to access the bucket reports through Outpost my-outpost owned by account 123456789012 in Region us-west-2, use the URL encoding of arn:aws:s3-outposts:us-west-2:123456789012:outpost/my-outpost/bucket/reports. The value must be URL encoded.",
      "nested_params": []
    },
    {
      "name": "ReplicationConfiguration",
      "type": "dict",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the Identity and Access Management (IAM) role that S3 on Outposts assumes when replicating objects. For information about S3 replication on Outposts configuration, see Setting up replication in the Amazon S3 User Guide. A container for one or more replication rules. A replication configuration must have at least one rule and can contain an array of 100 rules at the most. (dict) --- Specifies which S3 on Outposts objects to replicate and where to store the replicas. ID (string) --- A unique identifier for the rule. The maximum value is 255 characters. Priority (integer) --- The priority indicates which rule has precedence whenever two or more replication rules conflict. S3 on Outposts attempts to replicate objects according to all replication rules. However, if there are two or more rules with the same destination Outposts bucket, then objects will be replicated according to the rule with the highest priority. The higher the number, the higher the priority. For more information, see Creating replication rules on Outposts in the Amazon S3 User Guide. Prefix (string) --- An object key name prefix that identifies the object or objects to which the rule applies. The maximum prefix length is 1,024 characters. To include all objects in an Outposts bucket, specify an empty string. Filter (dict) --- A filter that identifies the subset of objects to which the replication rule applies. A Filter element must specify exactly one Prefix, Tag, or And child element. Prefix (string) --- An object key name prefix that identifies the subset of objects that the rule applies to. Tag (dict) --- A container for a key-value name pair. Key of the tag Value of the tag And (dict) --- A container for specifying rule filters. The filters determine the subset of objects that the rule applies to. This element is required only if you specify more than one filter. For example: If you specify both a Prefix and a Tag filter, wrap these filters in an And element. If you specify a filter based on multiple tags, wrap the Tag elements in an And element. Tags (list) --- An array of tags that contain key and value pairs. (dict) --- A container for a key-value name pair. Key of the tag Value of the tag Specifies whether the rule is enabled. SourceSelectionCriteria (dict) --- A container that describes additional filters for identifying the source Outposts objects that you want to replicate. You can choose to enable or disable the replication of these objects. SseKmsEncryptedObjects (dict) --- A filter that you can use to select Amazon S3 objects that are encrypted with server-side encryption by using Key Management Service (KMS) keys. If you include SourceSelectionCriteria in the replication configuration, this element is required. Specifies whether Amazon S3 replicates objects that are created with server-side encryption by using an KMS key stored in Key Management Service. ReplicaModifications (dict) --- A filter that you can use to specify whether replica modification sync is enabled. S3 on Outposts replica modification sync can help you keep object metadata synchronized between replicas and source objects. By default, S3 on Outposts replicates metadata from the source objects to the replicas only. When replica modification sync is enabled, S3 on Outposts replicates metadata changes made to the replica copies back to the source object, making the replication bidirectional. To replicate object metadata modifications on replicas, you can specify this element and set the Status of this element to Enabled. Specifies whether S3 on Outposts replicates modifications to object metadata on replicas. ExistingObjectReplication (dict) --- An optional configuration to replicate existing source bucket objects. Specifies whether Amazon S3 replicates existing source bucket objects. A container for information about the replication destination and its configurations. Account (string) --- The destination bucket owner's account ID. The Amazon Resource Name (ARN) of the access point for the destination bucket where you want S3 on Outposts to store the replication results. ReplicationTime (dict) --- A container that specifies S3 Replication Time Control (S3 RTC) settings, including whether S3 RTC is enabled and the time when all objects and operations on objects must be replicated. Must be specified together with a Metrics block. Specifies whether S3 Replication Time Control (S3 RTC) is enabled. A container that specifies the time by which replication should be complete for all objects and operations on objects. Minutes (integer) --- Contains an integer that specifies the time period in minutes. Valid value: 15 AccessControlTranslation (dict) --- Specify this property only in a cross-account scenario (where the source and destination bucket owners are not the same), and you want to change replica ownership to the Amazon Web Services account that owns the destination bucket. If this property is not specified in the replication configuration, the replicas are owned by same Amazon Web Services account that owns the source object. Specifies the replica ownership. EncryptionConfiguration (dict) --- A container that provides information about encryption. If SourceSelectionCriteria is specified, you must specify this element. ReplicaKmsKeyID (string) --- Specifies the ID of the customer managed KMS key that's stored in Key Management Service (KMS) for the destination bucket. This ID is either the Amazon Resource Name (ARN) for the KMS key or the alias ARN for the KMS key. Amazon S3 uses this KMS key to encrypt replica objects. Amazon S3 supports only symmetric encryption KMS keys. For more information, see Symmetric encryption KMS keys in the Amazon Web Services Key Management Service Developer Guide. Metrics (dict) --- A container that specifies replication metrics-related settings. Specifies whether replication metrics are enabled. EventThreshold (dict) --- A container that specifies the time threshold for emitting the s3:Replication:OperationMissedThreshold event. Valid value: 15 StorageClass (string) --- The storage class to use when replicating objects. All objects stored on S3 on Outposts are stored in the OUTPOSTS storage class. S3 on Outposts uses the OUTPOSTS storage class to create the object replicas. DeleteMarkerReplication (dict) --- Specifies whether S3 on Outposts replicates delete markers. If you specify a Filter element in your replication configuration, you must also include a DeleteMarkerReplication element. If your Filter includes a Tag element, the DeleteMarkerReplication element's Status child element must be set to Disabled, because S3 on Outposts doesn't support replicating delete markers for tag-based rules. For more information about delete marker replication, see How delete operations affect replication in the Amazon S3 User Guide. Indicates whether to replicate delete markers. The Amazon Resource Name (ARN) of the access point for the source Outposts bucket that you want S3 on Outposts to replicate the objects from.",
      "nested_params": [
        {
          "name": "Role",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the Identity and Access Management (IAM) role that S3 on Outposts assumes when replicating objects. For information about S3 replication on Outposts configuration, see Setting up replication in the Amazon S3 User Guide.",
          "nested_params": []
        },
        {
          "name": "Rules",
          "type": "list",
          "required": false,
          "description": "A container for one or more replication rules. A replication configuration must have at least one rule and can contain an array of 100 rules at the most.",
          "nested_params": [
            {
              "name": "ID",
              "type": "string",
              "required": false,
              "description": "A unique identifier for the rule. The maximum value is 255 characters.",
              "nested_params": []
            },
            {
              "name": "Priority",
              "type": "integer",
              "required": false,
              "description": "The priority indicates which rule has precedence whenever two or more replication rules conflict. S3 on Outposts attempts to replicate objects according to all replication rules. However, if there are two or more rules with the same destination Outposts bucket, then objects will be replicated according to the rule with the highest priority. The higher the number, the higher the priority. For more information, see Creating replication rules on Outposts in the Amazon S3 User Guide.",
              "nested_params": []
            },
            {
              "name": "Prefix",
              "type": "string",
              "required": false,
              "description": "An object key name prefix that identifies the object or objects to which the rule applies. The maximum prefix length is 1,024 characters. To include all objects in an Outposts bucket, specify an empty string.",
              "nested_params": []
            },
            {
              "name": "Filter",
              "type": "dict",
              "required": false,
              "description": "A filter that identifies the subset of objects to which the replication rule applies. A Filter element must specify exactly one Prefix, Tag, or And child element.",
              "nested_params": [
                {
                  "name": "Prefix",
                  "type": "string",
                  "required": false,
                  "description": "An object key name prefix that identifies the subset of objects that the rule applies to.",
                  "nested_params": []
                },
                {
                  "name": "Tag",
                  "type": "dict",
                  "required": false,
                  "description": "A container for a key-value name pair.",
                  "nested_params": [
                    {
                      "name": "Key",
                      "type": "string",
                      "required": false,
                      "description": "Key of the tag.",
                      "nested_params": []
                    },
                    {
                      "name": "Value",
                      "type": "string",
                      "required": false,
                      "description": "Value of the tag.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "And",
                  "type": "dict",
                  "required": false,
                  "description": "A container for specifying rule filters. The filters determine the subset of objects that the rule applies to. This element is required only if you specify more than one filter. For example:",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Status",
              "type": "string",
              "required": false,
              "description": "Specifies whether the rule is enabled.",
              "nested_params": []
            },
            {
              "name": "SourceSelectionCriteria",
              "type": "dict",
              "required": false,
              "description": "A container that describes additional filters for identifying the source Outposts objects that you want to replicate. You can choose to enable or disable the replication of these objects.",
              "nested_params": [
                {
                  "name": "SseKmsEncryptedObjects",
                  "type": "dict",
                  "required": false,
                  "description": "A filter that you can use to select Amazon S3 objects that are encrypted with server-side encryption by using Key Management Service (KMS) keys. If you include SourceSelectionCriteria in the replication configuration, this element is required.",
                  "nested_params": [
                    {
                      "name": "Status",
                      "type": "string",
                      "required": false,
                      "description": "Specifies whether Amazon S3 replicates objects that are created with server-side encryption by using an KMS key stored in Key Management Service.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "ReplicaModifications",
                  "type": "dict",
                  "required": false,
                  "description": "A filter that you can use to specify whether replica modification sync is enabled. S3 on Outposts replica modification sync can help you keep object metadata synchronized between replicas and source objects. By default, S3 on Outposts replicates metadata from the source objects to the replicas only. When replica modification sync is enabled, S3 on Outposts replicates metadata changes made to the replica copies back to the source object, making the replication bidirectional. To replicate object metadata modifications on replicas, you can specify this element and set the Status of this element to Enabled.",
                  "nested_params": [
                    {
                      "name": "Status",
                      "type": "string",
                      "required": false,
                      "description": "Specifies whether S3 on Outposts replicates modifications to object metadata on replicas.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "ExistingObjectReplication",
              "type": "dict",
              "required": false,
              "description": "An optional configuration to replicate existing source bucket objects.",
              "nested_params": [
                {
                  "name": "Status",
                  "type": "string",
                  "required": false,
                  "description": "Specifies whether Amazon S3 replicates existing source bucket objects.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Destination",
              "type": "dict",
              "required": false,
              "description": "A container for information about the replication destination and its configurations.",
              "nested_params": [
                {
                  "name": "Account",
                  "type": "string",
                  "required": false,
                  "description": "The destination bucket owner's account ID.",
                  "nested_params": []
                },
                {
                  "name": "Bucket",
                  "type": "string",
                  "required": false,
                  "description": "The Amazon Resource Name (ARN) of the access point for the destination bucket where you want S3 on Outposts to store the replication results.",
                  "nested_params": []
                },
                {
                  "name": "ReplicationTime",
                  "type": "dict",
                  "required": false,
                  "description": "A container that specifies S3 Replication Time Control (S3 RTC) settings, including whether S3 RTC is enabled and the time when all objects and operations on objects must be replicated. Must be specified together with a Metrics block.",
                  "nested_params": [
                    {
                      "name": "Status",
                      "type": "string",
                      "required": false,
                      "description": "Specifies whether S3 Replication Time Control (S3 RTC) is enabled.",
                      "nested_params": []
                    },
                    {
                      "name": "Time",
                      "type": "dict",
                      "required": false,
                      "description": "A container that specifies the time by which replication should be complete for all objects and operations on objects.",
                      "nested_params": [
                        {
                          "name": "Minutes",
                          "type": "integer",
                          "required": false,
                          "description": "Contains an integer that specifies the time period in minutes. Valid value: 15",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "AccessControlTranslation",
                  "type": "dict",
                  "required": false,
                  "description": "Specify this property only in a cross-account scenario (where the source and destination bucket owners are not the same), and you want to change replica ownership to the Amazon Web Services account that owns the destination bucket. If this property is not specified in the replication configuration, the replicas are owned by same Amazon Web Services account that owns the source object.",
                  "nested_params": [
                    {
                      "name": "Owner",
                      "type": "string",
                      "required": false,
                      "description": "Specifies the replica ownership.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "EncryptionConfiguration",
                  "type": "dict",
                  "required": false,
                  "description": "A container that provides information about encryption. If SourceSelectionCriteria is specified, you must specify this element.",
                  "nested_params": [
                    {
                      "name": "ReplicaKmsKeyID",
                      "type": "string",
                      "required": false,
                      "description": "Specifies the ID of the customer managed KMS key that's stored in Key Management Service (KMS) for the destination bucket. This ID is either the Amazon Resource Name (ARN) for the KMS key or the alias ARN for the KMS key. Amazon S3 uses this KMS key to encrypt replica objects. Amazon S3 supports only symmetric encryption KMS keys. For more information, see Symmetric encryption KMS keys in the Amazon Web Services Key Management Service Developer Guide.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "Metrics",
                  "type": "dict",
                  "required": false,
                  "description": "A container that specifies replication metrics-related settings.",
                  "nested_params": [
                    {
                      "name": "Status",
                      "type": "string",
                      "required": false,
                      "description": "Specifies whether replication metrics are enabled.",
                      "nested_params": []
                    },
                    {
                      "name": "EventThreshold",
                      "type": "dict",
                      "required": false,
                      "description": "A container that specifies the time threshold for emitting the s3:Replication:OperationMissedThreshold event.",
                      "nested_params": [
                        {
                          "name": "Minutes",
                          "type": "integer",
                          "required": false,
                          "description": "Contains an integer that specifies the time period in minutes. Valid value: 15",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "StorageClass",
                  "type": "string",
                  "required": false,
                  "description": "The storage class to use when replicating objects. All objects stored on S3 on Outposts are stored in the OUTPOSTS storage class. S3 on Outposts uses the OUTPOSTS storage class to create the object replicas.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "DeleteMarkerReplication",
              "type": "dict",
              "required": false,
              "description": "Specifies whether S3 on Outposts replicates delete markers. If you specify a Filter element in your replication configuration, you must also include a DeleteMarkerReplication element. If your Filter includes a Tag element, the DeleteMarkerReplication element's Status child element must be set to Disabled, because S3 on Outposts doesn't support replicating delete markers for tag-based rules. For more information about delete marker replication, see How delete operations affect replication in the Amazon S3 User Guide.",
              "nested_params": [
                {
                  "name": "Status",
                  "type": "string",
                  "required": false,
                  "description": "Indicates whether to replicate delete markers.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Bucket",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of the access point for the source Outposts bucket that you want S3 on Outposts to replicate the objects from.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}