{
  "method_name": "get_resource_policy",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/dynamodb/client/get_resource_policy.html",
  "description": "Returns the resource-based policy document attached to the resource, which can be a table or stream, in JSON format. GetResourcePolicy follows an eventually consistent model. The following list describes the outcomes when you issue the GetResourcePolicy request immediately after issuing another request: Because GetResourcePolicy uses an eventually consistent query, the metadata for your policy or table might not be available at that moment. Wait for a few seconds, and then retry the GetResourcePolicy request. After a GetResourcePolicy request returns a policy created using the PutResourcePolicy request, the policy will be applied in the authorization of requests to the resource. Because this process is eventually consistent, it will take some time to apply the policy to all requests to a resource. Policies that you attach while creating a table using the CreateTable request will always be applied to all requests for that table.",
  "parameters": [
    {
      "name": "ResourceArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the DynamoDB resource to which the policy is attached. The resources you can specify include tables and streams.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Policy",
          "type": "string",
          "description": "The resource-based policy document attached to the resource, which can be a table or stream, in JSON format.",
          "nested_items": []
        },
        {
          "name": "RevisionId",
          "type": "string",
          "description": "A unique string that represents the revision ID of the policy. If you're comparing revision IDs, make sure to always use string comparison logic.",
          "nested_items": []
        }
      ]
    }
  ]
}