{
  "method_name": "get_admin_scope",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/fms/client/get_admin_scope.html",
  "description": "Returns information about the specified account's administrative scope. The administrative scope defines the resources that an Firewall Manager administrator can manage.",
  "parameters": [
    {
      "name": "AdminAccount",
      "type": "string",
      "required": true,
      "description": "The administrator account that you want to get the details for.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "AdminScope",
          "type": "dict",
          "description": "Contains details about the administrative scope of the requested account.",
          "nested_items": [
            {
              "name": "AccountScope",
              "type": "dict",
              "description": "Defines the accounts that the specified Firewall Manager administrator can apply policies to.",
              "nested_items": [
                {
                  "name": "Accounts",
                  "type": "list",
                  "description": "The list of accounts within the organization that the specified Firewall Manager administrator either can or cannot apply policies to, based on the value of ExcludeSpecifiedAccounts. If ExcludeSpecifiedAccounts is set to true, then the Firewall Manager administrator can apply policies to all members of the organization except for the accounts in this list. If ExcludeSpecifiedAccounts is set to false, then the Firewall Manager administrator can only apply policies to the accounts in this list.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "AllAccountsEnabled",
                  "type": "boolean",
                  "description": "A boolean value that indicates if the administrator can apply policies to all accounts within an organization. If true, the administrator can apply policies to all accounts within the organization. You can either enable management of all accounts through this operation, or you can specify a list of accounts to manage in AccountScope$Accounts. You cannot specify both.",
                  "nested_items": []
                },
                {
                  "name": "ExcludeSpecifiedAccounts",
                  "type": "boolean",
                  "description": "A boolean value that excludes the accounts in AccountScope$Accounts from the administrator's scope. If true, the Firewall Manager administrator can apply policies to all members of the organization except for the accounts listed in AccountScope$Accounts. You can either specify a list of accounts to exclude by AccountScope$Accounts, or you can enable management of all accounts by AccountScope$AllAccountsEnabled. You cannot specify both.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "OrganizationalUnitScope",
              "type": "dict",
              "description": "Defines the Organizations organizational units that the specified Firewall Manager administrator can apply policies to. For more information about OUs in Organizations, see Managing organizational units (OUs) in the Organizations User Guide.",
              "nested_items": [
                {
                  "name": "OrganizationalUnits",
                  "type": "list",
                  "description": "The list of OUs within the organization that the specified Firewall Manager administrator either can or cannot apply policies to, based on the value of OrganizationalUnitScope$ExcludeSpecifiedOrganizationalUnits. If OrganizationalUnitScope$ExcludeSpecifiedOrganizationalUnits is set to true, then the Firewall Manager administrator can apply policies to all OUs in the organization except for the OUs in this list. If OrganizationalUnitScope$ExcludeSpecifiedOrganizationalUnits is set to false, then the Firewall Manager administrator can only apply policies to the OUs in this list.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "AllOrganizationalUnitsEnabled",
                  "type": "boolean",
                  "description": "A boolean value that indicates if the administrator can apply policies to all OUs within an organization. If true, the administrator can manage all OUs within the organization. You can either enable management of all OUs through this operation, or you can specify OUs to manage in OrganizationalUnitScope$OrganizationalUnits. You cannot specify both.",
                  "nested_items": []
                },
                {
                  "name": "ExcludeSpecifiedOrganizationalUnits",
                  "type": "boolean",
                  "description": "A boolean value that excludes the OUs in OrganizationalUnitScope$OrganizationalUnits from the administrator's scope. If true, the Firewall Manager administrator can apply policies to all OUs in the organization except for the OUs listed in OrganizationalUnitScope$OrganizationalUnits. You can either specify a list of OUs to exclude by OrganizationalUnitScope$OrganizationalUnits, or you can enable management of all OUs by OrganizationalUnitScope$AllOrganizationalUnitsEnabled. You cannot specify both.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "RegionScope",
              "type": "dict",
              "description": "Defines the Amazon Web Services Regions that the specified Firewall Manager administrator can perform actions in.",
              "nested_items": [
                {
                  "name": "Regions",
                  "type": "list",
                  "description": "The Amazon Web Services Regions that the specified Firewall Manager administrator can perform actions in.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "AllRegionsEnabled",
                  "type": "boolean",
                  "description": "Allows the specified Firewall Manager administrator to manage all Amazon Web Services Regions.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "PolicyTypeScope",
              "type": "dict",
              "description": "Defines the Firewall Manager policy types that the specified Firewall Manager administrator can create and manage.",
              "nested_items": [
                {
                  "name": "PolicyTypes",
                  "type": "list",
                  "description": "The list of policy types that the specified Firewall Manager administrator can manage.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "AllPolicyTypesEnabled",
                  "type": "boolean",
                  "description": "Allows the specified Firewall Manager administrator to manage all Firewall Manager policy types, except for third-party policy types. Third-party policy types can only be managed by the Firewall Manager default administrator.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "Status",
          "type": "string",
          "description": "The current status of the request to onboard a member account as an Firewall Manager administrator.",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "ONBOARDING - The account is onboarding to Firewall Manager as an administrator.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "ONBOARDING_COMPLETE - Firewall Manager The account is onboarded to Firewall Manager as an administrator, and can perform actions on the resources defined in their  AdminScope.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "OFFBOARDING - The account is being removed as an Firewall Manager administrator.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "OFFBOARDING_COMPLETE - The account has been removed as an Firewall Manager administrator.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}