{
  "method_name": "create_segment",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/evidently/client/create_segment.html",
  "description": "Use this operation to define a segment of your audience. A segment is a portion of your audience that share one or more characteristics. Examples could be Chrome browser users, users in Europe, or Firefox browser users in Europe who also fit other criteria that your application collects, such as age. Using a segment in an experiment limits that experiment to evaluate only the users who match the segment criteria. Using one or more segments in a launch allows you to define different traffic splits for the different audience segments. For more information about segment pattern syntax, see Segment rule pattern syntax. The pattern that you define for a segment is matched against the value of evaluationContext, which is passed into Evidently in the EvaluateFeature operation, when Evidently assigns a feature variation to a user.",
  "parameters": [
    {
      "name": "description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "name",
      "type": "string",
      "required": true,
      "description": "A name for the segment.",
      "nested_params": []
    },
    {
      "name": "pattern",
      "type": "string",
      "required": true,
      "description": "The pattern to use for the segment. For more information about pattern syntax, see Segment rule pattern syntax.",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "dict",
      "required": false,
      "description": "Assigns one or more tags (key-value pairs) to the segment. Tags can help you organize and categorize your resources. You can also use them to scope user permissions by granting a user permission to access or change only resources with certain tag values. Tags don't have any semantic meaning to Amazon Web Services and are interpreted strictly as strings of characters. You can associate as many as 50 tags with a segment. For more information, see Tagging Amazon Web Services resources. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "arn",
              "type": "string",
              "description": "The ARN of the segment.",
              "nested_items": []
            },
            {
              "name": "createdTime",
              "type": "datetime",
              "description": "The date and time that this segment was created.",
              "nested_items": []
            },
            {
              "name": "description",
              "type": "string",
              "description": "The customer-created description for this segment.",
              "nested_items": []
            },
            {
              "name": "experimentCount",
              "type": "integer",
              "description": "The number of experiments that this segment is used in. This count includes all current experiments, not just those that are currently running.",
              "nested_items": []
            },
            {
              "name": "lastUpdatedTime",
              "type": "datetime",
              "description": "The date and time that this segment was most recently updated.",
              "nested_items": []
            },
            {
              "name": "launchCount",
              "type": "integer",
              "description": "The number of launches that this segment is used in. This count includes all current launches, not just those that are currently running.",
              "nested_items": []
            },
            {
              "name": "name",
              "type": "string",
              "description": "The name of the segment.",
              "nested_items": []
            },
            {
              "name": "pattern",
              "type": "string",
              "description": "The pattern that defines the attributes to use to evalute whether a user session will be in the segment. For more information about the pattern syntax, see Segment rule pattern syntax.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}