{
  "method_name": "evaluate_feature",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/evidently/client/evaluate_feature.html",
  "description": "This operation assigns a feature variation to one given user session. You pass in an entityID that represents the user. Evidently then checks the evaluation rules and assigns the variation. The first rules that are evaluated are the override rules. If the user's entityID matches an override rule, the user is served the variation specified by that rule. If there is a current launch with this feature that uses segment overrides, and if the user session's evaluationContext matches a segment rule defined in a segment override, the configuration in the segment overrides is used. For more information about segments, see CreateSegment and Use segments to focus your audience. If there is a launch with no segment overrides, the user might be assigned to a variation in the launch. The chance of this depends on the percentage of users that are allocated to that launch. If the user is enrolled in the launch, the variation they are served depends on the allocation of the various feature variations used for the launch. If the user is not assigned to a launch, and there is an ongoing experiment for this feature, the user might be assigned to a variation in the experiment. The chance of this depends on the percentage of users that are allocated to that experiment. If the experiment uses a segment, then only user sessions with evaluationContext values that match the segment rule are used in the experiment. If the user is enrolled in the experiment, the variation they are served depends on the allocation of the various feature variations used for the experiment. If the user is not assigned to a launch or experiment, they are served the default variation.",
  "parameters": [
    {
      "name": "entityId",
      "type": "string",
      "required": true,
      "description": "An internal ID that represents a unique user of the application. This entityID is checked against any override rules assigned for this feature.",
      "nested_params": []
    },
    {
      "name": "evaluationContext",
      "type": "string",
      "required": false,
      "description": "A JSON object of attributes that you can optionally pass in as part of the evaluation event sent to Evidently from the user session. Evidently can use this value to match user sessions with defined audience segments. For more information, see Use segments to focus your audience. If you include this parameter, the value must be a JSON object. A JSON array is not supported.",
      "nested_params": []
    },
    {
      "name": "feature",
      "type": "string",
      "required": true,
      "description": "The name of the feature being evaluated.",
      "nested_params": []
    },
    {
      "name": "project",
      "type": "string",
      "required": true,
      "description": "The name or ARN of the project that contains this feature.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "details",
          "type": "string",
          "description": "If this user was assigned to a launch or experiment, this field lists the launch or experiment name.",
          "nested_items": []
        },
        {
          "name": "reason",
          "type": "string",
          "description": "Specifies the reason that the user session was assigned this variation. Possible values include DEFAULT, meaning the user was served the default variation; LAUNCH_RULE_MATCH, if the user session was enrolled in a launch; EXPERIMENT_RULE_MATCH, if the user session was enrolled in an experiment; or ENTITY_OVERRIDES_MATCH, if the user's entityId matches an override rule.",
          "nested_items": []
        },
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "boolValue",
              "type": "boolean",
              "description": "If this feature uses the Boolean variation type, this field contains the Boolean value of this variation.",
              "nested_items": []
            },
            {
              "name": "doubleValue",
              "type": "float",
              "description": "If this feature uses the double integer variation type, this field contains the double integer value of this variation.",
              "nested_items": []
            },
            {
              "name": "longValue",
              "type": "integer",
              "description": "If this feature uses the long variation type, this field contains the long value of this variation.",
              "nested_items": []
            },
            {
              "name": "stringValue",
              "type": "string",
              "description": "If this feature uses the string variation type, this field contains the string value of this variation.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "variation",
          "type": "string",
          "description": "The name of the variation that was served to the user session.",
          "nested_items": []
        }
      ]
    }
  ]
}