{
  "method_name": "accept_primary_email_update",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/account/client/accept_primary_email_update.html",
  "description": "Accepts the request that originated from  StartPrimaryEmailUpdate to update the primary email address (also known as the root user email address) for the specified account.",
  "parameters": [
    {
      "name": "AccountId",
      "type": "string",
      "required": true,
      "description": "Specifies the 12-digit account ID number of the Amazon Web Services account that you want to access or modify with this operation. To use this parameter, the caller must be an identity in the organization's management account or a delegated administrator account. The specified account ID must be a member account in the same organization. The organization must have all features enabled, and the organization must have trusted access enabled for the Account Management service, and optionally a delegated admin account assigned. This operation can only be called from the management account or the delegated administrator account of an organization for a member account.",
      "nested_params": []
    },
    {
      "name": "Otp",
      "type": "string",
      "required": true,
      "description": "The OTP code sent to the PrimaryEmail specified on the StartPrimaryEmailUpdate API call.",
      "nested_params": []
    },
    {
      "name": "PrimaryEmail",
      "type": "string",
      "required": true,
      "description": "The new primary email address for use with the specified account. This must match the PrimaryEmail from the StartPrimaryEmailUpdate API call.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Status",
          "type": "string",
          "description": "Retrieves the status of the accepted primary email update request.",
          "nested_items": []
        }
      ]
    }
  ]
}