{
  "method_name": "create_notification_rule",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/codestar-notifications/client/create_notification_rule.html",
  "description": "Creates a notification rule for a resource. The rule specifies the events you want notifications about and the targets (such as Chatbot topics or Chatbot clients configured for Slack) where you want to receive them.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "The name for the notification rule. Notification rule names must be unique in your Amazon Web Services account.",
      "nested_params": []
    },
    {
      "name": "EventTypeIds",
      "type": "list",
      "required": true,
      "description": "A list of event types associated with this notification rule. For a list of allowed events, see  EventTypeSummary. (string) ---",
      "nested_params": []
    },
    {
      "name": "Resource",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the resource to associate with the notification rule. Supported resources include pipelines in CodePipeline, repositories in CodeCommit, and build projects in CodeBuild.",
      "nested_params": []
    },
    {
      "name": "Targets",
      "type": "list",
      "required": true,
      "description": "A list of Amazon Resource Names (ARNs) of Amazon Simple Notification Service topics and Chatbot clients to associate with the notification rule. (dict) --- Information about the Chatbot topics or Chatbot clients associated with a notification rule. TargetType (string) --- The target type. Can be an Chatbot topic or Chatbot client. Chatbot topics are specified as SNS. Chatbot clients are specified as AWSChatbotSlack. TargetAddress (string) --- The Amazon Resource Name (ARN) of the Chatbot topic or Chatbot client.",
      "nested_params": [
        {
          "name": "TargetType",
          "type": "string",
          "required": false,
          "description": "The target type. Can be an Chatbot topic or Chatbot client.",
          "nested_params": []
        },
        {
          "name": "TargetAddress",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the Chatbot topic or Chatbot client.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "DetailType",
      "type": "string",
      "required": true,
      "description": "The level of detail to include in the notifications for this resource. BASIC will include only the contents of the event as it would appear in Amazon CloudWatch. FULL will include any supplemental information provided by AWS CodeStar Notifications and/or the service for the resource for which the notification is created.",
      "nested_params": []
    },
    {
      "name": "ClientRequestToken",
      "type": "string",
      "required": false,
      "description": "A unique, client-generated idempotency token that, when provided in a request, ensures the request cannot be repeated with a changed parameter. If a request with the same parameters is received and a token is included, the request returns information about the initial request that used that token. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "dict",
      "required": false,
      "description": "A list of tags to apply to this notification rule. Key names cannot start with ' aws'. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "Status",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Arn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the notification rule.",
          "nested_items": []
        }
      ]
    }
  ]
}