{
  "method_name": "list_notification_rules",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/codestar-notifications/client/list_notification_rules.html",
  "description": "Returns a list of the notification rules for an Amazon Web Services account.",
  "parameters": [
    {
      "name": "Filters",
      "type": "list",
      "required": true,
      "description": "The filters to use to return information by service or resource type. For valid values, see  ListNotificationRulesFilter. (dict) --- Information about a filter to apply to the list of returned notification rules. You can filter by event type, owner, resource, or target. The name of the attribute you want to use to filter the returned notification rules. The value of the attribute you want to use to filter the returned notification rules. For example, if you specify filtering by RESOURCE in Name, you might specify the ARN of a pipeline in CodePipeline for the value.",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name of the attribute you want to use to filter the returned notification rules.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value of the attribute you want to use to filter the returned notification rules. For example, if you specify filtering by RESOURCE in Name, you might specify the ARN of a pipeline in CodePipeline for the value.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "NextToken",
          "type": "string",
          "description": "An enumeration token that can be used in a request to return the next batch of the results.",
          "nested_items": []
        },
        {
          "name": "NotificationRules",
          "type": "list",
          "description": "The list of notification rules for the Amazon Web Services account, by Amazon Resource Name (ARN) and ID.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Id",
                  "type": "string",
                  "description": "The unique ID of the notification rule.",
                  "nested_items": []
                },
                {
                  "name": "Arn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the notification rule.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}