{
  "method_name": "create_bucket_metadata_table_configuration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3/client/create_bucket_metadata_table_configuration.html",
  "description": "Creates a metadata table configuration for a general purpose bucket. For more information, see Accelerating data discovery with S3 Metadata in the Amazon S3 User Guide. To use this operation, you must have the following permissions. For more information, see Setting up permissions for configuring metadata tables in the Amazon S3 User Guide. If you also want to integrate your table bucket with Amazon Web Services analytics services so that you can query your metadata table, you need additional permissions. For more information, see Integrating Amazon S3 Tables with Amazon Web Services analytics services in the Amazon S3 User Guide. The following operations are related to CreateBucketMetadataTableConfiguration:",
  "parameters": [
    {
      "name": "Bucket",
      "type": "string",
      "required": true,
      "description": "The general purpose bucket that you want to create the metadata table configuration in.",
      "nested_params": []
    },
    {
      "name": "ContentMD5",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ChecksumAlgorithm",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MetadataTableConfiguration",
      "type": "dict",
      "required": true,
      "description": "The contents of your metadata table configuration. The destination information for the metadata table configuration. The destination table bucket must be in the same Region and Amazon Web Services account as the general purpose bucket. The specified metadata table name must be unique within the aws_s3_metadata namespace in the destination table bucket. The Amazon Resource Name (ARN) for the table bucket that's specified as the destination in the metadata table configuration. The name for the metadata table in your metadata table configuration. The specified metadata table name must be unique within the aws_s3_metadata namespace in the destination table bucket.",
      "nested_params": [
        {
          "name": "S3TablesDestination",
          "type": "dict",
          "required": false,
          "description": "The destination information for the metadata table configuration. The destination table bucket must be in the same Region and Amazon Web Services account as the general purpose bucket. The specified metadata table name must be unique within the aws_s3_metadata namespace in the destination table bucket.",
          "nested_params": [
            {
              "name": "TableBucketArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) for the table bucket that's specified as the destination in the metadata table configuration. The destination table bucket must be in the same Region and Amazon Web Services account as the general purpose bucket.",
              "nested_params": []
            },
            {
              "name": "TableName",
              "type": "string",
              "required": false,
              "description": "The name for the metadata table in your metadata table configuration. The specified metadata table name must be unique within the aws_s3_metadata namespace in the destination table bucket.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "ExpectedBucketOwner",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}