{
  "method_name": "create_bucket",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3/client/create_bucket.html",
  "description": "Creates a new S3 bucket. To create a bucket, you must set up Amazon S3 and have a valid Amazon Web Services Access Key ID to authenticate requests. Anonymous requests are never allowed to create buckets. By creating the bucket, you become the bucket owner. There are two types of buckets: general purpose buckets and directory buckets. For more information about these bucket types, see Creating, configuring, and working with Amazon S3 buckets in the Amazon S3 User Guide. Directory buckets - The HTTP Host header syntax is s3express-control.region-code.amazonaws.com. The following operations are related to CreateBucket:",
  "parameters": [
    {
      "name": "ACL",
      "type": "string",
      "required": false,
      "description": "The canned ACL to apply to the bucket.",
      "nested_params": []
    },
    {
      "name": "Bucket",
      "type": "string",
      "required": true,
      "description": "The name of the bucket to create. General purpose buckets - For information about bucket naming restrictions, see Bucket naming rules in the Amazon S3 User Guide. Directory buckets - When you use this operation with a directory bucket, you must use path-style requests in the format https://s3express-control.region-code.amazonaws.com/bucket-name ``. Virtual-hosted-style requests aren't supported. Directory bucket names must be unique in the chosen Zone (Availability Zone or Local Zone). Bucket names must also follow the format ``bucket-base-name--zone-id--x-s3 (for example, DOC-EXAMPLE-BUCKET--usw2-az1--x-s3). For information about bucket naming restrictions, see Directory bucket naming rules in the Amazon S3 User Guide.",
      "nested_params": []
    },
    {
      "name": "CreateBucketConfiguration",
      "type": "dict",
      "required": true,
      "description": "The configuration information for the bucket. LocationConstraint (string) --- Specifies the Region where the bucket will be created. You might choose a Region to optimize latency, minimize costs, or address regulatory requirements. For example, if you reside in Europe, you will probably find it advantageous to create buckets in the Europe (Ireland) Region. If you don't specify a Region, the bucket is created in the US East (N. Virginia) Region (us-east-1) by default. Configurations using the value EU will create a bucket in eu-west-1. For a list of the valid values for all of the Amazon Web Services Regions, see Regions and Endpoints. Location (dict) --- Specifies the location where the bucket will be created. Directory buckets - The location type is Availability Zone or Local Zone. To use the Local Zone location type, your account must be enabled for Local Zones. Otherwise, you get an HTTP 403 Forbidden error with the error code AccessDenied. To learn more, see Enable accounts for Local Zones in the Amazon S3 User Guide. Type (string) --- The type of location where the bucket will be created. Name (string) --- The name of the location where the bucket will be created. For directory buckets, the name of the location is the Zone ID of the Availability Zone (AZ) or Local Zone (LZ) where the bucket will be created. An example AZ ID value is usw2-az1. Bucket (dict) --- Specifies the information about the bucket that will be created. DataRedundancy (string) --- The number of Zone (Availability Zone or Local Zone) that's used for redundancy for the bucket. Type (string) --- The type of bucket. Tags (list) --- An array of tags that you can apply to the bucket that you're creating. Tags are key-value pairs of metadata used to categorize and organize your buckets, track costs, and control access. (dict) --- A container of a key value name pair. Name of the object key. Value of the tag.",
      "nested_params": [
        {
          "name": "LocationConstraint",
          "type": "string",
          "required": false,
          "description": "Specifies the Region where the bucket will be created. You might choose a Region to optimize latency, minimize costs, or address regulatory requirements. For example, if you reside in Europe, you will probably find it advantageous to create buckets in the Europe (Ireland) Region. If you don't specify a Region, the bucket is created in the US East (N. Virginia) Region (us-east-1) by default. Configurations using the value EU will create a bucket in eu-west-1. For a list of the valid values for all of the Amazon Web Services Regions, see Regions and Endpoints.",
          "nested_params": []
        },
        {
          "name": "Location",
          "type": "dict",
          "required": false,
          "description": "Specifies the location where the bucket will be created.",
          "nested_params": [
            {
              "name": "Type",
              "type": "string",
              "required": false,
              "description": "The type of location where the bucket will be created.",
              "nested_params": []
            },
            {
              "name": "Name",
              "type": "string",
              "required": false,
              "description": "The name of the location where the bucket will be created. For directory buckets, the name of the location is the Zone ID of the Availability Zone (AZ) or Local Zone (LZ) where the bucket will be created. An example AZ ID value is usw2-az1.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Bucket",
          "type": "dict",
          "required": false,
          "description": "Specifies the information about the bucket that will be created.",
          "nested_params": [
            {
              "name": "DataRedundancy",
              "type": "string",
              "required": false,
              "description": "The number of Zone (Availability Zone or Local Zone) that's used for redundancy for the bucket.",
              "nested_params": []
            },
            {
              "name": "Type",
              "type": "string",
              "required": false,
              "description": "The type of bucket.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Tags",
          "type": "list",
          "required": false,
          "description": "An array of tags that you can apply to the bucket that you're creating. Tags are key-value pairs of metadata used to categorize and organize your buckets, track costs, and control access.",
          "nested_params": [
            {
              "name": "Key",
              "type": "string",
              "required": false,
              "description": "Name of the object key.",
              "nested_params": []
            },
            {
              "name": "Value",
              "type": "string",
              "required": false,
              "description": "Value of the tag.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "GrantFullControl",
      "type": "string",
      "required": false,
      "description": "Allows grantee the read, write, read ACP, and write ACP permissions on the bucket.",
      "nested_params": []
    },
    {
      "name": "GrantRead",
      "type": "string",
      "required": false,
      "description": "Allows grantee to list the objects in the bucket.",
      "nested_params": []
    },
    {
      "name": "GrantReadACP",
      "type": "string",
      "required": false,
      "description": "Allows grantee to read the bucket ACL.",
      "nested_params": []
    },
    {
      "name": "GrantWrite",
      "type": "string",
      "required": false,
      "description": "Allows grantee to create new objects in the bucket. For the bucket and object owners of existing objects, also allows deletions and overwrites of those objects.",
      "nested_params": []
    },
    {
      "name": "GrantWriteACP",
      "type": "string",
      "required": false,
      "description": "Allows grantee to write the ACL for the applicable bucket.",
      "nested_params": []
    },
    {
      "name": "ObjectLockEnabledForBucket",
      "type": "boolean",
      "required": false,
      "description": "Specifies whether you want S3 Object Lock to be enabled for the new bucket.",
      "nested_params": []
    },
    {
      "name": "ObjectOwnership",
      "type": "string",
      "required": false,
      "description": "The container element for object ownership for a bucket's ownership controls. BucketOwnerPreferred - Objects uploaded to the bucket change ownership to the bucket owner if the objects are uploaded with the bucket-owner-full-control canned ACL. ObjectWriter - The uploading account will own the object if the object is uploaded with the bucket-owner-full-control canned ACL. BucketOwnerEnforced - Access control lists (ACLs) are disabled and no longer affect permissions. The bucket owner automatically owns and has full control over every object in the bucket. The bucket only accepts PUT requests that don't specify an ACL or specify bucket owner full control ACLs (such as the predefined bucket-owner-full-control canned ACL or a custom ACL in XML format that grants the same permissions). By default, ObjectOwnership is set to BucketOwnerEnforced and ACLs are disabled. We recommend keeping ACLs disabled, except in uncommon use cases where you must control access for each object individually. For more information about S3 Object Ownership, see Controlling ownership of objects and disabling ACLs for your bucket in the Amazon S3 User Guide.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Location",
          "type": "string",
          "description": "A forward slash followed by the name of the bucket.",
          "nested_items": []
        },
        {
          "name": "BucketArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the S3 bucket. ARNs uniquely identify Amazon Web Services resources across all of Amazon Web Services.",
          "nested_items": []
        }
      ]
    }
  ]
}