{
  "method_name": "get_bucket_cors",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3/client/get_bucket_cors.html",
  "description": "Returns the Cross-Origin Resource Sharing (CORS) configuration information set for the bucket. To use this operation, you must have permission to perform the s3:GetBucketCORS action. By default, the bucket owner has this permission and can grant it to others. When you use this API operation with an access point, provide the alias of the access point in place of the bucket name. When you use this API operation with an Object Lambda access point, provide the alias of the Object Lambda access point in place of the bucket name. If the Object Lambda access point alias in a request is not valid, the error code InvalidAccessPointAliasError is returned. For more information about InvalidAccessPointAliasError, see List of Error Codes. For more information about CORS, see Enabling Cross-Origin Resource Sharing. The following operations are related to GetBucketCors:",
  "parameters": [
    {
      "name": "Bucket",
      "type": "string",
      "required": true,
      "description": "The bucket name for which to get the cors configuration. When you use this API operation with an access point, provide the alias of the access point in place of the bucket name. When you use this API operation with an Object Lambda access point, provide the alias of the Object Lambda access point in place of the bucket name. If the Object Lambda access point alias in a request is not valid, the error code InvalidAccessPointAliasError is returned. For more information about InvalidAccessPointAliasError, see List of Error Codes.",
      "nested_params": []
    },
    {
      "name": "ExpectedBucketOwner",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "CORSRules",
          "type": "list",
          "description": "A set of origins and methods (cross-origin access that you want to allow). You can add up to 100 rules to the configuration.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ID",
                  "type": "string",
                  "description": "Unique identifier for the rule. The value cannot be longer than 255 characters.",
                  "nested_items": []
                },
                {
                  "name": "AllowedHeaders",
                  "type": "list",
                  "description": "Headers that are specified in the Access-Control-Request-Headers header. These headers are allowed in a preflight OPTIONS request. In response to any preflight OPTIONS request, Amazon S3 returns any requested headers that are allowed.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "AllowedMethods",
                  "type": "list",
                  "description": "An HTTP method that you allow the origin to execute. Valid values are GET, PUT, HEAD, POST, and DELETE.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "AllowedOrigins",
                  "type": "list",
                  "description": "One or more origins you want customers to be able to access the bucket from.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "ExposeHeaders",
                  "type": "list",
                  "description": "One or more headers in the response that you want customers to be able to access from their applications (for example, from a JavaScript XMLHttpRequest object).",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "MaxAgeSeconds",
                  "type": "integer",
                  "description": "The time in seconds that your browser is to cache the preflight response for the specified resource.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}