{
  "method_name": "get_object_lock_configuration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3/client/get_object_lock_configuration.html",
  "description": "Gets the Object Lock configuration for a bucket. The rule specified in the Object Lock configuration will be applied by default to every new object placed in the specified bucket. For more information, see Locking Objects. The following action is related to GetObjectLockConfiguration:",
  "parameters": [
    {
      "name": "Bucket",
      "type": "string",
      "required": true,
      "description": "The bucket whose Object Lock configuration you want to retrieve. Access points - When you use this action with an access point for general purpose buckets, you must provide the alias of the access point in place of the bucket name or specify the access point ARN. When you use this action with an access point for directory buckets, you must provide the access point name in place of the bucket name. When using the access point ARN, you must direct requests to the access point hostname. The access point hostname takes the form AccessPointName-AccountId.s3-accesspoint.*Region*.amazonaws.com. When using this action with an access point through the Amazon Web Services SDKs, you provide the access point ARN in place of the bucket name. For more information about access point ARNs, see Using access points in the Amazon S3 User Guide.",
      "nested_params": []
    },
    {
      "name": "ExpectedBucketOwner",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ObjectLockConfiguration",
          "type": "dict",
          "description": "The specified bucket's Object Lock configuration.",
          "nested_items": [
            {
              "name": "ObjectLockEnabled",
              "type": "string",
              "description": "Indicates whether this bucket has an Object Lock configuration enabled. Enable ObjectLockEnabled when you apply ObjectLockConfiguration to a bucket.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "DefaultRetention",
                  "type": "dict",
                  "description": "The default Object Lock retention mode and period that you want to apply to new objects placed in the specified bucket. Bucket settings require both a mode and a period. The period can be either Days or Years but you must select one. You cannot specify Days and Years at the same time.",
                  "nested_items": [
                    {
                      "name": "Mode",
                      "type": "string",
                      "description": "The default Object Lock retention mode you want to apply to new objects placed in the specified bucket. Must be used with either Days or Years.",
                      "nested_items": []
                    },
                    {
                      "name": "Days",
                      "type": "integer",
                      "description": "The number of days that you want to specify for the default retention period. Must be used with Mode.",
                      "nested_items": []
                    },
                    {
                      "name": "Years",
                      "type": "integer",
                      "description": "The number of years that you want to specify for the default retention period. Must be used with Mode.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}