{
  "method_name": "get_object_attributes",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3/client/get_object_attributes.html",
  "description": "Retrieves all of the metadata from an object without returning the object itself. This operation is useful if you're interested only in an object's metadata. GetObjectAttributes combines the functionality of HeadObject and ListParts. All of the data returned with both of those individual calls can be returned with a single call to GetObjectAttributes. For more information, see Specifying Permissions in a Policy in the Amazon S3 User Guide. If the object that you request does not exist, the error Amazon S3 returns depends on whether you also have the s3:ListBucket permission. If you encrypted an object when you stored the object in Amazon S3 by using server-side encryption with customer-provided encryption keys (SSE-C), then when you retrieve the metadata from the object, you must use the following headers. These headers provide the server with the encryption key required to retrieve the object's metadata. The headers are: For more information about SSE-C, see Server-Side Encryption (Using Customer-Provided Encryption Keys) in the Amazon S3 User Guide. Directory buckets - S3 Versioning isn't enabled and supported for directory buckets. For this API operation, only the null value of the version ID is supported by directory buckets. You can only specify null to the versionId query parameter in the request. Consider the following when using request headers: For more information about conditional requests, see RFC 7232. For more information about conditional requests, see RFC 7232. Directory buckets - The HTTP Host header syntax is Bucket-name.s3express-zone-id.region-code.amazonaws.com. The following actions are related to GetObjectAttributes:",
  "parameters": [
    {
      "name": "Bucket",
      "type": "string",
      "required": true,
      "description": "The name of the bucket that contains the object. Directory buckets - When you use this operation with a directory bucket, you must use virtual-hosted-style requests in the format Bucket-name.s3express-zone-id.region-code.amazonaws.com. Path-style requests are not supported. Directory bucket names must be unique in the chosen Zone (Availability Zone or Local Zone). Bucket names must follow the format bucket-base-name--zone-id--x-s3 (for example, amzn-s3-demo-bucket--usw2-az1--x-s3). For information about bucket naming restrictions, see Directory bucket naming rules in the Amazon S3 User Guide. Access points - When you use this action with an access point for general purpose buckets, you must provide the alias of the access point in place of the bucket name or specify the access point ARN. When you use this action with an access point for directory buckets, you must provide the access point name in place of the bucket name. When using the access point ARN, you must direct requests to the access point hostname. The access point hostname takes the form AccessPointName-AccountId.s3-accesspoint.*Region*.amazonaws.com. When using this action with an access point through the Amazon Web Services SDKs, you provide the access point ARN in place of the bucket name. For more information about access point ARNs, see Using access points in the Amazon S3 User Guide. S3 on Outposts - When you use this action with S3 on Outposts, you must direct requests to the S3 on Outposts hostname. The S3 on Outposts hostname takes the form AccessPointName-AccountId.outpostID.s3-outposts.Region.amazonaws.com. When you use this action with S3 on Outposts, the destination bucket must be the Outposts access point ARN or the access point alias. For more information about S3 on Outposts, see What is S3 on Outposts? in the Amazon S3 User Guide.",
      "nested_params": []
    },
    {
      "name": "Key",
      "type": "string",
      "required": true,
      "description": "The object key.",
      "nested_params": []
    },
    {
      "name": "VersionId",
      "type": "string",
      "required": false,
      "description": "The version ID used to reference a specific version of the object.",
      "nested_params": []
    },
    {
      "name": "MaxParts",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "PartNumberMarker",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "SSECustomerAlgorithm",
      "type": "string",
      "required": false,
      "description": "Specifies the algorithm to use when encrypting the object (for example, AES256).",
      "nested_params": []
    },
    {
      "name": "SSECustomerKey",
      "type": "string",
      "required": false,
      "description": "Specifies the customer-provided encryption key for Amazon S3 to use in encrypting data. This value is used to store the object and then it is discarded; Amazon S3 does not store the encryption key. The key must be appropriate for use with the algorithm specified in the x-amz-server-side-encryption-customer-algorithm header.",
      "nested_params": []
    },
    {
      "name": "SSECustomerKeyMD5",
      "type": "string",
      "required": false,
      "description": "Specifies the 128-bit MD5 digest of the encryption key according to RFC 1321. Amazon S3 uses this header for a message integrity check to ensure that the encryption key was transmitted without error.",
      "nested_params": []
    },
    {
      "name": "RequestPayer",
      "type": "string",
      "required": false,
      "description": "Confirms that the requester knows that they will be charged for the request. Bucket owners need not specify this parameter in their requests. If either the source or destination S3 bucket has Requester Pays enabled, the requester will pay for corresponding charges to copy the object. For information about downloading objects from Requester Pays buckets, see Downloading Objects in Requester Pays Buckets in the Amazon S3 User Guide.",
      "nested_params": []
    },
    {
      "name": "ExpectedBucketOwner",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ObjectAttributes",
      "type": "list",
      "required": true,
      "description": "Specifies the fields at the root level that you want returned in the response. Fields that you do not specify are not returned. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "DeleteMarker",
          "type": "boolean",
          "description": "Specifies whether the object retrieved was ( true) or was not ( false) a delete marker. If false, this response header does not appear in the response. To learn more about delete markers, see Working with delete markers.",
          "nested_items": []
        },
        {
          "name": "LastModified",
          "type": "datetime",
          "description": "Date and time when the object was last modified.",
          "nested_items": []
        },
        {
          "name": "VersionId",
          "type": "string",
          "description": "The version ID of the object.",
          "nested_items": []
        },
        {
          "name": "RequestCharged",
          "type": "string",
          "description": "If present, indicates that the requester was successfully charged for the request. For more information, see Using Requester Pays buckets for storage transfers and usage in the Amazon Simple Storage Service user guide.",
          "nested_items": []
        },
        {
          "name": "ETag",
          "type": "string",
          "description": "An ETag is an opaque identifier assigned by a web server to a specific version of a resource found at a URL.",
          "nested_items": []
        },
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "ChecksumCRC32",
              "type": "string",
              "description": "The Base64 encoded, 32-bit CRC32 checksum of the object. This checksum is only be present if the checksum was uploaded with the object. When you use an API operation on an object that was uploaded using multipart uploads, this value may not be a direct checksum value of the full object. Instead, it's a calculation based on the checksum values of each individual part. For more information about how checksums are calculated with multipart uploads, see Checking object integrity in the Amazon S3 User Guide.",
              "nested_items": []
            },
            {
              "name": "ChecksumCRC32C",
              "type": "string",
              "description": "The Base64 encoded, 32-bit CRC32C checksum of the object. This checksum is only present if the checksum was uploaded with the object. When you use an API operation on an object that was uploaded using multipart uploads, this value may not be a direct checksum value of the full object. Instead, it's a calculation based on the checksum values of each individual part. For more information about how checksums are calculated with multipart uploads, see Checking object integrity in the Amazon S3 User Guide.",
              "nested_items": []
            },
            {
              "name": "ChecksumCRC64NVME",
              "type": "string",
              "description": "The Base64 encoded, 64-bit CRC64NVME checksum of the object. This checksum is present if the object was uploaded with the CRC64NVME checksum algorithm, or if the object was uploaded without a checksum (and Amazon S3 added the default checksum, CRC64NVME, to the uploaded object). For more information, see Checking object integrity in the Amazon S3 User Guide.",
              "nested_items": []
            },
            {
              "name": "ChecksumSHA1",
              "type": "string",
              "description": "The Base64 encoded, 160-bit SHA1 digest of the object. This will only be present if the object was uploaded with the object. When you use the API operation on an object that was uploaded using multipart uploads, this value may not be a direct checksum value of the full object. Instead, it's a calculation based on the checksum values of each individual part. For more information about how checksums are calculated with multipart uploads, see Checking object integrity in the Amazon S3 User Guide.",
              "nested_items": []
            },
            {
              "name": "ChecksumSHA256",
              "type": "string",
              "description": "The Base64 encoded, 256-bit SHA256 digest of the object. This will only be present if the object was uploaded with the object. When you use an API operation on an object that was uploaded using multipart uploads, this value may not be a direct checksum value of the full object. Instead, it's a calculation based on the checksum values of each individual part. For more information about how checksums are calculated with multipart uploads, see Checking object integrity in the Amazon S3 User Guide.",
              "nested_items": []
            },
            {
              "name": "ChecksumType",
              "type": "string",
              "description": "The checksum type that is used to calculate the object's checksum value. For more information, see Checking object integrity in the Amazon S3 User Guide.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "ObjectParts",
          "type": "dict",
          "description": "A collection of parts associated with a multipart upload.",
          "nested_items": [
            {
              "name": "TotalPartsCount",
              "type": "integer",
              "description": "The total number of parts.",
              "nested_items": []
            },
            {
              "name": "PartNumberMarker",
              "type": "integer",
              "description": "The marker for the current part.",
              "nested_items": []
            },
            {
              "name": "NextPartNumberMarker",
              "type": "integer",
              "description": "When a list is truncated, this element specifies the last part in the list, as well as the value to use for the PartNumberMarker request parameter in a subsequent request.",
              "nested_items": []
            },
            {
              "name": "MaxParts",
              "type": "integer",
              "description": "The maximum number of parts allowed in the response.",
              "nested_items": []
            },
            {
              "name": "IsTruncated",
              "type": "boolean",
              "description": "Indicates whether the returned list of parts is truncated. A value of true indicates that the list was truncated. A list can be truncated if the number of parts exceeds the limit returned in the MaxParts element.",
              "nested_items": []
            },
            {
              "name": "Parts",
              "type": "list",
              "description": "A container for elements related to a particular part. A response can contain zero or more Parts elements.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "PartNumber",
                      "type": "integer",
                      "description": "The part number identifying the part. This value is a positive integer between 1 and 10,000.",
                      "nested_items": []
                    },
                    {
                      "name": "Size",
                      "type": "integer",
                      "description": "The size of the uploaded part in bytes.",
                      "nested_items": []
                    },
                    {
                      "name": "ChecksumCRC32",
                      "type": "string",
                      "description": "The Base64 encoded, 32-bit CRC32 checksum of the part. This checksum is present if the multipart upload request was created with the CRC32 checksum algorithm. For more information, see Checking object integrity in the Amazon S3 User Guide.",
                      "nested_items": []
                    },
                    {
                      "name": "ChecksumCRC32C",
                      "type": "string",
                      "description": "The Base64 encoded, 32-bit CRC32C checksum of the part. This checksum is present if the multipart upload request was created with the CRC32C checksum algorithm. For more information, see Checking object integrity in the Amazon S3 User Guide.",
                      "nested_items": []
                    },
                    {
                      "name": "ChecksumCRC64NVME",
                      "type": "string",
                      "description": "The Base64 encoded, 64-bit CRC64NVME checksum of the part. This checksum is present if the multipart upload request was created with the CRC64NVME checksum algorithm, or if the object was uploaded without a checksum (and Amazon S3 added the default checksum, CRC64NVME, to the uploaded object). For more information, see Checking object integrity in the Amazon S3 User Guide.",
                      "nested_items": []
                    },
                    {
                      "name": "ChecksumSHA1",
                      "type": "string",
                      "description": "The Base64 encoded, 160-bit SHA1 checksum of the part. This checksum is present if the multipart upload request was created with the SHA1 checksum algorithm. For more information, see Checking object integrity in the Amazon S3 User Guide.",
                      "nested_items": []
                    },
                    {
                      "name": "ChecksumSHA256",
                      "type": "string",
                      "description": "The Base64 encoded, 256-bit SHA256 checksum of the part. This checksum is present if the multipart upload request was created with the SHA256 checksum algorithm. For more information, see Checking object integrity in the Amazon S3 User Guide.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "StorageClass",
          "type": "string",
          "description": "Provides the storage class information of the object. Amazon S3 returns this header for all objects except for S3 Standard storage class objects.",
          "nested_items": []
        },
        {
          "name": "ObjectSize",
          "type": "integer",
          "description": "The size of the object in bytes.",
          "nested_items": []
        }
      ]
    }
  ]
}