{
  "method_name": "list_bucket_analytics_configurations",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3/client/list_bucket_analytics_configurations.html",
  "description": "Lists the analytics configurations for the bucket. You can have up to 1,000 analytics configurations per bucket. This action supports list pagination and does not return more than 100 configurations at a time. You should always check the IsTruncated element in the response. If there are no more configurations to list, IsTruncated is set to false. If there are more configurations to list, IsTruncated is set to true, and there will be a value in NextContinuationToken. You use the NextContinuationToken value to continue the pagination of the list by passing the value in continuation-token in the request to GET the next page. To use this operation, you must have permissions to perform the s3:GetAnalyticsConfiguration action. The bucket owner has this permission by default. The bucket owner can grant this permission to others. For more information about permissions, see Permissions Related to Bucket Subresource Operations and Managing Access Permissions to Your Amazon S3 Resources. For information about Amazon S3 analytics feature, see Amazon S3 Analytics --- Storage Class Analysis. The following operations are related to ListBucketAnalyticsConfigurations:",
  "parameters": [
    {
      "name": "Bucket",
      "type": "string",
      "required": true,
      "description": "The name of the bucket from which analytics configurations are retrieved.",
      "nested_params": []
    },
    {
      "name": "ContinuationToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ExpectedBucketOwner",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "IsTruncated",
          "type": "boolean",
          "description": "Indicates whether the returned list of analytics configurations is complete. A value of true indicates that the list is not complete and the NextContinuationToken will be provided for a subsequent request.",
          "nested_items": []
        },
        {
          "name": "ContinuationToken",
          "type": "string",
          "description": "The marker that is used as a starting point for this analytics configuration list response. This value is present if it was sent in the request.",
          "nested_items": []
        },
        {
          "name": "NextContinuationToken",
          "type": "string",
          "description": "NextContinuationToken is sent when isTruncated is true, which indicates that there are more analytics configurations to list. The next request must include this NextContinuationToken. The token is obfuscated and is not a usable value.",
          "nested_items": []
        },
        {
          "name": "AnalyticsConfigurationList",
          "type": "list",
          "description": "The list of analytics configurations for a bucket.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Id",
                  "type": "string",
                  "description": "The ID that identifies the analytics configuration.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Prefix",
                      "type": "string",
                      "description": "The prefix to use when evaluating an analytics filter.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Key",
                          "type": "string",
                          "description": "Name of the object key.",
                          "nested_items": []
                        },
                        {
                          "name": "Value",
                          "type": "string",
                          "description": "Value of the tag.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Prefix",
                          "type": "string",
                          "description": "The prefix to use when evaluating an AND predicate: The prefix that an object must have to be included in the metrics results.",
                          "nested_items": []
                        },
                        {
                          "name": "Tags",
                          "type": "list",
                          "description": "The list of tags to use when evaluating an AND predicate.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "dict",
                              "description": "",
                              "nested_items": [
                                {
                                  "name": "Key",
                                  "type": "string",
                                  "description": "Name of the object key.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Value",
                                  "type": "string",
                                  "description": "Value of the tag.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "StorageClassAnalysis",
                  "type": "dict",
                  "description": "Contains data related to access patterns to be collected and made available to analyze the tradeoffs between different storage classes.",
                  "nested_items": [
                    {
                      "name": "DataExport",
                      "type": "dict",
                      "description": "Specifies how data related to the storage class analysis for an Amazon S3 bucket should be exported.",
                      "nested_items": [
                        {
                          "name": "OutputSchemaVersion",
                          "type": "string",
                          "description": "The version of the output schema to use when exporting data. Must be V_1.",
                          "nested_items": []
                        },
                        {
                          "name": "Destination",
                          "type": "dict",
                          "description": "The place to store the data for an analysis.",
                          "nested_items": [
                            {
                              "name": "S3BucketDestination",
                              "type": "dict",
                              "description": "A destination signifying output to an S3 bucket.",
                              "nested_items": [
                                {
                                  "name": "Format",
                                  "type": "string",
                                  "description": "Specifies the file format used when exporting data to Amazon S3.",
                                  "nested_items": []
                                },
                                {
                                  "name": "BucketAccountId",
                                  "type": "string",
                                  "description": "The account ID that owns the destination S3 bucket. If no account ID is provided, the owner is not validated before exporting data.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Bucket",
                                  "type": "string",
                                  "description": "The Amazon Resource Name (ARN) of the bucket to which data is exported.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Prefix",
                                  "type": "string",
                                  "description": "The prefix to use when exporting data. The prefix is prepended to all results.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}