{
  "method_name": "list_directory_buckets",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3/client/list_directory_buckets.html",
  "description": "Returns a list of all Amazon S3 directory buckets owned by the authenticated sender of the request. For more information about directory buckets, see Directory buckets in the Amazon S3 User Guide. You must have the s3express:ListAllMyDirectoryBuckets permission in an IAM identity-based policy instead of a bucket policy. Cross-account access to this API operation isn't supported. This operation can only be performed by the Amazon Web Services account that owns the resource. For more information about directory bucket policies and permissions, see Amazon Web Services Identity and Access Management (IAM) for S3 Express One Zone in the Amazon S3 User Guide. Directory buckets - The HTTP Host header syntax is s3express-control.region.amazonaws.com.",
  "parameters": [
    {
      "name": "ContinuationToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxDirectoryBuckets",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Buckets",
          "type": "list",
          "description": "The list of buckets owned by the requester.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The name of the bucket.",
                  "nested_items": []
                },
                {
                  "name": "CreationDate",
                  "type": "datetime",
                  "description": "Date the bucket was created. This date can change when making changes to your bucket, such as editing its bucket policy.",
                  "nested_items": []
                },
                {
                  "name": "BucketRegion",
                  "type": "string",
                  "description": "BucketRegion indicates the Amazon Web Services region where the bucket is located. If the request contains at least one valid parameter, it is included in the response.",
                  "nested_items": []
                },
                {
                  "name": "BucketArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the S3 bucket. ARNs uniquely identify Amazon Web Services resources across all of Amazon Web Services.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "ContinuationToken",
          "type": "string",
          "description": "If ContinuationToken was sent with the request, it is included in the response. You can use the returned ContinuationToken for pagination of the list response.",
          "nested_items": []
        }
      ]
    }
  ]
}