{
  "method_name": "put_bucket_lifecycle",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3/client/put_bucket_lifecycle.html",
  "description": "Creates a new lifecycle configuration for the bucket or replaces an existing lifecycle configuration. For information about lifecycle configuration, see Object Lifecycle Management in the Amazon S3 User Guide. By default, all Amazon S3 resources, including buckets, objects, and related subresources (for example, lifecycle configuration and website configuration) are private. Only the resource owner, the Amazon Web Services account that created the resource, can access it. The resource owner can optionally grant access permissions to others by writing an access policy. For this operation, users must get the s3:PutLifecycleConfiguration permission. You can also explicitly deny permissions. Explicit denial also supersedes any other permissions. If you want to prevent users or accounts from removing or deleting objects from your bucket, you must deny them permissions for the following actions: For more information about permissions, see Managing Access Permissions to your Amazon S3 Resources in the Amazon S3 User Guide. For more examples of transitioning objects to storage classes such as STANDARD_IA or ONEZONE_IA, see Examples of Lifecycle Configuration. The following operations are related to PutBucketLifecycle:",
  "parameters": [
    {
      "name": "Bucket",
      "type": "string",
      "required": true,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ChecksumAlgorithm",
      "type": "string",
      "required": false,
      "description": "Indicates the algorithm used to create the checksum for the request when you use the SDK. This header will not provide any additional functionality if you don't use the SDK. When you send this header, there must be a corresponding x-amz-checksum or x-amz-trailer header sent. Otherwise, Amazon S3 fails the request with the HTTP status code 400 Bad Request. For more information, see Checking object integrity in the Amazon S3 User Guide. If you provide an individual checksum, Amazon S3 ignores any provided ChecksumAlgorithm parameter.",
      "nested_params": []
    },
    {
      "name": "LifecycleConfiguration",
      "type": "dict",
      "required": true,
      "description": "Specifies lifecycle configuration rules for an Amazon S3 bucket. (dict) --- Specifies lifecycle rules for an Amazon S3 bucket. For more information, see Put Bucket Lifecycle Configuration in the Amazon S3 API Reference. For examples, see Put Bucket Lifecycle Configuration Examples. Expiration (dict) --- Specifies the expiration for the lifecycle of the object. Date (datetime) --- Indicates at what date the object is to be moved or deleted. The date value must conform to the ISO 8601 format. The time is always midnight UTC. Days (integer) --- Indicates the lifetime, in days, of the objects that are subject to the rule. The value must be a non-zero positive integer. ExpiredObjectDeleteMarker (boolean) --- Indicates whether Amazon S3 will remove a delete marker with no noncurrent versions. If set to true, the delete marker will be expired; if set to false the policy takes no action. This cannot be specified with Days or Date in a Lifecycle Expiration Policy. ID (string) --- Unique identifier for the rule. The value can't be longer than 255 characters. Object key prefix that identifies one or more objects to which this rule applies. If Enabled, the rule is currently being applied. If Disabled, the rule is not currently being applied. Transition (dict) --- Specifies when an object transitions to a specified storage class. For more information about Amazon S3 lifecycle configuration rules, see Transitioning Objects Using Amazon S3 Lifecycle in the Amazon S3 User Guide. Date (datetime) --- Indicates when objects are transitioned to the specified storage class. The date value must be in ISO 8601 format. Days (integer) --- Indicates the number of days after creation when objects are transitioned to the specified storage class. If the specified storage class is INTELLIGENT_TIERING, GLACIER_IR, GLACIER, or DEEP_ARCHIVE, valid values are 0 or positive integers. If the specified storage class is STANDARD_IA or ONEZONE_IA, valid values are positive integers greater than 30. Be aware that some storage classes have a minimum storage duration and that you're charged for transitioning objects before their minimum storage duration. For more information, see Constraints and considerations for transitions in the Amazon S3 User Guide. StorageClass (string) --- The storage class to which you want the object to transition. NoncurrentVersionTransition (dict) --- Container for the transition rule that describes when noncurrent objects transition to the STANDARD_IA, ONEZONE_IA, INTELLIGENT_TIERING, GLACIER_IR, GLACIER, or DEEP_ARCHIVE storage class. If your bucket is versioning-enabled (or versioning is suspended), you can set this action to request that Amazon S3 transition noncurrent object versions to the STANDARD_IA, ONEZONE_IA, INTELLIGENT_TIERING, GLACIER_IR, GLACIER, or DEEP_ARCHIVE storage class at a specific period in the object's lifetime. NoncurrentDays (integer) --- Specifies the number of days an object is noncurrent before Amazon S3 can perform the associated action. For information about the noncurrent days calculations, see How Amazon S3 Calculates How Long an Object Has Been Noncurrent in the Amazon S3 User Guide. StorageClass (string) --- The class of storage used to store the object. NewerNoncurrentVersions (integer) --- Specifies how many noncurrent versions Amazon S3 will retain in the same storage class before transitioning objects. You can specify up to 100 noncurrent versions to retain. Amazon S3 will transition any additional noncurrent versions beyond the specified number to retain. For more information about noncurrent versions, see Lifecycle configuration elements in the Amazon S3 User Guide. NoncurrentVersionExpiration (dict) --- Specifies when noncurrent object versions expire. Upon expiration, Amazon S3 permanently deletes the noncurrent object versions. You set this lifecycle configuration action on a bucket that has versioning enabled (or suspended) to request that Amazon S3 delete noncurrent object versions at a specific period in the object's lifetime. For information about the noncurrent days calculations, see How Amazon S3 Calculates When an Object Became Noncurrent in the Amazon S3 User Guide. NewerNoncurrentVersions (integer) --- Specifies how many noncurrent versions Amazon S3 will retain. Amazon S3 will permanently delete any additional noncurrent versions beyond the specified number to retain. AbortIncompleteMultipartUpload (dict) --- Specifies the days since the initiation of an incomplete multipart upload that Amazon S3 will wait before permanently removing all parts of the upload. For more information, see Aborting Incomplete Multipart Uploads Using a Bucket Lifecycle Configuration in the Amazon S3 User Guide. DaysAfterInitiation (integer) --- Specifies the number of days after which Amazon S3 aborts an incomplete multipart upload.",
      "nested_params": [
        {
          "name": "Rules",
          "type": "list",
          "required": false,
          "description": "Specifies lifecycle configuration rules for an Amazon S3 bucket.",
          "nested_params": [
            {
              "name": "Expiration",
              "type": "dict",
              "required": false,
              "description": "Specifies the expiration for the lifecycle of the object.",
              "nested_params": [
                {
                  "name": "Date",
                  "type": "datetime",
                  "required": false,
                  "description": "Indicates at what date the object is to be moved or deleted. The date value must conform to the ISO 8601 format. The time is always midnight UTC.",
                  "nested_params": []
                },
                {
                  "name": "Days",
                  "type": "integer",
                  "required": false,
                  "description": "Indicates the lifetime, in days, of the objects that are subject to the rule. The value must be a non-zero positive integer.",
                  "nested_params": []
                },
                {
                  "name": "ExpiredObjectDeleteMarker",
                  "type": "boolean",
                  "required": false,
                  "description": "Indicates whether Amazon S3 will remove a delete marker with no noncurrent versions. If set to true, the delete marker will be expired; if set to false the policy takes no action. This cannot be specified with Days or Date in a Lifecycle Expiration Policy.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ID",
              "type": "string",
              "required": false,
              "description": "Unique identifier for the rule. The value can't be longer than 255 characters.",
              "nested_params": []
            },
            {
              "name": "Prefix",
              "type": "string",
              "required": false,
              "description": "Object key prefix that identifies one or more objects to which this rule applies.",
              "nested_params": []
            },
            {
              "name": "Status",
              "type": "string",
              "required": false,
              "description": "If Enabled, the rule is currently being applied. If Disabled, the rule is not currently being applied.",
              "nested_params": []
            },
            {
              "name": "Transition",
              "type": "dict",
              "required": false,
              "description": "Specifies when an object transitions to a specified storage class. For more information about Amazon S3 lifecycle configuration rules, see Transitioning Objects Using Amazon S3 Lifecycle in the Amazon S3 User Guide.",
              "nested_params": [
                {
                  "name": "Date",
                  "type": "datetime",
                  "required": false,
                  "description": "Indicates when objects are transitioned to the specified storage class. The date value must be in ISO 8601 format. The time is always midnight UTC.",
                  "nested_params": []
                },
                {
                  "name": "Days",
                  "type": "integer",
                  "required": false,
                  "description": "Indicates the number of days after creation when objects are transitioned to the specified storage class. If the specified storage class is INTELLIGENT_TIERING, GLACIER_IR, GLACIER, or DEEP_ARCHIVE, valid values are 0 or positive integers. If the specified storage class is STANDARD_IA or ONEZONE_IA, valid values are positive integers greater than 30. Be aware that some storage classes have a minimum storage duration and that you're charged for transitioning objects before their minimum storage duration. For more information, see Constraints and considerations for transitions in the Amazon S3 User Guide.",
                  "nested_params": []
                },
                {
                  "name": "StorageClass",
                  "type": "string",
                  "required": false,
                  "description": "The storage class to which you want the object to transition.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "NoncurrentVersionTransition",
              "type": "dict",
              "required": false,
              "description": "Container for the transition rule that describes when noncurrent objects transition to the STANDARD_IA, ONEZONE_IA, INTELLIGENT_TIERING, GLACIER_IR, GLACIER, or DEEP_ARCHIVE storage class. If your bucket is versioning-enabled (or versioning is suspended), you can set this action to request that Amazon S3 transition noncurrent object versions to the STANDARD_IA, ONEZONE_IA, INTELLIGENT_TIERING, GLACIER_IR, GLACIER, or DEEP_ARCHIVE storage class at a specific period in the object's lifetime.",
              "nested_params": [
                {
                  "name": "NoncurrentDays",
                  "type": "integer",
                  "required": false,
                  "description": "Specifies the number of days an object is noncurrent before Amazon S3 can perform the associated action. For information about the noncurrent days calculations, see How Amazon S3 Calculates How Long an Object Has Been Noncurrent in the Amazon S3 User Guide.",
                  "nested_params": []
                },
                {
                  "name": "StorageClass",
                  "type": "string",
                  "required": false,
                  "description": "The class of storage used to store the object.",
                  "nested_params": []
                },
                {
                  "name": "NewerNoncurrentVersions",
                  "type": "integer",
                  "required": false,
                  "description": "Specifies how many noncurrent versions Amazon S3 will retain in the same storage class before transitioning objects. You can specify up to 100 noncurrent versions to retain. Amazon S3 will transition any additional noncurrent versions beyond the specified number to retain. For more information about noncurrent versions, see Lifecycle configuration elements in the Amazon S3 User Guide.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "NoncurrentVersionExpiration",
              "type": "dict",
              "required": false,
              "description": "Specifies when noncurrent object versions expire. Upon expiration, Amazon S3 permanently deletes the noncurrent object versions. You set this lifecycle configuration action on a bucket that has versioning enabled (or suspended) to request that Amazon S3 delete noncurrent object versions at a specific period in the object's lifetime.",
              "nested_params": [
                {
                  "name": "NoncurrentDays",
                  "type": "integer",
                  "required": false,
                  "description": "Specifies the number of days an object is noncurrent before Amazon S3 can perform the associated action. The value must be a non-zero positive integer. For information about the noncurrent days calculations, see How Amazon S3 Calculates When an Object Became Noncurrent in the Amazon S3 User Guide.",
                  "nested_params": []
                },
                {
                  "name": "NewerNoncurrentVersions",
                  "type": "integer",
                  "required": false,
                  "description": "Specifies how many noncurrent versions Amazon S3 will retain. You can specify up to 100 noncurrent versions to retain. Amazon S3 will permanently delete any additional noncurrent versions beyond the specified number to retain. For more information about noncurrent versions, see Lifecycle configuration elements in the Amazon S3 User Guide.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "AbortIncompleteMultipartUpload",
              "type": "dict",
              "required": false,
              "description": "Specifies the days since the initiation of an incomplete multipart upload that Amazon S3 will wait before permanently removing all parts of the upload. For more information, see Aborting Incomplete Multipart Uploads Using a Bucket Lifecycle Configuration in the Amazon S3 User Guide.",
              "nested_params": [
                {
                  "name": "DaysAfterInitiation",
                  "type": "integer",
                  "required": false,
                  "description": "Specifies the number of days after which Amazon S3 aborts an incomplete multipart upload.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "ExpectedBucketOwner",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}