{
  "method_name": "put_bucket_cors",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3/client/put_bucket_cors.html",
  "description": "Sets the cors configuration for your bucket. If the configuration exists, Amazon S3 replaces it. To use this operation, you must be allowed to perform the s3:PutBucketCORS action. By default, the bucket owner has this permission and can grant it to others. You set this configuration on a bucket so that the bucket can service cross-origin requests. For example, you might want to enable a request whose origin is http://www.example.com to access your Amazon S3 bucket at my.example.bucket.com by using the browser's XMLHttpRequest capability. To enable cross-origin resource sharing (CORS) on a bucket, you add the cors subresource to the bucket. The cors subresource is an XML document in which you configure rules that identify origins and the HTTP methods that can be executed on your bucket. The document is limited to 64 KB in size. When Amazon S3 receives a cross-origin request (or a pre-flight OPTIONS request) against a bucket, it evaluates the cors configuration on the bucket and uses the first CORSRule rule that matches the incoming browser request to enable a cross-origin request. For a rule to match, the following conditions must be met: For more information about CORS, go to Enabling Cross-Origin Resource Sharing in the Amazon S3 User Guide. The following operations are related to PutBucketCors:",
  "parameters": [
    {
      "name": "Bucket",
      "type": "string",
      "required": true,
      "description": "Specifies the bucket impacted by the ``cors``configuration.",
      "nested_params": []
    },
    {
      "name": "CORSConfiguration",
      "type": "dict",
      "required": true,
      "description": "Describes the cross-origin access configuration for objects in an Amazon S3 bucket. For more information, see Enabling Cross-Origin Resource Sharing in the Amazon S3 User Guide. A set of origins and methods (cross-origin access that you want to allow). You can add up to 100 rules to the configuration. (dict) --- Specifies a cross-origin access rule for an Amazon S3 bucket. ID (string) --- Unique identifier for the rule. The value cannot be longer than 255 characters. AllowedHeaders (list) --- Headers that are specified in the Access-Control-Request-Headers header. These headers are allowed in a preflight OPTIONS request. In response to any preflight OPTIONS request, Amazon S3 returns any requested headers that are allowed. (string) --- An HTTP method that you allow the origin to execute. Valid values are GET, PUT, HEAD, POST, and DELETE. (string) --- One or more origins you want customers to be able to access the bucket from. (string) --- ExposeHeaders (list) --- One or more headers in the response that you want customers to be able to access from their applications (for example, from a JavaScript XMLHttpRequest object). (string) --- MaxAgeSeconds (integer) --- The time in seconds that your browser is to cache the preflight response for the specified resource.",
      "nested_params": [
        {
          "name": "CORSRules",
          "type": "list",
          "required": false,
          "description": "A set of origins and methods (cross-origin access that you want to allow). You can add up to 100 rules to the configuration.",
          "nested_params": [
            {
              "name": "ID",
              "type": "string",
              "required": false,
              "description": "Unique identifier for the rule. The value cannot be longer than 255 characters.",
              "nested_params": []
            },
            {
              "name": "AllowedHeaders",
              "type": "list",
              "required": false,
              "description": "Headers that are specified in the Access-Control-Request-Headers header. These headers are allowed in a preflight OPTIONS request. In response to any preflight OPTIONS request, Amazon S3 returns any requested headers that are allowed.",
              "nested_params": []
            },
            {
              "name": "AllowedMethods",
              "type": "list",
              "required": false,
              "description": "An HTTP method that you allow the origin to execute. Valid values are GET, PUT, HEAD, POST, and DELETE.",
              "nested_params": []
            },
            {
              "name": "AllowedOrigins",
              "type": "list",
              "required": false,
              "description": "One or more origins you want customers to be able to access the bucket from.",
              "nested_params": []
            },
            {
              "name": "ExposeHeaders",
              "type": "list",
              "required": false,
              "description": "One or more headers in the response that you want customers to be able to access from their applications (for example, from a JavaScript XMLHttpRequest object).",
              "nested_params": []
            },
            {
              "name": "MaxAgeSeconds",
              "type": "integer",
              "required": false,
              "description": "The time in seconds that your browser is to cache the preflight response for the specified resource.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "ChecksumAlgorithm",
      "type": "string",
      "required": false,
      "description": "Indicates the algorithm used to create the checksum for the request when you use the SDK. This header will not provide any additional functionality if you don't use the SDK. When you send this header, there must be a corresponding x-amz-checksum or x-amz-trailer header sent. Otherwise, Amazon S3 fails the request with the HTTP status code 400 Bad Request. For more information, see Checking object integrity in the Amazon S3 User Guide. If you provide an individual checksum, Amazon S3 ignores any provided ChecksumAlgorithm parameter.",
      "nested_params": []
    },
    {
      "name": "ExpectedBucketOwner",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}