{
  "method_name": "put_bucket_versioning",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3/client/put_bucket_versioning.html",
  "description": "Sets the versioning state of an existing bucket. You can set the versioning state with one of the following values: Enabled--\u0094Enables versioning for the objects in the bucket. All objects added to the bucket receive a unique version ID. Suspended--\u0094Disables versioning for the objects in the bucket. All objects added to the bucket receive the version ID null. If the versioning state has never been set on a bucket, it has no versioning state; a GetBucketVersioning request does not return a versioning state value. In order to enable MFA Delete, you must be the bucket owner. If you are the bucket owner and want to enable MFA Delete in the bucket versioning configuration, you must include the x-amz-mfa request header and the Status and the MfaDelete request elements in a request to set the versioning state of the bucket. The following operations are related to PutBucketVersioning:",
  "parameters": [
    {
      "name": "Bucket",
      "type": "string",
      "required": true,
      "description": "The bucket name.",
      "nested_params": []
    },
    {
      "name": "ChecksumAlgorithm",
      "type": "string",
      "required": false,
      "description": "Indicates the algorithm used to create the checksum for the request when you use the SDK. This header will not provide any additional functionality if you don't use the SDK. When you send this header, there must be a corresponding x-amz-checksum or x-amz-trailer header sent. Otherwise, Amazon S3 fails the request with the HTTP status code 400 Bad Request. For more information, see Checking object integrity in the Amazon S3 User Guide. If you provide an individual checksum, Amazon S3 ignores any provided ChecksumAlgorithm parameter.",
      "nested_params": []
    },
    {
      "name": "MFA",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "VersioningConfiguration",
      "type": "dict",
      "required": true,
      "description": "Container for setting the versioning state. MFADelete (string) --- Specifies whether MFA delete is enabled in the bucket versioning configuration. This element is only returned if the bucket has been configured with MFA delete. If the bucket has never been so configured, this element is not returned. Status (string) --- The versioning state of the bucket.",
      "nested_params": [
        {
          "name": "MFADelete",
          "type": "string",
          "required": false,
          "description": "Specifies whether MFA delete is enabled in the bucket versioning configuration. This element is only returned if the bucket has been configured with MFA delete. If the bucket has never been so configured, this element is not returned.",
          "nested_params": []
        },
        {
          "name": "Status",
          "type": "string",
          "required": false,
          "description": "The versioning state of the bucket.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ExpectedBucketOwner",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}