{
  "method_name": "put_bucket_encryption",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3/client/put_bucket_encryption.html",
  "description": "This operation configures default encryption and Amazon S3 Bucket Keys for an existing bucket. By default, all buckets have a default encryption configuration that uses server-side encryption with Amazon S3 managed keys (SSE-S3). Directory buckets - The HTTP Host header syntax is s3express-control.region-code.amazonaws.com. The following operations are related to PutBucketEncryption:",
  "parameters": [
    {
      "name": "Bucket",
      "type": "string",
      "required": true,
      "description": "Specifies default encryption for a bucket using server-side encryption with different key options. Directory buckets - When you use this operation with a directory bucket, you must use path-style requests in the format https://s3express-control.region-code.amazonaws.com/bucket-name ``. Virtual-hosted-style requests aren't supported. Directory bucket names must be unique in the chosen Zone (Availability Zone or Local Zone). Bucket names must also follow the format ``bucket-base-name--zone-id--x-s3 (for example, DOC-EXAMPLE-BUCKET--usw2-az1--x-s3). For information about bucket naming restrictions, see Directory bucket naming rules in the Amazon S3 User Guide.",
      "nested_params": []
    },
    {
      "name": "ContentMD5",
      "type": "string",
      "required": false,
      "description": "The Base64 encoded 128-bit MD5 digest of the server-side encryption configuration. For requests made using the Amazon Web Services Command Line Interface (CLI) or Amazon Web Services SDKs, this field is calculated automatically.",
      "nested_params": []
    },
    {
      "name": "ChecksumAlgorithm",
      "type": "string",
      "required": false,
      "description": "Indicates the algorithm used to create the checksum for the request when you use the SDK. This header will not provide any additional functionality if you don't use the SDK. When you send this header, there must be a corresponding x-amz-checksum or x-amz-trailer header sent. Otherwise, Amazon S3 fails the request with the HTTP status code 400 Bad Request. For more information, see Checking object integrity in the Amazon S3 User Guide. If you provide an individual checksum, Amazon S3 ignores any provided ChecksumAlgorithm parameter.",
      "nested_params": []
    },
    {
      "name": "ServerSideEncryptionConfiguration",
      "type": "dict",
      "required": true,
      "description": "Specifies the default server-side-encryption configuration. Container for information about a particular server-side encryption configuration rule. (dict) --- Specifies the default server-side encryption configuration. ApplyServerSideEncryptionByDefault (dict) --- Specifies the default server-side encryption to apply to new objects in the bucket. If a PUT Object request doesn't specify any server-side encryption, this default encryption will be applied. Server-side encryption algorithm to use for the default encryption. KMSMasterKeyID (string) --- Amazon Web Services Key Management Service (KMS) customer managed key ID to use for the default encryption. You can specify the key ID, key alias, or the Amazon Resource Name (ARN) of the KMS key. Key ID: 1234abcd-12ab-34cd-56ef-1234567890ab Key ARN: arn:aws:kms:us-east-2:111122223333:key/1234abcd-12ab-34cd-56ef-1234567890ab Key Alias: alias/alias-name If you are using encryption with cross-account or Amazon Web Services service operations, you must use a fully qualified KMS key ARN. For more information, see Using encryption for cross-account operations. BucketKeyEnabled (boolean) --- Specifies whether Amazon S3 should use an S3 Bucket Key with server-side encryption using KMS (SSE-KMS) for new objects in the bucket. Existing objects are not affected. Setting the BucketKeyEnabled element to true causes Amazon S3 to use an S3 Bucket Key.",
      "nested_params": [
        {
          "name": "Rules",
          "type": "list",
          "required": false,
          "description": "Container for information about a particular server-side encryption configuration rule.",
          "nested_params": [
            {
              "name": "ApplyServerSideEncryptionByDefault",
              "type": "dict",
              "required": false,
              "description": "Specifies the default server-side encryption to apply to new objects in the bucket. If a PUT Object request doesn't specify any server-side encryption, this default encryption will be applied.",
              "nested_params": [
                {
                  "name": "SSEAlgorithm",
                  "type": "string",
                  "required": false,
                  "description": "Server-side encryption algorithm to use for the default encryption.",
                  "nested_params": []
                },
                {
                  "name": "KMSMasterKeyID",
                  "type": "string",
                  "required": false,
                  "description": "Amazon Web Services Key Management Service (KMS) customer managed key ID to use for the default encryption. You can specify the key ID, key alias, or the Amazon Resource Name (ARN) of the KMS key.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "BucketKeyEnabled",
              "type": "boolean",
              "required": false,
              "description": "Specifies whether Amazon S3 should use an S3 Bucket Key with server-side encryption using KMS (SSE-KMS) for new objects in the bucket. Existing objects are not affected. Setting the BucketKeyEnabled element to true causes Amazon S3 to use an S3 Bucket Key.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "ExpectedBucketOwner",
      "type": "string",
      "required": false,
      "description": "The account ID of the expected bucket owner. If the account ID that you provide does not match the actual owner of the bucket, the request fails with the HTTP status code 403 Forbidden (access denied).",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}