{
  "method_name": "put_object_lock_configuration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3/client/put_object_lock_configuration.html",
  "description": "Places an Object Lock configuration on the specified bucket. The rule specified in the Object Lock configuration will be applied by default to every new object placed in the specified bucket. For more information, see Locking Objects.",
  "parameters": [
    {
      "name": "Bucket",
      "type": "string",
      "required": true,
      "description": "The bucket whose Object Lock configuration you want to create or replace.",
      "nested_params": []
    },
    {
      "name": "ObjectLockConfiguration",
      "type": "dict",
      "required": false,
      "description": "The Object Lock configuration that you want to apply to the specified bucket. ObjectLockEnabled (string) --- Indicates whether this bucket has an Object Lock configuration enabled. Enable ObjectLockEnabled when you apply ObjectLockConfiguration to a bucket. Rule (dict) --- Specifies the Object Lock rule for the specified object. Enable the this rule when you apply ObjectLockConfiguration to a bucket. Bucket settings require both a mode and a period. The period can be either Days or Years but you must select one. You cannot specify Days and Years at the same time. DefaultRetention (dict) --- The default Object Lock retention mode and period that you want to apply to new objects placed in the specified bucket. Mode (string) --- The default Object Lock retention mode you want to apply to new objects placed in the specified bucket. Must be used with either Days or Years. Days (integer) --- The number of days that you want to specify for the default retention period. Must be used with Mode. Years (integer) --- The number of years that you want to specify for the default retention period. Must be used with Mode.",
      "nested_params": [
        {
          "name": "ObjectLockEnabled",
          "type": "string",
          "required": false,
          "description": "Indicates whether this bucket has an Object Lock configuration enabled. Enable ObjectLockEnabled when you apply ObjectLockConfiguration to a bucket.",
          "nested_params": []
        },
        {
          "name": "Rule",
          "type": "dict",
          "required": false,
          "description": "Specifies the Object Lock rule for the specified object. Enable the this rule when you apply ObjectLockConfiguration to a bucket. Bucket settings require both a mode and a period. The period can be either Days or Years but you must select one. You cannot specify Days and Years at the same time.",
          "nested_params": [
            {
              "name": "DefaultRetention",
              "type": "dict",
              "required": false,
              "description": "The default Object Lock retention mode and period that you want to apply to new objects placed in the specified bucket. Bucket settings require both a mode and a period. The period can be either Days or Years but you must select one. You cannot specify Days and Years at the same time.",
              "nested_params": [
                {
                  "name": "Mode",
                  "type": "string",
                  "required": false,
                  "description": "The default Object Lock retention mode you want to apply to new objects placed in the specified bucket. Must be used with either Days or Years.",
                  "nested_params": []
                },
                {
                  "name": "Days",
                  "type": "integer",
                  "required": false,
                  "description": "The number of days that you want to specify for the default retention period. Must be used with Mode.",
                  "nested_params": []
                },
                {
                  "name": "Years",
                  "type": "integer",
                  "required": false,
                  "description": "The number of years that you want to specify for the default retention period. Must be used with Mode.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "RequestPayer",
      "type": "string",
      "required": false,
      "description": "Confirms that the requester knows that they will be charged for the request. Bucket owners need not specify this parameter in their requests. If either the source or destination S3 bucket has Requester Pays enabled, the requester will pay for corresponding charges to copy the object. For information about downloading objects from Requester Pays buckets, see Downloading Objects in Requester Pays Buckets in the Amazon S3 User Guide.",
      "nested_params": []
    },
    {
      "name": "Token",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ContentMD5",
      "type": "string",
      "required": false,
      "description": "The MD5 hash for the request body. For requests made using the Amazon Web Services Command Line Interface (CLI) or Amazon Web Services SDKs, this field is calculated automatically.",
      "nested_params": []
    },
    {
      "name": "ChecksumAlgorithm",
      "type": "string",
      "required": false,
      "description": "Indicates the algorithm used to create the checksum for the object when you use the SDK. This header will not provide any additional functionality if you don't use the SDK. When you send this header, there must be a corresponding x-amz-checksum or x-amz-trailer header sent. Otherwise, Amazon S3 fails the request with the HTTP status code 400 Bad Request. For more information, see Checking object integrity in the Amazon S3 User Guide. If you provide an individual checksum, Amazon S3 ignores any provided ChecksumAlgorithm parameter.",
      "nested_params": []
    },
    {
      "name": "ExpectedBucketOwner",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "RequestCharged",
          "type": "string",
          "description": "If present, indicates that the requester was successfully charged for the request. For more information, see Using Requester Pays buckets for storage transfers and usage in the Amazon Simple Storage Service user guide.",
          "nested_items": []
        }
      ]
    }
  ]
}