{
  "method_name": "delete_recommendation_preferences",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/compute-optimizer/client/delete_recommendation_preferences.html",
  "description": "Deletes a recommendation preference, such as enhanced infrastructure metrics. For more information, see Activating enhanced infrastructure metrics in the Compute Optimizer User Guide.",
  "parameters": [
    {
      "name": "resourceType",
      "type": "string",
      "required": true,
      "description": "The target resource type of the recommendation preference to delete. The Ec2Instance option encompasses standalone instances and instances that are part of Auto Scaling groups. The AutoScalingGroup option encompasses only instances that are part of an Auto Scaling group.",
      "nested_params": []
    },
    {
      "name": "scope",
      "type": "dict",
      "required": false,
      "description": "An object that describes the scope of the recommendation preference to delete. You can delete recommendation preferences that are created at the organization level (for management accounts of an organization only), account level, and resource level. For more information, see Activating enhanced infrastructure metrics in the Compute Optimizer User Guide. name (string) --- The name of the scope. The following scopes are possible: Organization - Specifies that the recommendation preference applies at the organization level, for all member accounts of an organization. AccountId - Specifies that the recommendation preference applies at the account level, for all resources of a given resource type in an account. ResourceArn - Specifies that the recommendation preference applies at the individual resource level. value (string) --- The value of the scope. If you specified the name of the scope as: Organization - The value must be ALL_ACCOUNTS. AccountId - The value must be a 12-digit Amazon Web Services account ID. ResourceArn - The value must be the Amazon Resource Name (ARN) of an EC2 instance or an Auto Scaling group. Only EC2 instance and Auto Scaling group ARNs are currently supported.",
      "nested_params": [
        {
          "name": "name",
          "type": "string",
          "required": false,
          "description": "The name of the scope. The following scopes are possible:",
          "nested_params": []
        },
        {
          "name": "value",
          "type": "string",
          "required": false,
          "description": "The value of the scope. If you specified the name of the scope as:",
          "nested_params": []
        }
      ]
    },
    {
      "name": "recommendationPreferenceNames",
      "type": "list",
      "required": true,
      "description": "The name of the recommendation preference to delete. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}