{
  "method_name": "export_ec2_instance_recommendations",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/compute-optimizer/client/export_ec2_instance_recommendations.html",
  "description": "Exports optimization recommendations for Amazon EC2 instances. Recommendations are exported in a comma-separated values (.csv) file, and its metadata in a JavaScript Object Notation (JSON) (.json) file, to an existing Amazon Simple Storage Service (Amazon S3) bucket that you specify. For more information, see Exporting Recommendations in the Compute Optimizer User Guide. You can have only one Amazon EC2 instance export job in progress per Amazon Web Services Region.",
  "parameters": [
    {
      "name": "accountIds",
      "type": "list",
      "required": false,
      "description": "The IDs of the Amazon Web Services accounts for which to export instance recommendations. If your account is the management account of an organization, use this parameter to specify the member account for which you want to export recommendations. This parameter cannot be specified together with the include member accounts parameter. The parameters are mutually exclusive. Recommendations for member accounts are not included in the export if this parameter, or the include member accounts parameter, is omitted. You can specify multiple account IDs per request. (string) ---",
      "nested_params": []
    },
    {
      "name": "filters",
      "type": "list",
      "required": false,
      "description": "An array of objects to specify a filter that exports a more specific set of instance recommendations. (dict) --- Describes a filter that returns a more specific list of recommendations. Use this filter with the  GetAutoScalingGroupRecommendations and  GetEC2InstanceRecommendations actions. You can use EBSFilter with the  GetEBSVolumeRecommendations action, LambdaFunctionRecommendationFilter with the  GetLambdaFunctionRecommendations action, and JobFilter with the  DescribeRecommendationExportJobs action. name (string) --- The name of the filter. Specify Finding to return recommendations with a specific finding classification. For example, Underprovisioned. Specify RecommendationSourceType to return recommendations of a specific resource type. For example, Ec2Instance. Specify FindingReasonCodes to return recommendations with a specific finding reason code. For example, CPUUnderprovisioned. Specify InferredWorkloadTypes to return recommendations of a specific inferred workload. For example, Redis. You can filter your EC2 instance recommendations by tag:key and tag-key tags. A tag:key is a key and value combination of a tag assigned to your recommendations. Use the tag key in the filter name and the tag value as the filter value. For example, to find all recommendations that have a tag with the key of Owner and the value of TeamA, specify tag:Owner for the filter name and TeamA for the filter value. A tag-key is the key of a tag assigned to your recommendations. Use this filter to find all of your recommendations that have a tag with a specific key. This doesn't consider the tag value. For example, you can find your recommendations with a tag key value of Owner or without any tag keys assigned. values (list) --- The value of the filter. The valid values for this parameter are as follows, depending on what you specify for the name parameter and the resource type that you wish to filter results for: Specify Optimized or NotOptimized if you specify the name parameter as Finding and you want to filter results for Auto Scaling groups. Specify Underprovisioned, Overprovisioned, or Optimized if you specify the name parameter as Finding and you want to filter results for EC2 instances. Specify Ec2Instance or AutoScalingGroup if you specify the name parameter as RecommendationSourceType. Specify one of the following options if you specify the name parameter as FindingReasonCodes: CPUOverprovisioned --\u0094 The instance's CPU configuration can be sized down while still meeting the performance requirements of your workload. CPUUnderprovisioned --\u0094 The instance's CPU configuration doesn't meet the performance requirements of your workload and there is an alternative instance type that provides better CPU performance. MemoryOverprovisioned --\u0094 The instance's memory configuration can be sized down while still meeting the performance requirements of your workload. MemoryUnderprovisioned --\u0094 The instance's memory configuration doesn't meet the performance requirements of your workload and there is an alternative instance type that provides better memory performance. EBSThroughputOverprovisioned --\u0094 The instance's EBS throughput configuration can be sized down while still meeting the performance requirements of your workload. EBSThroughputUnderprovisioned --\u0094 The instance's EBS throughput configuration doesn't meet the performance requirements of your workload and there is an alternative instance type that provides better EBS throughput performance. EBSIOPSOverprovisioned --\u0094 The instance's EBS IOPS configuration can be sized down while still meeting the performance requirements of your workload. EBSIOPSUnderprovisioned --\u0094 The instance's EBS IOPS configuration doesn't meet the performance requirements of your workload and there is an alternative instance type that provides better EBS IOPS performance. NetworkBandwidthOverprovisioned --\u0094 The instance's network bandwidth configuration can be sized down while still meeting the performance requirements of your workload. NetworkBandwidthUnderprovisioned --\u0094 The instance's network bandwidth configuration doesn't meet the performance requirements of your workload and there is an alternative instance type that provides better network bandwidth performance. This finding reason happens when the NetworkIn or NetworkOut performance of an instance is impacted. NetworkPPSOverprovisioned --\u0094 The instance's network PPS (packets per second) configuration can be sized down while still meeting the performance requirements of your workload. NetworkPPSUnderprovisioned --\u0094 The instance's network PPS (packets per second) configuration doesn't meet the performance requirements of your workload and there is an alternative instance type that provides better network PPS performance. DiskIOPSOverprovisioned --\u0094 The instance's disk IOPS configuration can be sized down while still meeting the performance requirements of your workload. DiskIOPSUnderprovisioned --\u0094 The instance's disk IOPS configuration doesn't meet the performance requirements of your workload and there is an alternative instance type that provides better disk IOPS performance. DiskThroughputOverprovisioned --\u0094 The instance's disk throughput configuration can be sized down while still meeting the performance requirements of your workload. DiskThroughputUnderprovisioned --\u0094 The instance's disk throughput configuration doesn't meet the performance requirements of your workload and there is an alternative instance type that provides better disk throughput performance. (string) ---",
      "nested_params": [
        {
          "name": "name",
          "type": "string",
          "required": false,
          "description": "The name of the filter. Specify Finding to return recommendations with a specific finding classification. For example, Underprovisioned. Specify RecommendationSourceType to return recommendations of a specific resource type. For example, Ec2Instance. Specify FindingReasonCodes to return recommendations with a specific finding reason code. For example, CPUUnderprovisioned. Specify InferredWorkloadTypes to return recommendations of a specific inferred workload. For example, Redis. You can filter your EC2 instance recommendations by tag:key and tag-key tags. A tag:key is a key and value combination of a tag assigned to your recommendations. Use the tag key in the filter name and the tag value as the filter value. For example, to find all recommendations that have a tag with the key of Owner and the value of TeamA, specify tag:Owner for the filter name and TeamA for the filter value. A tag-key is the key of a tag assigned to your recommendations. Use this filter to find all of your recommendations that have a tag with a specific key. This doesn't consider the tag value. For example, you can find your recommendations with a tag key value of Owner or without any tag keys assigned.",
          "nested_params": []
        },
        {
          "name": "values",
          "type": "list",
          "required": false,
          "description": "The value of the filter. The valid values for this parameter are as follows, depending on what you specify for the name parameter and the resource type that you wish to filter results for:",
          "nested_params": []
        }
      ]
    },
    {
      "name": "fieldsToExport",
      "type": "list",
      "required": false,
      "description": "The recommendations data to include in the export file. For more information about the fields that can be exported, see Exported files in the Compute Optimizer User Guide. (string) ---",
      "nested_params": []
    },
    {
      "name": "s3DestinationConfig",
      "type": "dict",
      "required": true,
      "description": "An object to specify the destination Amazon Simple Storage Service (Amazon S3) bucket name and key prefix for the export job. You must create the destination Amazon S3 bucket for your recommendations export before you create the export job. Compute Optimizer does not create the S3 bucket for you. After you create the S3 bucket, ensure that it has the required permissions policy to allow Compute Optimizer to write the export file to it. If you plan to specify an object prefix when you create the export job, you must include the object prefix in the policy that you add to the S3 bucket. For more information, see Amazon S3 Bucket Policy for Compute Optimizer in the Compute Optimizer User Guide. bucket (string) --- The name of the Amazon S3 bucket to use as the destination for an export job. keyPrefix (string) --- The Amazon S3 bucket prefix for an export job.",
      "nested_params": [
        {
          "name": "bucket",
          "type": "string",
          "required": false,
          "description": "The name of the Amazon S3 bucket to use as the destination for an export job.",
          "nested_params": []
        },
        {
          "name": "keyPrefix",
          "type": "string",
          "required": false,
          "description": "The Amazon S3 bucket prefix for an export job.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "fileFormat",
      "type": "string",
      "required": false,
      "description": "The format of the export file. The only export file format currently supported is Csv.",
      "nested_params": []
    },
    {
      "name": "includeMemberAccounts",
      "type": "boolean",
      "required": false,
      "description": "Indicates whether to include recommendations for resources in all member accounts of the organization if your account is the management account of an organization. The member accounts must also be opted in to Compute Optimizer, and trusted access for Compute Optimizer must be enabled in the organization account. For more information, see Compute Optimizer and Amazon Web Services Organizations trusted access in the Compute Optimizer User Guide. Recommendations for member accounts of the organization are not included in the export file if this parameter is omitted. Recommendations for member accounts are not included in the export if this parameter, or the account IDs parameter, is omitted.",
      "nested_params": []
    },
    {
      "name": "recommendationPreferences",
      "type": "dict",
      "required": false,
      "description": "An object to specify the preferences for the Amazon EC2 instance recommendations to export. cpuVendorArchitectures (list) --- Specifies the CPU vendor and architecture for Amazon EC2 instance and Auto Scaling group recommendations. For example, when you specify AWS_ARM64 with: A  GetEC2InstanceRecommendations or  GetAutoScalingGroupRecommendations request, Compute Optimizer returns recommendations that consist of Graviton instance types only. A  GetEC2RecommendationProjectedMetrics request, Compute Optimizer returns projected utilization metrics for Graviton instance type recommendations only. A  ExportEC2InstanceRecommendations or  ExportAutoScalingGroupRecommendations request, Compute Optimizer exports recommendations that consist of Graviton instance types only. (string) ---",
      "nested_params": [
        {
          "name": "cpuVendorArchitectures",
          "type": "list",
          "required": false,
          "description": "Specifies the CPU vendor and architecture for Amazon EC2 instance and Auto Scaling group recommendations. For example, when you specify AWS_ARM64 with:",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "jobId",
          "type": "string",
          "description": "The identification number of the export job.",
          "nested_items": []
        },
        {
          "name": "s3Destination",
          "type": "dict",
          "description": "An object that describes the destination Amazon S3 bucket of a recommendations export file.",
          "nested_items": [
            {
              "name": "bucket",
              "type": "string",
              "description": "The name of the Amazon S3 bucket used as the destination of an export file.",
              "nested_items": []
            },
            {
              "name": "key",
              "type": "string",
              "description": "The Amazon S3 bucket key of an export file.",
              "nested_items": []
            },
            {
              "name": "metadataKey",
              "type": "string",
              "description": "The Amazon S3 bucket key of a metadata file.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}