{
  "method_name": "get_shard_iterator",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/dynamodbstreams/client/get_shard_iterator.html",
  "description": "Returns a shard iterator. A shard iterator provides information about how to retrieve the stream records from within a shard. Use the shard iterator in a subsequent GetRecords request to read the stream records from the shard.",
  "parameters": [
    {
      "name": "StreamArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) for the stream.",
      "nested_params": []
    },
    {
      "name": "ShardId",
      "type": "string",
      "required": true,
      "description": "The identifier of the shard. The iterator will be returned for this shard ID.",
      "nested_params": []
    },
    {
      "name": "ShardIteratorType",
      "type": "string",
      "required": true,
      "description": "Determines how the shard iterator is used to start reading stream records from the shard: AT_SEQUENCE_NUMBER - Start reading exactly from the position denoted by a specific sequence number. AFTER_SEQUENCE_NUMBER - Start reading right after the position denoted by a specific sequence number. TRIM_HORIZON - Start reading at the last (untrimmed) stream record, which is the oldest record in the shard. In DynamoDB Streams, there is a 24 hour limit on data retention. Stream records whose age exceeds this limit are subject to removal (trimming) from the stream. LATEST - Start reading just after the most recent stream record in the shard, so that you always read the most recent data in the shard.",
      "nested_params": []
    },
    {
      "name": "SequenceNumber",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ShardIterator",
          "type": "string",
          "description": "The position in the shard from which to start reading stream records sequentially. A shard iterator specifies this position using the sequence number of a stream record in a shard.",
          "nested_items": []
        }
      ]
    }
  ]
}