{
  "method_name": "update_service_access_policies",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudsearch/client/update_service_access_policies.html",
  "description": "Configures the access rules that control access to the domain's document and search endpoints. For more information, see Configuring Access for an Amazon CloudSearch Domain.",
  "parameters": [
    {
      "name": "DomainName",
      "type": "string",
      "required": true,
      "description": "A string that represents the name of a domain. Domain names are unique across the domains owned by an account within an AWS region. Domain names start with a letter or number and can contain the following characters: a-z (lowercase), 0-9, and - (hyphen).",
      "nested_params": []
    },
    {
      "name": "AccessPolicies",
      "type": "string",
      "required": true,
      "description": "The access rules you want to configure. These rules replace any existing rules.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "AccessPolicies",
          "type": "dict",
          "description": "The access rules configured for the domain.",
          "nested_items": [
            {
              "name": "Options",
              "type": "string",
              "description": "Access rules for a domain's document or search service endpoints. For more information, see Configuring Access for a Search Domain in the Amazon CloudSearch Developer Guide. The maximum size of a policy document is 100 KB.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "CreationDate",
                  "type": "datetime",
                  "description": "A timestamp for when this option was created.",
                  "nested_items": []
                },
                {
                  "name": "UpdateDate",
                  "type": "datetime",
                  "description": "A timestamp for when this option was last updated.",
                  "nested_items": []
                },
                {
                  "name": "UpdateVersion",
                  "type": "integer",
                  "description": "A unique integer that indicates when this option was last updated.",
                  "nested_items": []
                },
                {
                  "name": "State",
                  "type": "string",
                  "description": "The state of processing a change to an option. Possible values:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "RequiresIndexDocuments: the option's latest value will not be deployed until  IndexDocuments has been called and indexing is complete.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Processing: the option's latest value is in the process of being activated.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Active: the option's latest value is completely deployed.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "FailedToValidate: the option value is not compatible with the domain's data and cannot be used to index the data. You must either modify the option value or update or remove the incompatible documents.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "PendingDeletion",
                  "type": "boolean",
                  "description": "Indicates that the option will be deleted once processing is complete.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}