{
  "method_name": "subscribe_to_shard",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kinesis/client/subscribe_to_shard.html",
  "description": "This operation establishes an HTTP/2 connection between the consumer you specify in the ConsumerARN parameter and the shard you specify in the ShardId parameter. After the connection is successfully established, Kinesis Data Streams pushes records from the shard to the consumer over this connection. Before you call this operation, call  RegisterStreamConsumer to register the consumer with Kinesis Data Streams. When the SubscribeToShard call succeeds, your consumer starts receiving events of type  SubscribeToShardEvent over the HTTP/2 connection for up to 5 minutes, after which time you need to call SubscribeToShard again to renew the subscription if you want to continue to receive records. You can make one call to SubscribeToShard per second per registered consumer per shard. For example, if you have a 4000 shard stream and two registered stream consumers, you can make one SubscribeToShard request per second for each combination of shard and registered consumer, allowing you to subscribe both consumers to all 4000 shards in one second. If you call SubscribeToShard again with the same ConsumerARN and ShardId within 5 seconds of a successful call, you'll get a ResourceInUseException. If you call SubscribeToShard 5 seconds or more after a successful call, the second call takes over the subscription and the previous connection expires or fails with a ResourceInUseException. For an example of how to use this operation, see Enhanced Fan-Out Using the Kinesis Data Streams API.",
  "parameters": [
    {
      "name": "ConsumerARN",
      "type": "string",
      "required": true,
      "description": "For this parameter, use the value you obtained when you called  RegisterStreamConsumer.",
      "nested_params": []
    },
    {
      "name": "ShardId",
      "type": "string",
      "required": true,
      "description": "The ID of the shard you want to subscribe to. To see a list of all the shards for a given stream, use  ListShards.",
      "nested_params": []
    },
    {
      "name": "StartingPosition",
      "type": "dict",
      "required": true,
      "description": "The starting position in the data stream from which to start streaming. You can set the starting position to one of the following values: AT_SEQUENCE_NUMBER: Start streaming from the position denoted by the sequence number specified in the SequenceNumber field. AFTER_SEQUENCE_NUMBER: Start streaming right after the position denoted by the sequence number specified in the SequenceNumber field. AT_TIMESTAMP: Start streaming from the position denoted by the time stamp specified in the Timestamp field. TRIM_HORIZON: Start streaming at the last untrimmed record in the shard, which is the oldest data record in the shard. LATEST: Start streaming just after the most recent record in the shard, so that you always read the most recent data in the shard. SequenceNumber (string) --- The sequence number of the data record in the shard from which to start streaming. To specify a sequence number, set StartingPosition to AT_SEQUENCE_NUMBER or AFTER_SEQUENCE_NUMBER. Timestamp (datetime) --- The time stamp of the data record from which to start reading. To specify a time stamp, set StartingPosition to Type AT_TIMESTAMP. A time stamp is the Unix epoch date with precision in milliseconds. For example, 2016-04-04T19:58:46.480-00:00 or 1459799926.480. If a record with this exact time stamp does not exist, records will be streamed from the next (later) record. If the time stamp is older than the current trim horizon, records will be streamed from the oldest untrimmed data record ( TRIM_HORIZON).",
      "nested_params": [
        {
          "name": "Type",
          "type": "string",
          "required": false,
          "description": "You can set the starting position to one of the following values: AT_SEQUENCE_NUMBER: Start streaming from the position denoted by the sequence number specified in the SequenceNumber field. AFTER_SEQUENCE_NUMBER: Start streaming right after the position denoted by the sequence number specified in the SequenceNumber field. AT_TIMESTAMP: Start streaming from the position denoted by the time stamp specified in the Timestamp field. TRIM_HORIZON: Start streaming at the last untrimmed record in the shard, which is the oldest data record in the shard. LATEST: Start streaming just after the most recent record in the shard, so that you always read the most recent data in the shard.",
          "nested_params": []
        },
        {
          "name": "SequenceNumber",
          "type": "string",
          "required": false,
          "description": "The sequence number of the data record in the shard from which to start streaming. To specify a sequence number, set StartingPosition to AT_SEQUENCE_NUMBER or AFTER_SEQUENCE_NUMBER.",
          "nested_params": []
        },
        {
          "name": "Timestamp",
          "type": "datetime",
          "required": false,
          "description": "The time stamp of the data record from which to start reading. To specify a time stamp, set StartingPosition to Type AT_TIMESTAMP. A time stamp is the Unix epoch date with precision in milliseconds. For example, 2016-04-04T19:58:46.480-00:00 or 1459799926.480. If a record with this exact time stamp does not exist, records will be streamed from the next (later) record. If the time stamp is older than the current trim horizon, records will be streamed from the oldest untrimmed data record ( TRIM_HORIZON).",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "EventStream",
          "type": "EventStream",
          "description": "The event stream that your consumer can use to read records from the shard.",
          "nested_items": [
            {
              "name": "SubscribeToShardEvent",
              "type": "dict",
              "description": "After you call  SubscribeToShard, Kinesis Data Streams sends events of this type to your consumer. For an example of how to handle these events, see Enhanced Fan-Out Using the Kinesis Data Streams API.",
              "nested_items": [
                {
                  "name": "Records",
                  "type": "list",
                  "description": "(dict) ---",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "SequenceNumber",
                          "type": "string",
                          "description": "The unique identifier of the record within its shard.",
                          "nested_items": []
                        },
                        {
                          "name": "ApproximateArrivalTimestamp",
                          "type": "datetime",
                          "description": "The approximate time that the record was inserted into the stream.",
                          "nested_items": []
                        },
                        {
                          "name": "Data",
                          "type": "bytes",
                          "description": "The data blob. The data in the blob is both opaque and immutable to Kinesis Data Streams, which does not inspect, interpret, or change the data in the blob in any way. When the data blob (the payload before base64-encoding) is added to the partition key size, the total size must not exceed the maximum record size (1 MiB).",
                          "nested_items": []
                        },
                        {
                          "name": "PartitionKey",
                          "type": "string",
                          "description": "Identifies which shard in the stream the data record is assigned to.",
                          "nested_items": []
                        },
                        {
                          "name": "EncryptionType",
                          "type": "string",
                          "description": "The encryption type used on the record. This parameter can be one of the following values:",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "",
                              "description": "NONE: Do not encrypt the records in the stream.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "KMS: Use server-side encryption on the records in the stream using a customer-managed Amazon Web Services KMS key.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "ContinuationSequenceNumber",
                  "type": "string",
                  "description": "Use this as SequenceNumber in the next call to  SubscribeToShard, with StartingPosition set to AT_SEQUENCE_NUMBER or AFTER_SEQUENCE_NUMBER. Use ContinuationSequenceNumber for checkpointing because it captures your shard progress even when no data is written to the shard.",
                  "nested_items": []
                },
                {
                  "name": "MillisBehindLatest",
                  "type": "integer",
                  "description": "The number of milliseconds the read records are from the tip of the stream, indicating how far behind current time the consumer is. A value of zero indicates that record processing is caught up, and there are no new records to process at this moment.",
                  "nested_items": []
                },
                {
                  "name": "ChildShards",
                  "type": "list",
                  "description": "The list of the child shards of the current shard, returned only at the end of the current shard.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "ShardId",
                          "type": "string",
                          "description": "The shard ID of the existing child shard of the current shard.",
                          "nested_items": []
                        },
                        {
                          "name": "ParentShards",
                          "type": "list",
                          "description": "The current shard that is the parent of the existing child shard.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "HashKeyRange",
                          "type": "dict",
                          "description": "The range of possible hash key values for the shard, which is a set of ordered contiguous positive integers.",
                          "nested_items": [
                            {
                              "name": "StartingHashKey",
                              "type": "string",
                              "description": "The starting hash key of the hash key range.",
                              "nested_items": []
                            },
                            {
                              "name": "EndingHashKey",
                              "type": "string",
                              "description": "The ending hash key of the hash key range.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "ResourceNotFoundException",
              "type": "dict",
              "description": "The requested resource could not be found. The stream might not be specified correctly.",
              "nested_items": [
                {
                  "name": "message",
                  "type": "string",
                  "description": "A message that provides information about the error.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "ResourceInUseException",
              "type": "dict",
              "description": "The resource is not available for this operation. For successful operation, the resource must be in the ACTIVE state.",
              "nested_items": [
                {
                  "name": "message",
                  "type": "string",
                  "description": "A message that provides information about the error.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "KMSDisabledException",
              "type": "dict",
              "description": "The request was rejected because the specified customer master key (CMK) isn't enabled.",
              "nested_items": [
                {
                  "name": "message",
                  "type": "string",
                  "description": "A message that provides information about the error.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "KMSInvalidStateException",
              "type": "dict",
              "description": "The request was rejected because the state of the specified resource isn't valid for this request. For more information, see How Key State Affects Use of a Customer Master Key in the Amazon Web Services Key Management Service Developer Guide.",
              "nested_items": [
                {
                  "name": "message",
                  "type": "string",
                  "description": "A message that provides information about the error.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "KMSAccessDeniedException",
              "type": "dict",
              "description": "The ciphertext references a key that doesn't exist or that you don't have access to.",
              "nested_items": [
                {
                  "name": "message",
                  "type": "string",
                  "description": "A message that provides information about the error.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "KMSNotFoundException",
              "type": "dict",
              "description": "The request was rejected because the specified entity or resource can't be found.",
              "nested_items": [
                {
                  "name": "message",
                  "type": "string",
                  "description": "A message that provides information about the error.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "KMSOptInRequired",
              "type": "dict",
              "description": "The Amazon Web Services access key ID needs a subscription for the service.",
              "nested_items": [
                {
                  "name": "message",
                  "type": "string",
                  "description": "A message that provides information about the error.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "KMSThrottlingException",
              "type": "dict",
              "description": "The request was denied due to request throttling. For more information about throttling, see Limits in the Amazon Web Services Key Management Service Developer Guide.",
              "nested_items": [
                {
                  "name": "message",
                  "type": "string",
                  "description": "A message that provides information about the error.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "InternalFailureException",
              "type": "dict",
              "description": "The processing of the request failed because of an unknown error, exception, or failure.",
              "nested_items": [
                {
                  "name": "message",
                  "type": "string",
                  "description": "",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}