{
  "method_name": "put_bot_alias",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/lex-models/client/put_bot_alias.html",
  "description": "Creates an alias for the specified version of the bot or replaces an alias for the specified bot. To change the version of the bot that the alias points to, replace the alias. For more information about aliases, see  versioning-aliases. This operation requires permissions for the lex:PutBotAlias action.",
  "parameters": [
    {
      "name": "name",
      "type": "string",
      "required": true,
      "description": "The name of the alias. The name is not case sensitive.",
      "nested_params": []
    },
    {
      "name": "description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "botVersion",
      "type": "string",
      "required": true,
      "description": "The version of the bot.",
      "nested_params": []
    },
    {
      "name": "botName",
      "type": "string",
      "required": true,
      "description": "The name of the bot.",
      "nested_params": []
    },
    {
      "name": "checksum",
      "type": "string",
      "required": false,
      "description": "Identifies a specific revision of the $LATEST version. When you create a new bot alias, leave the checksum field blank. If you specify a checksum you get a BadRequestException exception. When you want to update a bot alias, set the checksum field to the checksum of the most recent revision of the $LATEST version. If you don't specify the checksum field, or if the checksum does not match the $LATEST version, you get a PreconditionFailedException exception.",
      "nested_params": []
    },
    {
      "name": "conversationLogs",
      "type": "dict",
      "required": true,
      "description": "Settings for conversation logs for the alias. The settings for your conversation logs. You can log the conversation text, conversation audio, or both. (dict) --- Settings used to configure delivery mode and destination for conversation logs. The type of logging to enable. Text logs are delivered to a CloudWatch Logs log group. Audio logs are delivered to an S3 bucket. Where the logs will be delivered. kmsKeyArn (string) --- The Amazon Resource Name (ARN) of the AWS KMS customer managed key for encrypting audio logs delivered to an S3 bucket. The key does not apply to CloudWatch Logs and is optional for S3 buckets. The Amazon Resource Name (ARN) of the CloudWatch Logs log group or S3 bucket where the logs should be delivered. The Amazon Resource Name (ARN) of an IAM role with permission to write to your CloudWatch Logs for text logs and your S3 bucket for audio logs. If audio encryption is enabled, this role also provides access permission for the AWS KMS key used for encrypting audio logs. For more information, see Creating an IAM Role and Policy for Conversation Logs.",
      "nested_params": [
        {
          "name": "logSettings",
          "type": "list",
          "required": false,
          "description": "The settings for your conversation logs. You can log the conversation text, conversation audio, or both.",
          "nested_params": [
            {
              "name": "logType",
              "type": "string",
              "required": false,
              "description": "The type of logging to enable. Text logs are delivered to a CloudWatch Logs log group. Audio logs are delivered to an S3 bucket.",
              "nested_params": []
            },
            {
              "name": "destination",
              "type": "string",
              "required": false,
              "description": "Where the logs will be delivered. Text logs are delivered to a CloudWatch Logs log group. Audio logs are delivered to an S3 bucket.",
              "nested_params": []
            },
            {
              "name": "kmsKeyArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of the AWS KMS customer managed key for encrypting audio logs delivered to an S3 bucket. The key does not apply to CloudWatch Logs and is optional for S3 buckets.",
              "nested_params": []
            },
            {
              "name": "resourceArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of the CloudWatch Logs log group or S3 bucket where the logs should be delivered.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "iamRoleArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of an IAM role with permission to write to your CloudWatch Logs for text logs and your S3 bucket for audio logs. If audio encryption is enabled, this role also provides access permission for the AWS KMS key used for encrypting audio logs. For more information, see Creating an IAM Role and Policy for Conversation Logs.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "tags",
      "type": "list",
      "required": true,
      "description": "A list of tags to add to the bot alias. You can only add tags when you create an alias, you can't use the PutBotAlias operation to update the tags on a bot alias. To update tags, use the TagResource operation. (dict) --- A list of key/value pairs that identify a bot, bot alias, or bot channel. Tag keys and values can consist of Unicode letters, digits, white space, and any of the following symbols: _ . : / = + - @. The key for the tag. Keys are not case-sensitive and must be unique. The value associated with a key. The value may be an empty string but it can't be null.",
      "nested_params": [
        {
          "name": "key",
          "type": "string",
          "required": false,
          "description": "The key for the tag. Keys are not case-sensitive and must be unique.",
          "nested_params": []
        },
        {
          "name": "value",
          "type": "string",
          "required": false,
          "description": "The value associated with a key. The value may be an empty string but it can't be null.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "name",
          "type": "string",
          "description": "The name of the alias.",
          "nested_items": []
        },
        {
          "name": "description",
          "type": "string",
          "description": "A description of the alias.",
          "nested_items": []
        },
        {
          "name": "botVersion",
          "type": "string",
          "description": "The version of the bot that the alias points to.",
          "nested_items": []
        },
        {
          "name": "botName",
          "type": "string",
          "description": "The name of the bot that the alias points to.",
          "nested_items": []
        },
        {
          "name": "lastUpdatedDate",
          "type": "datetime",
          "description": "The date that the bot alias was updated. When you create a resource, the creation date and the last updated date are the same.",
          "nested_items": []
        },
        {
          "name": "createdDate",
          "type": "datetime",
          "description": "The date that the bot alias was created.",
          "nested_items": []
        },
        {
          "name": "checksum",
          "type": "string",
          "description": "The checksum for the current version of the alias.",
          "nested_items": []
        },
        {
          "name": "conversationLogs",
          "type": "dict",
          "description": "The settings that determine how Amazon Lex uses conversation logs for the alias.",
          "nested_items": [
            {
              "name": "logSettings",
              "type": "list",
              "description": "The settings for your conversation logs. You can log text, audio, or both.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "logType",
                      "type": "string",
                      "description": "The type of logging that is enabled.",
                      "nested_items": []
                    },
                    {
                      "name": "destination",
                      "type": "string",
                      "description": "The destination where logs are delivered.",
                      "nested_items": []
                    },
                    {
                      "name": "kmsKeyArn",
                      "type": "string",
                      "description": "The Amazon Resource Name (ARN) of the key used to encrypt audio logs in an S3 bucket.",
                      "nested_items": []
                    },
                    {
                      "name": "resourceArn",
                      "type": "string",
                      "description": "The Amazon Resource Name (ARN) of the CloudWatch Logs log group or S3 bucket where the logs are delivered.",
                      "nested_items": []
                    },
                    {
                      "name": "resourcePrefix",
                      "type": "string",
                      "description": "The resource prefix is the first part of the S3 object key within the S3 bucket that you specified to contain audio logs. For CloudWatch Logs it is the prefix of the log stream name within the log group that you specified.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "iamRoleArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the IAM role used to write your logs to CloudWatch Logs or an S3 bucket.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "tags",
          "type": "list",
          "description": "A list of tags associated with a bot.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "key",
                  "type": "string",
                  "description": "The key for the tag. Keys are not case-sensitive and must be unique.",
                  "nested_items": []
                },
                {
                  "name": "value",
                  "type": "string",
                  "description": "The value associated with a key. The value may be an empty string but it can't be null.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}