{
  "method_name": "start_import",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/lex-models/client/start_import.html",
  "description": "Starts a job to import a resource to Amazon Lex.",
  "parameters": [
    {
      "name": "payload",
      "type": "bytes",
      "required": true,
      "description": "A zip archive in binary format. The archive should contain one file, a JSON file containing the resource to import. The resource should match the type specified in the resourceType field.",
      "nested_params": []
    },
    {
      "name": "resourceType",
      "type": "string",
      "required": true,
      "description": "Specifies the type of resource to export. Each resource also exports any resources that it depends on. A bot exports dependent intents. An intent exports dependent slot types.",
      "nested_params": []
    },
    {
      "name": "mergeStrategy",
      "type": "string",
      "required": true,
      "description": "Specifies the action that the StartImport operation should take when there is an existing resource with the same name. FAIL_ON_CONFLICT - The import operation is stopped on the first conflict between a resource in the import file and an existing resource. The name of the resource causing the conflict is in the failureReason field of the response to the GetImport operation. OVERWRITE_LATEST - The import operation proceeds even if there is a conflict with an existing resource. The $LASTEST version of the existing resource is overwritten with the data from the import file.",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "list",
      "required": true,
      "description": "A list of tags to add to the imported bot. You can only add tags when you import a bot, you can't add tags to an intent or slot type. (dict) --- A list of key/value pairs that identify a bot, bot alias, or bot channel. Tag keys and values can consist of Unicode letters, digits, white space, and any of the following symbols: _ . : / = + - @. The key for the tag. Keys are not case-sensitive and must be unique. The value associated with a key. The value may be an empty string but it can't be null.",
      "nested_params": [
        {
          "name": "key",
          "type": "string",
          "required": false,
          "description": "The key for the tag. Keys are not case-sensitive and must be unique.",
          "nested_params": []
        },
        {
          "name": "value",
          "type": "string",
          "required": false,
          "description": "The value associated with a key. The value may be an empty string but it can't be null.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "name",
          "type": "string",
          "description": "The name given to the import job.",
          "nested_items": []
        },
        {
          "name": "resourceType",
          "type": "string",
          "description": "The type of resource to import.",
          "nested_items": []
        },
        {
          "name": "mergeStrategy",
          "type": "string",
          "description": "The action to take when there is a merge conflict.",
          "nested_items": []
        },
        {
          "name": "importId",
          "type": "string",
          "description": "The identifier for the specific import job.",
          "nested_items": []
        },
        {
          "name": "importStatus",
          "type": "string",
          "description": "The status of the import job. If the status is FAILED, you can get the reason for the failure using the GetImport operation.",
          "nested_items": []
        },
        {
          "name": "tags",
          "type": "list",
          "description": "A list of tags added to the imported bot.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "key",
                  "type": "string",
                  "description": "The key for the tag. Keys are not case-sensitive and must be unique.",
                  "nested_items": []
                },
                {
                  "name": "value",
                  "type": "string",
                  "description": "The value associated with a key. The value may be an empty string but it can't be null.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "createdDate",
          "type": "datetime",
          "description": "A timestamp for the date and time that the import job was requested.",
          "nested_items": []
        }
      ]
    }
  ]
}