{
  "method_name": "create_cluster",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/eks/client/create_cluster.html",
  "description": "Creates an Amazon EKS control plane. The Amazon EKS control plane consists of control plane instances that run the Kubernetes software, such as etcd and the API server. The control plane runs in an account managed by Amazon Web Services, and the Kubernetes API is exposed by the Amazon EKS API server endpoint. Each Amazon EKS cluster control plane is single tenant and unique. It runs on its own set of Amazon EC2 instances. The cluster control plane is provisioned across multiple Availability Zones and fronted by an Elastic Load Balancing Network Load Balancer. Amazon EKS also provisions elastic network interfaces in your VPC subnets to provide connectivity from the control plane instances to the nodes (for example, to support kubectl exec, logs, and proxy data flows). Amazon EKS nodes run in your Amazon Web Services account and connect to your cluster's control plane over the Kubernetes API server endpoint and a certificate file that is created for your cluster. You can use the endpointPublicAccess and endpointPrivateAccess parameters to enable or disable public and private access to your cluster's Kubernetes API server endpoint. By default, public access is enabled, and private access is disabled. For more information, see Amazon EKS Cluster Endpoint Access Control in the Amazon EKS User Guide . You can use the logging parameter to enable or disable exporting the Kubernetes control plane logs for your cluster to CloudWatch Logs. By default, cluster control plane logs aren't exported to CloudWatch Logs. For more information, see Amazon EKS Cluster Control Plane Logs in the Amazon EKS User Guide . In most cases, it takes several minutes to create a cluster. After you create an Amazon EKS cluster, you must configure your Kubernetes tooling to communicate with the API server and launch nodes into your cluster. For more information, see Allowing users to access your cluster and Launching Amazon EKS nodes in the Amazon EKS User Guide.",
  "parameters": [
    {
      "name": "name",
      "type": "string",
      "required": true,
      "description": "The unique name to give to your cluster. The name can contain only alphanumeric characters (case-sensitive), hyphens, and underscores. It must start with an alphanumeric character and can't be longer than 100 characters. The name must be unique within the Amazon Web Services Region and Amazon Web Services account that you're creating the cluster in.",
      "nested_params": []
    },
    {
      "name": "version",
      "type": "string",
      "required": false,
      "description": "The desired Kubernetes version for your cluster. If you don't specify a value here, the default version available in Amazon EKS is used.",
      "nested_params": []
    },
    {
      "name": "roleArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the IAM role that provides permissions for the Kubernetes control plane to make calls to Amazon Web Services API operations on your behalf. For more information, see Amazon EKS Service IAM Role in the Amazon EKS User Guide .",
      "nested_params": []
    },
    {
      "name": "resourcesVpcConfig",
      "type": "dict",
      "required": true,
      "description": "The VPC configuration that's used by the cluster control plane. Amazon EKS VPC resources have specific requirements to work properly with Kubernetes. For more information, see Cluster VPC Considerations and Cluster Security Group Considerations in the Amazon EKS User Guide. You must specify at least two subnets. You can specify up to five security groups. However, we recommend that you use a dedicated security group for your cluster control plane. subnetIds (list) --- Specify subnets for your Amazon EKS nodes. Amazon EKS creates cross-account elastic network interfaces in these subnets to allow communication between your nodes and the Kubernetes control plane. (string) --- securityGroupIds (list) --- Specify one or more security groups for the cross-account elastic network interfaces that Amazon EKS creates to use that allow communication between your nodes and the Kubernetes control plane. If you don't specify any security groups, then familiarize yourself with the difference between Amazon EKS defaults for clusters deployed with Kubernetes. For more information, see Amazon EKS security group considerations in the Amazon EKS User Guide . (string) --- endpointPublicAccess (boolean) --- Set this value to false to disable public access to your cluster's Kubernetes API server endpoint. If you disable public access, your cluster's Kubernetes API server can only receive requests from within the cluster VPC. The default value for this parameter is true, which enables public access for your Kubernetes API server. For more information, see Amazon EKS cluster endpoint access control in the Amazon EKS User Guide . endpointPrivateAccess (boolean) --- Set this value to true to enable private access for your cluster's Kubernetes API server endpoint. If you enable private access, Kubernetes API requests from within your cluster's VPC use the private VPC endpoint. The default value for this parameter is false, which disables private access for your Kubernetes API server. If you disable private access and you have nodes or Fargate pods in the cluster, then ensure that publicAccessCidrs includes the necessary CIDR blocks for communication with the nodes or Fargate pods. publicAccessCidrs (list) --- The CIDR blocks that are allowed access to your cluster's public Kubernetes API server endpoint. Communication to the endpoint from addresses outside of the CIDR blocks that you specify is denied. The default value is 0.0.0.0/0. If you've disabled private endpoint access, make sure that you specify the necessary CIDR blocks for every node and Fargate Pod in the cluster. (string) ---",
      "nested_params": [
        {
          "name": "subnetIds",
          "type": "list",
          "required": false,
          "description": "Specify subnets for your Amazon EKS nodes. Amazon EKS creates cross-account elastic network interfaces in these subnets to allow communication between your nodes and the Kubernetes control plane.",
          "nested_params": []
        },
        {
          "name": "securityGroupIds",
          "type": "list",
          "required": false,
          "description": "Specify one or more security groups for the cross-account elastic network interfaces that Amazon EKS creates to use that allow communication between your nodes and the Kubernetes control plane. If you don't specify any security groups, then familiarize yourself with the difference between Amazon EKS defaults for clusters deployed with Kubernetes. For more information, see Amazon EKS security group considerations in the Amazon EKS User Guide .",
          "nested_params": []
        },
        {
          "name": "endpointPublicAccess",
          "type": "boolean",
          "required": false,
          "description": "Set this value to false to disable public access to your cluster's Kubernetes API server endpoint. If you disable public access, your cluster's Kubernetes API server can only receive requests from within the cluster VPC. The default value for this parameter is true, which enables public access for your Kubernetes API server. For more information, see Amazon EKS cluster endpoint access control in the Amazon EKS User Guide .",
          "nested_params": []
        },
        {
          "name": "endpointPrivateAccess",
          "type": "boolean",
          "required": false,
          "description": "Set this value to true to enable private access for your cluster's Kubernetes API server endpoint. If you enable private access, Kubernetes API requests from within your cluster's VPC use the private VPC endpoint. The default value for this parameter is false, which disables private access for your Kubernetes API server. If you disable private access and you have nodes or Fargate pods in the cluster, then ensure that publicAccessCidrs includes the necessary CIDR blocks for communication with the nodes or Fargate pods. For more information, see Amazon EKS cluster endpoint access control in the Amazon EKS User Guide .",
          "nested_params": []
        },
        {
          "name": "publicAccessCidrs",
          "type": "list",
          "required": false,
          "description": "The CIDR blocks that are allowed access to your cluster's public Kubernetes API server endpoint. Communication to the endpoint from addresses outside of the CIDR blocks that you specify is denied. The default value is 0.0.0.0/0. If you've disabled private endpoint access, make sure that you specify the necessary CIDR blocks for every node and Fargate Pod in the cluster. For more information, see Amazon EKS cluster endpoint access control in the Amazon EKS User Guide .",
          "nested_params": []
        }
      ]
    },
    {
      "name": "kubernetesNetworkConfig",
      "type": "dict",
      "required": false,
      "description": "The Kubernetes network configuration for the cluster. serviceIpv4Cidr (string) --- Don't specify a value if you select ipv6 for ipFamily. The CIDR block to assign Kubernetes service IP addresses from. If you don't specify a block, Kubernetes assigns addresses from either the 10.100.0.0/16 or 172.20.0.0/16 CIDR blocks. We recommend that you specify a block that does not overlap with resources in other networks that are peered or connected to your VPC. The block must meet the following requirements: Within one of the following private IP address blocks: 10.0.0.0/8, 172.16.0.0/12, or 192.168.0.0/16. Doesn't overlap with any CIDR block assigned to the VPC that you selected for VPC. Between /24 and /12. ipFamily (string) --- Specify which IP family is used to assign Kubernetes pod and service IP addresses. If you don't specify a value, ipv4 is used by default. You can only specify an IP family when you create a cluster and can't change this value once the cluster is created. If you specify ipv6, the VPC and subnets that you specify for cluster creation must have both IPv4 and IPv6 CIDR blocks assigned to them. You can't specify ipv6 for clusters in China Regions. You can only specify ipv6 for 1.21 and later clusters that use version 1.10.1 or later of the Amazon VPC CNI add-on. If you specify ipv6, then ensure that your VPC meets the requirements listed in the considerations listed in Assigning IPv6 addresses to pods and services in the Amazon EKS User Guide. Kubernetes assigns services IPv6 addresses from the unique local address range (fc00::/7). You can't specify a custom IPv6 CIDR block. Pod addresses are assigned from the subnet's IPv6 CIDR. elasticLoadBalancing (dict) --- Request to enable or disable the load balancing capability on your EKS Auto Mode cluster. For more information, see EKS Auto Mode load balancing capability in the Amazon EKS User Guide. enabled (boolean) --- Indicates if the load balancing capability is enabled on your EKS Auto Mode cluster. If the load balancing capability is enabled, EKS Auto Mode will create and delete load balancers in your Amazon Web Services account.",
      "nested_params": [
        {
          "name": "serviceIpv4Cidr",
          "type": "string",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "ipFamily",
          "type": "string",
          "required": false,
          "description": "Specify which IP family is used to assign Kubernetes pod and service IP addresses. If you don't specify a value, ipv4 is used by default. You can only specify an IP family when you create a cluster and can't change this value once the cluster is created. If you specify ipv6, the VPC and subnets that you specify for cluster creation must have both IPv4 and IPv6 CIDR blocks assigned to them. You can't specify ipv6 for clusters in China Regions. You can only specify ipv6 for 1.21 and later clusters that use version 1.10.1 or later of the Amazon VPC CNI add-on. If you specify ipv6, then ensure that your VPC meets the requirements listed in the considerations listed in Assigning IPv6 addresses to pods and services in the Amazon EKS User Guide. Kubernetes assigns services IPv6 addresses from the unique local address range (fc00::/7). You can't specify a custom IPv6 CIDR block. Pod addresses are assigned from the subnet's IPv6 CIDR.",
          "nested_params": []
        },
        {
          "name": "elasticLoadBalancing",
          "type": "dict",
          "required": false,
          "description": "Request to enable or disable the load balancing capability on your EKS Auto Mode cluster. For more information, see EKS Auto Mode load balancing capability in the Amazon EKS User Guide.",
          "nested_params": [
            {
              "name": "enabled",
              "type": "boolean",
              "required": false,
              "description": "Indicates if the load balancing capability is enabled on your EKS Auto Mode cluster. If the load balancing capability is enabled, EKS Auto Mode will create and delete load balancers in your Amazon Web Services account.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "logging",
      "type": "dict",
      "required": false,
      "description": "Enable or disable exporting the Kubernetes control plane logs for your cluster to CloudWatch Logs . By default, cluster control plane logs aren't exported to CloudWatch Logs . For more information, see Amazon EKS Cluster control plane logs in the Amazon EKS User Guide . clusterLogging (list) --- The cluster control plane logging configuration for your cluster. (dict) --- An object representing the enabled or disabled Kubernetes control plane logs for your cluster. types (list) --- The available cluster control plane log types. (string) --- enabled (boolean) --- If a log type is enabled, that log type exports its control plane logs to CloudWatch Logs . If a log type isn't enabled, that log type doesn't export its control plane logs. Each individual log type can be enabled or disabled independently.",
      "nested_params": [
        {
          "name": "clusterLogging",
          "type": "list",
          "required": false,
          "description": "The cluster control plane logging configuration for your cluster.",
          "nested_params": [
            {
              "name": "types",
              "type": "list",
              "required": false,
              "description": "The available cluster control plane log types.",
              "nested_params": []
            },
            {
              "name": "enabled",
              "type": "boolean",
              "required": false,
              "description": "If a log type is enabled, that log type exports its control plane logs to CloudWatch Logs . If a log type isn't enabled, that log type doesn't export its control plane logs. Each individual log type can be enabled or disabled independently.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "clientRequestToken",
      "type": "string",
      "required": false,
      "description": "A unique, case-sensitive identifier that you provide to ensure the idempotency of the request. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "dict",
      "required": false,
      "description": "Metadata that assists with categorization and organization. Each tag consists of a key and an optional value. You define both. Tags don't propagate to any other cluster or Amazon Web Services resources. (string) --- One part of a key-value pair that make up a tag. A key is a general label that acts like a category for more specific tag values. (string) --- The optional part of a key-value pair that make up a tag. A value acts as a descriptor within a tag category (key).",
      "nested_params": []
    },
    {
      "name": "encryptionConfig",
      "type": "list",
      "required": false,
      "description": "The encryption configuration for the cluster. (dict) --- The encryption configuration for the cluster. resources (list) --- Specifies the resources to be encrypted. The only supported value is secrets. (string) --- provider (dict) --- Key Management Service (KMS) key. Either the ARN or the alias can be used. keyArn (string) --- Amazon Resource Name (ARN) or alias of the KMS key. The KMS key must be symmetric and created in the same Amazon Web Services Region as the cluster. If the KMS key was created in a different account, the IAM principal must have access to the KMS key. For more information, see Allowing users in other accounts to use a KMS key in the Key Management Service Developer Guide.",
      "nested_params": [
        {
          "name": "resources",
          "type": "list",
          "required": false,
          "description": "Specifies the resources to be encrypted. The only supported value is secrets.",
          "nested_params": []
        },
        {
          "name": "provider",
          "type": "dict",
          "required": false,
          "description": "Key Management Service (KMS) key. Either the ARN or the alias can be used.",
          "nested_params": [
            {
              "name": "keyArn",
              "type": "string",
              "required": false,
              "description": "Amazon Resource Name (ARN) or alias of the KMS key. The KMS key must be symmetric and created in the same Amazon Web Services Region as the cluster. If the KMS key was created in a different account, the IAM principal must have access to the KMS key. For more information, see Allowing users in other accounts to use a KMS key in the Key Management Service Developer Guide.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "outpostConfig",
      "type": "dict",
      "required": true,
      "description": "An object representing the configuration of your local Amazon EKS cluster on an Amazon Web Services Outpost. Before creating a local cluster on an Outpost, review Local clusters for Amazon EKS on Amazon Web Services Outposts in the Amazon EKS User Guide. This object isn't available for creating Amazon EKS clusters on the Amazon Web Services cloud. The ARN of the Outpost that you want to use for your local Amazon EKS cluster on Outposts. Only a single Outpost ARN is supported. (string) --- The Amazon EC2 instance type that you want to use for your local Amazon EKS cluster on Outposts. Choose an instance type based on the number of nodes that your cluster will have. For more information, see Capacity considerations in the Amazon EKS User Guide. The instance type that you specify is used for all Kubernetes control plane instances. The instance type can't be changed after cluster creation. The control plane is not automatically scaled by Amazon EKS. controlPlanePlacement (dict) --- An object representing the placement configuration for all the control plane instances of your local Amazon EKS cluster on an Amazon Web Services Outpost. groupName (string) --- The name of the placement group for the Kubernetes control plane instances. This setting can't be changed after cluster creation.",
      "nested_params": [
        {
          "name": "outpostArns",
          "type": "list",
          "required": false,
          "description": "The ARN of the Outpost that you want to use for your local Amazon EKS cluster on Outposts. Only a single Outpost ARN is supported.",
          "nested_params": []
        },
        {
          "name": "controlPlaneInstanceType",
          "type": "string",
          "required": false,
          "description": "The Amazon EC2 instance type that you want to use for your local Amazon EKS cluster on Outposts. Choose an instance type based on the number of nodes that your cluster will have. For more information, see Capacity considerations in the Amazon EKS User Guide. The instance type that you specify is used for all Kubernetes control plane instances. The instance type can't be changed after cluster creation. The control plane is not automatically scaled by Amazon EKS.",
          "nested_params": []
        },
        {
          "name": "controlPlanePlacement",
          "type": "dict",
          "required": false,
          "description": "An object representing the placement configuration for all the control plane instances of your local Amazon EKS cluster on an Amazon Web Services Outpost. For more information, see Capacity considerations in the Amazon EKS User Guide.",
          "nested_params": [
            {
              "name": "groupName",
              "type": "string",
              "required": false,
              "description": "The name of the placement group for the Kubernetes control plane instances. This setting can't be changed after cluster creation.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "accessConfig",
      "type": "dict",
      "required": false,
      "description": "The access configuration for the cluster. bootstrapClusterCreatorAdminPermissions (boolean) --- Specifies whether or not the cluster creator IAM principal was set as a cluster admin access entry during cluster creation time. The default value is true. authenticationMode (string) --- The desired authentication mode for the cluster. If you create a cluster by using the EKS API, Amazon Web Services SDKs, or CloudFormation, the default is CONFIG_MAP. If you create the cluster by using the Amazon Web Services Management Console, the default value is API_AND_CONFIG_MAP.",
      "nested_params": [
        {
          "name": "bootstrapClusterCreatorAdminPermissions",
          "type": "boolean",
          "required": false,
          "description": "Specifies whether or not the cluster creator IAM principal was set as a cluster admin access entry during cluster creation time. The default value is true.",
          "nested_params": []
        },
        {
          "name": "authenticationMode",
          "type": "string",
          "required": false,
          "description": "The desired authentication mode for the cluster. If you create a cluster by using the EKS API, Amazon Web Services SDKs, or CloudFormation, the default is CONFIG_MAP. If you create the cluster by using the Amazon Web Services Management Console, the default value is API_AND_CONFIG_MAP.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "bootstrapSelfManagedAddons",
      "type": "boolean",
      "required": false,
      "description": "If you set this value to False when creating a cluster, the default networking add-ons will not be installed. The default networking addons include vpc-cni, coredns, and kube-proxy. Use this option when you plan to install third-party alternative add-ons or self-manage the default networking add-ons.",
      "nested_params": []
    },
    {
      "name": "upgradePolicy",
      "type": "dict",
      "required": false,
      "description": "New clusters, by default, have extended support enabled. You can disable extended support when creating a cluster by setting this value to STANDARD. supportType (string) --- If the cluster is set to EXTENDED, it will enter extended support at the end of standard support. If the cluster is set to STANDARD, it will be automatically upgraded at the end of standard support. Learn more about EKS Extended Support in the Amazon EKS User Guide.",
      "nested_params": [
        {
          "name": "supportType",
          "type": "string",
          "required": false,
          "description": "If the cluster is set to EXTENDED, it will enter extended support at the end of standard support. If the cluster is set to STANDARD, it will be automatically upgraded at the end of standard support. Learn more about EKS Extended Support in the Amazon EKS User Guide.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "zonalShiftConfig",
      "type": "dict",
      "required": false,
      "description": "Enable or disable ARC zonal shift for the cluster. If zonal shift is enabled, Amazon Web Services configures zonal autoshift for the cluster. Zonal shift is a feature of Amazon Application Recovery Controller (ARC). ARC zonal shift is designed to be a temporary measure that allows you to move traffic for a resource away from an impaired AZ until the zonal shift expires or you cancel it. You can extend the zonal shift if necessary. You can start a zonal shift for an Amazon EKS cluster, or you can allow Amazon Web Services to do it for you by enabling zonal autoshift. This shift updates the flow of east-to-west network traffic in your cluster to only consider network endpoints for Pods running on worker nodes in healthy AZs. Additionally, any ALB or NLB handling ingress traffic for applications in your Amazon EKS cluster will automatically route traffic to targets in the healthy AZs. For more information about zonal shift in EKS, see Learn about Amazon Application Recovery Controller (ARC) Zonal Shift in Amazon EKS in the Amazon EKS User Guide . enabled (boolean) --- If zonal shift is enabled, Amazon Web Services configures zonal autoshift for the cluster.",
      "nested_params": [
        {
          "name": "enabled",
          "type": "boolean",
          "required": false,
          "description": "If zonal shift is enabled, Amazon Web Services configures zonal autoshift for the cluster.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "remoteNetworkConfig",
      "type": "dict",
      "required": false,
      "description": "The configuration in the cluster for EKS Hybrid Nodes. You can add, change, or remove this configuration after the cluster is created. remoteNodeNetworks (list) --- The list of network CIDRs that can contain hybrid nodes. These CIDR blocks define the expected IP address range of the hybrid nodes that join the cluster. These blocks are typically determined by your network administrator. Enter one or more IPv4 CIDR blocks in decimal dotted-quad notation (for example, 10.2.0.0/16). It must satisfy the following requirements: Each block must be within an IPv4 RFC-1918 network range. Minimum allowed size is /24, maximum allowed size is /8. Publicly-routable addresses aren't supported. Each block cannot overlap with the range of the VPC CIDR blocks for your EKS resources, or the block of the Kubernetes service IP range. Each block must have a route to the VPC that uses the VPC CIDR blocks, not public IPs or Elastic IPs. There are many options including Transit Gateway, Site-to-Site VPN, or Direct Connect. Each host must allow outbound connection to the EKS cluster control plane on TCP ports 443 and 10250. Each host must allow inbound connection from the EKS cluster control plane on TCP port 10250 for logs, exec and port-forward operations. Each host must allow TCP and UDP network connectivity to and from other hosts that are running CoreDNS on UDP port 53 for service and pod DNS names. (dict) --- A network CIDR that can contain hybrid nodes. cidrs (list) --- A network CIDR that can contain hybrid nodes. (string) --- remotePodNetworks (list) --- The list of network CIDRs that can contain pods that run Kubernetes webhooks on hybrid nodes. These CIDR blocks are determined by configuring your Container Network Interface (CNI) plugin. We recommend the Calico CNI or Cilium CNI. Note that the Amazon VPC CNI plugin for Kubernetes isn't available for on-premises and edge locations. (dict) --- A network CIDR that can contain pods that run Kubernetes webhooks on hybrid nodes. cidrs (list) --- A network CIDR that can contain pods that run Kubernetes webhooks on hybrid nodes. (string) ---",
      "nested_params": [
        {
          "name": "remoteNodeNetworks",
          "type": "list",
          "required": false,
          "description": "The list of network CIDRs that can contain hybrid nodes. These CIDR blocks define the expected IP address range of the hybrid nodes that join the cluster. These blocks are typically determined by your network administrator. Enter one or more IPv4 CIDR blocks in decimal dotted-quad notation (for example, 10.2.0.0/16). It must satisfy the following requirements:",
          "nested_params": []
        },
        {
          "name": "remotePodNetworks",
          "type": "list",
          "required": false,
          "description": "The list of network CIDRs that can contain pods that run Kubernetes webhooks on hybrid nodes. These CIDR blocks are determined by configuring your Container Network Interface (CNI) plugin. We recommend the Calico CNI or Cilium CNI. Note that the Amazon VPC CNI plugin for Kubernetes isn't available for on-premises and edge locations. Enter one or more IPv4 CIDR blocks in decimal dotted-quad notation (for example, 10.2.0.0/16). It must satisfy the following requirements:",
          "nested_params": []
        }
      ]
    },
    {
      "name": "computeConfig",
      "type": "dict",
      "required": false,
      "description": "Enable or disable the compute capability of EKS Auto Mode when creating your EKS Auto Mode cluster. If the compute capability is enabled, EKS Auto Mode will create and delete EC2 Managed Instances in your Amazon Web Services account enabled (boolean) --- Request to enable or disable the compute capability on your EKS Auto Mode cluster. If the compute capability is enabled, EKS Auto Mode will create and delete EC2 Managed Instances in your Amazon Web Services account. nodePools (list) --- Configuration for node pools that defines the compute resources for your EKS Auto Mode cluster. For more information, see EKS Auto Mode Node Pools in the Amazon EKS User Guide. (string) --- nodeRoleArn (string) --- The ARN of the IAM Role EKS will assign to EC2 Managed Instances in your EKS Auto Mode cluster. This value cannot be changed after the compute capability of EKS Auto Mode is enabled. For more information, see the IAM Reference in the Amazon EKS User Guide.",
      "nested_params": [
        {
          "name": "enabled",
          "type": "boolean",
          "required": false,
          "description": "Request to enable or disable the compute capability on your EKS Auto Mode cluster. If the compute capability is enabled, EKS Auto Mode will create and delete EC2 Managed Instances in your Amazon Web Services account.",
          "nested_params": []
        },
        {
          "name": "nodePools",
          "type": "list",
          "required": false,
          "description": "Configuration for node pools that defines the compute resources for your EKS Auto Mode cluster. For more information, see EKS Auto Mode Node Pools in the Amazon EKS User Guide.",
          "nested_params": []
        },
        {
          "name": "nodeRoleArn",
          "type": "string",
          "required": false,
          "description": "The ARN of the IAM Role EKS will assign to EC2 Managed Instances in your EKS Auto Mode cluster. This value cannot be changed after the compute capability of EKS Auto Mode is enabled. For more information, see the IAM Reference in the Amazon EKS User Guide.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "storageConfig",
      "type": "dict",
      "required": false,
      "description": "Enable or disable the block storage capability of EKS Auto Mode when creating your EKS Auto Mode cluster. If the block storage capability is enabled, EKS Auto Mode will create and delete EBS volumes in your Amazon Web Services account. blockStorage (dict) --- Request to configure EBS Block Storage settings for your EKS Auto Mode cluster. enabled (boolean) --- Indicates if the block storage capability is enabled on your EKS Auto Mode cluster. If the block storage capability is enabled, EKS Auto Mode will create and delete EBS volumes in your Amazon Web Services account.",
      "nested_params": [
        {
          "name": "blockStorage",
          "type": "dict",
          "required": false,
          "description": "Request to configure EBS Block Storage settings for your EKS Auto Mode cluster.",
          "nested_params": [
            {
              "name": "enabled",
              "type": "boolean",
              "required": false,
              "description": "Indicates if the block storage capability is enabled on your EKS Auto Mode cluster. If the block storage capability is enabled, EKS Auto Mode will create and delete EBS volumes in your Amazon Web Services account.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "name",
              "type": "string",
              "description": "The name of your cluster.",
              "nested_items": []
            },
            {
              "name": "arn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the cluster.",
              "nested_items": []
            },
            {
              "name": "createdAt",
              "type": "datetime",
              "description": "The Unix epoch timestamp at object creation.",
              "nested_items": []
            },
            {
              "name": "version",
              "type": "string",
              "description": "The Kubernetes server version for the cluster.",
              "nested_items": []
            },
            {
              "name": "endpoint",
              "type": "string",
              "description": "The endpoint for your Kubernetes API server.",
              "nested_items": []
            },
            {
              "name": "roleArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the IAM role that provides permissions for the Kubernetes control plane to make calls to Amazon Web Services API operations on your behalf.",
              "nested_items": []
            },
            {
              "name": "resourcesVpcConfig",
              "type": "dict",
              "description": "The VPC configuration used by the cluster control plane. Amazon EKS VPC resources have specific requirements to work properly with Kubernetes. For more information, see Cluster VPC considerations and Cluster security group considerations in the Amazon EKS User Guide.",
              "nested_items": [
                {
                  "name": "subnetIds",
                  "type": "list",
                  "description": "The subnets associated with your cluster.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "securityGroupIds",
                  "type": "list",
                  "description": "The security groups associated with the cross-account elastic network interfaces that are used to allow communication between your nodes and the Kubernetes control plane.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "clusterSecurityGroupId",
                  "type": "string",
                  "description": "The cluster security group that was created by Amazon EKS for the cluster. Managed node groups use this security group for control-plane-to-data-plane communication.",
                  "nested_items": []
                },
                {
                  "name": "vpcId",
                  "type": "string",
                  "description": "The VPC associated with your cluster.",
                  "nested_items": []
                },
                {
                  "name": "endpointPublicAccess",
                  "type": "boolean",
                  "description": "Whether the public API server endpoint is enabled.",
                  "nested_items": []
                },
                {
                  "name": "endpointPrivateAccess",
                  "type": "boolean",
                  "description": "This parameter indicates whether the Amazon EKS private API server endpoint is enabled. If the Amazon EKS private API server endpoint is enabled, Kubernetes API requests that originate from within your cluster's VPC use the private VPC endpoint instead of traversing the internet. If this value is disabled and you have nodes or Fargate pods in the cluster, then ensure that publicAccessCidrs includes the necessary CIDR blocks for communication with the nodes or Fargate pods. For more information, see Amazon EKS cluster endpoint access control in the Amazon EKS User Guide .",
                  "nested_items": []
                },
                {
                  "name": "publicAccessCidrs",
                  "type": "list",
                  "description": "The CIDR blocks that are allowed access to your cluster's public Kubernetes API server endpoint.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "kubernetesNetworkConfig",
              "type": "dict",
              "description": "The Kubernetes network configuration for the cluster.",
              "nested_items": [
                {
                  "name": "serviceIpv4Cidr",
                  "type": "string",
                  "description": "The CIDR block that Kubernetes Pod and Service object IP addresses are assigned from. Kubernetes assigns addresses from an IPv4 CIDR block assigned to a subnet that the node is in. If you didn't specify a CIDR block when you created the cluster, then Kubernetes assigns addresses from either the 10.100.0.0/16 or 172.20.0.0/16 CIDR blocks. If this was specified, then it was specified when the cluster was created and it can't be changed.",
                  "nested_items": []
                },
                {
                  "name": "serviceIpv6Cidr",
                  "type": "string",
                  "description": "The CIDR block that Kubernetes pod and service IP addresses are assigned from if you created a 1.21 or later cluster with version 1.10.1 or later of the Amazon VPC CNI add-on and specified ipv6 for ipFamily when you created the cluster. Kubernetes assigns service addresses from the unique local address range ( fc00::/7) because you can't specify a custom IPv6 CIDR block when you create the cluster.",
                  "nested_items": []
                },
                {
                  "name": "ipFamily",
                  "type": "string",
                  "description": "The IP family used to assign Kubernetes Pod and Service objects IP addresses. The IP family is always ipv4, unless you have a 1.21 or later cluster running version 1.10.1 or later of the Amazon VPC CNI plugin for Kubernetes and specified ipv6 when you created the cluster.",
                  "nested_items": []
                },
                {
                  "name": "elasticLoadBalancing",
                  "type": "dict",
                  "description": "Indicates the current configuration of the load balancing capability on your EKS Auto Mode cluster. For example, if the capability is enabled or disabled.",
                  "nested_items": [
                    {
                      "name": "enabled",
                      "type": "boolean",
                      "description": "Indicates if the load balancing capability is enabled on your EKS Auto Mode cluster. If the load balancing capability is enabled, EKS Auto Mode will create and delete load balancers in your Amazon Web Services account.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "clusterLogging",
                  "type": "list",
                  "description": "The cluster control plane logging configuration for your cluster.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "types",
                          "type": "list",
                          "description": "The available cluster control plane log types.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "enabled",
                          "type": "boolean",
                          "description": "If a log type is enabled, that log type exports its control plane logs to CloudWatch Logs . If a log type isn't enabled, that log type doesn't export its control plane logs. Each individual log type can be enabled or disabled independently.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "issuer",
                      "type": "string",
                      "description": "The issuer URL for the OIDC identity provider.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "status",
              "type": "string",
              "description": "The current status of the cluster.",
              "nested_items": []
            },
            {
              "name": "certificateAuthority",
              "type": "dict",
              "description": "The certificate-authority-data for your cluster.",
              "nested_items": [
                {
                  "name": "data",
                  "type": "string",
                  "description": "The Base64-encoded certificate data required to communicate with your cluster. Add this to the certificate-authority-data section of the kubeconfig file for your cluster.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "clientRequestToken",
              "type": "string",
              "description": "A unique, case-sensitive identifier that you provide to ensure the idempotency of the request.",
              "nested_items": []
            },
            {
              "name": "platformVersion",
              "type": "string",
              "description": "The platform version of your Amazon EKS cluster. For more information about clusters deployed on the Amazon Web Services Cloud, see Platform versions in the Amazon EKS User Guide . For more information about local clusters deployed on an Outpost, see Amazon EKS local cluster platform versions in the Amazon EKS User Guide .",
              "nested_items": []
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "encryptionConfig",
              "type": "list",
              "description": "The encryption configuration for the cluster.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "resources",
                      "type": "list",
                      "description": "Specifies the resources to be encrypted. The only supported value is secrets.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "keyArn",
                          "type": "string",
                          "description": "Amazon Resource Name (ARN) or alias of the KMS key. The KMS key must be symmetric and created in the same Amazon Web Services Region as the cluster. If the KMS key was created in a different account, the IAM principal must have access to the KMS key. For more information, see Allowing users in other accounts to use a KMS key in the Key Management Service Developer Guide.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "connectorConfig",
              "type": "dict",
              "description": "The configuration used to connect to a cluster for registration.",
              "nested_items": [
                {
                  "name": "activationId",
                  "type": "string",
                  "description": "A unique ID associated with the cluster for registration purposes.",
                  "nested_items": []
                },
                {
                  "name": "activationCode",
                  "type": "string",
                  "description": "A unique code associated with the cluster for registration purposes.",
                  "nested_items": []
                },
                {
                  "name": "activationExpiry",
                  "type": "datetime",
                  "description": "The expiration time of the connected cluster. The cluster's YAML file must be applied through the native provider.",
                  "nested_items": []
                },
                {
                  "name": "provider",
                  "type": "string",
                  "description": "The cluster's cloud service provider.",
                  "nested_items": []
                },
                {
                  "name": "roleArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the role to communicate with services from the connected Kubernetes cluster.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "id",
              "type": "string",
              "description": "The ID of your local Amazon EKS cluster on an Amazon Web Services Outpost. This property isn't available for an Amazon EKS cluster on the Amazon Web Services cloud.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "issues",
                  "type": "list",
                  "description": "An object representing the health issues of your Amazon EKS cluster.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "code",
                          "type": "string",
                          "description": "The error code of the issue.",
                          "nested_items": []
                        },
                        {
                          "name": "message",
                          "type": "string",
                          "description": "A description of the issue.",
                          "nested_items": []
                        },
                        {
                          "name": "resourceIds",
                          "type": "list",
                          "description": "The resource IDs that the issue relates to.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "outpostConfig",
              "type": "dict",
              "description": "An object representing the configuration of your local Amazon EKS cluster on an Amazon Web Services Outpost. This object isn't available for clusters on the Amazon Web Services cloud.",
              "nested_items": [
                {
                  "name": "outpostArns",
                  "type": "list",
                  "description": "The ARN of the Outpost that you specified for use with your local Amazon EKS cluster on Outposts.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "controlPlaneInstanceType",
                  "type": "string",
                  "description": "The Amazon EC2 instance type used for the control plane. The instance type is the same for all control plane instances.",
                  "nested_items": []
                },
                {
                  "name": "controlPlanePlacement",
                  "type": "dict",
                  "description": "An object representing the placement configuration for all the control plane instances of your local Amazon EKS cluster on an Amazon Web Services Outpost. For more information, see Capacity considerations in the Amazon EKS User Guide.",
                  "nested_items": [
                    {
                      "name": "groupName",
                      "type": "string",
                      "description": "The name of the placement group for the Kubernetes control plane instances.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "accessConfig",
              "type": "dict",
              "description": "The access configuration for the cluster.",
              "nested_items": [
                {
                  "name": "bootstrapClusterCreatorAdminPermissions",
                  "type": "boolean",
                  "description": "Specifies whether or not the cluster creator IAM principal was set as a cluster admin access entry during cluster creation time.",
                  "nested_items": []
                },
                {
                  "name": "authenticationMode",
                  "type": "string",
                  "description": "The current authentication mode of the cluster.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "upgradePolicy",
              "type": "dict",
              "description": "This value indicates if extended support is enabled or disabled for the cluster.",
              "nested_items": [
                {
                  "name": "supportType",
                  "type": "string",
                  "description": "If the cluster is set to EXTENDED, it will enter extended support at the end of standard support. If the cluster is set to STANDARD, it will be automatically upgraded at the end of standard support.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "zonalShiftConfig",
              "type": "dict",
              "description": "The configuration for zonal shift for the cluster.",
              "nested_items": [
                {
                  "name": "enabled",
                  "type": "boolean",
                  "description": "Whether the zonal shift is enabled.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "remoteNetworkConfig",
              "type": "dict",
              "description": "The configuration in the cluster for EKS Hybrid Nodes. You can add, change, or remove this configuration after the cluster is created.",
              "nested_items": [
                {
                  "name": "remoteNodeNetworks",
                  "type": "list",
                  "description": "The list of network CIDRs that can contain hybrid nodes.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "Each block must be within an IPv4 RFC-1918 network range. Minimum allowed size is /24, maximum allowed size is /8. Publicly-routable addresses aren't supported.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "Each block cannot overlap with the range of the VPC CIDR blocks for your EKS resources, or the block of the Kubernetes service IP range.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "Each block must have a route to the VPC that uses the VPC CIDR blocks, not public IPs or Elastic IPs. There are many options including Transit Gateway, Site-to-Site VPN, or Direct Connect.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "Each host must allow outbound connection to the EKS cluster control plane on TCP ports 443 and 10250.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "Each host must allow inbound connection from the EKS cluster control plane on TCP port 10250 for logs, exec and port-forward operations.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "Each host must allow TCP and UDP network connectivity to and from other hosts that are running CoreDNS on UDP port 53 for service and pod DNS names.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "remotePodNetworks",
                  "type": "list",
                  "description": "The list of network CIDRs that can contain pods that run Kubernetes webhooks on hybrid nodes.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "Each block must be within an IPv4 RFC-1918 network range. Minimum allowed size is /24, maximum allowed size is /8. Publicly-routable addresses aren't supported.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "Each block cannot overlap with the range of the VPC CIDR blocks for your EKS resources, or the block of the Kubernetes service IP range.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "computeConfig",
              "type": "dict",
              "description": "Indicates the current configuration of the compute capability on your EKS Auto Mode cluster. For example, if the capability is enabled or disabled. If the compute capability is enabled, EKS Auto Mode will create and delete EC2 Managed Instances in your Amazon Web Services account. For more information, see EKS Auto Mode compute capability in the Amazon EKS User Guide.",
              "nested_items": [
                {
                  "name": "enabled",
                  "type": "boolean",
                  "description": "Indicates if the compute capability is enabled on your EKS Auto Mode cluster. If the compute capability is enabled, EKS Auto Mode will create and delete EC2 Managed Instances in your Amazon Web Services account.",
                  "nested_items": []
                },
                {
                  "name": "nodePools",
                  "type": "list",
                  "description": "Indicates the current configuration of node pools in your EKS Auto Mode cluster. For more information, see EKS Auto Mode Node Pools in the Amazon EKS User Guide.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "nodeRoleArn",
                  "type": "string",
                  "description": "The ARN of the IAM Role EKS will assign to EC2 Managed Instances in your EKS Auto Mode cluster.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "storageConfig",
              "type": "dict",
              "description": "Indicates the current configuration of the block storage capability on your EKS Auto Mode cluster. For example, if the capability is enabled or disabled. If the block storage capability is enabled, EKS Auto Mode will create and delete EBS volumes in your Amazon Web Services account. For more information, see EKS Auto Mode block storage capability in the Amazon EKS User Guide.",
              "nested_items": [
                {
                  "name": "blockStorage",
                  "type": "dict",
                  "description": "Indicates the current configuration of the block storage capability on your EKS Auto Mode cluster. For example, if the capability is enabled or disabled.",
                  "nested_items": [
                    {
                      "name": "enabled",
                      "type": "boolean",
                      "description": "Indicates if the block storage capability is enabled on your EKS Auto Mode cluster. If the block storage capability is enabled, EKS Auto Mode will create and delete EBS volumes in your Amazon Web Services account.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}