{
  "method_name": "delete_capacity_provider",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ecs/client/delete_capacity_provider.html",
  "description": "Deletes the specified capacity provider. Prior to a capacity provider being deleted, the capacity provider must be removed from the capacity provider strategy from all services. The UpdateService API can be used to remove a capacity provider from a service's capacity provider strategy. When updating a service, the forceNewDeployment option can be used to ensure that any tasks using the Amazon EC2 instance capacity provided by the capacity provider are transitioned to use the capacity from the remaining capacity providers. Only capacity providers that aren't associated with a cluster can be deleted. To remove a capacity provider from a cluster, you can either use PutClusterCapacityProviders or delete the cluster.",
  "parameters": [
    {
      "name": "capacityProvider",
      "type": "string",
      "required": true,
      "description": "The short name or full Amazon Resource Name (ARN) of the capacity provider to delete.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "capacityProvider",
          "type": "dict",
          "description": "The details of the capacity provider.",
          "nested_items": [
            {
              "name": "capacityProviderArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) that identifies the capacity provider.",
              "nested_items": []
            },
            {
              "name": "name",
              "type": "string",
              "description": "The name of the capacity provider.",
              "nested_items": []
            },
            {
              "name": "status",
              "type": "string",
              "description": "The current status of the capacity provider. Only capacity providers in an ACTIVE state can be used in a cluster. When a capacity provider is successfully deleted, it has an INACTIVE status.",
              "nested_items": []
            },
            {
              "name": "autoScalingGroupProvider",
              "type": "dict",
              "description": "The Auto Scaling group settings for the capacity provider.",
              "nested_items": [
                {
                  "name": "autoScalingGroupArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) that identifies the Auto Scaling group, or the Auto Scaling group name.",
                  "nested_items": []
                },
                {
                  "name": "managedScaling",
                  "type": "dict",
                  "description": "The managed scaling settings for the Auto Scaling group capacity provider.",
                  "nested_items": [
                    {
                      "name": "status",
                      "type": "string",
                      "description": "Determines whether to use managed scaling for the capacity provider.",
                      "nested_items": []
                    },
                    {
                      "name": "targetCapacity",
                      "type": "integer",
                      "description": "The target capacity utilization as a percentage for the capacity provider. The specified value must be greater than 0 and less than or equal to 100. For example, if you want the capacity provider to maintain 10% spare capacity, then that means the utilization is 90%, so use a targetCapacity of 90. The default value of 100 percent results in the Amazon EC2 instances in your Auto Scaling group being completely used.",
                      "nested_items": []
                    },
                    {
                      "name": "minimumScalingStepSize",
                      "type": "integer",
                      "description": "The minimum number of Amazon EC2 instances that Amazon ECS will scale out at one time. The scale in process is not affected by this parameter If this parameter is omitted, the default value of 1 is used.",
                      "nested_items": []
                    },
                    {
                      "name": "maximumScalingStepSize",
                      "type": "integer",
                      "description": "The maximum number of Amazon EC2 instances that Amazon ECS will scale out at one time. If this parameter is omitted, the default value of 10000 is used.",
                      "nested_items": []
                    },
                    {
                      "name": "instanceWarmupPeriod",
                      "type": "integer",
                      "description": "The period of time, in seconds, after a newly launched Amazon EC2 instance can contribute to CloudWatch metrics for Auto Scaling group. If this parameter is omitted, the default value of 300 seconds is used.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "managedTerminationProtection",
                  "type": "string",
                  "description": "The managed termination protection setting to use for the Auto Scaling group capacity provider. This determines whether the Auto Scaling group has managed termination protection. The default is off.",
                  "nested_items": []
                },
                {
                  "name": "managedDraining",
                  "type": "string",
                  "description": "The managed draining option for the Auto Scaling group capacity provider. When you enable this, Amazon ECS manages and gracefully drains the EC2 container instances that are in the Auto Scaling group capacity provider.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "updateStatus",
              "type": "string",
              "description": "The update status of the capacity provider. The following are the possible states that is returned.",
              "nested_items": []
            },
            {
              "name": "updateStatusReason",
              "type": "string",
              "description": "The update status reason. This provides further details about the update status for the capacity provider.",
              "nested_items": []
            },
            {
              "name": "tags",
              "type": "list",
              "description": "The metadata that you apply to the capacity provider to help you categorize and organize it. Each tag consists of a key and an optional value. You define both.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "Maximum number of tags per resource - 50",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "For each resource, each tag key must be unique, and each tag key can have only one value.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Maximum key length - 128 Unicode characters in UTF-8",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Maximum value length - 256 Unicode characters in UTF-8",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "If your tagging schema is used across multiple services and resources, remember that other services may have restrictions on allowed characters. Generally allowed characters are: letters, numbers, and spaces representable in UTF-8, and the following characters: + - = . _ : / @.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Tag keys and values are case-sensitive.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Do not use aws:, AWS:, or any upper or lowercase combination of such as a prefix for either keys or values as it is reserved for Amazon Web Services use. You cannot edit or delete tag keys or values with this prefix. Tags with this prefix do not count against your tags per resource limit.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}