{
  "method_name": "create_medical_vocabulary",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/transcribe/client/create_medical_vocabulary.html",
  "description": "Creates a new custom medical vocabulary. Before creating a new custom medical vocabulary, you must first upload a text file that contains your vocabulary table into an Amazon S3 bucket. Note that this differs from , where you can include a list of terms within your request using the Phrases flag; CreateMedicalVocabulary does not support the Phrases flag and only accepts vocabularies in table format. Each language has a character set that contains all allowed characters for that specific language. If you use unsupported characters, your custom vocabulary request fails. Refer to Character Sets for Custom Vocabularies to get the character set for your language. For more information, see Custom vocabularies.",
  "parameters": [
    {
      "name": "VocabularyName",
      "type": "string",
      "required": true,
      "description": "A unique name, chosen by you, for your new custom medical vocabulary. This name is case sensitive, cannot contain spaces, and must be unique within an Amazon Web Services account. If you try to create a new custom medical vocabulary with the same name as an existing custom medical vocabulary, you get a ConflictException error.",
      "nested_params": []
    },
    {
      "name": "LanguageCode",
      "type": "string",
      "required": true,
      "description": "The language code that represents the language of the entries in your custom vocabulary. US English ( en-US) is the only language supported with Amazon Transcribe Medical.",
      "nested_params": []
    },
    {
      "name": "VocabularyFileUri",
      "type": "string",
      "required": true,
      "description": "The Amazon S3 location (URI) of the text file that contains your custom medical vocabulary. The URI must be in the same Amazon Web Services Region as the resource you're calling. Here's an example URI path: s3://DOC-EXAMPLE-BUCKET/my-vocab-file.txt.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "Adds one or more custom tags, each in the form of a key:value pair, to a new custom medical vocabulary at the time you create this new custom vocabulary. To learn more about using tags with Amazon Transcribe, refer to Tagging resources. (dict) --- Adds metadata, in the form of a key:value pair, to the specified resource. For example, you could add the tag Department:Sales to a resource to indicate that it pertains to your organization's sales department. You can also use tags for tag-based access control. To learn more about tagging, see Tagging resources. The first part of a key:value pair that forms a tag associated with a given resource. For example, in the tag Department:Sales, the key is --\u0098Department'. The second part of a key:value pair that forms a tag associated with a given resource. For example, in the tag Department:Sales, the value is --\u0098Sales'. Note that you can set the value of a tag to an empty string, but you can't set the value of a tag to null. Omitting the tag value is the same as using an empty string.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The first part of a key:value pair that forms a tag associated with a given resource. For example, in the tag Department:Sales, the key is --\u0098Department'.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The second part of a key:value pair that forms a tag associated with a given resource. For example, in the tag Department:Sales, the value is --\u0098Sales'. Note that you can set the value of a tag to an empty string, but you can't set the value of a tag to null. Omitting the tag value is the same as using an empty string.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "VocabularyName",
          "type": "string",
          "description": "The name you chose for your custom medical vocabulary.",
          "nested_items": []
        },
        {
          "name": "LanguageCode",
          "type": "string",
          "description": "The language code you selected for your custom medical vocabulary. US English ( en-US) is the only language supported with Amazon Transcribe Medical.",
          "nested_items": []
        },
        {
          "name": "VocabularyState",
          "type": "string",
          "description": "The processing state of your custom medical vocabulary. If the state is READY, you can use the custom vocabulary in a StartMedicalTranscriptionJob request.",
          "nested_items": []
        },
        {
          "name": "LastModifiedTime",
          "type": "datetime",
          "description": "The date and time you created your custom medical vocabulary.",
          "nested_items": []
        },
        {
          "name": "FailureReason",
          "type": "string",
          "description": "If VocabularyState is FAILED, FailureReason contains information about why the medical transcription job request failed. See also: Common Errors.",
          "nested_items": []
        }
      ]
    }
  ]
}