{
  "method_name": "create_call_analytics_category",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/transcribe/client/create_call_analytics_category.html",
  "description": "Creates a new Call Analytics category. All categories are automatically applied to your Call Analytics transcriptions. Note that in order to apply categories to your transcriptions, you must create them before submitting your transcription request, as categories cannot be applied retroactively. When creating a new category, you can use the InputType parameter to label the category as a POST_CALL or a REAL_TIME category. POST_CALL categories can only be applied to post-call transcriptions and REAL_TIME categories can only be applied to real-time transcriptions. If you do not include InputType, your category is created as a POST_CALL category by default. Call Analytics categories are composed of rules. For each category, you must create between 1 and 20 rules. Rules can include these parameters: , , , and . To update an existing category, see . To learn more about Call Analytics categories, see Creating categories for post-call transcriptions and Creating categories for real-time transcriptions.",
  "parameters": [
    {
      "name": "CategoryName",
      "type": "string",
      "required": true,
      "description": "A unique name, chosen by you, for your Call Analytics category. It's helpful to use a detailed naming system that will make sense to you in the future. For example, it's better to use sentiment-positive-last30seconds for a category over a generic name like test-category. Category names are case sensitive.",
      "nested_params": []
    },
    {
      "name": "Rules",
      "type": "list",
      "required": true,
      "description": "Rules define a Call Analytics category. When creating a new category, you must create between 1 and 20 rules for that category. For each rule, you specify a filter you want applied to the attributes of a call. For example, you can choose a sentiment filter that detects if a customer's sentiment was positive during the last 30 seconds of the call. (dict) --- A rule is a set of criteria that you can specify to flag an attribute in your Call Analytics output. Rules can include these parameters: , , , and . To learn more about Call Analytics rules and categories, see Creating categories for post-call transcriptions and Creating categories for real-time transcriptions. To learn more about Call Analytics, see Analyzing call center audio with Call Analytics. NonTalkTimeFilter (dict) --- Flag the presence or absence of periods of silence in your Call Analytics transcription output. Refer to for more detail. Threshold (integer) --- Specify the duration, in milliseconds, of the period of silence that you want to flag. For example, you can flag a silent period that lasts 30,000 milliseconds. AbsoluteTimeRange (dict) --- Makes it possible to specify a time range (in milliseconds) in your audio, during which you want to search for a period of silence. See for more detail. StartTime (integer) --- The time, in milliseconds, when Amazon Transcribe starts searching for the specified criteria in your audio. If you include StartTime in your request, you must also include EndTime. EndTime (integer) --- The time, in milliseconds, when Amazon Transcribe stops searching for the specified criteria in your audio. If you include EndTime in your request, you must also include StartTime. First (integer) --- The time, in milliseconds, from the start of your media file until the specified value. Amazon Transcribe searches for your specified criteria in this time segment. Last (integer) --- The time, in milliseconds, from the specified value until the end of your media file. RelativeTimeRange (dict) --- Makes it possible to specify a time range (in percentage) in your media file, during which you want to search for a period of silence. StartPercentage (integer) --- The time, in percentage, when Amazon Transcribe starts searching for the specified criteria in your media file. If you include StartPercentage in your request, you must also include EndPercentage. EndPercentage (integer) --- The time, in percentage, when Amazon Transcribe stops searching for the specified criteria in your media file. If you include EndPercentage in your request, you must also include StartPercentage. First (integer) --- The time, in percentage, from the start of your media file until the specified value. Last (integer) --- The time, in percentage, from the specified value until the end of your media file. Negate (boolean) --- Set to TRUE to flag periods of speech. Set to FALSE to flag periods of silence InterruptionFilter (dict) --- Flag the presence or absence of interruptions in your Call Analytics transcription output. Threshold (integer) --- Specify the duration of the interruptions in milliseconds. For example, you can flag speech that contains more than 10,000 milliseconds of interruptions. ParticipantRole (string) --- Specify the interrupter that you want to flag. Omitting this parameter is equivalent to specifying both participants. AbsoluteTimeRange (dict) --- Makes it possible to specify a time range (in milliseconds) in your audio, during which you want to search for an interruption. RelativeTimeRange (dict) --- Makes it possible to specify a time range (in percentage) in your media file, during which you want to search for an interruption. Negate (boolean) --- Set to TRUE to flag speech that does not contain interruptions. Set to FALSE to flag speech that contains interruptions. TranscriptFilter (dict) --- Flag the presence or absence of specific words or phrases in your Call Analytics transcription output. Flag the presence or absence of an exact match to the phrases that you specify. For example, if you specify the phrase 'speak to a manager' as your Targets value, only that exact phrase is flagged. Note that semantic matching is not supported. For example, if your customer says 'speak to the manager', instead of 'speak to a manager', your content is not flagged. AbsoluteTimeRange (dict) --- Makes it possible to specify a time range (in milliseconds) in your audio, during which you want to search for the specified key words or phrases. RelativeTimeRange (dict) --- Makes it possible to specify a time range (in percentage) in your media file, during which you want to search for the specified key words or phrases. ParticipantRole (string) --- Specify the participant that you want to flag. Negate (boolean) --- Set to TRUE to flag the absence of the phrase that you specified in your request. Set to FALSE to flag the presence of the phrase that you specified in your request. Specify the phrases that you want to flag. (string) --- SentimentFilter (dict) --- Flag the presence or absence of specific sentiments in your Call Analytics transcription output. Specify the sentiments that you want to flag. (string) --- AbsoluteTimeRange (dict) --- Makes it possible to specify a time range (in milliseconds) in your audio, during which you want to search for the specified sentiments. RelativeTimeRange (dict) --- Makes it possible to specify a time range (in percentage) in your media file, during which you want to search for the specified sentiments. Negate (boolean) --- Set to TRUE to flag the sentiments that you didn't include in your request. Set to FALSE to flag the sentiments that you specified in your request.",
      "nested_params": [
        {
          "name": "NonTalkTimeFilter",
          "type": "dict",
          "required": false,
          "description": "Flag the presence or absence of periods of silence in your Call Analytics transcription output. Refer to for more detail.",
          "nested_params": [
            {
              "name": "Threshold",
              "type": "integer",
              "required": false,
              "description": "Specify the duration, in milliseconds, of the period of silence that you want to flag. For example, you can flag a silent period that lasts 30,000 milliseconds.",
              "nested_params": []
            },
            {
              "name": "AbsoluteTimeRange",
              "type": "dict",
              "required": false,
              "description": "Makes it possible to specify a time range (in milliseconds) in your audio, during which you want to search for a period of silence. See for more detail.",
              "nested_params": [
                {
                  "name": "StartTime",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in milliseconds, when Amazon Transcribe starts searching for the specified criteria in your audio. If you include StartTime in your request, you must also include EndTime.",
                  "nested_params": []
                },
                {
                  "name": "EndTime",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in milliseconds, when Amazon Transcribe stops searching for the specified criteria in your audio. If you include EndTime in your request, you must also include StartTime.",
                  "nested_params": []
                },
                {
                  "name": "First",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in milliseconds, from the start of your media file until the specified value. Amazon Transcribe searches for your specified criteria in this time segment.",
                  "nested_params": []
                },
                {
                  "name": "Last",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in milliseconds, from the specified value until the end of your media file. Amazon Transcribe searches for your specified criteria in this time segment.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "RelativeTimeRange",
              "type": "dict",
              "required": false,
              "description": "Makes it possible to specify a time range (in percentage) in your media file, during which you want to search for a period of silence. See for more detail.",
              "nested_params": [
                {
                  "name": "StartPercentage",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in percentage, when Amazon Transcribe starts searching for the specified criteria in your media file. If you include StartPercentage in your request, you must also include EndPercentage.",
                  "nested_params": []
                },
                {
                  "name": "EndPercentage",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in percentage, when Amazon Transcribe stops searching for the specified criteria in your media file. If you include EndPercentage in your request, you must also include StartPercentage.",
                  "nested_params": []
                },
                {
                  "name": "First",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in percentage, from the start of your media file until the specified value. Amazon Transcribe searches for your specified criteria in this time segment.",
                  "nested_params": []
                },
                {
                  "name": "Last",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in percentage, from the specified value until the end of your media file. Amazon Transcribe searches for your specified criteria in this time segment.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Negate",
              "type": "boolean",
              "required": false,
              "description": "Set to TRUE to flag periods of speech. Set to FALSE to flag periods of silence.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "InterruptionFilter",
          "type": "dict",
          "required": false,
          "description": "Flag the presence or absence of interruptions in your Call Analytics transcription output. Refer to for more detail.",
          "nested_params": [
            {
              "name": "Threshold",
              "type": "integer",
              "required": false,
              "description": "Specify the duration of the interruptions in milliseconds. For example, you can flag speech that contains more than 10,000 milliseconds of interruptions.",
              "nested_params": []
            },
            {
              "name": "ParticipantRole",
              "type": "string",
              "required": false,
              "description": "Specify the interrupter that you want to flag. Omitting this parameter is equivalent to specifying both participants.",
              "nested_params": []
            },
            {
              "name": "AbsoluteTimeRange",
              "type": "dict",
              "required": false,
              "description": "Makes it possible to specify a time range (in milliseconds) in your audio, during which you want to search for an interruption. See for more detail.",
              "nested_params": [
                {
                  "name": "StartTime",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in milliseconds, when Amazon Transcribe starts searching for the specified criteria in your audio. If you include StartTime in your request, you must also include EndTime.",
                  "nested_params": []
                },
                {
                  "name": "EndTime",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in milliseconds, when Amazon Transcribe stops searching for the specified criteria in your audio. If you include EndTime in your request, you must also include StartTime.",
                  "nested_params": []
                },
                {
                  "name": "First",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in milliseconds, from the start of your media file until the specified value. Amazon Transcribe searches for your specified criteria in this time segment.",
                  "nested_params": []
                },
                {
                  "name": "Last",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in milliseconds, from the specified value until the end of your media file. Amazon Transcribe searches for your specified criteria in this time segment.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "RelativeTimeRange",
              "type": "dict",
              "required": false,
              "description": "Makes it possible to specify a time range (in percentage) in your media file, during which you want to search for an interruption. See for more detail.",
              "nested_params": [
                {
                  "name": "StartPercentage",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in percentage, when Amazon Transcribe starts searching for the specified criteria in your media file. If you include StartPercentage in your request, you must also include EndPercentage.",
                  "nested_params": []
                },
                {
                  "name": "EndPercentage",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in percentage, when Amazon Transcribe stops searching for the specified criteria in your media file. If you include EndPercentage in your request, you must also include StartPercentage.",
                  "nested_params": []
                },
                {
                  "name": "First",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in percentage, from the start of your media file until the specified value. Amazon Transcribe searches for your specified criteria in this time segment.",
                  "nested_params": []
                },
                {
                  "name": "Last",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in percentage, from the specified value until the end of your media file. Amazon Transcribe searches for your specified criteria in this time segment.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Negate",
              "type": "boolean",
              "required": false,
              "description": "Set to TRUE to flag speech that does not contain interruptions. Set to FALSE to flag speech that contains interruptions.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "TranscriptFilter",
          "type": "dict",
          "required": false,
          "description": "Flag the presence or absence of specific words or phrases in your Call Analytics transcription output. Refer to for more detail.",
          "nested_params": [
            {
              "name": "TranscriptFilterType",
              "type": "string",
              "required": false,
              "description": "Flag the presence or absence of an exact match to the phrases that you specify. For example, if you specify the phrase 'speak to a manager' as your Targets value, only that exact phrase is flagged. Note that semantic matching is not supported. For example, if your customer says 'speak to the manager', instead of 'speak to a manager', your content is not flagged.",
              "nested_params": []
            },
            {
              "name": "AbsoluteTimeRange",
              "type": "dict",
              "required": false,
              "description": "Makes it possible to specify a time range (in milliseconds) in your audio, during which you want to search for the specified key words or phrases. See for more detail.",
              "nested_params": [
                {
                  "name": "StartTime",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in milliseconds, when Amazon Transcribe starts searching for the specified criteria in your audio. If you include StartTime in your request, you must also include EndTime.",
                  "nested_params": []
                },
                {
                  "name": "EndTime",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in milliseconds, when Amazon Transcribe stops searching for the specified criteria in your audio. If you include EndTime in your request, you must also include StartTime.",
                  "nested_params": []
                },
                {
                  "name": "First",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in milliseconds, from the start of your media file until the specified value. Amazon Transcribe searches for your specified criteria in this time segment.",
                  "nested_params": []
                },
                {
                  "name": "Last",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in milliseconds, from the specified value until the end of your media file. Amazon Transcribe searches for your specified criteria in this time segment.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "RelativeTimeRange",
              "type": "dict",
              "required": false,
              "description": "Makes it possible to specify a time range (in percentage) in your media file, during which you want to search for the specified key words or phrases. See for more detail.",
              "nested_params": [
                {
                  "name": "StartPercentage",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in percentage, when Amazon Transcribe starts searching for the specified criteria in your media file. If you include StartPercentage in your request, you must also include EndPercentage.",
                  "nested_params": []
                },
                {
                  "name": "EndPercentage",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in percentage, when Amazon Transcribe stops searching for the specified criteria in your media file. If you include EndPercentage in your request, you must also include StartPercentage.",
                  "nested_params": []
                },
                {
                  "name": "First",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in percentage, from the start of your media file until the specified value. Amazon Transcribe searches for your specified criteria in this time segment.",
                  "nested_params": []
                },
                {
                  "name": "Last",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in percentage, from the specified value until the end of your media file. Amazon Transcribe searches for your specified criteria in this time segment.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ParticipantRole",
              "type": "string",
              "required": false,
              "description": "Specify the participant that you want to flag. Omitting this parameter is equivalent to specifying both participants.",
              "nested_params": []
            },
            {
              "name": "Negate",
              "type": "boolean",
              "required": false,
              "description": "Set to TRUE to flag the absence of the phrase that you specified in your request. Set to FALSE to flag the presence of the phrase that you specified in your request.",
              "nested_params": []
            },
            {
              "name": "Targets",
              "type": "list",
              "required": false,
              "description": "Specify the phrases that you want to flag.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "SentimentFilter",
          "type": "dict",
          "required": false,
          "description": "Flag the presence or absence of specific sentiments in your Call Analytics transcription output. Refer to for more detail.",
          "nested_params": [
            {
              "name": "Sentiments",
              "type": "list",
              "required": false,
              "description": "Specify the sentiments that you want to flag.",
              "nested_params": []
            },
            {
              "name": "AbsoluteTimeRange",
              "type": "dict",
              "required": false,
              "description": "Makes it possible to specify a time range (in milliseconds) in your audio, during which you want to search for the specified sentiments. See for more detail.",
              "nested_params": [
                {
                  "name": "StartTime",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in milliseconds, when Amazon Transcribe starts searching for the specified criteria in your audio. If you include StartTime in your request, you must also include EndTime.",
                  "nested_params": []
                },
                {
                  "name": "EndTime",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in milliseconds, when Amazon Transcribe stops searching for the specified criteria in your audio. If you include EndTime in your request, you must also include StartTime.",
                  "nested_params": []
                },
                {
                  "name": "First",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in milliseconds, from the start of your media file until the specified value. Amazon Transcribe searches for your specified criteria in this time segment.",
                  "nested_params": []
                },
                {
                  "name": "Last",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in milliseconds, from the specified value until the end of your media file. Amazon Transcribe searches for your specified criteria in this time segment.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "RelativeTimeRange",
              "type": "dict",
              "required": false,
              "description": "Makes it possible to specify a time range (in percentage) in your media file, during which you want to search for the specified sentiments. See for more detail.",
              "nested_params": [
                {
                  "name": "StartPercentage",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in percentage, when Amazon Transcribe starts searching for the specified criteria in your media file. If you include StartPercentage in your request, you must also include EndPercentage.",
                  "nested_params": []
                },
                {
                  "name": "EndPercentage",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in percentage, when Amazon Transcribe stops searching for the specified criteria in your media file. If you include EndPercentage in your request, you must also include StartPercentage.",
                  "nested_params": []
                },
                {
                  "name": "First",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in percentage, from the start of your media file until the specified value. Amazon Transcribe searches for your specified criteria in this time segment.",
                  "nested_params": []
                },
                {
                  "name": "Last",
                  "type": "integer",
                  "required": false,
                  "description": "The time, in percentage, from the specified value until the end of your media file. Amazon Transcribe searches for your specified criteria in this time segment.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ParticipantRole",
              "type": "string",
              "required": false,
              "description": "Specify the participant that you want to flag. Omitting this parameter is equivalent to specifying both participants.",
              "nested_params": []
            },
            {
              "name": "Negate",
              "type": "boolean",
              "required": false,
              "description": "Set to TRUE to flag the sentiments that you didn't include in your request. Set to FALSE to flag the sentiments that you specified in your request.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "Adds one or more custom tags, each in the form of a key:value pair, to a new call analytics category at the time you start this new job. To learn more about using tags with Amazon Transcribe, refer to Tagging resources. (dict) --- Adds metadata, in the form of a key:value pair, to the specified resource. For example, you could add the tag Department:Sales to a resource to indicate that it pertains to your organization's sales department. You can also use tags for tag-based access control. To learn more about tagging, see Tagging resources. The first part of a key:value pair that forms a tag associated with a given resource. For example, in the tag Department:Sales, the key is --\u0098Department'. The second part of a key:value pair that forms a tag associated with a given resource. For example, in the tag Department:Sales, the value is --\u0098Sales'. Note that you can set the value of a tag to an empty string, but you can't set the value of a tag to null. Omitting the tag value is the same as using an empty string.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The first part of a key:value pair that forms a tag associated with a given resource. For example, in the tag Department:Sales, the key is --\u0098Department'.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The second part of a key:value pair that forms a tag associated with a given resource. For example, in the tag Department:Sales, the value is --\u0098Sales'. Note that you can set the value of a tag to an empty string, but you can't set the value of a tag to null. Omitting the tag value is the same as using an empty string.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "InputType",
      "type": "string",
      "required": false,
      "description": "Choose whether you want to create a real-time or a post-call category for your Call Analytics transcription. Specifying POST_CALL assigns your category to post-call transcriptions; categories with this input type cannot be applied to streaming (real-time) transcriptions. Specifying REAL_TIME assigns your category to streaming transcriptions; categories with this input type cannot be applied to post-call transcriptions. If you do not include InputType, your category is created as a post-call category by default.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "CategoryProperties",
          "type": "dict",
          "description": "Provides you with the properties of your new category, including its associated rules.",
          "nested_items": [
            {
              "name": "CategoryName",
              "type": "string",
              "description": "The name of the Call Analytics category. Category names are case sensitive and must be unique within an Amazon Web Services account.",
              "nested_items": []
            },
            {
              "name": "Rules",
              "type": "list",
              "description": "The rules used to define a Call Analytics category. Each category can have between 1 and 20 rules.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "NonTalkTimeFilter",
                      "type": "dict",
                      "description": "Flag the presence or absence of periods of silence in your Call Analytics transcription output. Refer to for more detail.",
                      "nested_items": [
                        {
                          "name": "Threshold",
                          "type": "integer",
                          "description": "Specify the duration, in milliseconds, of the period of silence that you want to flag. For example, you can flag a silent period that lasts 30,000 milliseconds.",
                          "nested_items": []
                        },
                        {
                          "name": "AbsoluteTimeRange",
                          "type": "dict",
                          "description": "Makes it possible to specify a time range (in milliseconds) in your audio, during which you want to search for a period of silence. See for more detail.",
                          "nested_items": [
                            {
                              "name": "StartTime",
                              "type": "integer",
                              "description": "The time, in milliseconds, when Amazon Transcribe starts searching for the specified criteria in your audio. If you include StartTime in your request, you must also include EndTime.",
                              "nested_items": []
                            },
                            {
                              "name": "EndTime",
                              "type": "integer",
                              "description": "The time, in milliseconds, when Amazon Transcribe stops searching for the specified criteria in your audio. If you include EndTime in your request, you must also include StartTime.",
                              "nested_items": []
                            },
                            {
                              "name": "First",
                              "type": "integer",
                              "description": "The time, in milliseconds, from the start of your media file until the specified value. Amazon Transcribe searches for your specified criteria in this time segment.",
                              "nested_items": []
                            },
                            {
                              "name": "Last",
                              "type": "integer",
                              "description": "The time, in milliseconds, from the specified value until the end of your media file. Amazon Transcribe searches for your specified criteria in this time segment.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "RelativeTimeRange",
                          "type": "dict",
                          "description": "Makes it possible to specify a time range (in percentage) in your media file, during which you want to search for a period of silence. See for more detail.",
                          "nested_items": [
                            {
                              "name": "StartPercentage",
                              "type": "integer",
                              "description": "The time, in percentage, when Amazon Transcribe starts searching for the specified criteria in your media file. If you include StartPercentage in your request, you must also include EndPercentage.",
                              "nested_items": []
                            },
                            {
                              "name": "EndPercentage",
                              "type": "integer",
                              "description": "The time, in percentage, when Amazon Transcribe stops searching for the specified criteria in your media file. If you include EndPercentage in your request, you must also include StartPercentage.",
                              "nested_items": []
                            },
                            {
                              "name": "First",
                              "type": "integer",
                              "description": "The time, in percentage, from the start of your media file until the specified value. Amazon Transcribe searches for your specified criteria in this time segment.",
                              "nested_items": []
                            },
                            {
                              "name": "Last",
                              "type": "integer",
                              "description": "The time, in percentage, from the specified value until the end of your media file. Amazon Transcribe searches for your specified criteria in this time segment.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "Negate",
                          "type": "boolean",
                          "description": "Set to TRUE to flag periods of speech. Set to FALSE to flag periods of silence.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "InterruptionFilter",
                      "type": "dict",
                      "description": "Flag the presence or absence of interruptions in your Call Analytics transcription output. Refer to for more detail.",
                      "nested_items": [
                        {
                          "name": "Threshold",
                          "type": "integer",
                          "description": "Specify the duration of the interruptions in milliseconds. For example, you can flag speech that contains more than 10,000 milliseconds of interruptions.",
                          "nested_items": []
                        },
                        {
                          "name": "ParticipantRole",
                          "type": "string",
                          "description": "Specify the interrupter that you want to flag. Omitting this parameter is equivalent to specifying both participants.",
                          "nested_items": []
                        },
                        {
                          "name": "AbsoluteTimeRange",
                          "type": "dict",
                          "description": "Makes it possible to specify a time range (in milliseconds) in your audio, during which you want to search for an interruption. See for more detail.",
                          "nested_items": [
                            {
                              "name": "StartTime",
                              "type": "integer",
                              "description": "The time, in milliseconds, when Amazon Transcribe starts searching for the specified criteria in your audio. If you include StartTime in your request, you must also include EndTime.",
                              "nested_items": []
                            },
                            {
                              "name": "EndTime",
                              "type": "integer",
                              "description": "The time, in milliseconds, when Amazon Transcribe stops searching for the specified criteria in your audio. If you include EndTime in your request, you must also include StartTime.",
                              "nested_items": []
                            },
                            {
                              "name": "First",
                              "type": "integer",
                              "description": "The time, in milliseconds, from the start of your media file until the specified value. Amazon Transcribe searches for your specified criteria in this time segment.",
                              "nested_items": []
                            },
                            {
                              "name": "Last",
                              "type": "integer",
                              "description": "The time, in milliseconds, from the specified value until the end of your media file. Amazon Transcribe searches for your specified criteria in this time segment.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "RelativeTimeRange",
                          "type": "dict",
                          "description": "Makes it possible to specify a time range (in percentage) in your media file, during which you want to search for an interruption. See for more detail.",
                          "nested_items": [
                            {
                              "name": "StartPercentage",
                              "type": "integer",
                              "description": "The time, in percentage, when Amazon Transcribe starts searching for the specified criteria in your media file. If you include StartPercentage in your request, you must also include EndPercentage.",
                              "nested_items": []
                            },
                            {
                              "name": "EndPercentage",
                              "type": "integer",
                              "description": "The time, in percentage, when Amazon Transcribe stops searching for the specified criteria in your media file. If you include EndPercentage in your request, you must also include StartPercentage.",
                              "nested_items": []
                            },
                            {
                              "name": "First",
                              "type": "integer",
                              "description": "The time, in percentage, from the start of your media file until the specified value. Amazon Transcribe searches for your specified criteria in this time segment.",
                              "nested_items": []
                            },
                            {
                              "name": "Last",
                              "type": "integer",
                              "description": "The time, in percentage, from the specified value until the end of your media file. Amazon Transcribe searches for your specified criteria in this time segment.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "Negate",
                          "type": "boolean",
                          "description": "Set to TRUE to flag speech that does not contain interruptions. Set to FALSE to flag speech that contains interruptions.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "TranscriptFilter",
                      "type": "dict",
                      "description": "Flag the presence or absence of specific words or phrases in your Call Analytics transcription output. Refer to for more detail.",
                      "nested_items": [
                        {
                          "name": "TranscriptFilterType",
                          "type": "string",
                          "description": "Flag the presence or absence of an exact match to the phrases that you specify. For example, if you specify the phrase 'speak to a manager' as your Targets value, only that exact phrase is flagged.",
                          "nested_items": []
                        },
                        {
                          "name": "AbsoluteTimeRange",
                          "type": "dict",
                          "description": "Makes it possible to specify a time range (in milliseconds) in your audio, during which you want to search for the specified key words or phrases. See for more detail.",
                          "nested_items": [
                            {
                              "name": "StartTime",
                              "type": "integer",
                              "description": "The time, in milliseconds, when Amazon Transcribe starts searching for the specified criteria in your audio. If you include StartTime in your request, you must also include EndTime.",
                              "nested_items": []
                            },
                            {
                              "name": "EndTime",
                              "type": "integer",
                              "description": "The time, in milliseconds, when Amazon Transcribe stops searching for the specified criteria in your audio. If you include EndTime in your request, you must also include StartTime.",
                              "nested_items": []
                            },
                            {
                              "name": "First",
                              "type": "integer",
                              "description": "The time, in milliseconds, from the start of your media file until the specified value. Amazon Transcribe searches for your specified criteria in this time segment.",
                              "nested_items": []
                            },
                            {
                              "name": "Last",
                              "type": "integer",
                              "description": "The time, in milliseconds, from the specified value until the end of your media file. Amazon Transcribe searches for your specified criteria in this time segment.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "RelativeTimeRange",
                          "type": "dict",
                          "description": "Makes it possible to specify a time range (in percentage) in your media file, during which you want to search for the specified key words or phrases. See for more detail.",
                          "nested_items": [
                            {
                              "name": "StartPercentage",
                              "type": "integer",
                              "description": "The time, in percentage, when Amazon Transcribe starts searching for the specified criteria in your media file. If you include StartPercentage in your request, you must also include EndPercentage.",
                              "nested_items": []
                            },
                            {
                              "name": "EndPercentage",
                              "type": "integer",
                              "description": "The time, in percentage, when Amazon Transcribe stops searching for the specified criteria in your media file. If you include EndPercentage in your request, you must also include StartPercentage.",
                              "nested_items": []
                            },
                            {
                              "name": "First",
                              "type": "integer",
                              "description": "The time, in percentage, from the start of your media file until the specified value. Amazon Transcribe searches for your specified criteria in this time segment.",
                              "nested_items": []
                            },
                            {
                              "name": "Last",
                              "type": "integer",
                              "description": "The time, in percentage, from the specified value until the end of your media file. Amazon Transcribe searches for your specified criteria in this time segment.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "ParticipantRole",
                          "type": "string",
                          "description": "Specify the participant that you want to flag. Omitting this parameter is equivalent to specifying both participants.",
                          "nested_items": []
                        },
                        {
                          "name": "Negate",
                          "type": "boolean",
                          "description": "Set to TRUE to flag the absence of the phrase that you specified in your request. Set to FALSE to flag the presence of the phrase that you specified in your request.",
                          "nested_items": []
                        },
                        {
                          "name": "Targets",
                          "type": "list",
                          "description": "Specify the phrases that you want to flag.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "SentimentFilter",
                      "type": "dict",
                      "description": "Flag the presence or absence of specific sentiments in your Call Analytics transcription output. Refer to for more detail.",
                      "nested_items": [
                        {
                          "name": "Sentiments",
                          "type": "list",
                          "description": "Specify the sentiments that you want to flag.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "AbsoluteTimeRange",
                          "type": "dict",
                          "description": "Makes it possible to specify a time range (in milliseconds) in your audio, during which you want to search for the specified sentiments. See for more detail.",
                          "nested_items": [
                            {
                              "name": "StartTime",
                              "type": "integer",
                              "description": "The time, in milliseconds, when Amazon Transcribe starts searching for the specified criteria in your audio. If you include StartTime in your request, you must also include EndTime.",
                              "nested_items": []
                            },
                            {
                              "name": "EndTime",
                              "type": "integer",
                              "description": "The time, in milliseconds, when Amazon Transcribe stops searching for the specified criteria in your audio. If you include EndTime in your request, you must also include StartTime.",
                              "nested_items": []
                            },
                            {
                              "name": "First",
                              "type": "integer",
                              "description": "The time, in milliseconds, from the start of your media file until the specified value. Amazon Transcribe searches for your specified criteria in this time segment.",
                              "nested_items": []
                            },
                            {
                              "name": "Last",
                              "type": "integer",
                              "description": "The time, in milliseconds, from the specified value until the end of your media file. Amazon Transcribe searches for your specified criteria in this time segment.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "RelativeTimeRange",
                          "type": "dict",
                          "description": "Makes it possible to specify a time range (in percentage) in your media file, during which you want to search for the specified sentiments. See for more detail.",
                          "nested_items": [
                            {
                              "name": "StartPercentage",
                              "type": "integer",
                              "description": "The time, in percentage, when Amazon Transcribe starts searching for the specified criteria in your media file. If you include StartPercentage in your request, you must also include EndPercentage.",
                              "nested_items": []
                            },
                            {
                              "name": "EndPercentage",
                              "type": "integer",
                              "description": "The time, in percentage, when Amazon Transcribe stops searching for the specified criteria in your media file. If you include EndPercentage in your request, you must also include StartPercentage.",
                              "nested_items": []
                            },
                            {
                              "name": "First",
                              "type": "integer",
                              "description": "The time, in percentage, from the start of your media file until the specified value. Amazon Transcribe searches for your specified criteria in this time segment.",
                              "nested_items": []
                            },
                            {
                              "name": "Last",
                              "type": "integer",
                              "description": "The time, in percentage, from the specified value until the end of your media file. Amazon Transcribe searches for your specified criteria in this time segment.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "ParticipantRole",
                          "type": "string",
                          "description": "Specify the participant that you want to flag. Omitting this parameter is equivalent to specifying both participants.",
                          "nested_items": []
                        },
                        {
                          "name": "Negate",
                          "type": "boolean",
                          "description": "Set to TRUE to flag the sentiments that you didn't include in your request. Set to FALSE to flag the sentiments that you specified in your request.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "CreateTime",
              "type": "datetime",
              "description": "The date and time the specified Call Analytics category was created.",
              "nested_items": []
            },
            {
              "name": "LastUpdateTime",
              "type": "datetime",
              "description": "The date and time the specified Call Analytics category was last updated.",
              "nested_items": []
            },
            {
              "name": "Tags",
              "type": "list",
              "description": "The tags, each in the form of a key:value pair, assigned to the specified call analytics category.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Key",
                      "type": "string",
                      "description": "The first part of a key:value pair that forms a tag associated with a given resource. For example, in the tag Department:Sales, the key is --\u0098Department'.",
                      "nested_items": []
                    },
                    {
                      "name": "Value",
                      "type": "string",
                      "description": "The second part of a key:value pair that forms a tag associated with a given resource. For example, in the tag Department:Sales, the value is --\u0098Sales'.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "InputType",
              "type": "string",
              "description": "The input type associated with the specified category. POST_CALL refers to a category that is applied to batch transcriptions; REAL_TIME refers to a category that is applied to streaming transcriptions.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}