{
  "method_name": "get_vocabulary",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/transcribe/client/get_vocabulary.html",
  "description": "Provides information about the specified custom vocabulary. To view the status of the specified custom vocabulary, check the VocabularyState field. If the status is READY, your custom vocabulary is available to use. If the status is FAILED, FailureReason provides details on why your custom vocabulary failed. To get a list of your custom vocabularies, use the operation.",
  "parameters": [
    {
      "name": "VocabularyName",
      "type": "string",
      "required": true,
      "description": "The name of the custom vocabulary you want information about. Custom vocabulary names are case sensitive.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "VocabularyName",
          "type": "string",
          "description": "The name of the custom vocabulary you requested information about.",
          "nested_items": []
        },
        {
          "name": "LanguageCode",
          "type": "string",
          "description": "The language code you selected for your custom vocabulary.",
          "nested_items": []
        },
        {
          "name": "VocabularyState",
          "type": "string",
          "description": "The processing state of your custom vocabulary. If the state is READY, you can use the custom vocabulary in a StartTranscriptionJob request.",
          "nested_items": []
        },
        {
          "name": "LastModifiedTime",
          "type": "datetime",
          "description": "The date and time the specified custom vocabulary was last modified.",
          "nested_items": []
        },
        {
          "name": "FailureReason",
          "type": "string",
          "description": "If VocabularyState is FAILED, FailureReason contains information about why the custom vocabulary request failed. See also: Common Errors.",
          "nested_items": []
        },
        {
          "name": "DownloadUri",
          "type": "string",
          "description": "The Amazon S3 location where the custom vocabulary is stored; use this URI to view or download the custom vocabulary.",
          "nested_items": []
        }
      ]
    }
  ]
}