{
  "method_name": "get_call_analytics_job",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/transcribe/client/get_call_analytics_job.html",
  "description": "Provides information about the specified Call Analytics job. To view the job's status, refer to CallAnalyticsJobStatus. If the status is COMPLETED, the job is finished. You can find your completed transcript at the URI specified in TranscriptFileUri. If the status is FAILED, FailureReason provides details on why your transcription job failed. If you enabled personally identifiable information (PII) redaction, the redacted transcript appears at the location specified in RedactedTranscriptFileUri. If you chose to redact the audio in your media file, you can find your redacted media file at the location specified in RedactedMediaFileUri. To get a list of your Call Analytics jobs, use the operation.",
  "parameters": [
    {
      "name": "CallAnalyticsJobName",
      "type": "string",
      "required": true,
      "description": "The name of the Call Analytics job you want information about. Job names are case sensitive.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "CallAnalyticsJob",
          "type": "dict",
          "description": "Provides detailed information about the specified Call Analytics job, including job status and, if applicable, failure reason.",
          "nested_items": [
            {
              "name": "CallAnalyticsJobName",
              "type": "string",
              "description": "The name of the Call Analytics job. Job names are case sensitive and must be unique within an Amazon Web Services account.",
              "nested_items": []
            },
            {
              "name": "CallAnalyticsJobStatus",
              "type": "string",
              "description": "Provides the status of the specified Call Analytics job.",
              "nested_items": []
            },
            {
              "name": "CallAnalyticsJobDetails",
              "type": "dict",
              "description": "Provides detailed information about a call analytics job, including information about skipped analytics features.",
              "nested_items": [
                {
                  "name": "Skipped",
                  "type": "list",
                  "description": "Contains information about any skipped analytics features during the analysis of a call analytics job.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Feature",
                          "type": "string",
                          "description": "Indicates the type of analytics feature that was skipped during the analysis of a call analytics job.",
                          "nested_items": []
                        },
                        {
                          "name": "ReasonCode",
                          "type": "string",
                          "description": "Provides a code indicating the reason why a specific analytics feature was skipped during the analysis of a call analytics job.",
                          "nested_items": []
                        },
                        {
                          "name": "Message",
                          "type": "string",
                          "description": "Contains additional information or a message explaining why a specific analytics feature was skipped during the analysis of a call analytics job.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "LanguageCode",
              "type": "string",
              "description": "The language code used to create your Call Analytics job. For a list of supported languages and their associated language codes, refer to the Supported languages table.",
              "nested_items": []
            },
            {
              "name": "MediaSampleRateHertz",
              "type": "integer",
              "description": "The sample rate, in hertz, of the audio track in your input media file.",
              "nested_items": []
            },
            {
              "name": "MediaFormat",
              "type": "string",
              "description": "The format of the input media file.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "MediaFileUri",
                  "type": "string",
                  "description": "The Amazon S3 location of the media file you want to transcribe. For example:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "s3://DOC-EXAMPLE-BUCKET/my-media-file.flac.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "s3://DOC-EXAMPLE-BUCKET/media-files/my-media-file.flac.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "RedactedMediaFileUri",
                  "type": "string",
                  "description": "The Amazon S3 location of the media file you want to redact. For example:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "s3://DOC-EXAMPLE-BUCKET/my-media-file.flac.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "s3://DOC-EXAMPLE-BUCKET/media-files/my-media-file.flac.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "Transcript",
              "type": "dict",
              "description": "Provides you with the Amazon S3 URI you can use to access your transcript.",
              "nested_items": [
                {
                  "name": "TranscriptFileUri",
                  "type": "string",
                  "description": "The Amazon S3 location of your transcript. You can use this URI to access or download your transcript.",
                  "nested_items": []
                },
                {
                  "name": "RedactedTranscriptFileUri",
                  "type": "string",
                  "description": "The Amazon S3 location of your redacted transcript. You can use this URI to access or download your transcript.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "StartTime",
              "type": "datetime",
              "description": "The date and time the specified Call Analytics job began processing.",
              "nested_items": []
            },
            {
              "name": "CreationTime",
              "type": "datetime",
              "description": "The date and time the specified Call Analytics job request was made.",
              "nested_items": []
            },
            {
              "name": "CompletionTime",
              "type": "datetime",
              "description": "The date and time the specified Call Analytics job finished processing.",
              "nested_items": []
            },
            {
              "name": "FailureReason",
              "type": "string",
              "description": "If CallAnalyticsJobStatus is FAILED, FailureReason contains information about why the Call Analytics job request failed.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "Unsupported media format. The media format specified in MediaFormat isn't valid. Refer to refer to the MediaFormat parameter for a list of supported formats.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "The media format provided does not match the detected media format. The media format specified in MediaFormat doesn't match the format of the input file. Check the media format of your media file and correct the specified value.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Invalid sample rate for audio file. The sample rate specified in MediaSampleRateHertz isn't valid. The sample rate must be between 8,000 and 48,000 hertz.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "The sample rate provided does not match the detected sample rate. The sample rate specified in MediaSampleRateHertz doesn't match the sample rate detected in your input media file. Check the sample rate of your media file and correct the specified value.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Invalid file size: file size too large. The size of your media file is larger than what Amazon Transcribe can process. For more information, refer to Service quotas.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Invalid number of channels: number of channels too large. Your audio contains more channels than Amazon Transcribe is able to process. For more information, refer to Service quotas.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "DataAccessRoleArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) you included in your request.",
              "nested_items": []
            },
            {
              "name": "IdentifiedLanguageScore",
              "type": "float",
              "description": "The confidence score associated with the language identified in your media file.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "VocabularyName",
                  "type": "string",
                  "description": "The name of the custom vocabulary you want to include in your Call Analytics transcription request. Custom vocabulary names are case sensitive.",
                  "nested_items": []
                },
                {
                  "name": "VocabularyFilterName",
                  "type": "string",
                  "description": "The name of the custom vocabulary filter you want to include in your Call Analytics transcription request. Custom vocabulary filter names are case sensitive.",
                  "nested_items": []
                },
                {
                  "name": "VocabularyFilterMethod",
                  "type": "string",
                  "description": "Specify how you want your custom vocabulary filter applied to your transcript.",
                  "nested_items": []
                },
                {
                  "name": "LanguageModelName",
                  "type": "string",
                  "description": "The name of the custom language model you want to use when processing your Call Analytics job. Note that custom language model names are case sensitive.",
                  "nested_items": []
                },
                {
                  "name": "ContentRedaction",
                  "type": "dict",
                  "description": "Makes it possible to redact or flag specified personally identifiable information (PII) in your transcript. If you use ContentRedaction, you must also include the sub-parameters: RedactionOutput and RedactionType. You can optionally include PiiEntityTypes to choose which types of PII you want to redact.",
                  "nested_items": [
                    {
                      "name": "RedactionType",
                      "type": "string",
                      "description": "Specify the category of information you want to redact; PII (personally identifiable information) is the only valid value. You can use PiiEntityTypes to choose which types of PII you want to redact. If you do not include PiiEntityTypes in your request, all PII is redacted.",
                      "nested_items": []
                    },
                    {
                      "name": "RedactionOutput",
                      "type": "string",
                      "description": "Specify if you want only a redacted transcript, or if you want a redacted and an unredacted transcript.",
                      "nested_items": []
                    },
                    {
                      "name": "PiiEntityTypes",
                      "type": "list",
                      "description": "Specify which types of personally identifiable information (PII) you want to redact in your transcript. You can include as many types as you'd like, or you can select ALL. If you do not include PiiEntityTypes in your request, all PII is redacted.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "LanguageOptions",
                  "type": "list",
                  "description": "You can specify two or more language codes that represent the languages you think may be present in your media. Including more than five is not recommended. If you're unsure what languages are present, do not include this parameter.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "LanguageIdSettings",
                  "type": "dict",
                  "description": "If using automatic language identification in your request and you want to apply a custom language model, a custom vocabulary, or a custom vocabulary filter, include LanguageIdSettings with the relevant sub-parameters ( VocabularyName, LanguageModelName, and VocabularyFilterName).",
                  "nested_items": [
                    {
                      "name": "do not",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "VocabularyName",
                              "type": "string",
                              "description": "The name of the custom vocabulary you want to use when processing your transcription job. Custom vocabulary names are case sensitive.",
                              "nested_items": []
                            },
                            {
                              "name": "VocabularyFilterName",
                              "type": "string",
                              "description": "The name of the custom vocabulary filter you want to use when processing your transcription job. Custom vocabulary filter names are case sensitive.",
                              "nested_items": []
                            },
                            {
                              "name": "LanguageModelName",
                              "type": "string",
                              "description": "The name of the custom language model you want to use when processing your transcription job. Note that custom language model names are case sensitive.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "Summarization",
                  "type": "dict",
                  "description": "Contains GenerateAbstractiveSummary, which is a required parameter if you want to enable Generative call summarization in your Call Analytics request.",
                  "nested_items": [
                    {
                      "name": "GenerateAbstractiveSummary",
                      "type": "boolean",
                      "description": "Enables Generative call summarization in your Call Analytics request.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "ChannelDefinitions",
              "type": "list",
              "description": "Indicates which speaker is on which channel.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "ChannelId",
                      "type": "integer",
                      "description": "Specify the audio channel you want to define.",
                      "nested_items": []
                    },
                    {
                      "name": "ParticipantRole",
                      "type": "string",
                      "description": "Specify the speaker you want to define. Omitting this parameter is equivalent to specifying both participants.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "Tags",
              "type": "list",
              "description": "The tags, each in the form of a key:value pair, assigned to the specified call analytics job.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Key",
                      "type": "string",
                      "description": "The first part of a key:value pair that forms a tag associated with a given resource. For example, in the tag Department:Sales, the key is --\u0098Department'.",
                      "nested_items": []
                    },
                    {
                      "name": "Value",
                      "type": "string",
                      "description": "The second part of a key:value pair that forms a tag associated with a given resource. For example, in the tag Department:Sales, the value is --\u0098Sales'.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}