{
  "method_name": "start_medical_transcription_job",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/transcribe/client/start_medical_transcription_job.html",
  "description": "Transcribes the audio from a medical dictation or conversation and applies any additional Request Parameters you choose to include in your request. In addition to many standard transcription features, Amazon Transcribe Medical provides you with a robust medical vocabulary and, optionally, content identification, which adds flags to personal health information (PHI). To learn more about these features, refer to How Amazon Transcribe Medical works. To make a StartMedicalTranscriptionJob request, you must first upload your media file into an Amazon S3 bucket; you can then specify the Amazon S3 location of the file using the Media parameter. You must include the following parameters in your StartMedicalTranscriptionJob request:",
  "parameters": [
    {
      "name": "MedicalTranscriptionJobName",
      "type": "string",
      "required": true,
      "description": "A unique name, chosen by you, for your medical transcription job. The name that you specify is also used as the default name of your transcription output file. If you want to specify a different name for your transcription output, use the OutputKey parameter. This name is case sensitive, cannot contain spaces, and must be unique within an Amazon Web Services account. If you try to create a new job with the same name as an existing job, you get a ConflictException error.",
      "nested_params": []
    },
    {
      "name": "LanguageCode",
      "type": "string",
      "required": true,
      "description": "The language code that represents the language spoken in the input media file. US English ( en-US) is the only valid value for medical transcription jobs. Any other value you enter for language code results in a BadRequestException error.",
      "nested_params": []
    },
    {
      "name": "MediaSampleRateHertz",
      "type": "integer",
      "required": false,
      "description": "The sample rate, in hertz, of the audio track in your input media file. If you do not specify the media sample rate, Amazon Transcribe Medical determines it for you. If you specify the sample rate, it must match the rate detected by Amazon Transcribe Medical; if there's a mismatch between the value that you specify and the value detected, your job fails. Therefore, in most cases, it's advised to omit MediaSampleRateHertz and let Amazon Transcribe Medical determine the sample rate.",
      "nested_params": []
    },
    {
      "name": "MediaFormat",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Media",
      "type": "dict",
      "required": true,
      "description": "Describes the Amazon S3 location of the media file you want to use in your request. For information on supported media formats, refer to the MediaFormat parameter or the Media formats section in the Amazon S3 Developer Guide. MediaFileUri (string) --- The Amazon S3 location of the media file you want to transcribe. For example: s3://DOC-EXAMPLE-BUCKET/my-media-file.flac s3://DOC-EXAMPLE-BUCKET/media-files/my-media-file.flac Note that the Amazon S3 bucket that contains your input media must be located in the same Amazon Web Services Region where you're making your transcription request. RedactedMediaFileUri (string) --- The Amazon S3 location of the media file you want to redact. For example: s3://DOC-EXAMPLE-BUCKET/my-media-file.flac s3://DOC-EXAMPLE-BUCKET/media-files/my-media-file.flac Note that the Amazon S3 bucket that contains your input media must be located in the same Amazon Web Services Region where you're making your transcription request.",
      "nested_params": [
        {
          "name": "MediaFileUri",
          "type": "string",
          "required": false,
          "description": "The Amazon S3 location of the media file you want to transcribe. For example:",
          "nested_params": []
        },
        {
          "name": "RedactedMediaFileUri",
          "type": "string",
          "required": false,
          "description": "The Amazon S3 location of the media file you want to redact. For example:",
          "nested_params": []
        }
      ]
    },
    {
      "name": "OutputBucketName",
      "type": "string",
      "required": true,
      "description": "The name of the Amazon S3 bucket where you want your medical transcription output stored. Do not include the S3:// prefix of the specified bucket. If you want your output to go to a sub-folder of this bucket, specify it using the OutputKey parameter; OutputBucketName only accepts the name of a bucket. For example, if you want your output stored in S3://DOC-EXAMPLE-BUCKET, set OutputBucketName to DOC-EXAMPLE-BUCKET. However, if you want your output stored in S3://DOC-EXAMPLE-BUCKET/test-files/, set OutputBucketName to DOC-EXAMPLE-BUCKET and OutputKey to test-files/. Note that Amazon Transcribe must have permission to use the specified location. You can change Amazon S3 permissions using the Amazon Web Services Management Console. See also Permissions Required for IAM User Roles.",
      "nested_params": []
    },
    {
      "name": "OutputKey",
      "type": "string",
      "required": false,
      "description": "Use in combination with OutputBucketName to specify the output location of your transcript and, optionally, a unique name for your output file. The default name for your transcription output is the same as the name you specified for your medical transcription job ( MedicalTranscriptionJobName). Here are some examples of how you can use OutputKey: If you specify --\u0098DOC-EXAMPLE-BUCKET' as the OutputBucketName and --\u0098my-transcript.json' as the OutputKey, your transcription output path is s3://DOC-EXAMPLE-BUCKET/my-transcript.json. If you specify --\u0098my-first-transcription' as the MedicalTranscriptionJobName, --\u0098DOC-EXAMPLE-BUCKET' as the OutputBucketName, and --\u0098my-transcript' as the OutputKey, your transcription output path is s3://DOC-EXAMPLE-BUCKET/my-transcript/my-first-transcription.json. If you specify --\u0098DOC-EXAMPLE-BUCKET' as the OutputBucketName and --\u0098test-files/my-transcript.json' as the OutputKey, your transcription output path is s3://DOC-EXAMPLE-BUCKET/test-files/my-transcript.json. If you specify --\u0098my-first-transcription' as the MedicalTranscriptionJobName, --\u0098DOC-EXAMPLE-BUCKET' as the OutputBucketName, and --\u0098test-files/my-transcript' as the OutputKey, your transcription output path is s3://DOC-EXAMPLE-BUCKET/test-files/my-transcript/my-first-transcription.json. If you specify the name of an Amazon S3 bucket sub-folder that doesn't exist, one is created for you.",
      "nested_params": []
    },
    {
      "name": "OutputEncryptionKMSKeyId",
      "type": "string",
      "required": false,
      "description": "The KMS key you want to use to encrypt your medical transcription output. If using a key located in the current Amazon Web Services account, you can specify your KMS key in one of four ways: Use the KMS key ID itself. For example, 1234abcd-12ab-34cd-56ef-1234567890ab. Use an alias for the KMS key ID. For example, alias/ExampleAlias. Use the Amazon Resource Name (ARN) for the KMS key ID. For example, arn:aws:kms:region:account-ID:key/1234abcd-12ab-34cd-56ef-1234567890ab. Use the ARN for the KMS key alias. For example, arn:aws:kms:region:account-ID:alias/ExampleAlias. If using a key located in a different Amazon Web Services account than the current Amazon Web Services account, you can specify your KMS key in one of two ways: Use the ARN for the KMS key ID. If you do not specify an encryption key, your output is encrypted with the default Amazon S3 key (SSE-S3). If you specify a KMS key to encrypt your output, you must also specify an output location using the OutputLocation parameter. Note that the role making the request must have permission to use the specified KMS key.",
      "nested_params": []
    },
    {
      "name": "KMSEncryptionContext",
      "type": "dict",
      "required": false,
      "description": "A map of plain text, non-secret key:value pairs, known as encryption context pairs, that provide an added layer of security for your data. For more information, see KMS encryption context and Asymmetric keys in KMS. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "Settings",
      "type": "dict",
      "required": false,
      "description": "Specify additional optional settings in your request, including channel identification, alternative transcriptions, and speaker partitioning. You can use that to apply custom vocabularies to your transcription job. ShowSpeakerLabels (boolean) --- Enables speaker partitioning (diarization) in your transcription output. Speaker partitioning labels the speech from individual speakers in your media file. If you enable ShowSpeakerLabels in your request, you must also include MaxSpeakerLabels. For more information, see Partitioning speakers (diarization). MaxSpeakerLabels (integer) --- Specify the maximum number of speakers you want to partition in your media. Note that if your media contains more speakers than the specified number, multiple speakers are treated as a single speaker. If you specify the MaxSpeakerLabels field, you must set the ShowSpeakerLabels field to true. ChannelIdentification (boolean) --- Enables channel identification in multi-channel audio. Channel identification transcribes the audio on each channel independently, then appends the output for each channel into one transcript. If you have multi-channel audio and do not enable channel identification, your audio is transcribed in a continuous manner and your transcript does not separate the speech by channel. For more information, see Transcribing multi-channel audio. ShowAlternatives (boolean) --- To include alternative transcriptions within your transcription output, include ShowAlternatives in your transcription request. If you include ShowAlternatives, you must also include MaxAlternatives, which is the maximum number of alternative transcriptions you want Amazon Transcribe Medical to generate. For more information, see Alternative transcriptions. MaxAlternatives (integer) --- Indicate the maximum number of alternative transcriptions you want Amazon Transcribe Medical to include in your transcript. If you select a number greater than the number of alternative transcriptions generated by Amazon Transcribe Medical, only the actual number of alternative transcriptions are included. If you include MaxAlternatives in your request, you must also include ShowAlternatives with a value of true. VocabularyName (string) --- The name of the custom vocabulary you want to use when processing your medical transcription job. Custom vocabulary names are case sensitive. The language of the specified custom vocabulary must match the language code that you specify in your transcription request. If the languages do not match, the custom vocabulary isn't applied. There are no errors or warnings associated with a language mismatch. US English ( en-US) is the only valid language for Amazon Transcribe Medical.",
      "nested_params": [
        {
          "name": "ShowSpeakerLabels",
          "type": "boolean",
          "required": false,
          "description": "Enables speaker partitioning (diarization) in your transcription output. Speaker partitioning labels the speech from individual speakers in your media file. If you enable ShowSpeakerLabels in your request, you must also include MaxSpeakerLabels. For more information, see Partitioning speakers (diarization).",
          "nested_params": []
        },
        {
          "name": "MaxSpeakerLabels",
          "type": "integer",
          "required": false,
          "description": "Specify the maximum number of speakers you want to partition in your media. Note that if your media contains more speakers than the specified number, multiple speakers are treated as a single speaker. If you specify the MaxSpeakerLabels field, you must set the ShowSpeakerLabels field to true.",
          "nested_params": []
        },
        {
          "name": "ChannelIdentification",
          "type": "boolean",
          "required": false,
          "description": "Enables channel identification in multi-channel audio. Channel identification transcribes the audio on each channel independently, then appends the output for each channel into one transcript. If you have multi-channel audio and do not enable channel identification, your audio is transcribed in a continuous manner and your transcript does not separate the speech by channel. For more information, see Transcribing multi-channel audio.",
          "nested_params": []
        },
        {
          "name": "ShowAlternatives",
          "type": "boolean",
          "required": false,
          "description": "To include alternative transcriptions within your transcription output, include ShowAlternatives in your transcription request. If you include ShowAlternatives, you must also include MaxAlternatives, which is the maximum number of alternative transcriptions you want Amazon Transcribe Medical to generate. For more information, see Alternative transcriptions.",
          "nested_params": []
        },
        {
          "name": "MaxAlternatives",
          "type": "integer",
          "required": false,
          "description": "Indicate the maximum number of alternative transcriptions you want Amazon Transcribe Medical to include in your transcript. If you select a number greater than the number of alternative transcriptions generated by Amazon Transcribe Medical, only the actual number of alternative transcriptions are included. If you include MaxAlternatives in your request, you must also include ShowAlternatives with a value of true. For more information, see Alternative transcriptions.",
          "nested_params": []
        },
        {
          "name": "VocabularyName",
          "type": "string",
          "required": false,
          "description": "The name of the custom vocabulary you want to use when processing your medical transcription job. Custom vocabulary names are case sensitive. The language of the specified custom vocabulary must match the language code that you specify in your transcription request. If the languages do not match, the custom vocabulary isn't applied. There are no errors or warnings associated with a language mismatch. US English ( en-US) is the only valid language for Amazon Transcribe Medical.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ContentIdentificationType",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Specialty",
      "type": "string",
      "required": true,
      "description": "Specify the predominant medical specialty represented in your media. For batch transcriptions, PRIMARYCARE is the only valid value. If you require additional specialties, refer to .",
      "nested_params": []
    },
    {
      "name": "Type",
      "type": "string",
      "required": true,
      "description": "Specify whether your input media contains only one person ( DICTATION) or contains a conversation between two people ( CONVERSATION). For example, DICTATION could be used for a medical professional wanting to transcribe voice memos; CONVERSATION could be used for transcribing the doctor-patient dialogue during the patient's office visit.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "Adds one or more custom tags, each in the form of a key:value pair, to a new medical transcription job at the time you start this new job. To learn more about using tags with Amazon Transcribe, refer to Tagging resources. (dict) --- Adds metadata, in the form of a key:value pair, to the specified resource. For example, you could add the tag Department:Sales to a resource to indicate that it pertains to your organization's sales department. You can also use tags for tag-based access control. To learn more about tagging, see Tagging resources. The first part of a key:value pair that forms a tag associated with a given resource. For example, in the tag Department:Sales, the key is --\u0098Department'. The second part of a key:value pair that forms a tag associated with a given resource. For example, in the tag Department:Sales, the value is --\u0098Sales'. Note that you can set the value of a tag to an empty string, but you can't set the value of a tag to null. Omitting the tag value is the same as using an empty string.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The first part of a key:value pair that forms a tag associated with a given resource. For example, in the tag Department:Sales, the key is --\u0098Department'.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The second part of a key:value pair that forms a tag associated with a given resource. For example, in the tag Department:Sales, the value is --\u0098Sales'. Note that you can set the value of a tag to an empty string, but you can't set the value of a tag to null. Omitting the tag value is the same as using an empty string.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "MedicalTranscriptionJob",
          "type": "dict",
          "description": "Provides detailed information about the current medical transcription job, including job status and, if applicable, failure reason.",
          "nested_items": [
            {
              "name": "MedicalTranscriptionJobName",
              "type": "string",
              "description": "The name of the medical transcription job. Job names are case sensitive and must be unique within an Amazon Web Services account.",
              "nested_items": []
            },
            {
              "name": "TranscriptionJobStatus",
              "type": "string",
              "description": "Provides the status of the specified medical transcription job.",
              "nested_items": []
            },
            {
              "name": "LanguageCode",
              "type": "string",
              "description": "The language code used to create your medical transcription job. US English ( en-US) is the only supported language for medical transcriptions.",
              "nested_items": []
            },
            {
              "name": "MediaSampleRateHertz",
              "type": "integer",
              "description": "The sample rate, in hertz, of the audio track in your input media file.",
              "nested_items": []
            },
            {
              "name": "MediaFormat",
              "type": "string",
              "description": "The format of the input media file.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "MediaFileUri",
                  "type": "string",
                  "description": "The Amazon S3 location of the media file you want to transcribe. For example:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "s3://DOC-EXAMPLE-BUCKET/my-media-file.flac.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "s3://DOC-EXAMPLE-BUCKET/media-files/my-media-file.flac.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "RedactedMediaFileUri",
                  "type": "string",
                  "description": "The Amazon S3 location of the media file you want to redact. For example:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "s3://DOC-EXAMPLE-BUCKET/my-media-file.flac.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "s3://DOC-EXAMPLE-BUCKET/media-files/my-media-file.flac.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "Transcript",
              "type": "dict",
              "description": "Provides you with the Amazon S3 URI you can use to access your transcript.",
              "nested_items": [
                {
                  "name": "TranscriptFileUri",
                  "type": "string",
                  "description": "The Amazon S3 location of your transcript. You can use this URI to access or download your transcript.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "StartTime",
              "type": "datetime",
              "description": "The date and time the specified medical transcription job began processing.",
              "nested_items": []
            },
            {
              "name": "CreationTime",
              "type": "datetime",
              "description": "The date and time the specified medical transcription job request was made.",
              "nested_items": []
            },
            {
              "name": "CompletionTime",
              "type": "datetime",
              "description": "The date and time the specified medical transcription job finished processing.",
              "nested_items": []
            },
            {
              "name": "FailureReason",
              "type": "string",
              "description": "If TranscriptionJobStatus is FAILED, FailureReason contains information about why the transcription job request failed.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "Unsupported media format. The media format specified in MediaFormat isn't valid. Refer to refer to the MediaFormat parameter for a list of supported formats.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "The media format provided does not match the detected media format. The media format specified in MediaFormat doesn't match the format of the input file. Check the media format of your media file and correct the specified value.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Invalid sample rate for audio file. The sample rate specified in MediaSampleRateHertz isn't valid. The sample rate must be between 16,000 and 48,000 hertz.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "The sample rate provided does not match the detected sample rate. The sample rate specified in MediaSampleRateHertz doesn't match the sample rate detected in your input media file. Check the sample rate of your media file and correct the specified value.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Invalid file size: file size too large. The size of your media file is larger than what Amazon Transcribe can process. For more information, refer to Service quotas.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Invalid number of channels: number of channels too large. Your audio contains more channels than Amazon Transcribe is able to process. For more information, refer to Service quotas.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ShowSpeakerLabels",
                  "type": "boolean",
                  "description": "Enables speaker partitioning (diarization) in your transcription output. Speaker partitioning labels the speech from individual speakers in your media file.",
                  "nested_items": []
                },
                {
                  "name": "MaxSpeakerLabels",
                  "type": "integer",
                  "description": "Specify the maximum number of speakers you want to partition in your media.",
                  "nested_items": []
                },
                {
                  "name": "ChannelIdentification",
                  "type": "boolean",
                  "description": "Enables channel identification in multi-channel audio.",
                  "nested_items": []
                },
                {
                  "name": "ShowAlternatives",
                  "type": "boolean",
                  "description": "To include alternative transcriptions within your transcription output, include ShowAlternatives in your transcription request.",
                  "nested_items": []
                },
                {
                  "name": "MaxAlternatives",
                  "type": "integer",
                  "description": "Indicate the maximum number of alternative transcriptions you want Amazon Transcribe Medical to include in your transcript.",
                  "nested_items": []
                },
                {
                  "name": "VocabularyName",
                  "type": "string",
                  "description": "The name of the custom vocabulary you want to use when processing your medical transcription job. Custom vocabulary names are case sensitive.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "ContentIdentificationType",
              "type": "string",
              "description": "Indicates whether content identification was enabled for your transcription request.",
              "nested_items": []
            },
            {
              "name": "Specialty",
              "type": "string",
              "description": "Describes the medical specialty represented in your media.",
              "nested_items": []
            },
            {
              "name": "Type",
              "type": "string",
              "description": "Indicates whether the input media is a dictation or a conversation, as specified in the StartMedicalTranscriptionJob request.",
              "nested_items": []
            },
            {
              "name": "Tags",
              "type": "list",
              "description": "The tags, each in the form of a key:value pair, assigned to the specified medical transcription job.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Key",
                      "type": "string",
                      "description": "The first part of a key:value pair that forms a tag associated with a given resource. For example, in the tag Department:Sales, the key is --\u0098Department'.",
                      "nested_items": []
                    },
                    {
                      "name": "Value",
                      "type": "string",
                      "description": "The second part of a key:value pair that forms a tag associated with a given resource. For example, in the tag Department:Sales, the value is --\u0098Sales'.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}