{
  "method_name": "start_transcription_job",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/transcribe/client/start_transcription_job.html",
  "description": "Transcribes the audio from a media file and applies any additional Request Parameters you choose to include in your request. To make a StartTranscriptionJob request, you must first upload your media file into an Amazon S3 bucket; you can then specify the Amazon S3 location of the file using the Media parameter. You must include the following parameters in your StartTranscriptionJob request:",
  "parameters": [
    {
      "name": "TranscriptionJobName",
      "type": "string",
      "required": true,
      "description": "A unique name, chosen by you, for your transcription job. The name that you specify is also used as the default name of your transcription output file. If you want to specify a different name for your transcription output, use the OutputKey parameter. This name is case sensitive, cannot contain spaces, and must be unique within an Amazon Web Services account. If you try to create a new job with the same name as an existing job, you get a ConflictException error.",
      "nested_params": []
    },
    {
      "name": "LanguageCode",
      "type": "string",
      "required": false,
      "description": "The language code that represents the language spoken in the input media file. If you're unsure of the language spoken in your media file, consider using IdentifyLanguage or IdentifyMultipleLanguages to enable automatic language identification. Note that you must include one of LanguageCode, IdentifyLanguage, or IdentifyMultipleLanguages in your request. If you include more than one of these parameters, your transcription job fails. For a list of supported languages and their associated language codes, refer to the Supported languages table.",
      "nested_params": []
    },
    {
      "name": "MediaSampleRateHertz",
      "type": "integer",
      "required": false,
      "description": "The sample rate, in hertz, of the audio track in your input media file. If you do not specify the media sample rate, Amazon Transcribe determines it for you. If you specify the sample rate, it must match the rate detected by Amazon Transcribe. If there's a mismatch between the value that you specify and the value detected, your job fails. In most cases, you can omit MediaSampleRateHertz and let Amazon Transcribe determine the sample rate.",
      "nested_params": []
    },
    {
      "name": "MediaFormat",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Media",
      "type": "dict",
      "required": true,
      "description": "Describes the Amazon S3 location of the media file you want to use in your request. MediaFileUri (string) --- The Amazon S3 location of the media file you want to transcribe. For example: s3://DOC-EXAMPLE-BUCKET/my-media-file.flac s3://DOC-EXAMPLE-BUCKET/media-files/my-media-file.flac Note that the Amazon S3 bucket that contains your input media must be located in the same Amazon Web Services Region where you're making your transcription request. RedactedMediaFileUri (string) --- The Amazon S3 location of the media file you want to redact. For example: s3://DOC-EXAMPLE-BUCKET/my-media-file.flac s3://DOC-EXAMPLE-BUCKET/media-files/my-media-file.flac Note that the Amazon S3 bucket that contains your input media must be located in the same Amazon Web Services Region where you're making your transcription request.",
      "nested_params": [
        {
          "name": "MediaFileUri",
          "type": "string",
          "required": false,
          "description": "The Amazon S3 location of the media file you want to transcribe. For example:",
          "nested_params": []
        },
        {
          "name": "RedactedMediaFileUri",
          "type": "string",
          "required": false,
          "description": "The Amazon S3 location of the media file you want to redact. For example:",
          "nested_params": []
        }
      ]
    },
    {
      "name": "OutputBucketName",
      "type": "string",
      "required": false,
      "description": "The name of the Amazon S3 bucket where you want your transcription output stored. Do not include the S3:// prefix of the specified bucket. If you want your output to go to a sub-folder of this bucket, specify it using the OutputKey parameter; OutputBucketName only accepts the name of a bucket. For example, if you want your output stored in S3://DOC-EXAMPLE-BUCKET, set OutputBucketName to DOC-EXAMPLE-BUCKET. However, if you want your output stored in S3://DOC-EXAMPLE-BUCKET/test-files/, set OutputBucketName to DOC-EXAMPLE-BUCKET and OutputKey to test-files/. Note that Amazon Transcribe must have permission to use the specified location. You can change Amazon S3 permissions using the Amazon Web Services Management Console. See also Permissions Required for IAM User Roles. If you do not specify OutputBucketName, your transcript is placed in a service-managed Amazon S3 bucket and you are provided with a URI to access your transcript.",
      "nested_params": []
    },
    {
      "name": "OutputKey",
      "type": "string",
      "required": false,
      "description": "Use in combination with OutputBucketName to specify the output location of your transcript and, optionally, a unique name for your output file. The default name for your transcription output is the same as the name you specified for your transcription job ( TranscriptionJobName). Here are some examples of how you can use OutputKey: If you specify --\u0098DOC-EXAMPLE-BUCKET' as the OutputBucketName and --\u0098my-transcript.json' as the OutputKey, your transcription output path is s3://DOC-EXAMPLE-BUCKET/my-transcript.json. If you specify --\u0098my-first-transcription' as the TranscriptionJobName, --\u0098DOC-EXAMPLE-BUCKET' as the OutputBucketName, and --\u0098my-transcript' as the OutputKey, your transcription output path is s3://DOC-EXAMPLE-BUCKET/my-transcript/my-first-transcription.json. If you specify --\u0098DOC-EXAMPLE-BUCKET' as the OutputBucketName and --\u0098test-files/my-transcript.json' as the OutputKey, your transcription output path is s3://DOC-EXAMPLE-BUCKET/test-files/my-transcript.json. If you specify --\u0098my-first-transcription' as the TranscriptionJobName, --\u0098DOC-EXAMPLE-BUCKET' as the OutputBucketName, and --\u0098test-files/my-transcript' as the OutputKey, your transcription output path is s3://DOC-EXAMPLE-BUCKET/test-files/my-transcript/my-first-transcription.json. If you specify the name of an Amazon S3 bucket sub-folder that doesn't exist, one is created for you.",
      "nested_params": []
    },
    {
      "name": "OutputEncryptionKMSKeyId",
      "type": "string",
      "required": false,
      "description": "The KMS key you want to use to encrypt your transcription output. If using a key located in the current Amazon Web Services account, you can specify your KMS key in one of four ways: Use the KMS key ID itself. For example, 1234abcd-12ab-34cd-56ef-1234567890ab. Use an alias for the KMS key ID. For example, alias/ExampleAlias. Use the Amazon Resource Name (ARN) for the KMS key ID. For example, arn:aws:kms:region:account-ID:key/1234abcd-12ab-34cd-56ef-1234567890ab. Use the ARN for the KMS key alias. For example, arn:aws:kms:region:account-ID:alias/ExampleAlias. If using a key located in a different Amazon Web Services account than the current Amazon Web Services account, you can specify your KMS key in one of two ways: Use the ARN for the KMS key ID. If you do not specify an encryption key, your output is encrypted with the default Amazon S3 key (SSE-S3). If you specify a KMS key to encrypt your output, you must also specify an output location using the OutputLocation parameter. Note that the role making the request must have permission to use the specified KMS key.",
      "nested_params": []
    },
    {
      "name": "KMSEncryptionContext",
      "type": "dict",
      "required": false,
      "description": "A map of plain text, non-secret key:value pairs, known as encryption context pairs, that provide an added layer of security for your data. For more information, see KMS encryption context and Asymmetric keys in KMS. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "Settings",
      "type": "dict",
      "required": false,
      "description": "Specify additional optional settings in your request, including channel identification, alternative transcriptions, speaker partitioning. You can use that to apply custom vocabularies and vocabulary filters. If you want to include a custom vocabulary or a custom vocabulary filter (or both) with your request but do not want to use automatic language identification, use Settings with the VocabularyName or VocabularyFilterName (or both) sub-parameter. If you're using automatic language identification with your request and want to include a custom language model, a custom vocabulary, or a custom vocabulary filter, use instead the  parameter with the LanguageModelName, VocabularyName or VocabularyFilterName sub-parameters. VocabularyName (string) --- The name of the custom vocabulary you want to use in your transcription job request. This name is case sensitive, cannot contain spaces, and must be unique within an Amazon Web Services account. ShowSpeakerLabels (boolean) --- Enables speaker partitioning (diarization) in your transcription output. Speaker partitioning labels the speech from individual speakers in your media file. If you enable ShowSpeakerLabels in your request, you must also include MaxSpeakerLabels. For more information, see Partitioning speakers (diarization). MaxSpeakerLabels (integer) --- Specify the maximum number of speakers you want to partition in your media. Note that if your media contains more speakers than the specified number, multiple speakers are treated as a single speaker. If you specify the MaxSpeakerLabels field, you must set the ShowSpeakerLabels field to true. ChannelIdentification (boolean) --- Enables channel identification in multi-channel audio. Channel identification transcribes the audio on each channel independently, then appends the output for each channel into one transcript. For more information, see Transcribing multi-channel audio. ShowAlternatives (boolean) --- To include alternative transcriptions within your transcription output, include ShowAlternatives in your transcription request. If you have multi-channel audio and do not enable channel identification, your audio is transcribed in a continuous manner and your transcript does not separate the speech by channel. If you include ShowAlternatives, you must also include MaxAlternatives, which is the maximum number of alternative transcriptions you want Amazon Transcribe to generate. For more information, see Alternative transcriptions. MaxAlternatives (integer) --- Indicate the maximum number of alternative transcriptions you want Amazon Transcribe to include in your transcript. If you select a number greater than the number of alternative transcriptions generated by Amazon Transcribe, only the actual number of alternative transcriptions are included. If you include MaxAlternatives in your request, you must also include ShowAlternatives with a value of true. VocabularyFilterName (string) --- The name of the custom vocabulary filter you want to use in your transcription job request. Note that if you include VocabularyFilterName in your request, you must also include VocabularyFilterMethod. VocabularyFilterMethod (string) --- Specify how you want your custom vocabulary filter applied to your transcript. To replace words with ***, choose mask. To delete words, choose remove. To flag words without changing them, choose tag.",
      "nested_params": [
        {
          "name": "VocabularyName",
          "type": "string",
          "required": false,
          "description": "The name of the custom vocabulary you want to use in your transcription job request. This name is case sensitive, cannot contain spaces, and must be unique within an Amazon Web Services account.",
          "nested_params": []
        },
        {
          "name": "ShowSpeakerLabels",
          "type": "boolean",
          "required": false,
          "description": "Enables speaker partitioning (diarization) in your transcription output. Speaker partitioning labels the speech from individual speakers in your media file. If you enable ShowSpeakerLabels in your request, you must also include MaxSpeakerLabels. For more information, see Partitioning speakers (diarization).",
          "nested_params": []
        },
        {
          "name": "MaxSpeakerLabels",
          "type": "integer",
          "required": false,
          "description": "Specify the maximum number of speakers you want to partition in your media. Note that if your media contains more speakers than the specified number, multiple speakers are treated as a single speaker. If you specify the MaxSpeakerLabels field, you must set the ShowSpeakerLabels field to true.",
          "nested_params": []
        },
        {
          "name": "ChannelIdentification",
          "type": "boolean",
          "required": false,
          "description": "Enables channel identification in multi-channel audio. Channel identification transcribes the audio on each channel independently, then appends the output for each channel into one transcript. For more information, see Transcribing multi-channel audio.",
          "nested_params": []
        },
        {
          "name": "ShowAlternatives",
          "type": "boolean",
          "required": false,
          "description": "To include alternative transcriptions within your transcription output, include ShowAlternatives in your transcription request. If you have multi-channel audio and do not enable channel identification, your audio is transcribed in a continuous manner and your transcript does not separate the speech by channel. If you include ShowAlternatives, you must also include MaxAlternatives, which is the maximum number of alternative transcriptions you want Amazon Transcribe to generate. For more information, see Alternative transcriptions.",
          "nested_params": []
        },
        {
          "name": "MaxAlternatives",
          "type": "integer",
          "required": false,
          "description": "Indicate the maximum number of alternative transcriptions you want Amazon Transcribe to include in your transcript. If you select a number greater than the number of alternative transcriptions generated by Amazon Transcribe, only the actual number of alternative transcriptions are included. If you include MaxAlternatives in your request, you must also include ShowAlternatives with a value of true. For more information, see Alternative transcriptions.",
          "nested_params": []
        },
        {
          "name": "VocabularyFilterName",
          "type": "string",
          "required": false,
          "description": "The name of the custom vocabulary filter you want to use in your transcription job request. This name is case sensitive, cannot contain spaces, and must be unique within an Amazon Web Services account. Note that if you include VocabularyFilterName in your request, you must also include VocabularyFilterMethod.",
          "nested_params": []
        },
        {
          "name": "VocabularyFilterMethod",
          "type": "string",
          "required": false,
          "description": "Specify how you want your custom vocabulary filter applied to your transcript. To replace words with ***, choose mask. To delete words, choose remove. To flag words without changing them, choose tag.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ModelSettings",
      "type": "dict",
      "required": false,
      "description": "Specify the custom language model you want to include with your transcription job. If you include ModelSettings in your request, you must include the LanguageModelName sub-parameter. For more information, see Custom language models. LanguageModelName (string) --- The name of the custom language model you want to use when processing your transcription job. Note that custom language model names are case sensitive. The language of the specified custom language model must match the language code that you specify in your transcription request. If the languages do not match, the custom language model isn't applied. There are no errors or warnings associated with a language mismatch.",
      "nested_params": [
        {
          "name": "LanguageModelName",
          "type": "string",
          "required": false,
          "description": "The name of the custom language model you want to use when processing your transcription job. Note that custom language model names are case sensitive. The language of the specified custom language model must match the language code that you specify in your transcription request. If the languages do not match, the custom language model isn't applied. There are no errors or warnings associated with a language mismatch.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "JobExecutionSettings",
      "type": "dict",
      "required": false,
      "description": "Makes it possible to control how your transcription job is processed. Currently, the only JobExecutionSettings modification you can choose is enabling job queueing using the AllowDeferredExecution sub-parameter. If you include JobExecutionSettings in your request, you must also include the sub-parameters: AllowDeferredExecution and DataAccessRoleArn. AllowDeferredExecution (boolean) --- Makes it possible to enable job queuing when your concurrent request limit is exceeded. When AllowDeferredExecution is set to true, transcription job requests are placed in a queue until the number of jobs falls below the concurrent request limit. If AllowDeferredExecution is set to false and the number of transcription job requests exceed the concurrent request limit, you get a LimitExceededException error. If you include AllowDeferredExecution in your request, you must also include DataAccessRoleArn. DataAccessRoleArn (string) --- The Amazon Resource Name (ARN) of an IAM role that has permissions to access the Amazon S3 bucket that contains your input files. If the role that you specify doesn't have the appropriate permissions to access the specified Amazon S3 location, your request fails. IAM role ARNs have the format arn:partition:iam::account:role/role-name-with-path. For example: arn:aws:iam::111122223333:role/Admin. For more information, see IAM ARNs. Note that if you include DataAccessRoleArn in your request, you must also include AllowDeferredExecution.",
      "nested_params": [
        {
          "name": "AllowDeferredExecution",
          "type": "boolean",
          "required": false,
          "description": "Makes it possible to enable job queuing when your concurrent request limit is exceeded. When AllowDeferredExecution is set to true, transcription job requests are placed in a queue until the number of jobs falls below the concurrent request limit. If AllowDeferredExecution is set to false and the number of transcription job requests exceed the concurrent request limit, you get a LimitExceededException error. If you include AllowDeferredExecution in your request, you must also include DataAccessRoleArn.",
          "nested_params": []
        },
        {
          "name": "DataAccessRoleArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of an IAM role that has permissions to access the Amazon S3 bucket that contains your input files. If the role that you specify doesn't have the appropriate permissions to access the specified Amazon S3 location, your request fails. IAM role ARNs have the format arn:partition:iam::account:role/role-name-with-path. For example: arn:aws:iam::111122223333:role/Admin. For more information, see IAM ARNs. Note that if you include DataAccessRoleArn in your request, you must also include AllowDeferredExecution.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ContentRedaction",
      "type": "dict",
      "required": true,
      "description": "Makes it possible to redact or flag specified personally identifiable information (PII) in your transcript. If you use ContentRedaction, you must also include the sub-parameters: RedactionOutput and RedactionType. You can optionally include PiiEntityTypes to choose which types of PII you want to redact. If you do not include PiiEntityTypes in your request, all PII is redacted. Specify the category of information you want to redact; PII (personally identifiable information) is the only valid value. You can use PiiEntityTypes to choose which types of PII you want to redact. Specify if you want only a redacted transcript, or if you want a redacted and an unredacted transcript. When you choose redacted Amazon Transcribe creates only a redacted transcript. When you choose redacted_and_unredacted Amazon Transcribe creates a redacted and an unredacted transcript (as two separate files). PiiEntityTypes (list) --- Specify which types of personally identifiable information (PII) you want to redact in your transcript. You can include as many types as you'd like, or you can select ALL. (string) ---",
      "nested_params": [
        {
          "name": "RedactionType",
          "type": "string",
          "required": false,
          "description": "Specify the category of information you want to redact; PII (personally identifiable information) is the only valid value. You can use PiiEntityTypes to choose which types of PII you want to redact. If you do not include PiiEntityTypes in your request, all PII is redacted.",
          "nested_params": []
        },
        {
          "name": "RedactionOutput",
          "type": "string",
          "required": false,
          "description": "Specify if you want only a redacted transcript, or if you want a redacted and an unredacted transcript. When you choose redacted Amazon Transcribe creates only a redacted transcript. When you choose redacted_and_unredacted Amazon Transcribe creates a redacted and an unredacted transcript (as two separate files).",
          "nested_params": []
        },
        {
          "name": "PiiEntityTypes",
          "type": "list",
          "required": false,
          "description": "Specify which types of personally identifiable information (PII) you want to redact in your transcript. You can include as many types as you'd like, or you can select ALL. If you do not include PiiEntityTypes in your request, all PII is redacted.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "IdentifyLanguage",
      "type": "boolean",
      "required": false,
      "description": "Enables automatic language identification in your transcription job request. Use this parameter if your media file contains only one language. If your media contains multiple languages, use IdentifyMultipleLanguages instead. If you include IdentifyLanguage, you can optionally include a list of language codes, using LanguageOptions, that you think may be present in your media file. Including LanguageOptions restricts IdentifyLanguage to only the language options that you specify, which can improve transcription accuracy. If you want to apply a custom language model, a custom vocabulary, or a custom vocabulary filter to your automatic language identification request, include LanguageIdSettings with the relevant sub-parameters ( VocabularyName, LanguageModelName, and VocabularyFilterName). If you include LanguageIdSettings, also include LanguageOptions. Note that you must include one of LanguageCode, IdentifyLanguage, or IdentifyMultipleLanguages in your request. If you include more than one of these parameters, your transcription job fails.",
      "nested_params": []
    },
    {
      "name": "IdentifyMultipleLanguages",
      "type": "boolean",
      "required": false,
      "description": "Enables automatic multi-language identification in your transcription job request. Use this parameter if your media file contains more than one language. If your media contains only one language, use IdentifyLanguage instead. If you include IdentifyMultipleLanguages, you can optionally include a list of language codes, using LanguageOptions, that you think may be present in your media file. Including LanguageOptions restricts IdentifyLanguage to only the language options that you specify, which can improve transcription accuracy. If you want to apply a custom vocabulary or a custom vocabulary filter to your automatic language identification request, include LanguageIdSettings with the relevant sub-parameters ( VocabularyName and VocabularyFilterName). If you include LanguageIdSettings, also include LanguageOptions. Note that you must include one of LanguageCode, IdentifyLanguage, or IdentifyMultipleLanguages in your request. If you include more than one of these parameters, your transcription job fails.",
      "nested_params": []
    },
    {
      "name": "LanguageOptions",
      "type": "list",
      "required": false,
      "description": "You can specify two or more language codes that represent the languages you think may be present in your media. Including more than five is not recommended. If you're unsure what languages are present, do not include this parameter. If you include LanguageOptions in your request, you must also include IdentifyLanguage. For more information, refer to Supported languages. To transcribe speech in Modern Standard Arabic ( ar-SA)in Amazon Web Services GovCloud (US) (US-West, us-gov-west-1), Amazon Web Services GovCloud (US) (US-East, us-gov-east-1), in Canada (Calgary) ca-west-1 and Africa (Cape Town) af-south-1, your media file must be encoded at a sample rate of 16,000 Hz or higher. (string) ---",
      "nested_params": []
    },
    {
      "name": "Subtitles",
      "type": "dict",
      "required": false,
      "description": "Produces subtitle files for your input media. You can specify WebVTT (.vtt) and SubRip (.srt) formats. Formats (list) --- Specify the output format for your subtitle file; if you select both WebVTT ( vtt) and SubRip ( srt) formats, two output files are generated. (string) --- OutputStartIndex (integer) --- Specify the starting value that is assigned to the first subtitle segment. The default start index for Amazon Transcribe is 0, which differs from the more widely used standard of 1. If you're uncertain which value to use, we recommend choosing 1, as this may improve compatibility with other services.",
      "nested_params": [
        {
          "name": "Formats",
          "type": "list",
          "required": false,
          "description": "Specify the output format for your subtitle file; if you select both WebVTT ( vtt) and SubRip ( srt) formats, two output files are generated.",
          "nested_params": []
        },
        {
          "name": "OutputStartIndex",
          "type": "integer",
          "required": false,
          "description": "Specify the starting value that is assigned to the first subtitle segment. The default start index for Amazon Transcribe is 0, which differs from the more widely used standard of 1. If you're uncertain which value to use, we recommend choosing 1, as this may improve compatibility with other services.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "Adds one or more custom tags, each in the form of a key:value pair, to a new transcription job at the time you start this new job. To learn more about using tags with Amazon Transcribe, refer to Tagging resources. (dict) --- Adds metadata, in the form of a key:value pair, to the specified resource. For example, you could add the tag Department:Sales to a resource to indicate that it pertains to your organization's sales department. You can also use tags for tag-based access control. To learn more about tagging, see Tagging resources. The first part of a key:value pair that forms a tag associated with a given resource. For example, in the tag Department:Sales, the key is --\u0098Department'. The second part of a key:value pair that forms a tag associated with a given resource. For example, in the tag Department:Sales, the value is --\u0098Sales'. Note that you can set the value of a tag to an empty string, but you can't set the value of a tag to null. Omitting the tag value is the same as using an empty string.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The first part of a key:value pair that forms a tag associated with a given resource. For example, in the tag Department:Sales, the key is --\u0098Department'.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The second part of a key:value pair that forms a tag associated with a given resource. For example, in the tag Department:Sales, the value is --\u0098Sales'. Note that you can set the value of a tag to an empty string, but you can't set the value of a tag to null. Omitting the tag value is the same as using an empty string.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "LanguageIdSettings",
      "type": "dict",
      "required": false,
      "description": "If using automatic language identification in your request and you want to apply a custom language model, a custom vocabulary, or a custom vocabulary filter, include LanguageIdSettings with the relevant sub-parameters ( VocabularyName, LanguageModelName, and VocabularyFilterName). Note that multi-language identification ( IdentifyMultipleLanguages) doesn't support custom language models. LanguageIdSettings supports two to five language codes. Each language code you include can have an associated custom language model, custom vocabulary, and custom vocabulary filter. The language codes that you specify must match the languages of the associated custom language models, custom vocabularies, and custom vocabulary filters. It's recommended that you include LanguageOptions when using LanguageIdSettings to ensure that the correct language dialect is identified. For example, if you specify a custom vocabulary that is in en-US but Amazon Transcribe determines that the language spoken in your media is en-AU, your custom vocabulary is not applied to your transcription. If you include LanguageOptions and include en-US as the only English language dialect, your custom vocabulary is applied to your transcription. If you want to include a custom language model with your request but do not want to use automatic language identification, use instead the  parameter with the LanguageModelName sub-parameter. If you want to include a custom vocabulary or a custom vocabulary filter (or both) with your request but do not want to use automatic language identification, use instead the  parameter with the VocabularyName or VocabularyFilterName (or both) sub-parameter. (string) --- (dict) --- If using automatic language identification in your request and you want to apply a custom language model, a custom vocabulary, or a custom vocabulary filter, include LanguageIdSettings with the relevant sub-parameters ( VocabularyName, LanguageModelName, and VocabularyFilterName). VocabularyName (string) --- The name of the custom vocabulary you want to use when processing your transcription job. Custom vocabulary names are case sensitive. The language of the specified custom vocabulary must match the language code that you specify in your transcription request. If the languages do not match, the custom vocabulary isn't applied. There are no errors or warnings associated with a language mismatch. VocabularyFilterName (string) --- The name of the custom vocabulary filter you want to use when processing your transcription job. Custom vocabulary filter names are case sensitive. The language of the specified custom vocabulary filter must match the language code that you specify in your transcription request. If the languages do not match, the custom vocabulary filter isn't applied. Note that if you include VocabularyFilterName in your request, you must also include VocabularyFilterMethod. LanguageModelName (string) --- The name of the custom language model you want to use when processing your transcription job. Note that custom language model names are case sensitive. The language of the specified custom language model must match the language code that you specify in your transcription request. If the languages do not match, the custom language model isn't applied. There are no errors or warnings associated with a language mismatch.",
      "nested_params": [
        {
          "name": "VocabularyName",
          "type": "string",
          "required": false,
          "description": "The name of the custom vocabulary you want to use when processing your transcription job. Custom vocabulary names are case sensitive. The language of the specified custom vocabulary must match the language code that you specify in your transcription request. If the languages do not match, the custom vocabulary isn't applied. There are no errors or warnings associated with a language mismatch.",
          "nested_params": []
        },
        {
          "name": "VocabularyFilterName",
          "type": "string",
          "required": false,
          "description": "The name of the custom vocabulary filter you want to use when processing your transcription job. Custom vocabulary filter names are case sensitive. The language of the specified custom vocabulary filter must match the language code that you specify in your transcription request. If the languages do not match, the custom vocabulary filter isn't applied. There are no errors or warnings associated with a language mismatch. Note that if you include VocabularyFilterName in your request, you must also include VocabularyFilterMethod.",
          "nested_params": []
        },
        {
          "name": "LanguageModelName",
          "type": "string",
          "required": false,
          "description": "The name of the custom language model you want to use when processing your transcription job. Note that custom language model names are case sensitive. The language of the specified custom language model must match the language code that you specify in your transcription request. If the languages do not match, the custom language model isn't applied. There are no errors or warnings associated with a language mismatch.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ToxicityDetection",
      "type": "list",
      "required": true,
      "description": "Enables toxic speech detection in your transcript. If you include ToxicityDetection in your request, you must also include ToxicityCategories. For information on the types of toxic speech Amazon Transcribe can detect, see Detecting toxic speech. (dict) --- Contains ToxicityCategories, which is a required parameter if you want to enable toxicity detection ( ToxicityDetection) in your transcription request. If you include ToxicityDetection in your transcription request, you must also include ToxicityCategories. The only accepted value for this parameter is ALL. (string) ---",
      "nested_params": [
        {
          "name": "ToxicityCategories",
          "type": "list",
          "required": false,
          "description": "If you include ToxicityDetection in your transcription request, you must also include ToxicityCategories. The only accepted value for this parameter is ALL.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "TranscriptionJob",
          "type": "dict",
          "description": "Provides detailed information about the current transcription job, including job status and, if applicable, failure reason.",
          "nested_items": [
            {
              "name": "TranscriptionJobName",
              "type": "string",
              "description": "The name of the transcription job. Job names are case sensitive and must be unique within an Amazon Web Services account.",
              "nested_items": []
            },
            {
              "name": "TranscriptionJobStatus",
              "type": "string",
              "description": "Provides the status of the specified transcription job.",
              "nested_items": []
            },
            {
              "name": "LanguageCode",
              "type": "string",
              "description": "The language code used to create your transcription job. This parameter is used with single-language identification. For multi-language identification requests, refer to the plural version of this parameter, LanguageCodes.",
              "nested_items": []
            },
            {
              "name": "MediaSampleRateHertz",
              "type": "integer",
              "description": "The sample rate, in hertz, of the audio track in your input media file.",
              "nested_items": []
            },
            {
              "name": "MediaFormat",
              "type": "string",
              "description": "The format of the input media file.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "MediaFileUri",
                  "type": "string",
                  "description": "The Amazon S3 location of the media file you want to transcribe. For example:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "s3://DOC-EXAMPLE-BUCKET/my-media-file.flac.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "s3://DOC-EXAMPLE-BUCKET/media-files/my-media-file.flac.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "RedactedMediaFileUri",
                  "type": "string",
                  "description": "The Amazon S3 location of the media file you want to redact. For example:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "s3://DOC-EXAMPLE-BUCKET/my-media-file.flac.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "s3://DOC-EXAMPLE-BUCKET/media-files/my-media-file.flac.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "Transcript",
              "type": "dict",
              "description": "Provides you with the Amazon S3 URI you can use to access your transcript.",
              "nested_items": [
                {
                  "name": "TranscriptFileUri",
                  "type": "string",
                  "description": "The Amazon S3 location of your transcript. You can use this URI to access or download your transcript.",
                  "nested_items": []
                },
                {
                  "name": "RedactedTranscriptFileUri",
                  "type": "string",
                  "description": "The Amazon S3 location of your redacted transcript. You can use this URI to access or download your transcript.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "StartTime",
              "type": "datetime",
              "description": "The date and time the specified transcription job began processing.",
              "nested_items": []
            },
            {
              "name": "CreationTime",
              "type": "datetime",
              "description": "The date and time the specified transcription job request was made.",
              "nested_items": []
            },
            {
              "name": "CompletionTime",
              "type": "datetime",
              "description": "The date and time the specified transcription job finished processing.",
              "nested_items": []
            },
            {
              "name": "FailureReason",
              "type": "string",
              "description": "If TranscriptionJobStatus is FAILED, FailureReason contains information about why the transcription job request failed.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "Unsupported media format. The media format specified in MediaFormat isn't valid. Refer to refer to the MediaFormat parameter for a list of supported formats.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "The media format provided does not match the detected media format. The media format specified in MediaFormat doesn't match the format of the input file. Check the media format of your media file and correct the specified value.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Invalid sample rate for audio file. The sample rate specified in MediaSampleRateHertz isn't valid. The sample rate must be between 8,000 and 48,000 hertz.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "The sample rate provided does not match the detected sample rate. The sample rate specified in MediaSampleRateHertz doesn't match the sample rate detected in your input media file. Check the sample rate of your media file and correct the specified value.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Invalid file size: file size too large. The size of your media file is larger than what Amazon Transcribe can process. For more information, refer to Service quotas.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Invalid number of channels: number of channels too large. Your audio contains more channels than Amazon Transcribe is able to process. For more information, refer to Service quotas.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "VocabularyName",
                  "type": "string",
                  "description": "The name of the custom vocabulary you want to use in your transcription job request. This name is case sensitive, cannot contain spaces, and must be unique within an Amazon Web Services account.",
                  "nested_items": []
                },
                {
                  "name": "ShowSpeakerLabels",
                  "type": "boolean",
                  "description": "Enables speaker partitioning (diarization) in your transcription output. Speaker partitioning labels the speech from individual speakers in your media file.",
                  "nested_items": []
                },
                {
                  "name": "MaxSpeakerLabels",
                  "type": "integer",
                  "description": "Specify the maximum number of speakers you want to partition in your media.",
                  "nested_items": []
                },
                {
                  "name": "ChannelIdentification",
                  "type": "boolean",
                  "description": "Enables channel identification in multi-channel audio.",
                  "nested_items": []
                },
                {
                  "name": "ShowAlternatives",
                  "type": "boolean",
                  "description": "To include alternative transcriptions within your transcription output, include ShowAlternatives in your transcription request.",
                  "nested_items": []
                },
                {
                  "name": "MaxAlternatives",
                  "type": "integer",
                  "description": "Indicate the maximum number of alternative transcriptions you want Amazon Transcribe to include in your transcript.",
                  "nested_items": []
                },
                {
                  "name": "VocabularyFilterName",
                  "type": "string",
                  "description": "The name of the custom vocabulary filter you want to use in your transcription job request. This name is case sensitive, cannot contain spaces, and must be unique within an Amazon Web Services account.",
                  "nested_items": []
                },
                {
                  "name": "VocabularyFilterMethod",
                  "type": "string",
                  "description": "Specify how you want your custom vocabulary filter applied to your transcript.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "ModelSettings",
              "type": "dict",
              "description": "Provides information on the custom language model you included in your request.",
              "nested_items": [
                {
                  "name": "LanguageModelName",
                  "type": "string",
                  "description": "The name of the custom language model you want to use when processing your transcription job. Note that custom language model names are case sensitive.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "JobExecutionSettings",
              "type": "dict",
              "description": "Provides information about how your transcription job was processed. This parameter shows if your request was queued and what data access role was used.",
              "nested_items": [
                {
                  "name": "AllowDeferredExecution",
                  "type": "boolean",
                  "description": "Makes it possible to enable job queuing when your concurrent request limit is exceeded. When AllowDeferredExecution is set to true, transcription job requests are placed in a queue until the number of jobs falls below the concurrent request limit. If AllowDeferredExecution is set to false and the number of transcription job requests exceed the concurrent request limit, you get a LimitExceededException error.",
                  "nested_items": []
                },
                {
                  "name": "DataAccessRoleArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of an IAM role that has permissions to access the Amazon S3 bucket that contains your input files. If the role that you specify doesn't have the appropriate permissions to access the specified Amazon S3 location, your request fails.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "ContentRedaction",
              "type": "dict",
              "description": "Indicates whether redaction was enabled in your transcript.",
              "nested_items": [
                {
                  "name": "RedactionType",
                  "type": "string",
                  "description": "Specify the category of information you want to redact; PII (personally identifiable information) is the only valid value. You can use PiiEntityTypes to choose which types of PII you want to redact. If you do not include PiiEntityTypes in your request, all PII is redacted.",
                  "nested_items": []
                },
                {
                  "name": "RedactionOutput",
                  "type": "string",
                  "description": "Specify if you want only a redacted transcript, or if you want a redacted and an unredacted transcript.",
                  "nested_items": []
                },
                {
                  "name": "PiiEntityTypes",
                  "type": "list",
                  "description": "Specify which types of personally identifiable information (PII) you want to redact in your transcript. You can include as many types as you'd like, or you can select ALL. If you do not include PiiEntityTypes in your request, all PII is redacted.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "IdentifyLanguage",
              "type": "boolean",
              "description": "Indicates whether automatic language identification was enabled ( TRUE) for the specified transcription job.",
              "nested_items": []
            },
            {
              "name": "IdentifyMultipleLanguages",
              "type": "boolean",
              "description": "Indicates whether automatic multi-language identification was enabled ( TRUE) for the specified transcription job.",
              "nested_items": []
            },
            {
              "name": "LanguageOptions",
              "type": "list",
              "description": "Provides the language codes you specified in your request.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "IdentifiedLanguageScore",
              "type": "float",
              "description": "The confidence score associated with the language identified in your media file.",
              "nested_items": []
            },
            {
              "name": "LanguageCodes",
              "type": "list",
              "description": "The language codes used to create your transcription job. This parameter is used with multi-language identification. For single-language identification requests, refer to the singular version of this parameter, LanguageCode.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "LanguageCode",
                      "type": "string",
                      "description": "Provides the language code for each language identified in your media.",
                      "nested_items": []
                    },
                    {
                      "name": "DurationInSeconds",
                      "type": "float",
                      "description": "Provides the total time, in seconds, each identified language is spoken in your media.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "Tags",
              "type": "list",
              "description": "The tags, each in the form of a key:value pair, assigned to the specified transcription job.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Key",
                      "type": "string",
                      "description": "The first part of a key:value pair that forms a tag associated with a given resource. For example, in the tag Department:Sales, the key is --\u0098Department'.",
                      "nested_items": []
                    },
                    {
                      "name": "Value",
                      "type": "string",
                      "description": "The second part of a key:value pair that forms a tag associated with a given resource. For example, in the tag Department:Sales, the value is --\u0098Sales'.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "Subtitles",
              "type": "dict",
              "description": "Indicates whether subtitles were generated with your transcription.",
              "nested_items": [
                {
                  "name": "Formats",
                  "type": "list",
                  "description": "Provides the format of your subtitle files. If your request included both WebVTT ( vtt) and SubRip ( srt) formats, both formats are shown.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "SubtitleFileUris",
                  "type": "list",
                  "description": "The Amazon S3 location of your transcript. You can use this URI to access or download your subtitle file. Your subtitle file is stored in the same location as your transcript. If you specified both WebVTT and SubRip subtitle formats, two URIs are provided.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "OutputStartIndex",
                  "type": "integer",
                  "description": "Provides the start index value for your subtitle files. If you did not specify a value in your request, the default value of 0 is used.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "LanguageIdSettings",
              "type": "dict",
              "description": "Provides the name and language of all custom language models, custom vocabularies, and custom vocabulary filters that you included in your request.",
              "nested_items": [
                {
                  "name": "do not",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "VocabularyName",
                          "type": "string",
                          "description": "The name of the custom vocabulary you want to use when processing your transcription job. Custom vocabulary names are case sensitive.",
                          "nested_items": []
                        },
                        {
                          "name": "VocabularyFilterName",
                          "type": "string",
                          "description": "The name of the custom vocabulary filter you want to use when processing your transcription job. Custom vocabulary filter names are case sensitive.",
                          "nested_items": []
                        },
                        {
                          "name": "LanguageModelName",
                          "type": "string",
                          "description": "The name of the custom language model you want to use when processing your transcription job. Note that custom language model names are case sensitive.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "ToxicityDetection",
              "type": "list",
              "description": "Provides information about the toxicity detection settings applied to your transcription.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "ToxicityCategories",
                      "type": "list",
                      "description": "If you include ToxicityDetection in your transcription request, you must also include ToxicityCategories. The only accepted value for this parameter is ALL.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}