{
  "method_name": "update_vocabulary",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/transcribe/client/update_vocabulary.html",
  "description": "Updates an existing custom vocabulary with new values. This operation overwrites all existing information with your new values; you cannot append new terms onto an existing custom vocabulary.",
  "parameters": [
    {
      "name": "VocabularyName",
      "type": "string",
      "required": true,
      "description": "The name of the custom vocabulary you want to update. Custom vocabulary names are case sensitive.",
      "nested_params": []
    },
    {
      "name": "LanguageCode",
      "type": "string",
      "required": true,
      "description": "The language code that represents the language of the entries in the custom vocabulary you want to update. Each custom vocabulary must contain terms in only one language. A custom vocabulary can only be used to transcribe files in the same language as the custom vocabulary. For example, if you create a custom vocabulary using US English ( en-US), you can only apply this custom vocabulary to files that contain English audio. For a list of supported languages and their associated language codes, refer to the Supported languages table.",
      "nested_params": []
    },
    {
      "name": "Phrases",
      "type": "list",
      "required": false,
      "description": "Use this parameter if you want to update your custom vocabulary by including all desired terms, as comma-separated values, within your request. The other option for updating your custom vocabulary is to save your entries in a text file and upload them to an Amazon S3 bucket, then specify the location of your file using the VocabularyFileUri parameter. Note that if you include Phrases in your request, you cannot use VocabularyFileUri; you must choose one or the other. Each language has a character set that contains all allowed characters for that specific language. If you use unsupported characters, your custom vocabulary filter request fails. Refer to Character Sets for Custom Vocabularies to get the character set for your language. (string) ---",
      "nested_params": []
    },
    {
      "name": "VocabularyFileUri",
      "type": "string",
      "required": false,
      "description": "The Amazon S3 location of the text file that contains your custom vocabulary. The URI must be located in the same Amazon Web Services Region as the resource you're calling. Here's an example URI path: s3://DOC-EXAMPLE-BUCKET/my-vocab-file.txt Note that if you include VocabularyFileUri in your request, you cannot use the Phrases flag; you must choose one or the other.",
      "nested_params": []
    },
    {
      "name": "DataAccessRoleArn",
      "type": "string",
      "required": false,
      "description": "The Amazon Resource Name (ARN) of an IAM role that has permissions to access the Amazon S3 bucket that contains your input files (in this case, your custom vocabulary). If the role that you specify doesn't have the appropriate permissions to access the specified Amazon S3 location, your request fails. IAM role ARNs have the format arn:partition:iam::account:role/role-name-with-path. For example: arn:aws:iam::111122223333:role/Admin. For more information, see IAM ARNs.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "VocabularyName",
          "type": "string",
          "description": "The name of the updated custom vocabulary.",
          "nested_items": []
        },
        {
          "name": "LanguageCode",
          "type": "string",
          "description": "The language code you selected for your custom vocabulary.",
          "nested_items": []
        },
        {
          "name": "LastModifiedTime",
          "type": "datetime",
          "description": "The date and time the specified custom vocabulary was last updated.",
          "nested_items": []
        },
        {
          "name": "VocabularyState",
          "type": "string",
          "description": "The processing state of your custom vocabulary. If the state is READY, you can use the custom vocabulary in a StartTranscriptionJob request.",
          "nested_items": []
        }
      ]
    }
  ]
}