{
  "method_name": "update_medical_vocabulary",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/transcribe/client/update_medical_vocabulary.html",
  "description": "Updates an existing custom medical vocabulary with new values. This operation overwrites all existing information with your new values; you cannot append new terms onto an existing custom vocabulary.",
  "parameters": [
    {
      "name": "VocabularyName",
      "type": "string",
      "required": true,
      "description": "The name of the custom medical vocabulary you want to update. Custom medical vocabulary names are case sensitive.",
      "nested_params": []
    },
    {
      "name": "LanguageCode",
      "type": "string",
      "required": true,
      "description": "The language code that represents the language of the entries in the custom vocabulary you want to update. US English ( en-US) is the only language supported with Amazon Transcribe Medical.",
      "nested_params": []
    },
    {
      "name": "VocabularyFileUri",
      "type": "string",
      "required": true,
      "description": "The Amazon S3 location of the text file that contains your custom medical vocabulary. The URI must be located in the same Amazon Web Services Region as the resource you're calling. Here's an example URI path: s3://DOC-EXAMPLE-BUCKET/my-vocab-file.txt.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "VocabularyName",
          "type": "string",
          "description": "The name of the updated custom medical vocabulary.",
          "nested_items": []
        },
        {
          "name": "LanguageCode",
          "type": "string",
          "description": "The language code you selected for your custom medical vocabulary. US English ( en-US) is the only language supported with Amazon Transcribe Medical.",
          "nested_items": []
        },
        {
          "name": "LastModifiedTime",
          "type": "datetime",
          "description": "The date and time the specified custom medical vocabulary was last updated.",
          "nested_items": []
        },
        {
          "name": "VocabularyState",
          "type": "string",
          "description": "The processing state of your custom medical vocabulary. If the state is READY, you can use the custom vocabulary in a StartMedicalTranscriptionJob request.",
          "nested_items": []
        }
      ]
    }
  ]
}