{
  "method_name": "create_network_analyzer_configuration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iotwireless/client/create_network_analyzer_configuration.html",
  "description": "Creates a new network analyzer configuration.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "Name of the network analyzer configuration.",
      "nested_params": []
    },
    {
      "name": "TraceContent",
      "type": "dict",
      "required": false,
      "description": "Trace content for your wireless devices, gateways, and multicast groups. WirelessDeviceFrameInfo (string) --- FrameInfo of your wireless device resources for the trace content. Use FrameInfo to debug the communication between your LoRaWAN end devices and the network server. LogLevel (string) --- The log level for a log message. The log levels can be disabled, or set to ERROR to display less verbose logs containing only error information, or to INFO for more detailed logs. MulticastFrameInfo (string) --- FrameInfo of your multicast group resources for the trace content. Use FrameInfo to debug the multicast communication between your multicast groups and the network server.",
      "nested_params": [
        {
          "name": "WirelessDeviceFrameInfo",
          "type": "string",
          "required": false,
          "description": "FrameInfo of your wireless device resources for the trace content. Use FrameInfo to debug the communication between your LoRaWAN end devices and the network server.",
          "nested_params": []
        },
        {
          "name": "LogLevel",
          "type": "string",
          "required": false,
          "description": "The log level for a log message. The log levels can be disabled, or set to ERROR to display less verbose logs containing only error information, or to INFO for more detailed logs.",
          "nested_params": []
        },
        {
          "name": "MulticastFrameInfo",
          "type": "string",
          "required": false,
          "description": "FrameInfo of your multicast group resources for the trace content. Use FrameInfo to debug the multicast communication between your multicast groups and the network server.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "WirelessDevices",
      "type": "list",
      "required": false,
      "description": "Wireless device resources to add to the network analyzer configuration. Provide the WirelessDeviceId of the resource to add in the input array. (string) --- The ID of the wireless device.",
      "nested_params": []
    },
    {
      "name": "WirelessGateways",
      "type": "list",
      "required": false,
      "description": "Wireless gateway resources to add to the network analyzer configuration. Provide the WirelessGatewayId of the resource to add in the input array. (string) ---",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "The tag to attach to the specified resource. Tags are metadata that you can use to manage a resource. (dict) --- A simple label consisting of a customer-defined key-value pair The tag's key value. The tag's value.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The tag's key value.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The tag's value.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ClientRequestToken",
      "type": "string",
      "required": false,
      "description": "Each resource must have a unique client request token. The client token is used to implement idempotency. It ensures that the request completes no more than one time. If you retry a request with the same token and the same parameters, the request will complete successfully. However, if you try to create a new resource using the same token but different parameters, an HTTP 409 conflict occurs. If you omit this value, AWS SDKs will automatically generate a unique client request. For more information about idempotency, see Ensuring idempotency in Amazon EC2 API requests. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "MulticastGroups",
      "type": "list",
      "required": false,
      "description": "Multicast Group resources to add to the network analyzer configruation. Provide the MulticastGroupId of the resource to add in the input array. (string) --- The ID of the multicast group.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Arn",
          "type": "string",
          "description": "The Amazon Resource Name of the new resource.",
          "nested_items": []
        },
        {
          "name": "Name",
          "type": "string",
          "description": "Name of the network analyzer configuration.",
          "nested_items": []
        }
      ]
    }
  ]
}