{
  "method_name": "update_log_levels_by_resource_types",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iotwireless/client/update_log_levels_by_resource_types.html",
  "description": "Set default log level, or log levels by resource types. This can be for wireless device, wireless gateway, or FUOTA task log options, and is used to control the log messages that'll be displayed in CloudWatch.",
  "parameters": [
    {
      "name": "DefaultLogLevel",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "FuotaTaskLogOptions",
      "type": "list",
      "required": true,
      "description": "The list of FUOTA task log options. (dict) --- The log options for FUOTA tasks and can be used to set log levels for a specific type of FUOTA task. The FUOTA task type. The log level for a log message. The log levels can be disabled, or set to ERROR to display less verbose logs containing only error information, or to INFO for more detailed logs. Events (list) --- The list of FUOTA task event log options. (dict) --- The log options for a FUOTA task event and can be used to set log levels for a specific FUOTA task event. For a LoRaWAN FUOTA task, the only possible event for a log message is Fuota. The event for a log message, if the log message is tied to a FUOTA task. The log levels can be disabled, or set to ERROR to display less verbose logs containing only error information, or to INFO for more detailed logs.",
      "nested_params": [
        {
          "name": "Type",
          "type": "string",
          "required": false,
          "description": "The FUOTA task type.",
          "nested_params": []
        },
        {
          "name": "LogLevel",
          "type": "string",
          "required": false,
          "description": "The log level for a log message. The log levels can be disabled, or set to ERROR to display less verbose logs containing only error information, or to INFO for more detailed logs.",
          "nested_params": []
        },
        {
          "name": "Events",
          "type": "list",
          "required": false,
          "description": "The list of FUOTA task event log options.",
          "nested_params": [
            {
              "name": "Event",
              "type": "string",
              "required": false,
              "description": "The event for a log message, if the log message is tied to a FUOTA task.",
              "nested_params": []
            },
            {
              "name": "LogLevel",
              "type": "string",
              "required": false,
              "description": "The log level for a log message. The log levels can be disabled, or set to ERROR to display less verbose logs containing only error information, or to INFO for more detailed logs.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "WirelessDeviceLogOptions",
      "type": "list",
      "required": true,
      "description": "The list of wireless device log options. (dict) --- The log options for wireless devices and can be used to set log levels for a specific type of wireless device. The wireless device type. The log level for a log message. The log levels can be disabled, or set to ERROR to display less verbose logs containing only error information, or to INFO for more detailed logs. Events (list) --- The list of wireless device event log options. (dict) --- The log options for a wireless device event and can be used to set log levels for a specific wireless device event. For a LoRaWAN device, possible events for a log messsage are: Join, Rejoin, Downlink_Data, and Uplink_Data. For a Sidewalk device, possible events for a log message are Registration, Downlink_Data, and Uplink_Data. The event for a log message, if the log message is tied to a wireless device. The log levels can be disabled, or set to ERROR to display less verbose logs containing only error information, or to INFO for more detailed logs.",
      "nested_params": [
        {
          "name": "Type",
          "type": "string",
          "required": false,
          "description": "The wireless device type.",
          "nested_params": []
        },
        {
          "name": "LogLevel",
          "type": "string",
          "required": false,
          "description": "The log level for a log message. The log levels can be disabled, or set to ERROR to display less verbose logs containing only error information, or to INFO for more detailed logs.",
          "nested_params": []
        },
        {
          "name": "Events",
          "type": "list",
          "required": false,
          "description": "The list of wireless device event log options.",
          "nested_params": [
            {
              "name": "Event",
              "type": "string",
              "required": false,
              "description": "The event for a log message, if the log message is tied to a wireless device.",
              "nested_params": []
            },
            {
              "name": "LogLevel",
              "type": "string",
              "required": false,
              "description": "The log level for a log message. The log levels can be disabled, or set to ERROR to display less verbose logs containing only error information, or to INFO for more detailed logs.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "WirelessGatewayLogOptions",
      "type": "list",
      "required": true,
      "description": "The list of wireless gateway log options. (dict) --- The log options for wireless gateways and can be used to set log levels for a specific type of wireless gateway. The wireless gateway type. The log level for a log message. The log levels can be disabled, or set to ERROR to display less verbose logs containing only error information, or to INFO for more detailed logs. Events (list) --- The list of wireless gateway event log options. (dict) --- The log options for a wireless gateway event and can be used to set log levels for a specific wireless gateway event. For a LoRaWAN gateway, possible events for a log message are CUPS_Request and Certificate. The event for a log message, if the log message is tied to a wireless gateway. The log levels can be disabled, or set to ERROR to display less verbose logs containing only error information, or to INFO for more detailed logs.",
      "nested_params": [
        {
          "name": "Type",
          "type": "string",
          "required": false,
          "description": "The wireless gateway type.",
          "nested_params": []
        },
        {
          "name": "LogLevel",
          "type": "string",
          "required": false,
          "description": "The log level for a log message. The log levels can be disabled, or set to ERROR to display less verbose logs containing only error information, or to INFO for more detailed logs.",
          "nested_params": []
        },
        {
          "name": "Events",
          "type": "list",
          "required": false,
          "description": "The list of wireless gateway event log options.",
          "nested_params": [
            {
              "name": "Event",
              "type": "string",
              "required": false,
              "description": "The event for a log message, if the log message is tied to a wireless gateway.",
              "nested_params": []
            },
            {
              "name": "LogLevel",
              "type": "string",
              "required": false,
              "description": "The log level for a log message. The log levels can be disabled, or set to ERROR to display less verbose logs containing only error information, or to INFO for more detailed logs.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}