{
  "method_name": "start_import",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/lexv2-models/client/start_import.html",
  "description": "Starts importing a bot, bot locale, or custom vocabulary from a zip archive that you uploaded to an S3 bucket.",
  "parameters": [
    {
      "name": "importId",
      "type": "string",
      "required": true,
      "description": "The unique identifier for the import. It is included in the response from the CreateUploadUrl operation.",
      "nested_params": []
    },
    {
      "name": "resourceSpecification",
      "type": "dict",
      "required": true,
      "description": "Parameters for creating the bot, bot locale or custom vocabulary. botImportSpecification (dict) --- Parameters for importing a bot. The name that Amazon Lex should use for the bot. The Amazon Resource Name (ARN) of the IAM role used to build and run the bot. By default, data stored by Amazon Lex is encrypted. The DataPrivacy structure provides settings that determine how Amazon Lex handles special cases of securing the data for your bot. For each Amazon Lex bot created with the Amazon Lex Model Building Service, you must specify whether your use of Amazon Lex is related to a website, program, or other application that is directed or targeted, in whole or in part, to children under age 13 and subject to the Children's Online Privacy Protection Act (COPPA) by specifying true or false in the childDirected field. By specifying true in the childDirected field, you confirm that your use of Amazon Lex is related to a website, program, or other application that is directed or targeted, in whole or in part, to children under age 13 and subject to COPPA. By specifying false in the childDirected field, you confirm that your use of Amazon Lex is not related to a website, program, or other application that is directed or targeted, in whole or in part, to children under age 13 and subject to COPPA. You may not specify a default value for the childDirected field that does not accurately reflect whether your use of Amazon Lex is related to a website, program, or other application that is directed or targeted, in whole or in part, to children under age 13 and subject to COPPA. If your use of Amazon Lex relates to a website, program, or other application that is directed in whole or in part, to children under age 13, you must obtain any required verifiable parental consent under COPPA. For information regarding the use of Amazon Lex in connection with websites, programs, or other applications that are directed or targeted, in whole or in part, to children under age 13, see the Amazon Lex FAQ. errorLogSettings (dict) --- Allows you to configure destinations where error logs will be published during the bot import process. Settings parameters for the error logs, when it is enabled. idleSessionTTLInSeconds (integer) --- The time, in seconds, that Amazon Lex should keep information about a user's conversation with the bot. A user interaction remains active for the amount of time specified. If no conversation occurs during this time, the session expires and Amazon Lex deletes any data provided before the timeout. You can specify between 60 (1 minute) and 86,400 (24 hours) seconds. botTags (dict) --- A list of tags to add to the bot. You can only add tags when you import a bot. You can't use the UpdateBot operation to update tags. To update tags, use the TagResource operation. (string) --- (string) --- testBotAliasTags (dict) --- A list of tags to add to the test alias for a bot. You can't use the UpdateAlias operation to update tags. To update tags on the test alias, use the TagResource operation. (string) --- (string) --- botLocaleImportSpecification (dict) --- Parameters for importing a bot locale. The identifier of the bot to import the locale to. The version of the bot to import the locale to. This can only be the DRAFT version of the bot. The identifier of the language and locale that the bot will be used in. The string must match one of the supported locales. All of the intents, slot types, and slots used in the bot must have the same locale. For more information, see Supported languages. nluIntentConfidenceThreshold (float) --- Determines the threshold where Amazon Lex will insert the AMAZON.FallbackIntent, AMAZON.KendraSearchIntent, or both when returning alternative intents. AMAZON.FallbackIntent and AMAZON.KendraSearchIntent are only inserted if they are configured for the bot. For example, suppose a bot is configured with the confidence threshold of 0.80 and the AMAZON.FallbackIntent. Amazon Lex returns three alternative intents with the following confidence scores: IntentA (0.70), IntentB (0.60), IntentC (0.50). The response from the PostText operation would be: AMAZON.FallbackIntent IntentA IntentB IntentC voiceSettings (dict) --- Defines settings for using an Amazon Polly voice to communicate with a user. Valid values include: standard neural long-form generative The identifier of the Amazon Polly voice to use. engine (string) --- Indicates the type of Amazon Polly voice that Amazon Lex should use for voice interaction with the user. For more information, see the engine parameter of the SynthesizeSpeech operation in the Amazon Polly developer guide. If you do not specify a value, the default is standard. customVocabularyImportSpecification (dict) --- Provides the parameters required for importing a custom vocabulary. The identifier of the bot to import the custom vocabulary to. The version of the bot to import the custom vocabulary to. The identifier of the local to import the custom vocabulary to. The value must be en_GB. testSetImportResourceSpecification (dict) --- Specifications for the test set that is imported. The name of the test set. description (string) --- The description of the test set. The Amazon Resource Name (ARN) of an IAM role that has permission to access the test set. Contains information about the location that Amazon Lex uses to store the test-set. The name of the Amazon S3 bucket in which the test set is stored. The path inside the Amazon S3 bucket where the test set is stored. kmsKeyArn (string) --- The Amazon Resource Name (ARN) of an Amazon Web Services Key Management Service (KMS) key for encrypting the test set. Contains information about the input location from where test-set should be imported. The name of the Amazon S3 bucket. The path inside the Amazon S3 bucket pointing to the test-set CSV file. Specifies whether the test-set being imported contains written or spoken data. testSetTags (dict) --- A list of tags to add to the test set. You can only add tags when you import/generate a new test set. You can't use the UpdateTestSet operation to update tags. (string) --- (string) ---",
      "nested_params": [
        {
          "name": "botImportSpecification",
          "type": "dict",
          "required": false,
          "description": "Parameters for importing a bot.",
          "nested_params": [
            {
              "name": "botName",
              "type": "string",
              "required": false,
              "description": "The name that Amazon Lex should use for the bot.",
              "nested_params": []
            },
            {
              "name": "roleArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of the IAM role used to build and run the bot.",
              "nested_params": []
            },
            {
              "name": "dataPrivacy",
              "type": "dict",
              "required": false,
              "description": "By default, data stored by Amazon Lex is encrypted. The DataPrivacy structure provides settings that determine how Amazon Lex handles special cases of securing the data for your bot.",
              "nested_params": [
                {
                  "name": "childDirected",
                  "type": "boolean",
                  "required": false,
                  "description": "",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "errorLogSettings",
              "type": "dict",
              "required": false,
              "description": "Allows you to configure destinations where error logs will be published during the bot import process.",
              "nested_params": [
                {
                  "name": "enabled",
                  "type": "boolean",
                  "required": false,
                  "description": "Settings parameters for the error logs, when it is enabled.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "idleSessionTTLInSeconds",
              "type": "integer",
              "required": false,
              "description": "The time, in seconds, that Amazon Lex should keep information about a user's conversation with the bot. A user interaction remains active for the amount of time specified. If no conversation occurs during this time, the session expires and Amazon Lex deletes any data provided before the timeout. You can specify between 60 (1 minute) and 86,400 (24 hours) seconds.",
              "nested_params": []
            },
            {
              "name": "botTags",
              "type": "dict",
              "required": false,
              "description": "A list of tags to add to the bot. You can only add tags when you import a bot. You can't use the UpdateBot operation to update tags. To update tags, use the TagResource operation.",
              "nested_params": []
            },
            {
              "name": "testBotAliasTags",
              "type": "dict",
              "required": false,
              "description": "A list of tags to add to the test alias for a bot. You can only add tags when you import a bot. You can't use the UpdateAlias operation to update tags. To update tags on the test alias, use the TagResource operation.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "botLocaleImportSpecification",
          "type": "dict",
          "required": false,
          "description": "Parameters for importing a bot locale.",
          "nested_params": [
            {
              "name": "botId",
              "type": "string",
              "required": false,
              "description": "The identifier of the bot to import the locale to.",
              "nested_params": []
            },
            {
              "name": "botVersion",
              "type": "string",
              "required": false,
              "description": "The version of the bot to import the locale to. This can only be the DRAFT version of the bot.",
              "nested_params": []
            },
            {
              "name": "localeId",
              "type": "string",
              "required": false,
              "description": "The identifier of the language and locale that the bot will be used in. The string must match one of the supported locales. All of the intents, slot types, and slots used in the bot must have the same locale. For more information, see Supported languages.",
              "nested_params": []
            },
            {
              "name": "nluIntentConfidenceThreshold",
              "type": "float",
              "required": false,
              "description": "Determines the threshold where Amazon Lex will insert the AMAZON.FallbackIntent, AMAZON.KendraSearchIntent, or both when returning alternative intents. AMAZON.FallbackIntent and AMAZON.KendraSearchIntent are only inserted if they are configured for the bot. For example, suppose a bot is configured with the confidence threshold of 0.80 and the AMAZON.FallbackIntent. Amazon Lex returns three alternative intents with the following confidence scores: IntentA (0.70), IntentB (0.60), IntentC (0.50). The response from the PostText operation would be:",
              "nested_params": []
            },
            {
              "name": "voiceSettings",
              "type": "dict",
              "required": false,
              "description": "Defines settings for using an Amazon Polly voice to communicate with a user. Valid values include:",
              "nested_params": []
            }
          ]
        },
        {
          "name": "customVocabularyImportSpecification",
          "type": "dict",
          "required": false,
          "description": "Provides the parameters required for importing a custom vocabulary.",
          "nested_params": [
            {
              "name": "botId",
              "type": "string",
              "required": false,
              "description": "The identifier of the bot to import the custom vocabulary to.",
              "nested_params": []
            },
            {
              "name": "botVersion",
              "type": "string",
              "required": false,
              "description": "The version of the bot to import the custom vocabulary to.",
              "nested_params": []
            },
            {
              "name": "localeId",
              "type": "string",
              "required": false,
              "description": "The identifier of the local to import the custom vocabulary to. The value must be en_GB.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "testSetImportResourceSpecification",
          "type": "dict",
          "required": false,
          "description": "Specifications for the test set that is imported.",
          "nested_params": [
            {
              "name": "testSetName",
              "type": "string",
              "required": false,
              "description": "The name of the test set.",
              "nested_params": []
            },
            {
              "name": "description",
              "type": "string",
              "required": false,
              "description": "The description of the test set.",
              "nested_params": []
            },
            {
              "name": "roleArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of an IAM role that has permission to access the test set.",
              "nested_params": []
            },
            {
              "name": "storageLocation",
              "type": "dict",
              "required": false,
              "description": "Contains information about the location that Amazon Lex uses to store the test-set.",
              "nested_params": [
                {
                  "name": "s3BucketName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the Amazon S3 bucket in which the test set is stored.",
                  "nested_params": []
                },
                {
                  "name": "s3Path",
                  "type": "string",
                  "required": false,
                  "description": "The path inside the Amazon S3 bucket where the test set is stored.",
                  "nested_params": []
                },
                {
                  "name": "kmsKeyArn",
                  "type": "string",
                  "required": false,
                  "description": "The Amazon Resource Name (ARN) of an Amazon Web Services Key Management Service (KMS) key for encrypting the test set.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "importInputLocation",
              "type": "dict",
              "required": false,
              "description": "Contains information about the input location from where test-set should be imported.",
              "nested_params": [
                {
                  "name": "s3BucketName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the Amazon S3 bucket.",
                  "nested_params": []
                },
                {
                  "name": "s3Path",
                  "type": "string",
                  "required": false,
                  "description": "The path inside the Amazon S3 bucket pointing to the test-set CSV file.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "modality",
              "type": "string",
              "required": false,
              "description": "Specifies whether the test-set being imported contains written or spoken data.",
              "nested_params": []
            },
            {
              "name": "testSetTags",
              "type": "dict",
              "required": false,
              "description": "A list of tags to add to the test set. You can only add tags when you import/generate a new test set. You can't use the UpdateTestSet operation to update tags. To update tags, use the TagResource operation.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "mergeStrategy",
      "type": "string",
      "required": true,
      "description": "The strategy to use when there is a name conflict between the imported resource and an existing resource. When the merge strategy is FailOnConflict existing resources are not overwritten and the import fails.",
      "nested_params": []
    },
    {
      "name": "filePassword",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "importId",
          "type": "string",
          "description": "A unique identifier for the import.",
          "nested_items": []
        },
        {
          "name": "resourceSpecification",
          "type": "dict",
          "description": "The parameters used when importing the resource.",
          "nested_items": [
            {
              "name": "botImportSpecification",
              "type": "dict",
              "description": "Parameters for importing a bot.",
              "nested_items": [
                {
                  "name": "botName",
                  "type": "string",
                  "description": "The name that Amazon Lex should use for the bot.",
                  "nested_items": []
                },
                {
                  "name": "roleArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the IAM role used to build and run the bot.",
                  "nested_items": []
                },
                {
                  "name": "dataPrivacy",
                  "type": "dict",
                  "description": "By default, data stored by Amazon Lex is encrypted. The DataPrivacy structure provides settings that determine how Amazon Lex handles special cases of securing the data for your bot.",
                  "nested_items": [
                    {
                      "name": "childDirected",
                      "type": "boolean",
                      "description": "For each Amazon Lex bot created with the Amazon Lex Model Building Service, you must specify whether your use of Amazon Lex is related to a website, program, or other application that is directed or targeted, in whole or in part, to children under age 13 and subject to the Children's Online Privacy Protection Act (COPPA) by specifying true or false in the childDirected field. By specifying true in the childDirected field, you confirm that your use of Amazon Lex is related to a website, program, or other application that is directed or targeted, in whole or in part, to children under age 13 and subject to COPPA. By specifying false in the childDirected field, you confirm that your use of Amazon Lex is not related to a website, program, or other application that is directed or targeted, in whole or in part, to children under age 13 and subject to COPPA. You may not specify a default value for the childDirected field that does not accurately reflect whether your use of Amazon Lex is related to a website, program, or other application that is directed or targeted, in whole or in part, to children under age 13 and subject to COPPA. If your use of Amazon Lex relates to a website, program, or other application that is directed in whole or in part, to children under age 13, you must obtain any required verifiable parental consent under COPPA. For information regarding the use of Amazon Lex in connection with websites, programs, or other applications that are directed or targeted, in whole or in part, to children under age 13, see the Amazon Lex FAQ.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "errorLogSettings",
                  "type": "dict",
                  "description": "Allows you to configure destinations where error logs will be published during the bot import process.",
                  "nested_items": [
                    {
                      "name": "enabled",
                      "type": "boolean",
                      "description": "Settings parameters for the error logs, when it is enabled.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "idleSessionTTLInSeconds",
                  "type": "integer",
                  "description": "The time, in seconds, that Amazon Lex should keep information about a user's conversation with the bot.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "testBotAliasTags",
                  "type": "dict",
                  "description": "A list of tags to add to the test alias for a bot. You can only add tags when you import a bot. You can't use the UpdateAlias operation to update tags. To update tags on the test alias, use the TagResource operation.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "botLocaleImportSpecification",
              "type": "dict",
              "description": "Parameters for importing a bot locale.",
              "nested_items": [
                {
                  "name": "botId",
                  "type": "string",
                  "description": "The identifier of the bot to import the locale to.",
                  "nested_items": []
                },
                {
                  "name": "botVersion",
                  "type": "string",
                  "description": "The version of the bot to import the locale to. This can only be the DRAFT version of the bot.",
                  "nested_items": []
                },
                {
                  "name": "localeId",
                  "type": "string",
                  "description": "The identifier of the language and locale that the bot will be used in. The string must match one of the supported locales. All of the intents, slot types, and slots used in the bot must have the same locale. For more information, see Supported languages.",
                  "nested_items": []
                },
                {
                  "name": "nluIntentConfidenceThreshold",
                  "type": "float",
                  "description": "Determines the threshold where Amazon Lex will insert the AMAZON.FallbackIntent, AMAZON.KendraSearchIntent, or both when returning alternative intents. AMAZON.FallbackIntent and AMAZON.KendraSearchIntent are only inserted if they are configured for the bot.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "AMAZON.FallbackIntent.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "IntentA.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "IntentB.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "IntentC.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "voiceSettings",
                  "type": "dict",
                  "description": "Defines settings for using an Amazon Polly voice to communicate with a user.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "standard.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "neural.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "long-form.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "generative.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "customVocabularyImportSpecification",
              "type": "dict",
              "description": "Provides the parameters required for importing a custom vocabulary.",
              "nested_items": [
                {
                  "name": "botId",
                  "type": "string",
                  "description": "The identifier of the bot to import the custom vocabulary to.",
                  "nested_items": []
                },
                {
                  "name": "botVersion",
                  "type": "string",
                  "description": "The version of the bot to import the custom vocabulary to.",
                  "nested_items": []
                },
                {
                  "name": "localeId",
                  "type": "string",
                  "description": "The identifier of the local to import the custom vocabulary to. The value must be en_GB.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "testSetImportResourceSpecification",
              "type": "dict",
              "description": "Specifications for the test set that is imported.",
              "nested_items": [
                {
                  "name": "testSetName",
                  "type": "string",
                  "description": "The name of the test set.",
                  "nested_items": []
                },
                {
                  "name": "description",
                  "type": "string",
                  "description": "The description of the test set.",
                  "nested_items": []
                },
                {
                  "name": "roleArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of an IAM role that has permission to access the test set.",
                  "nested_items": []
                },
                {
                  "name": "storageLocation",
                  "type": "dict",
                  "description": "Contains information about the location that Amazon Lex uses to store the test-set.",
                  "nested_items": [
                    {
                      "name": "s3BucketName",
                      "type": "string",
                      "description": "The name of the Amazon S3 bucket in which the test set is stored.",
                      "nested_items": []
                    },
                    {
                      "name": "s3Path",
                      "type": "string",
                      "description": "The path inside the Amazon S3 bucket where the test set is stored.",
                      "nested_items": []
                    },
                    {
                      "name": "kmsKeyArn",
                      "type": "string",
                      "description": "The Amazon Resource Name (ARN) of an Amazon Web Services Key Management Service (KMS) key for encrypting the test set.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "importInputLocation",
                  "type": "dict",
                  "description": "Contains information about the input location from where test-set should be imported.",
                  "nested_items": [
                    {
                      "name": "s3BucketName",
                      "type": "string",
                      "description": "The name of the Amazon S3 bucket.",
                      "nested_items": []
                    },
                    {
                      "name": "s3Path",
                      "type": "string",
                      "description": "The path inside the Amazon S3 bucket pointing to the test-set CSV file.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "modality",
                  "type": "string",
                  "description": "Specifies whether the test-set being imported contains written or spoken data.",
                  "nested_items": []
                },
                {
                  "name": "testSetTags",
                  "type": "dict",
                  "description": "A list of tags to add to the test set. You can only add tags when you import/generate a new test set. You can't use the UpdateTestSet operation to update tags. To update tags, use the TagResource operation.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "mergeStrategy",
          "type": "string",
          "description": "The strategy used when there was a name conflict between the imported resource and an existing resource. When the merge strategy is FailOnConflict existing resources are not overwritten and the import fails.",
          "nested_items": []
        },
        {
          "name": "importStatus",
          "type": "string",
          "description": "The current status of the import. When the status is Complete the bot, bot alias, or custom vocabulary is ready to use.",
          "nested_items": []
        },
        {
          "name": "creationDateTime",
          "type": "datetime",
          "description": "The date and time that the import request was created.",
          "nested_items": []
        }
      ]
    }
  ]
}