{
  "method_name": "create_filter",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/personalize/client/create_filter.html",
  "description": "Creates a recommendation filter. For more information, see Filtering recommendations and user segments.",
  "parameters": [
    {
      "name": "name",
      "type": "string",
      "required": true,
      "description": "The name of the filter to create.",
      "nested_params": []
    },
    {
      "name": "datasetGroupArn",
      "type": "string",
      "required": true,
      "description": "The ARN of the dataset group that the filter will belong to.",
      "nested_params": []
    },
    {
      "name": "filterExpression",
      "type": "string",
      "required": true,
      "description": "The filter expression defines which items are included or excluded from recommendations. Filter expression must follow specific format rules. For information about filter expression structure and syntax, see Filter expressions.",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "list",
      "required": true,
      "description": "A list of tags to apply to the filter. (dict) --- The optional metadata that you apply to resources to help you categorize and organize them. Each tag consists of a key and an optional value, both of which you define. For more information see Tagging Amazon Personalize resources. One part of a key-value pair that makes up a tag. A key is a general label that acts like a category for more specific tag values. The optional part of a key-value pair that makes up a tag. A value acts as a descriptor within a tag category (key).",
      "nested_params": [
        {
          "name": "tagKey",
          "type": "string",
          "required": false,
          "description": "One part of a key-value pair that makes up a tag. A key is a general label that acts like a category for more specific tag values.",
          "nested_params": []
        },
        {
          "name": "tagValue",
          "type": "string",
          "required": false,
          "description": "The optional part of a key-value pair that makes up a tag. A value acts as a descriptor within a tag category (key).",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "filterArn",
          "type": "string",
          "description": "The ARN of the new filter.",
          "nested_items": []
        }
      ]
    }
  ]
}