{
  "method_name": "create_dataset",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/personalize/client/create_dataset.html",
  "description": "Creates an empty dataset and adds it to the specified dataset group. Use CreateDatasetImportJob to import your training data to a dataset. There are 5 types of datasets: Each dataset type has an associated schema with required field types. Only the Item interactions dataset is required in order to train a model (also referred to as creating a solution). A dataset can be in one of the following states: To get the status of the dataset, call DescribeDataset.",
  "parameters": [
    {
      "name": "name",
      "type": "string",
      "required": true,
      "description": "The name for the dataset.",
      "nested_params": []
    },
    {
      "name": "schemaArn",
      "type": "string",
      "required": true,
      "description": "The ARN of the schema to associate with the dataset. The schema defines the dataset fields.",
      "nested_params": []
    },
    {
      "name": "datasetGroupArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the dataset group to add the dataset to.",
      "nested_params": []
    },
    {
      "name": "datasetType",
      "type": "string",
      "required": true,
      "description": "The type of dataset. One of the following (case insensitive) values: Interactions Items Users Actions Action_Interactions.",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "list",
      "required": true,
      "description": "A list of tags to apply to the dataset. (dict) --- The optional metadata that you apply to resources to help you categorize and organize them. Each tag consists of a key and an optional value, both of which you define. For more information see Tagging Amazon Personalize resources. One part of a key-value pair that makes up a tag. A key is a general label that acts like a category for more specific tag values. The optional part of a key-value pair that makes up a tag. A value acts as a descriptor within a tag category (key).",
      "nested_params": [
        {
          "name": "tagKey",
          "type": "string",
          "required": false,
          "description": "One part of a key-value pair that makes up a tag. A key is a general label that acts like a category for more specific tag values.",
          "nested_params": []
        },
        {
          "name": "tagValue",
          "type": "string",
          "required": false,
          "description": "The optional part of a key-value pair that makes up a tag. A value acts as a descriptor within a tag category (key).",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "datasetArn",
          "type": "string",
          "description": "The ARN of the dataset.",
          "nested_items": []
        }
      ]
    }
  ]
}