{
  "method_name": "create_metric_attribution",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/personalize/client/create_metric_attribution.html",
  "description": "Creates a metric attribution. A metric attribution creates reports on the data that you import into Amazon Personalize. Depending on how you imported the data, you can view reports in Amazon CloudWatch or Amazon S3. For more information, see Measuring impact of recommendations.",
  "parameters": [
    {
      "name": "name",
      "type": "string",
      "required": true,
      "description": "A name for the metric attribution.",
      "nested_params": []
    },
    {
      "name": "datasetGroupArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the destination dataset group for the metric attribution.",
      "nested_params": []
    },
    {
      "name": "metrics",
      "type": "list",
      "required": true,
      "description": "A list of metric attributes for the metric attribution. Each metric attribute specifies an event type to track and a function. Available functions are SUM() or SAMPLECOUNT(). For SUM() functions, provide the dataset type (either Interactions or Items) and column to sum as a parameter. For example SUM(Items.PRICE). (dict) --- Contains information on a metric that a metric attribution reports on. For more information, see Measuring impact of recommendations. The metric's event type. The metric's name. The name helps you identify the metric in Amazon CloudWatch or Amazon S3. The attribute's expression. For example SUM(Items.PRICE).",
      "nested_params": [
        {
          "name": "eventType",
          "type": "string",
          "required": false,
          "description": "The metric's event type.",
          "nested_params": []
        },
        {
          "name": "metricName",
          "type": "string",
          "required": false,
          "description": "The metric's name. The name helps you identify the metric in Amazon CloudWatch or Amazon S3.",
          "nested_params": []
        },
        {
          "name": "expression",
          "type": "string",
          "required": false,
          "description": "The attribute's expression. Available functions are SUM() or SAMPLECOUNT(). For SUM() functions, provide the dataset type (either Interactions or Items) and column to sum as a parameter. For example SUM(Items.PRICE).",
          "nested_params": []
        }
      ]
    },
    {
      "name": "metricsOutputConfig",
      "type": "dict",
      "required": true,
      "description": "The output configuration details for the metric attribution. s3DataDestination (dict) --- The configuration details of an Amazon S3 input or output bucket. The file path of the Amazon S3 bucket. kmsKeyArn (string) --- The Amazon Resource Name (ARN) of the Key Management Service (KMS) key that Amazon Personalize uses to encrypt or decrypt the input and output files. The Amazon Resource Name (ARN) of the IAM service role that has permissions to add data to your output Amazon S3 bucket and add metrics to Amazon CloudWatch. For more information, see Measuring impact of recommendations.",
      "nested_params": [
        {
          "name": "s3DataDestination",
          "type": "dict",
          "required": false,
          "description": "The configuration details of an Amazon S3 input or output bucket.",
          "nested_params": [
            {
              "name": "path",
              "type": "string",
              "required": false,
              "description": "The file path of the Amazon S3 bucket.",
              "nested_params": []
            },
            {
              "name": "kmsKeyArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of the Key Management Service (KMS) key that Amazon Personalize uses to encrypt or decrypt the input and output files.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "roleArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the IAM service role that has permissions to add data to your output Amazon S3 bucket and add metrics to Amazon CloudWatch. For more information, see Measuring impact of recommendations.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "metricAttributionArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) for the new metric attribution.",
          "nested_items": []
        }
      ]
    }
  ]
}