{
  "method_name": "create_data_deletion_job",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/personalize/client/create_data_deletion_job.html",
  "description": "Creates a batch job that deletes all references to specific users from an Amazon Personalize dataset group in batches. You specify the users to delete in a CSV file of userIds in an Amazon S3 bucket. After a job completes, Amazon Personalize no longer trains on the users' data and no longer considers the users when generating user segments. For more information about creating a data deletion job, see Deleting users. After you create a job, it can take up to a day to delete all references to the users from datasets and models. Until the job completes, Amazon Personalize continues to use the data when training. And if you use a User Segmentation recipe, the users might appear in user segments. A data deletion job can have one of the following statuses: To get the status of the data deletion job, call DescribeDataDeletionJob API operation and specify the Amazon Resource Name (ARN) of the job. If the status is FAILED, the response includes a failureReason key, which describes why the job failed.",
  "parameters": [
    {
      "name": "jobName",
      "type": "string",
      "required": true,
      "description": "The name for the data deletion job.",
      "nested_params": []
    },
    {
      "name": "datasetGroupArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the dataset group that has the datasets you want to delete records from.",
      "nested_params": []
    },
    {
      "name": "dataSource",
      "type": "dict",
      "required": true,
      "description": "The Amazon S3 bucket that contains the list of userIds of the users to delete. dataLocation (string) --- For dataset import jobs, the path to the Amazon S3 bucket where the data that you want to upload to your dataset is stored. For data deletion jobs, the path to the Amazon S3 bucket that stores the list of records to delete. For example: s3://bucket-name/folder-name/fileName.csv If your CSV files are in a folder in your Amazon S3 bucket and you want your import job or data deletion job to consider multiple files, you can specify the path to the folder. With a data deletion job, Amazon Personalize uses all files in the folder and any sub folder. Use the following syntax with a / after the folder name: s3://bucket-name/folder-name/",
      "nested_params": [
        {
          "name": "dataLocation",
          "type": "string",
          "required": false,
          "description": "For dataset import jobs, the path to the Amazon S3 bucket where the data that you want to upload to your dataset is stored. For data deletion jobs, the path to the Amazon S3 bucket that stores the list of records to delete. For example: s3://bucket-name/folder-name/fileName.csv If your CSV files are in a folder in your Amazon S3 bucket and you want your import job or data deletion job to consider multiple files, you can specify the path to the folder. With a data deletion job, Amazon Personalize uses all files in the folder and any sub folder. Use the following syntax with a / after the folder name: s3://bucket-name/folder-name/",
          "nested_params": []
        }
      ]
    },
    {
      "name": "roleArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the IAM role that has permissions to read from the Amazon S3 data source.",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "list",
      "required": true,
      "description": "A list of tags to apply to the data deletion job. (dict) --- The optional metadata that you apply to resources to help you categorize and organize them. Each tag consists of a key and an optional value, both of which you define. For more information see Tagging Amazon Personalize resources. One part of a key-value pair that makes up a tag. A key is a general label that acts like a category for more specific tag values. The optional part of a key-value pair that makes up a tag. A value acts as a descriptor within a tag category (key).",
      "nested_params": [
        {
          "name": "tagKey",
          "type": "string",
          "required": false,
          "description": "One part of a key-value pair that makes up a tag. A key is a general label that acts like a category for more specific tag values.",
          "nested_params": []
        },
        {
          "name": "tagValue",
          "type": "string",
          "required": false,
          "description": "The optional part of a key-value pair that makes up a tag. A value acts as a descriptor within a tag category (key).",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "dataDeletionJobArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the data deletion job.",
          "nested_items": []
        }
      ]
    }
  ]
}