{
  "method_name": "update_campaign",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/personalize/client/update_campaign.html",
  "description": "Updates a campaign to deploy a retrained solution version with an existing campaign, change your campaign's minProvisionedTPS, or modify your campaign's configuration. For example, you can set enableMetadataWithRecommendations to true for an existing campaign. To update a campaign to start automatically using the latest solution version, specify the following: To update a campaign, the campaign status must be ACTIVE or CREATE FAILED. Check the campaign status using the DescribeCampaign operation. For more information about updating a campaign, including code samples, see Updating a campaign. For more information about campaigns, see Creating a campaign.",
  "parameters": [
    {
      "name": "campaignArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the campaign.",
      "nested_params": []
    },
    {
      "name": "solutionVersionArn",
      "type": "string",
      "required": false,
      "description": "The Amazon Resource Name (ARN) of a new model to deploy. To specify the latest solution version of your solution, specify the ARN of your solution in SolutionArn/$LATEST format. You must use this format if you set syncWithLatestSolutionVersion to True in the CampaignConfig. To deploy a model that isn't the latest solution version of your solution, specify the ARN of the solution version. For more information about automatic campaign updates, see Enabling automatic campaign updates.",
      "nested_params": []
    },
    {
      "name": "minProvisionedTPS",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "campaignConfig",
      "type": "dict",
      "required": false,
      "description": "The configuration details of a campaign. itemExplorationConfig (dict) --- Specifies the exploration configuration hyperparameters, including explorationWeight and explorationItemAgeCutOff, you want to use to configure the amount of item exploration Amazon Personalize uses when recommending items. Provide itemExplorationConfig data only if your solution uses the User-Personalization recipe. (string) --- (string) --- enableMetadataWithRecommendations (boolean) --- Whether metadata with recommendations is enabled for the campaign. If enabled, you can specify the columns from your Items dataset in your request for recommendations. Amazon Personalize returns this data for each item in the recommendation response. For information about enabling metadata for a campaign, see Enabling metadata in recommendations for a campaign. If you enable metadata in recommendations, you will incur additional costs. For more information, see Amazon Personalize pricing. syncWithLatestSolutionVersion (boolean) --- Whether the campaign automatically updates to use the latest solution version (trained model) of a solution. If you specify True, you must specify the ARN of your solution for the SolutionVersionArn parameter. It must be in SolutionArn/$LATEST format. The default is False and you must manually update the campaign to deploy the latest solution version. For more information about automatic campaign updates, see Enabling automatic campaign updates.",
      "nested_params": [
        {
          "name": "itemExplorationConfig",
          "type": "dict",
          "required": false,
          "description": "Specifies the exploration configuration hyperparameters, including explorationWeight and explorationItemAgeCutOff, you want to use to configure the amount of item exploration Amazon Personalize uses when recommending items. Provide itemExplorationConfig data only if your solution uses the User-Personalization recipe.",
          "nested_params": []
        },
        {
          "name": "enableMetadataWithRecommendations",
          "type": "boolean",
          "required": false,
          "description": "Whether metadata with recommendations is enabled for the campaign. If enabled, you can specify the columns from your Items dataset in your request for recommendations. Amazon Personalize returns this data for each item in the recommendation response. For information about enabling metadata for a campaign, see Enabling metadata in recommendations for a campaign. If you enable metadata in recommendations, you will incur additional costs. For more information, see Amazon Personalize pricing.",
          "nested_params": []
        },
        {
          "name": "syncWithLatestSolutionVersion",
          "type": "boolean",
          "required": false,
          "description": "Whether the campaign automatically updates to use the latest solution version (trained model) of a solution. If you specify True, you must specify the ARN of your solution for the SolutionVersionArn parameter. It must be in SolutionArn/$LATEST format. The default is False and you must manually update the campaign to deploy the latest solution version. For more information about automatic campaign updates, see Enabling automatic campaign updates.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "campaignArn",
          "type": "string",
          "description": "The same campaign ARN as given in the request.",
          "nested_items": []
        }
      ]
    }
  ]
}