{
  "method_name": "update_recommender",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/personalize/client/update_recommender.html",
  "description": "Updates the recommender to modify the recommender configuration. If you update the recommender to modify the columns used in training, Amazon Personalize automatically starts a full retraining of the models backing your recommender. While the update completes, you can still get recommendations from the recommender. The recommender uses the previous configuration until the update completes. To track the status of this update, use the latestRecommenderUpdate returned in the DescribeRecommender operation.",
  "parameters": [
    {
      "name": "recommenderArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the recommender to modify.",
      "nested_params": []
    },
    {
      "name": "recommenderConfig",
      "type": "dict",
      "required": true,
      "description": "The configuration details of the recommender. itemExplorationConfig (dict) --- Specifies the exploration configuration hyperparameters, including explorationWeight and explorationItemAgeCutOff, you want to use to configure the amount of item exploration Amazon Personalize uses when recommending items. Provide itemExplorationConfig data only if your recommenders generate personalized recommendations for a user (not popular items or similar items). (string) --- (string) --- minRecommendationRequestsPerSecond (integer) --- Specifies the requested minimum provisioned recommendation requests per second that Amazon Personalize will support. A high minRecommendationRequestsPerSecond will increase your bill. We recommend starting with 1 for minRecommendationRequestsPerSecond (the default). Track your usage using Amazon CloudWatch metrics, and increase the minRecommendationRequestsPerSecond as necessary. trainingDataConfig (dict) --- Specifies the training data configuration to use when creating a domain recommender. excludedDatasetColumns (dict) --- Specifies the columns to exclude from training. Each key is a dataset type, and each value is a list of columns. Exclude columns to control what data Amazon Personalize uses to generate recommendations. For example, you might have a column that you want to use only to filter recommendations. You can exclude this column from training and Amazon Personalize considers it only when filtering. (string) --- (list) --- (string) --- enableMetadataWithRecommendations (boolean) --- Whether metadata with recommendations is enabled for the recommender. If enabled, you can specify the columns from your Items dataset in your request for recommendations. Amazon Personalize returns this data for each item in the recommendation response. For information about enabling metadata for a recommender, see Enabling metadata in recommendations for a recommender. If you enable metadata in recommendations, you will incur additional costs. For more information, see Amazon Personalize pricing.",
      "nested_params": [
        {
          "name": "itemExplorationConfig",
          "type": "dict",
          "required": false,
          "description": "Specifies the exploration configuration hyperparameters, including explorationWeight and explorationItemAgeCutOff, you want to use to configure the amount of item exploration Amazon Personalize uses when recommending items. Provide itemExplorationConfig data only if your recommenders generate personalized recommendations for a user (not popular items or similar items).",
          "nested_params": []
        },
        {
          "name": "minRecommendationRequestsPerSecond",
          "type": "integer",
          "required": false,
          "description": "Specifies the requested minimum provisioned recommendation requests per second that Amazon Personalize will support. A high minRecommendationRequestsPerSecond will increase your bill. We recommend starting with 1 for minRecommendationRequestsPerSecond (the default). Track your usage using Amazon CloudWatch metrics, and increase the minRecommendationRequestsPerSecond as necessary.",
          "nested_params": []
        },
        {
          "name": "trainingDataConfig",
          "type": "dict",
          "required": false,
          "description": "Specifies the training data configuration to use when creating a domain recommender.",
          "nested_params": [
            {
              "name": "excludedDatasetColumns",
              "type": "dict",
              "required": false,
              "description": "Specifies the columns to exclude from training. Each key is a dataset type, and each value is a list of columns. Exclude columns to control what data Amazon Personalize uses to generate recommendations. For example, you might have a column that you want to use only to filter recommendations. You can exclude this column from training and Amazon Personalize considers it only when filtering.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "enableMetadataWithRecommendations",
          "type": "boolean",
          "required": false,
          "description": "Whether metadata with recommendations is enabled for the recommender. If enabled, you can specify the columns from your Items dataset in your request for recommendations. Amazon Personalize returns this data for each item in the recommendation response. For information about enabling metadata for a recommender, see Enabling metadata in recommendations for a recommender. If you enable metadata in recommendations, you will incur additional costs. For more information, see Amazon Personalize pricing.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "recommenderArn",
          "type": "string",
          "description": "The same recommender Amazon Resource Name (ARN) as given in the request.",
          "nested_items": []
        }
      ]
    }
  ]
}