{
  "method_name": "modify_instance_groups",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/emr/client/modify_instance_groups.html",
  "description": "ModifyInstanceGroups modifies the number of nodes and configuration settings of an instance group. The input parameters include the new target instance count for the group and the instance group ID. The call will either succeed or fail atomically.",
  "parameters": [
    {
      "name": "ClusterId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "InstanceGroups",
      "type": "list",
      "required": true,
      "description": "Instance groups to change. (dict) --- Modify the size or configurations of an instance group. Unique ID of the instance group to modify. InstanceCount (integer) --- Target size for the instance group. EC2InstanceIdsToTerminate (list) --- The Amazon EC2 InstanceIds to terminate. After you terminate the instances, the instance group will not return to its original requested size. (string) --- ShrinkPolicy (dict) --- Policy for customizing shrink operations. DecommissionTimeout (integer) --- The desired timeout for decommissioning an instance. Overrides the default YARN decommissioning timeout. InstanceResizePolicy (dict) --- Custom policy for requesting termination protection or termination of specific instances when shrinking an instance group. InstancesToTerminate (list) --- Specific list of instances to be terminated when shrinking an instance group. (string) --- InstancesToProtect (list) --- Specific list of instances to be protected when shrinking an instance group. (string) --- InstanceTerminationTimeout (integer) --- Decommissioning timeout override for the specific list of instances to be terminated. ReconfigurationType (string) --- Type of reconfiguration requested. Valid values are MERGE and OVERWRITE. Configurations (list) --- A list of new or modified configurations to apply for an instance group. (dict) --- An optional configuration specification to be used when provisioning cluster instances, which can include configurations for applications and software bundled with Amazon EMR. A configuration consists of a classification, properties, and optional nested configurations. A classification refers to an application-specific configuration file. Properties are the settings you want to change in that file. For more information, see Configuring Applications. Classification (string) --- The classification within a configuration. Configurations (list) --- A list of additional configurations to apply within a configuration object. Properties (dict) --- A set of properties specified within a configuration classification. (string) --- (string) ---",
      "nested_params": [
        {
          "name": "InstanceGroupId",
          "type": "string",
          "required": false,
          "description": "Unique ID of the instance group to modify.",
          "nested_params": []
        },
        {
          "name": "InstanceCount",
          "type": "integer",
          "required": false,
          "description": "Target size for the instance group.",
          "nested_params": []
        },
        {
          "name": "EC2InstanceIdsToTerminate",
          "type": "list",
          "required": false,
          "description": "The Amazon EC2 InstanceIds to terminate. After you terminate the instances, the instance group will not return to its original requested size.",
          "nested_params": []
        },
        {
          "name": "ShrinkPolicy",
          "type": "dict",
          "required": false,
          "description": "Policy for customizing shrink operations.",
          "nested_params": [
            {
              "name": "DecommissionTimeout",
              "type": "integer",
              "required": false,
              "description": "The desired timeout for decommissioning an instance. Overrides the default YARN decommissioning timeout.",
              "nested_params": []
            },
            {
              "name": "InstanceResizePolicy",
              "type": "dict",
              "required": false,
              "description": "Custom policy for requesting termination protection or termination of specific instances when shrinking an instance group.",
              "nested_params": [
                {
                  "name": "InstancesToTerminate",
                  "type": "list",
                  "required": false,
                  "description": "Specific list of instances to be terminated when shrinking an instance group.",
                  "nested_params": []
                },
                {
                  "name": "InstancesToProtect",
                  "type": "list",
                  "required": false,
                  "description": "Specific list of instances to be protected when shrinking an instance group.",
                  "nested_params": []
                },
                {
                  "name": "InstanceTerminationTimeout",
                  "type": "integer",
                  "required": false,
                  "description": "Decommissioning timeout override for the specific list of instances to be terminated.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "ReconfigurationType",
          "type": "string",
          "required": false,
          "description": "Type of reconfiguration requested. Valid values are MERGE and OVERWRITE.",
          "nested_params": []
        },
        {
          "name": "Configurations",
          "type": "list",
          "required": false,
          "description": "A list of new or modified configurations to apply for an instance group.",
          "nested_params": [
            {
              "name": "Classification",
              "type": "string",
              "required": false,
              "description": "The classification within a configuration.",
              "nested_params": []
            },
            {
              "name": "Configurations",
              "type": "list",
              "required": false,
              "description": "A list of additional configurations to apply within a configuration object.",
              "nested_params": []
            },
            {
              "name": "Properties",
              "type": "dict",
              "required": false,
              "description": "A set of properties specified within a configuration classification.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}