{
  "method_name": "put_managed_scaling_policy",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/emr/client/put_managed_scaling_policy.html",
  "description": "Creates or updates a managed scaling policy for an Amazon EMR cluster. The managed scaling policy defines the limits for resources, such as Amazon EC2 instances that can be added or terminated from a cluster. The policy only applies to the core and task nodes. The master node cannot be scaled after initial configuration.",
  "parameters": [
    {
      "name": "ClusterId",
      "type": "string",
      "required": true,
      "description": "Specifies the ID of an Amazon EMR cluster where the managed scaling policy is attached.",
      "nested_params": []
    },
    {
      "name": "ManagedScalingPolicy",
      "type": "dict",
      "required": true,
      "description": "Specifies the constraints for the managed scaling policy. ComputeLimits (dict) --- The Amazon EC2 unit limits for a managed scaling policy. The managed scaling activity of a cluster is not allowed to go above or below these limits. The limit only applies to the core and task nodes. The master node cannot be scaled after initial configuration. The unit type used for specifying a managed scaling policy. The lower boundary of Amazon EC2 units. It is measured through vCPU cores or instances for instance groups and measured through units for instance fleets. Managed scaling activities are not allowed beyond this boundary. The upper boundary of Amazon EC2 units. MaximumOnDemandCapacityUnits (integer) --- The upper boundary of On-Demand Amazon EC2 units. The On-Demand units are not allowed to scale beyond this boundary. The parameter is used to split capacity allocation between On-Demand and Spot Instances. MaximumCoreCapacityUnits (integer) --- The upper boundary of Amazon EC2 units for core node type in a cluster. The core units are not allowed to scale beyond this boundary. The parameter is used to split capacity allocation between core and task nodes. UtilizationPerformanceIndex (integer) --- An integer value that represents an advanced scaling strategy. Setting a higher value optimizes for performance. Setting a lower value optimizes for resource conservation. Setting the value to 50 balances performance and resource conservation. Possible values are 1, 25, 50, 75, and 100. ScalingStrategy (string) --- Determines whether a custom scaling utilization performance index can be set. Possible values include ADVANCED or DEFAULT.",
      "nested_params": [
        {
          "name": "ComputeLimits",
          "type": "dict",
          "required": false,
          "description": "The Amazon EC2 unit limits for a managed scaling policy. The managed scaling activity of a cluster is not allowed to go above or below these limits. The limit only applies to the core and task nodes. The master node cannot be scaled after initial configuration.",
          "nested_params": [
            {
              "name": "UnitType",
              "type": "string",
              "required": false,
              "description": "The unit type used for specifying a managed scaling policy.",
              "nested_params": []
            },
            {
              "name": "MinimumCapacityUnits",
              "type": "integer",
              "required": false,
              "description": "The lower boundary of Amazon EC2 units. It is measured through vCPU cores or instances for instance groups and measured through units for instance fleets. Managed scaling activities are not allowed beyond this boundary. The limit only applies to the core and task nodes. The master node cannot be scaled after initial configuration.",
              "nested_params": []
            },
            {
              "name": "MaximumCapacityUnits",
              "type": "integer",
              "required": false,
              "description": "The upper boundary of Amazon EC2 units. It is measured through vCPU cores or instances for instance groups and measured through units for instance fleets. Managed scaling activities are not allowed beyond this boundary. The limit only applies to the core and task nodes. The master node cannot be scaled after initial configuration.",
              "nested_params": []
            },
            {
              "name": "MaximumOnDemandCapacityUnits",
              "type": "integer",
              "required": false,
              "description": "The upper boundary of On-Demand Amazon EC2 units. It is measured through vCPU cores or instances for instance groups and measured through units for instance fleets. The On-Demand units are not allowed to scale beyond this boundary. The parameter is used to split capacity allocation between On-Demand and Spot Instances.",
              "nested_params": []
            },
            {
              "name": "MaximumCoreCapacityUnits",
              "type": "integer",
              "required": false,
              "description": "The upper boundary of Amazon EC2 units for core node type in a cluster. It is measured through vCPU cores or instances for instance groups and measured through units for instance fleets. The core units are not allowed to scale beyond this boundary. The parameter is used to split capacity allocation between core and task nodes.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "UtilizationPerformanceIndex",
          "type": "integer",
          "required": false,
          "description": "An integer value that represents an advanced scaling strategy. Setting a higher value optimizes for performance. Setting a lower value optimizes for resource conservation. Setting the value to 50 balances performance and resource conservation. Possible values are 1, 25, 50, 75, and 100.",
          "nested_params": []
        },
        {
          "name": "ScalingStrategy",
          "type": "string",
          "required": false,
          "description": "Determines whether a custom scaling utilization performance index can be set. Possible values include ADVANCED or DEFAULT.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}