{
  "method_name": "update_zonal_autoshift_configuration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/arc-zonal-shift/client/update_zonal_autoshift_configuration.html",
  "description": "The zonal autoshift configuration for a resource includes the practice run configuration and the status for running autoshifts, zonal autoshift status. When a resource has a practice run configuation, Route 53 ARC starts weekly zonal shifts for the resource, to shift traffic away from an Availability Zone. Weekly practice runs help you to make sure that your application can continue to operate normally with the loss of one Availability Zone. You can update the zonal autoshift autoshift status to enable or disable zonal autoshift. When zonal autoshift is ENABLED, you authorize Amazon Web Services to shift away resource traffic for an application from an Availability Zone during events, on your behalf, to help reduce time to recovery. Traffic is also shifted away for the required weekly practice runs.",
  "parameters": [
    {
      "name": "resourceIdentifier",
      "type": "string",
      "required": true,
      "description": "The identifier for the resource that you want to update the zonal autoshift configuration for. The identifier is the Amazon Resource Name (ARN) for the resource.",
      "nested_params": []
    },
    {
      "name": "zonalAutoshiftStatus",
      "type": "string",
      "required": true,
      "description": "The zonal autoshift status for the resource that you want to update the zonal autoshift configuration for. Choose ENABLED to authorize Amazon Web Services to shift away resource traffic for an application from an Availability Zone during events, on your behalf, to help reduce time to recovery.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "resourceIdentifier",
          "type": "string",
          "description": "The identifier for the resource that you updated the zonal autoshift configuration for. The identifier is the Amazon Resource Name (ARN) for the resource.",
          "nested_items": []
        },
        {
          "name": "zonalAutoshiftStatus",
          "type": "string",
          "description": "The updated zonal autoshift status for the resource.",
          "nested_items": []
        }
      ]
    }
  ]
}