{
  "method_name": "create_subscriber_notification",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/securitylake/client/create_subscriber_notification.html",
  "description": "Notifies the subscriber when new data is written to the data lake for the sources that the subscriber consumes in Security Lake. You can create only one subscriber notification per subscriber.",
  "parameters": [
    {
      "name": "configuration",
      "type": "dict",
      "required": true,
      "description": "Specify the configuration using which you want to create the subscriber notification. httpsNotificationConfiguration (dict) --- The configurations used for HTTPS subscriber notification. authorizationApiKeyName (string) --- The key name for the notification subscription. authorizationApiKeyValue (string) --- The key value for the notification subscription. The subscription endpoint in Security Lake. If you prefer notification with an HTTPs endpoint, populate this field. httpMethod (string) --- The HTTPS method used for the notification subscription. The Amazon Resource Name (ARN) of the EventBridge API destinations IAM role that you created. For more information about ARNs and how to use them in policies, see Managing data access and Amazon Web Services Managed Policies in the Amazon Security Lake User Guide. sqsNotificationConfiguration (dict) --- The configurations for SQS subscriber notification.",
      "nested_params": [
        {
          "name": "httpsNotificationConfiguration",
          "type": "dict",
          "required": false,
          "description": "The configurations used for HTTPS subscriber notification.",
          "nested_params": [
            {
              "name": "authorizationApiKeyName",
              "type": "string",
              "required": false,
              "description": "The key name for the notification subscription.",
              "nested_params": []
            },
            {
              "name": "authorizationApiKeyValue",
              "type": "string",
              "required": false,
              "description": "The key value for the notification subscription.",
              "nested_params": []
            },
            {
              "name": "endpoint",
              "type": "string",
              "required": false,
              "description": "The subscription endpoint in Security Lake. If you prefer notification with an HTTPs endpoint, populate this field.",
              "nested_params": []
            },
            {
              "name": "httpMethod",
              "type": "string",
              "required": false,
              "description": "The HTTPS method used for the notification subscription.",
              "nested_params": []
            },
            {
              "name": "targetRoleArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of the EventBridge API destinations IAM role that you created. For more information about ARNs and how to use them in policies, see Managing data access and Amazon Web Services Managed Policies in the Amazon Security Lake User Guide.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "sqsNotificationConfiguration",
          "type": "dict",
          "required": false,
          "description": "The configurations for SQS subscriber notification.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "subscriberId",
      "type": "string",
      "required": true,
      "description": "The subscriber ID for the notification subscription.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "subscriberEndpoint",
          "type": "string",
          "description": "The subscriber endpoint to which exception messages are posted.",
          "nested_items": []
        }
      ]
    }
  ]
}