{
  "method_name": "update_data_lake",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/securitylake/client/update_data_lake.html",
  "description": "You can use UpdateDataLake to specify where to store your security data, how it should be encrypted at rest and for how long. You can add a Rollup Region to consolidate data from multiple Amazon Web Services Regions, replace default encryption (SSE-S3) with Customer Manged Key, or specify transition and expiration actions through storage Lifecycle management. The UpdateDataLake API works as an 'upsert' operation that performs an insert if the specified item or record does not exist, or an update if it already exists. Security Lake securely stores your data at rest using Amazon Web Services encryption solutions. For more details, see Data protection in Amazon Security Lake. For example, omitting the key encryptionConfiguration from a Region that is included in an update call that currently uses KMS will leave that Region's KMS key in place, but specifying encryptionConfiguration: {kmsKeyId: 'S3_MANAGED_KEY'} for that same Region will reset the key to S3-managed. For more details about lifecycle management and how to update retention settings for one or more Regions after enabling Security Lake, see the Amazon Security Lake User Guide.",
  "parameters": [
    {
      "name": "configurations",
      "type": "list",
      "required": true,
      "description": "Specifies the Region or Regions that will contribute data to the rollup region. (dict) --- Provides details of Amazon Security Lake object. encryptionConfiguration (dict) --- Provides encryption details of Amazon Security Lake object. kmsKeyId (string) --- The identifier of KMS encryption key used by Amazon Security Lake to encrypt the Security Lake object. lifecycleConfiguration (dict) --- Provides lifecycle details of Amazon Security Lake object. expiration (dict) --- Provides data expiration details of Amazon Security Lake object. days (integer) --- Number of days before data expires in the Amazon Security Lake object. transitions (list) --- Provides data storage transition details of Amazon Security Lake object. (dict) --- Provide transition lifecycle details of Amazon Security Lake object. days (integer) --- Number of days before data transitions to a different S3 Storage Class in the Amazon Security Lake object. storageClass (string) --- The range of storage classes that you can choose from based on the data access, resiliency, and cost requirements of your workloads. The Amazon Web Services Regions where Security Lake is automatically enabled. replicationConfiguration (dict) --- Provides replication details of Amazon Security Lake object. regions (list) --- Specifies one or more centralized rollup Regions. The Amazon Web Services Region specified in the region parameter of the CreateDataLake or UpdateDataLake operations contributes data to the rollup Region or Regions specified in this parameter. Replication enables automatic, asynchronous copying of objects across Amazon S3 buckets. S3 buckets that are configured for object replication can be owned by the same Amazon Web Services account or by different accounts. You can replicate objects to a single destination bucket or to multiple destination buckets. The destination buckets can be in different Regions or within the same Region as the source bucket. (string) --- roleArn (string) --- Replication settings for the Amazon S3 buckets. This parameter uses the Identity and Access Management (IAM) role you created that is managed by Security Lake, to ensure the replication setting is correct.",
      "nested_params": [
        {
          "name": "encryptionConfiguration",
          "type": "dict",
          "required": false,
          "description": "Provides encryption details of Amazon Security Lake object.",
          "nested_params": [
            {
              "name": "kmsKeyId",
              "type": "string",
              "required": false,
              "description": "The identifier of KMS encryption key used by Amazon Security Lake to encrypt the Security Lake object.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "lifecycleConfiguration",
          "type": "dict",
          "required": false,
          "description": "Provides lifecycle details of Amazon Security Lake object.",
          "nested_params": [
            {
              "name": "expiration",
              "type": "dict",
              "required": false,
              "description": "Provides data expiration details of Amazon Security Lake object.",
              "nested_params": [
                {
                  "name": "days",
                  "type": "integer",
                  "required": false,
                  "description": "Number of days before data expires in the Amazon Security Lake object.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "transitions",
              "type": "list",
              "required": false,
              "description": "Provides data storage transition details of Amazon Security Lake object.",
              "nested_params": [
                {
                  "name": "days",
                  "type": "integer",
                  "required": false,
                  "description": "Number of days before data transitions to a different S3 Storage Class in the Amazon Security Lake object.",
                  "nested_params": []
                },
                {
                  "name": "storageClass",
                  "type": "string",
                  "required": false,
                  "description": "The range of storage classes that you can choose from based on the data access, resiliency, and cost requirements of your workloads.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "region",
          "type": "string",
          "required": false,
          "description": "The Amazon Web Services Regions where Security Lake is automatically enabled.",
          "nested_params": []
        },
        {
          "name": "replicationConfiguration",
          "type": "dict",
          "required": false,
          "description": "Provides replication details of Amazon Security Lake object.",
          "nested_params": [
            {
              "name": "regions",
              "type": "list",
              "required": false,
              "description": "Specifies one or more centralized rollup Regions. The Amazon Web Services Region specified in the region parameter of the CreateDataLake or UpdateDataLake operations contributes data to the rollup Region or Regions specified in this parameter. Replication enables automatic, asynchronous copying of objects across Amazon S3 buckets. S3 buckets that are configured for object replication can be owned by the same Amazon Web Services account or by different accounts. You can replicate objects to a single destination bucket or to multiple destination buckets. The destination buckets can be in different Regions or within the same Region as the source bucket.",
              "nested_params": []
            },
            {
              "name": "roleArn",
              "type": "string",
              "required": false,
              "description": "Replication settings for the Amazon S3 buckets. This parameter uses the Identity and Access Management (IAM) role you created that is managed by Security Lake, to ensure the replication setting is correct.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "metaStoreManagerRoleArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "dataLakes",
          "type": "list",
          "description": "The created Security Lake configuration object.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "createStatus",
                  "type": "string",
                  "description": "Retrieves the status of the CreateDatalake API call for an account in Amazon Security Lake.",
                  "nested_items": []
                },
                {
                  "name": "dataLakeArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) created by you to provide to the subscriber. For more information about ARNs and how to use them in policies, see the Amazon Security Lake User Guide.",
                  "nested_items": []
                },
                {
                  "name": "encryptionConfiguration",
                  "type": "dict",
                  "description": "Provides encryption details of Amazon Security Lake object.",
                  "nested_items": [
                    {
                      "name": "kmsKeyId",
                      "type": "string",
                      "description": "The identifier of KMS encryption key used by Amazon Security Lake to encrypt the Security Lake object.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "lifecycleConfiguration",
                  "type": "dict",
                  "description": "Provides lifecycle details of Amazon Security Lake object.",
                  "nested_items": [
                    {
                      "name": "expiration",
                      "type": "dict",
                      "description": "Provides data expiration details of Amazon Security Lake object.",
                      "nested_items": [
                        {
                          "name": "days",
                          "type": "integer",
                          "description": "Number of days before data expires in the Amazon Security Lake object.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "transitions",
                      "type": "list",
                      "description": "Provides data storage transition details of Amazon Security Lake object.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "days",
                              "type": "integer",
                              "description": "Number of days before data transitions to a different S3 Storage Class in the Amazon Security Lake object.",
                              "nested_items": []
                            },
                            {
                              "name": "storageClass",
                              "type": "string",
                              "description": "The range of storage classes that you can choose from based on the data access, resiliency, and cost requirements of your workloads.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "region",
                  "type": "string",
                  "description": "The Amazon Web Services Regions where Security Lake is enabled.",
                  "nested_items": []
                },
                {
                  "name": "replicationConfiguration",
                  "type": "dict",
                  "description": "Provides replication details of Amazon Security Lake object.",
                  "nested_items": [
                    {
                      "name": "regions",
                      "type": "list",
                      "description": "Specifies one or more centralized rollup Regions. The Amazon Web Services Region specified in the region parameter of the CreateDataLake or UpdateDataLake operations contributes data to the rollup Region or Regions specified in this parameter.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "roleArn",
                      "type": "string",
                      "description": "Replication settings for the Amazon S3 buckets. This parameter uses the Identity and Access Management (IAM) role you created that is managed by Security Lake, to ensure the replication setting is correct.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "s3BucketArn",
                  "type": "string",
                  "description": "The ARN for the Amazon Security Lake Amazon S3 bucket.",
                  "nested_items": []
                },
                {
                  "name": "updateStatus",
                  "type": "dict",
                  "description": "The status of the last UpdateDataLake ``or ``DeleteDataLake API request.",
                  "nested_items": [
                    {
                      "name": "exception",
                      "type": "dict",
                      "description": "The details of the last UpdateDataLake``or ``DeleteDataLake API request which failed.",
                      "nested_items": [
                        {
                          "name": "code",
                          "type": "string",
                          "description": "The reason code for the exception of the last UpdateDataLake or DeleteDataLake API request.",
                          "nested_items": []
                        },
                        {
                          "name": "reason",
                          "type": "string",
                          "description": "The reason for the exception of the last UpdateDataLake``or ``DeleteDataLake API request.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "requestId",
                      "type": "string",
                      "description": "The unique ID for the last UpdateDataLake or DeleteDataLake API request.",
                      "nested_items": []
                    },
                    {
                      "name": "status",
                      "type": "string",
                      "description": "The status of the last UpdateDataLake or DeleteDataLake API request that was requested.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}