{
  "method_name": "get_policy",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iam/client/get_policy.html",
  "description": "Retrieves information about the specified managed policy, including the policy's default version and the total number of IAM users, groups, and roles to which the policy is attached. To retrieve the list of the specific users, groups, and roles that the policy is attached to, use  ListEntitiesForPolicy. This operation returns metadata about the policy. To retrieve the actual policy document for a specific version of the policy, use  GetPolicyVersion. This operation retrieves information about managed policies. To retrieve information about an inline policy that is embedded with an IAM user, group, or role, use  GetUserPolicy,  GetGroupPolicy, or  GetRolePolicy. For more information about policies, see Managed policies and inline policies in the IAM User Guide.",
  "parameters": [
    {
      "name": "PolicyArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the managed policy that you want information about. For more information about ARNs, see Amazon Resource Names (ARNs) in the Amazon Web Services General Reference.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "PolicyName",
              "type": "string",
              "description": "The friendly name (not ARN) identifying the policy.",
              "nested_items": []
            },
            {
              "name": "PolicyId",
              "type": "string",
              "description": "The stable and unique string identifying the policy.",
              "nested_items": []
            },
            {
              "name": "Arn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN). ARNs are unique identifiers for Amazon Web Services resources.",
              "nested_items": []
            },
            {
              "name": "Path",
              "type": "string",
              "description": "The path to the policy.",
              "nested_items": []
            },
            {
              "name": "DefaultVersionId",
              "type": "string",
              "description": "The identifier for the version of the policy that is set as the default version.",
              "nested_items": []
            },
            {
              "name": "AttachmentCount",
              "type": "integer",
              "description": "The number of entities (users, groups, and roles) that the policy is attached to.",
              "nested_items": []
            },
            {
              "name": "PermissionsBoundaryUsageCount",
              "type": "integer",
              "description": "The number of entities (users and roles) for which the policy is used to set the permissions boundary.",
              "nested_items": []
            },
            {
              "name": "IsAttachable",
              "type": "boolean",
              "description": "Specifies whether the policy can be attached to an IAM user, group, or role.",
              "nested_items": []
            },
            {
              "name": "Description",
              "type": "string",
              "description": "A friendly description of the policy.",
              "nested_items": []
            },
            {
              "name": "CreateDate",
              "type": "datetime",
              "description": "The date and time, in ISO 8601 date-time format, when the policy was created.",
              "nested_items": []
            },
            {
              "name": "UpdateDate",
              "type": "datetime",
              "description": "The date and time, in ISO 8601 date-time format, when the policy was last updated.",
              "nested_items": []
            },
            {
              "name": "Tags",
              "type": "list",
              "description": "A list of tags that are attached to the instance profile. For more information about tagging, see Tagging IAM resources in the IAM User Guide.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Key",
                      "type": "string",
                      "description": "The key name that can be used to look up or retrieve the associated value. For example, Department or Cost Center are common choices.",
                      "nested_items": []
                    },
                    {
                      "name": "Value",
                      "type": "string",
                      "description": "The value associated with this tag. For example, tags with a key name of Department could have values such as Human Resources, Accounting, and Support. Tags with a key name of Cost Center might have values that consist of the number associated with the different cost centers in your company. Typically, many resources have tags with the same key name but with different values.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}