{
  "method_name": "reset_service_specific_credential",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iam/client/reset_service_specific_credential.html",
  "description": "Resets the password for a service-specific credential. The new password is Amazon Web Services generated and cryptographically strong. It cannot be configured by the user. Resetting the password immediately invalidates the previous password associated with this user.",
  "parameters": [
    {
      "name": "UserName",
      "type": "string",
      "required": false,
      "description": "The name of the IAM user associated with the service-specific credential. If this value is not specified, then the operation assumes the user whose credentials are used to call the operation. This parameter allows (through its regex pattern) a string of characters consisting of upper and lowercase alphanumeric characters with no spaces. You can also include any of the following characters: _+=,.@-",
      "nested_params": []
    },
    {
      "name": "ServiceSpecificCredentialId",
      "type": "string",
      "required": true,
      "description": "The unique identifier of the service-specific credential. This parameter allows (through its regex pattern) a string of characters that can consist of any upper or lowercased letter or digit.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ServiceSpecificCredential",
          "type": "dict",
          "description": "A structure with details about the updated service-specific credential, including the new password.",
          "nested_items": [
            {
              "name": "CreateDate",
              "type": "datetime",
              "description": "The date and time, in ISO 8601 date-time format, when the service-specific credential were created.",
              "nested_items": []
            },
            {
              "name": "ServiceName",
              "type": "string",
              "description": "The name of the service associated with the service-specific credential.",
              "nested_items": []
            },
            {
              "name": "ServiceUserName",
              "type": "string",
              "description": "The generated user name for the service-specific credential. This value is generated by combining the IAM user's name combined with the ID number of the Amazon Web Services account, as in jane-at-123456789012, for example. This value cannot be configured by the user.",
              "nested_items": []
            },
            {
              "name": "ServicePassword",
              "type": "string",
              "description": "The generated password for the service-specific credential.",
              "nested_items": []
            },
            {
              "name": "ServiceSpecificCredentialId",
              "type": "string",
              "description": "The unique identifier for the service-specific credential.",
              "nested_items": []
            },
            {
              "name": "UserName",
              "type": "string",
              "description": "The name of the IAM user associated with the service-specific credential.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The status of the service-specific credential. Active means that the key is valid for API calls, while Inactive means it is not.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}