{
  "method_name": "create_run_cache",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/omics/client/create_run_cache.html",
  "description": "You can create a run cache to save the task outputs from completed tasks in a run for a private workflow. Subsequent runs use the task outputs from the cache, rather than computing the task outputs again. You specify an Amazon S3 location where Amazon Web Services HealthOmics saves the cached data. This data must be immediately accessible (not in an archived state). For more information, see Creating a run cache in the Amazon Web Services HealthOmics User Guide.",
  "parameters": [
    {
      "name": "cacheBehavior",
      "type": "string",
      "required": false,
      "description": "Default cache behavior for runs that use this cache. Supported values are: CACHE_ON_FAILURE: Caches task outputs from completed tasks for runs that fail. This setting is useful if you're debugging a workflow that fails after several tasks completed successfully. The subsequent run uses the cache outputs for previously-completed tasks if the task definition, inputs, and container in ECR are identical to the prior run. CACHE_ALWAYS: Caches task outputs from completed tasks for all runs. This setting is useful in development mode, but do not use it in a production setting. If you don't specify a value, the default behavior is CACHE_ON_FAILURE. When you start a run that uses this cache, you can override the default cache behavior. For more information, see Run cache behavior in the Amazon Web Services HealthOmics User Guide.",
      "nested_params": []
    },
    {
      "name": "cacheS3Location",
      "type": "string",
      "required": true,
      "description": "Specify the S3 location for storing the cached task outputs. This data must be immediately accessible (not in an archived state).",
      "nested_params": []
    },
    {
      "name": "description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "name",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "requestId",
      "type": "string",
      "required": true,
      "description": "A unique request token, to ensure idempotency. If you don't specify a token, Amazon Web Services HealthOmics automatically generates a universally unique identifier (UUID) for the request. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "dict",
      "required": false,
      "description": "Specify one or more tags to associate with this run cache. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "cacheBucketOwnerId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "arn",
          "type": "string",
          "description": "Unique resource identifier for the run cache.",
          "nested_items": []
        },
        {
          "name": "id",
          "type": "string",
          "description": "Identifier for the run cache.",
          "nested_items": []
        },
        {
          "name": "status",
          "type": "string",
          "description": "Run cache status.",
          "nested_items": []
        },
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}