{
  "method_name": "describe_cluster_snapshots",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/redshift/client/describe_cluster_snapshots.html",
  "description": "Returns one or more snapshot objects, which contain metadata about your cluster snapshots. By default, this operation returns information about all snapshots of all clusters that are owned by your Amazon Web Services account. No information is returned for snapshots owned by inactive Amazon Web Services accounts. If you specify both tag keys and tag values in the same request, Amazon Redshift returns all snapshots that match any combination of the specified keys and values. For example, if you have owner and environment for tag keys, and admin and test for tag values, all snapshots that have any combination of those values are returned. Only snapshots that you own are returned in the response; shared snapshots are not returned with the tag key and tag value request parameters. If both tag keys and values are omitted from the request, snapshots are returned regardless of whether they have tag keys or values associated with them.",
  "parameters": [
    {
      "name": "ClusterIdentifier",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "SnapshotIdentifier",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "SnapshotArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "SnapshotType",
      "type": "string",
      "required": false,
      "description": "The type of snapshots for which you are requesting information. By default, snapshots of all types are returned. Valid Values: automated | manual.",
      "nested_params": []
    },
    {
      "name": "StartTime",
      "type": "datetime",
      "required": false,
      "description": "A value that requests only snapshots created at or after the specified time. The time value is specified in ISO 8601 format. For more information about ISO 8601, go to the ISO8601 Wikipedia page. Example: 2012-07-16T18:00:00Z.",
      "nested_params": []
    },
    {
      "name": "EndTime",
      "type": "datetime",
      "required": false,
      "description": "A time value that requests only snapshots created at or before the specified time. The time value is specified in ISO 8601 format. For more information about ISO 8601, go to the ISO8601 Wikipedia page. Example: 2012-07-16T18:00:00Z.",
      "nested_params": []
    },
    {
      "name": "MaxRecords",
      "type": "integer",
      "required": false,
      "description": "The maximum number of response records to return in each call. If the number of remaining response records exceeds the specified MaxRecords value, a value is returned in a marker field of the response. You can retrieve the next set of records by retrying the command with the returned marker value. Default: 100 Constraints: minimum 20, maximum 100.",
      "nested_params": []
    },
    {
      "name": "Marker",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "OwnerAccount",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "TagKeys",
      "type": "list",
      "required": false,
      "description": "A tag key or keys for which you want to return all matching cluster snapshots that are associated with the specified key or keys. For example, suppose that you have snapshots that are tagged with keys called owner and environment. If you specify both of these tag keys in the request, Amazon Redshift returns a response with the snapshots that have either or both of these tag keys associated with them. (string) ---",
      "nested_params": []
    },
    {
      "name": "TagValues",
      "type": "list",
      "required": false,
      "description": "A tag value or values for which you want to return all matching cluster snapshots that are associated with the specified tag value or values. For example, suppose that you have snapshots that are tagged with values called admin and test. If you specify both of these tag values in the request, Amazon Redshift returns a response with the snapshots that have either or both of these tag values associated with them. (string) ---",
      "nested_params": []
    },
    {
      "name": "ClusterExists",
      "type": "boolean",
      "required": false,
      "description": "A value that indicates whether to return snapshots only for an existing cluster. You can perform table-level restore only by using a snapshot of an existing cluster, that is, a cluster that has not been deleted. Values for this parameter work as follows: If ClusterExists is set to true, ClusterIdentifier is required. If ClusterExists is set to false and ClusterIdentifier isn't specified, all snapshots associated with deleted clusters (orphaned snapshots) are returned. If ClusterExists is set to false and ClusterIdentifier is specified for a deleted cluster, snapshots associated with that cluster are returned. If ClusterExists is set to false and ClusterIdentifier is specified for an existing cluster, no snapshots are returned.",
      "nested_params": []
    },
    {
      "name": "SortingEntities",
      "type": "list",
      "required": true,
      "description": "(dict) --- Describes a sorting entity The category for sorting the snapshots. SortOrder (string) --- The order for listing the attributes.",
      "nested_params": [
        {
          "name": "Attribute",
          "type": "string",
          "required": false,
          "description": "The category for sorting the snapshots.",
          "nested_params": []
        },
        {
          "name": "SortOrder",
          "type": "string",
          "required": false,
          "description": "The order for listing the attributes.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Marker",
          "type": "string",
          "description": "A value that indicates the starting point for the next set of response records in a subsequent request. If a value is returned in a response, you can retrieve the next set of records by providing this returned marker value in the Marker parameter and retrying the command. If the Marker field is empty, all response records have been retrieved for the request.",
          "nested_items": []
        },
        {
          "name": "Snapshots",
          "type": "list",
          "description": "A list of  Snapshot instances.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "SnapshotIdentifier",
                  "type": "string",
                  "description": "The snapshot identifier that is provided in the request.",
                  "nested_items": []
                },
                {
                  "name": "ClusterIdentifier",
                  "type": "string",
                  "description": "The identifier of the cluster for which the snapshot was taken.",
                  "nested_items": []
                },
                {
                  "name": "SnapshotCreateTime",
                  "type": "datetime",
                  "description": "The time (in UTC format) when Amazon Redshift began the snapshot. A snapshot contains a copy of the cluster data as of this exact time.",
                  "nested_items": []
                },
                {
                  "name": "Status",
                  "type": "string",
                  "description": "The snapshot status. The value of the status depends on the API operation used:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "CreateClusterSnapshot and  CopyClusterSnapshot returns status as 'creating'.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "DescribeClusterSnapshots returns status as 'creating', 'available', 'final snapshot', or 'failed'.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "DeleteClusterSnapshot returns status as 'deleted'.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Port",
                  "type": "integer",
                  "description": "The port that the cluster is listening on.",
                  "nested_items": []
                },
                {
                  "name": "AvailabilityZone",
                  "type": "string",
                  "description": "The Availability Zone in which the cluster was created.",
                  "nested_items": []
                },
                {
                  "name": "ClusterCreateTime",
                  "type": "datetime",
                  "description": "The time (UTC) when the cluster was originally created.",
                  "nested_items": []
                },
                {
                  "name": "MasterUsername",
                  "type": "string",
                  "description": "The admin user name for the cluster.",
                  "nested_items": []
                },
                {
                  "name": "ClusterVersion",
                  "type": "string",
                  "description": "The version ID of the Amazon Redshift engine that is running on the cluster.",
                  "nested_items": []
                },
                {
                  "name": "EngineFullVersion",
                  "type": "string",
                  "description": "The cluster version of the cluster used to create the snapshot. For example, 1.0.15503.",
                  "nested_items": []
                },
                {
                  "name": "SnapshotType",
                  "type": "string",
                  "description": "The snapshot type. Snapshots created using  CreateClusterSnapshot and  CopyClusterSnapshot are of type 'manual'.",
                  "nested_items": []
                },
                {
                  "name": "NodeType",
                  "type": "string",
                  "description": "The node type of the nodes in the cluster.",
                  "nested_items": []
                },
                {
                  "name": "NumberOfNodes",
                  "type": "integer",
                  "description": "The number of nodes in the cluster.",
                  "nested_items": []
                },
                {
                  "name": "DBName",
                  "type": "string",
                  "description": "The name of the database that was created when the cluster was created.",
                  "nested_items": []
                },
                {
                  "name": "VpcId",
                  "type": "string",
                  "description": "The VPC identifier of the cluster if the snapshot is from a cluster in a VPC. Otherwise, this field is not in the output.",
                  "nested_items": []
                },
                {
                  "name": "Encrypted",
                  "type": "boolean",
                  "description": "If true, the data in the snapshot is encrypted at rest.",
                  "nested_items": []
                },
                {
                  "name": "KmsKeyId",
                  "type": "string",
                  "description": "The Key Management Service (KMS) key ID of the encryption key that was used to encrypt data in the cluster from which the snapshot was taken.",
                  "nested_items": []
                },
                {
                  "name": "EncryptedWithHSM",
                  "type": "boolean",
                  "description": "A boolean that indicates whether the snapshot data is encrypted using the HSM keys of the source cluster. true indicates that the data is encrypted using HSM keys.",
                  "nested_items": []
                },
                {
                  "name": "AccountsWithRestoreAccess",
                  "type": "list",
                  "description": "A list of the Amazon Web Services accounts authorized to restore the snapshot. Returns null if no accounts are authorized. Visible only to the snapshot owner.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "AccountId",
                          "type": "string",
                          "description": "The identifier of an Amazon Web Services account authorized to restore a snapshot.",
                          "nested_items": []
                        },
                        {
                          "name": "AccountAlias",
                          "type": "string",
                          "description": "The identifier of an Amazon Web Services support account authorized to restore a snapshot. For Amazon Web Services Support, the identifier is amazon-redshift-support.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "OwnerAccount",
                  "type": "string",
                  "description": "For manual snapshots, the Amazon Web Services account used to create or copy the snapshot. For automatic snapshots, the owner of the cluster. The owner can perform all snapshot actions, such as sharing a manual snapshot.",
                  "nested_items": []
                },
                {
                  "name": "TotalBackupSizeInMegaBytes",
                  "type": "float",
                  "description": "The size of the complete set of backup data that would be used to restore the cluster.",
                  "nested_items": []
                },
                {
                  "name": "ActualIncrementalBackupSizeInMegaBytes",
                  "type": "float",
                  "description": "The size of the incremental backup.",
                  "nested_items": []
                },
                {
                  "name": "BackupProgressInMegaBytes",
                  "type": "float",
                  "description": "The number of megabytes that have been transferred to the snapshot backup.",
                  "nested_items": []
                },
                {
                  "name": "CurrentBackupRateInMegaBytesPerSecond",
                  "type": "float",
                  "description": "The number of megabytes per second being transferred to the snapshot backup. Returns 0 for a completed backup.",
                  "nested_items": []
                },
                {
                  "name": "EstimatedSecondsToCompletion",
                  "type": "integer",
                  "description": "The estimate of the time remaining before the snapshot backup will complete. Returns 0 for a completed backup.",
                  "nested_items": []
                },
                {
                  "name": "ElapsedTimeInSeconds",
                  "type": "integer",
                  "description": "The amount of time an in-progress snapshot backup has been running, or the amount of time it took a completed backup to finish.",
                  "nested_items": []
                },
                {
                  "name": "SourceRegion",
                  "type": "string",
                  "description": "The source region from which the snapshot was copied.",
                  "nested_items": []
                },
                {
                  "name": "Tags",
                  "type": "list",
                  "description": "The list of tags for the cluster snapshot.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Key",
                          "type": "string",
                          "description": "The key, or name, for the resource tag.",
                          "nested_items": []
                        },
                        {
                          "name": "Value",
                          "type": "string",
                          "description": "The value for the resource tag.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "RestorableNodeTypes",
                  "type": "list",
                  "description": "The list of node types that this cluster snapshot is able to restore into.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "EnhancedVpcRouting",
                  "type": "boolean",
                  "description": "An option that specifies whether to create the cluster with enhanced VPC routing enabled. To create a cluster that uses enhanced VPC routing, the cluster must be in a VPC. For more information, see Enhanced VPC Routing in the Amazon Redshift Cluster Management Guide.",
                  "nested_items": []
                },
                {
                  "name": "MaintenanceTrackName",
                  "type": "string",
                  "description": "The name of the maintenance track for the snapshot.",
                  "nested_items": []
                },
                {
                  "name": "ManualSnapshotRetentionPeriod",
                  "type": "integer",
                  "description": "The number of days that a manual snapshot is retained. If the value is -1, the manual snapshot is retained indefinitely.",
                  "nested_items": []
                },
                {
                  "name": "ManualSnapshotRemainingDays",
                  "type": "integer",
                  "description": "The number of days until a manual snapshot will pass its retention period.",
                  "nested_items": []
                },
                {
                  "name": "SnapshotRetentionStartTime",
                  "type": "datetime",
                  "description": "A timestamp representing the start of the retention period for the snapshot.",
                  "nested_items": []
                },
                {
                  "name": "MasterPasswordSecretArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) for the cluster's admin user credentials secret.",
                  "nested_items": []
                },
                {
                  "name": "MasterPasswordSecretKmsKeyId",
                  "type": "string",
                  "description": "The ID of the Key Management Service (KMS) key used to encrypt and store the cluster's admin credentials secret.",
                  "nested_items": []
                },
                {
                  "name": "SnapshotArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the snapshot.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}