{
  "method_name": "describe_reserved_node_offerings",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/redshift/client/describe_reserved_node_offerings.html",
  "description": "Returns a list of the available reserved node offerings by Amazon Redshift with their descriptions including the node type, the fixed and recurring costs of reserving the node and duration the node will be reserved for you. These descriptions help you determine which reserve node offering you want to purchase. You then use the unique offering ID in you call to  PurchaseReservedNodeOffering to reserve one or more nodes for your Amazon Redshift cluster. For more information about reserved node offerings, go to Purchasing Reserved Nodes in the Amazon Redshift Cluster Management Guide.",
  "parameters": [
    {
      "name": "ReservedNodeOfferingId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxRecords",
      "type": "integer",
      "required": false,
      "description": "The maximum number of response records to return in each call. If the number of remaining response records exceeds the specified MaxRecords value, a value is returned in a marker field of the response. You can retrieve the next set of records by retrying the command with the returned marker value. Default: 100 Constraints: minimum 20, maximum 100.",
      "nested_params": []
    },
    {
      "name": "Marker",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Marker",
          "type": "string",
          "description": "A value that indicates the starting point for the next set of response records in a subsequent request. If a value is returned in a response, you can retrieve the next set of records by providing this returned marker value in the Marker parameter and retrying the command. If the Marker field is empty, all response records have been retrieved for the request.",
          "nested_items": []
        },
        {
          "name": "ReservedNodeOfferings",
          "type": "list",
          "description": "A list of ReservedNodeOffering objects.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ReservedNodeOfferingId",
                  "type": "string",
                  "description": "The offering identifier.",
                  "nested_items": []
                },
                {
                  "name": "NodeType",
                  "type": "string",
                  "description": "The node type offered by the reserved node offering.",
                  "nested_items": []
                },
                {
                  "name": "Duration",
                  "type": "integer",
                  "description": "The duration, in seconds, for which the offering will reserve the node.",
                  "nested_items": []
                },
                {
                  "name": "FixedPrice",
                  "type": "float",
                  "description": "The upfront fixed charge you will pay to purchase the specific reserved node offering.",
                  "nested_items": []
                },
                {
                  "name": "UsagePrice",
                  "type": "float",
                  "description": "The rate you are charged for each hour the cluster that is using the offering is running.",
                  "nested_items": []
                },
                {
                  "name": "CurrencyCode",
                  "type": "string",
                  "description": "The currency code for the compute nodes offering.",
                  "nested_items": []
                },
                {
                  "name": "OfferingType",
                  "type": "string",
                  "description": "The anticipated utilization of the reserved node, as defined in the reserved node offering.",
                  "nested_items": []
                },
                {
                  "name": "RecurringCharges",
                  "type": "list",
                  "description": "The charge to your account regardless of whether you are creating any clusters using the node offering. Recurring charges are only in effect for heavy-utilization reserved nodes.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "RecurringChargeAmount",
                          "type": "float",
                          "description": "The amount charged per the period of time specified by the recurring charge frequency.",
                          "nested_items": []
                        },
                        {
                          "name": "RecurringChargeFrequency",
                          "type": "string",
                          "description": "The frequency at which the recurring charge amount is applied.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "ReservedNodeOfferingType",
                  "type": "string",
                  "description": "",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}