{
  "method_name": "describe_cluster_security_groups",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/redshift/client/describe_cluster_security_groups.html",
  "description": "Returns information about Amazon Redshift security groups. If the name of a security group is specified, the response will contain only information about only that security group. For information about managing security groups, go to Amazon Redshift Cluster Security Groups in the Amazon Redshift Cluster Management Guide. If you specify both tag keys and tag values in the same request, Amazon Redshift returns all security groups that match any combination of the specified keys and values. For example, if you have owner and environment for tag keys, and admin and test for tag values, all security groups that have any combination of those values are returned. If both tag keys and values are omitted from the request, security groups are returned regardless of whether they have tag keys or values associated with them.",
  "parameters": [
    {
      "name": "ClusterSecurityGroupName",
      "type": "string",
      "required": false,
      "description": "The name of a cluster security group for which you are requesting details. You must specify either the Marker parameter or a ClusterSecurityGroupName parameter, but not both. Example: securitygroup1",
      "nested_params": []
    },
    {
      "name": "MaxRecords",
      "type": "integer",
      "required": false,
      "description": "The maximum number of response records to return in each call. If the number of remaining response records exceeds the specified MaxRecords value, a value is returned in a marker field of the response. You can retrieve the next set of records by retrying the command with the returned marker value. Default: 100 Constraints: minimum 20, maximum 100.",
      "nested_params": []
    },
    {
      "name": "Marker",
      "type": "string",
      "required": false,
      "description": "An optional parameter that specifies the starting point to return a set of response records. When the results of a  DescribeClusterSecurityGroups request exceed the value specified in MaxRecords, Amazon Web Services returns a value in the Marker field of the response. You can retrieve the next set of response records by providing the returned marker value in the Marker parameter and retrying the request. Constraints: You must specify either the ClusterSecurityGroupName parameter or the Marker parameter, but not both.",
      "nested_params": []
    },
    {
      "name": "TagKeys",
      "type": "list",
      "required": false,
      "description": "A tag key or keys for which you want to return all matching cluster security groups that are associated with the specified key or keys. For example, suppose that you have security groups that are tagged with keys called owner and environment. If you specify both of these tag keys in the request, Amazon Redshift returns a response with the security groups that have either or both of these tag keys associated with them. (string) ---",
      "nested_params": []
    },
    {
      "name": "TagValues",
      "type": "list",
      "required": false,
      "description": "A tag value or values for which you want to return all matching cluster security groups that are associated with the specified tag value or values. For example, suppose that you have security groups that are tagged with values called admin and test. If you specify both of these tag values in the request, Amazon Redshift returns a response with the security groups that have either or both of these tag values associated with them. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Marker",
          "type": "string",
          "description": "A value that indicates the starting point for the next set of response records in a subsequent request. If a value is returned in a response, you can retrieve the next set of records by providing this returned marker value in the Marker parameter and retrying the command. If the Marker field is empty, all response records have been retrieved for the request.",
          "nested_items": []
        },
        {
          "name": "ClusterSecurityGroups",
          "type": "list",
          "description": "A list of  ClusterSecurityGroup instances.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ClusterSecurityGroupName",
                  "type": "string",
                  "description": "The name of the cluster security group to which the operation was applied.",
                  "nested_items": []
                },
                {
                  "name": "Description",
                  "type": "string",
                  "description": "A description of the security group.",
                  "nested_items": []
                },
                {
                  "name": "EC2SecurityGroups",
                  "type": "list",
                  "description": "A list of EC2 security groups that are permitted to access clusters associated with this cluster security group.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Status",
                          "type": "string",
                          "description": "The status of the EC2 security group.",
                          "nested_items": []
                        },
                        {
                          "name": "EC2SecurityGroupName",
                          "type": "string",
                          "description": "The name of the EC2 Security Group.",
                          "nested_items": []
                        },
                        {
                          "name": "EC2SecurityGroupOwnerId",
                          "type": "string",
                          "description": "The Amazon Web Services account ID of the owner of the EC2 security group specified in the EC2SecurityGroupName field.",
                          "nested_items": []
                        },
                        {
                          "name": "Tags",
                          "type": "list",
                          "description": "The list of tags for the EC2 security group.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "dict",
                              "description": "",
                              "nested_items": [
                                {
                                  "name": "Key",
                                  "type": "string",
                                  "description": "The key, or name, for the resource tag.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Value",
                                  "type": "string",
                                  "description": "The value for the resource tag.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "IPRanges",
                  "type": "list",
                  "description": "A list of IP ranges (CIDR blocks) that are permitted to access clusters associated with this cluster security group.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Status",
                          "type": "string",
                          "description": "The status of the IP range, for example, 'authorized'.",
                          "nested_items": []
                        },
                        {
                          "name": "CIDRIP",
                          "type": "string",
                          "description": "The IP range in Classless Inter-Domain Routing (CIDR) notation.",
                          "nested_items": []
                        },
                        {
                          "name": "Tags",
                          "type": "list",
                          "description": "The list of tags for the IP range.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "dict",
                              "description": "",
                              "nested_items": [
                                {
                                  "name": "Key",
                                  "type": "string",
                                  "description": "The key, or name, for the resource tag.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Value",
                                  "type": "string",
                                  "description": "The value for the resource tag.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "Tags",
                  "type": "list",
                  "description": "The list of tags for the cluster security group.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Key",
                          "type": "string",
                          "description": "The key, or name, for the resource tag.",
                          "nested_items": []
                        },
                        {
                          "name": "Value",
                          "type": "string",
                          "description": "The value for the resource tag.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}