{
  "method_name": "describe_cluster_parameters",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/redshift/client/describe_cluster_parameters.html",
  "description": "Returns a detailed list of parameters contained within the specified Amazon Redshift parameter group. For each parameter the response includes information such as parameter name, description, data type, value, whether the parameter value is modifiable, and so on. You can specify source filter to retrieve parameters of only specific type. For example, to retrieve parameters that were modified by a user action such as from  ModifyClusterParameterGroup, you can specify source equal to user. For more information about parameters and parameter groups, go to Amazon Redshift Parameter Groups in the Amazon Redshift Cluster Management Guide.",
  "parameters": [
    {
      "name": "ParameterGroupName",
      "type": "string",
      "required": true,
      "description": "The name of a cluster parameter group for which to return details.",
      "nested_params": []
    },
    {
      "name": "Source",
      "type": "string",
      "required": false,
      "description": "The parameter types to return. Specify user to show parameters that are different form the default. Similarly, specify engine-default to show parameters that are the same as the default parameter group. Default: All parameter types returned. Valid Values: user | engine-default.",
      "nested_params": []
    },
    {
      "name": "MaxRecords",
      "type": "integer",
      "required": false,
      "description": "The maximum number of response records to return in each call. If the number of remaining response records exceeds the specified MaxRecords value, a value is returned in a marker field of the response. You can retrieve the next set of records by retrying the command with the returned marker value. Default: 100 Constraints: minimum 20, maximum 100.",
      "nested_params": []
    },
    {
      "name": "Marker",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Parameters",
          "type": "list",
          "description": "A list of  Parameter instances. Each instance lists the parameters of one cluster parameter group.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ParameterName",
                  "type": "string",
                  "description": "The name of the parameter.",
                  "nested_items": []
                },
                {
                  "name": "ParameterValue",
                  "type": "string",
                  "description": "The value of the parameter. If ParameterName is wlm_json_configuration, then the maximum size of ParameterValue is 8000 characters.",
                  "nested_items": []
                },
                {
                  "name": "Description",
                  "type": "string",
                  "description": "A description of the parameter.",
                  "nested_items": []
                },
                {
                  "name": "Source",
                  "type": "string",
                  "description": "The source of the parameter value, such as 'engine-default' or 'user'.",
                  "nested_items": []
                },
                {
                  "name": "DataType",
                  "type": "string",
                  "description": "The data type of the parameter.",
                  "nested_items": []
                },
                {
                  "name": "AllowedValues",
                  "type": "string",
                  "description": "The valid range of values for the parameter.",
                  "nested_items": []
                },
                {
                  "name": "ApplyType",
                  "type": "string",
                  "description": "Specifies how to apply the WLM configuration parameter. Some properties can be applied dynamically, while other properties require that any associated clusters be rebooted for the configuration changes to be applied. For more information about parameters and parameter groups, go to Amazon Redshift Parameter Groups in the Amazon Redshift Cluster Management Guide.",
                  "nested_items": []
                },
                {
                  "name": "IsModifiable",
                  "type": "boolean",
                  "description": "If true, the parameter can be modified. Some parameters have security or operational implications that prevent them from being changed.",
                  "nested_items": []
                },
                {
                  "name": "MinimumEngineVersion",
                  "type": "string",
                  "description": "The earliest engine version to which the parameter can apply.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "Marker",
          "type": "string",
          "description": "A value that indicates the starting point for the next set of response records in a subsequent request. If a value is returned in a response, you can retrieve the next set of records by providing this returned marker value in the Marker parameter and retrying the command. If the Marker field is empty, all response records have been retrieved for the request.",
          "nested_items": []
        }
      ]
    }
  ]
}