{
  "method_name": "describe_cluster_versions",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/redshift/client/describe_cluster_versions.html",
  "description": "Returns descriptions of the available Amazon Redshift cluster versions. You can call this operation even before creating any clusters to learn more about the Amazon Redshift versions. For more information about managing clusters, go to Amazon Redshift Clusters in the Amazon Redshift Cluster Management Guide.",
  "parameters": [
    {
      "name": "ClusterVersion",
      "type": "string",
      "required": false,
      "description": "The specific cluster version to return. Example: 1.0",
      "nested_params": []
    },
    {
      "name": "ClusterParameterGroupFamily",
      "type": "string",
      "required": false,
      "description": "The name of a specific cluster parameter group family to return details for. Constraints: Must be 1 to 255 alphanumeric characters First character must be a letter Cannot end with a hyphen or contain two consecutive hyphens.",
      "nested_params": []
    },
    {
      "name": "MaxRecords",
      "type": "integer",
      "required": false,
      "description": "The maximum number of response records to return in each call. If the number of remaining response records exceeds the specified MaxRecords value, a value is returned in a marker field of the response. You can retrieve the next set of records by retrying the command with the returned marker value. Default: 100 Constraints: minimum 20, maximum 100.",
      "nested_params": []
    },
    {
      "name": "Marker",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Marker",
          "type": "string",
          "description": "A value that indicates the starting point for the next set of response records in a subsequent request. If a value is returned in a response, you can retrieve the next set of records by providing this returned marker value in the Marker parameter and retrying the command. If the Marker field is empty, all response records have been retrieved for the request.",
          "nested_items": []
        },
        {
          "name": "ClusterVersions",
          "type": "list",
          "description": "A list of Version elements.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ClusterVersion",
                  "type": "string",
                  "description": "The version number used by the cluster.",
                  "nested_items": []
                },
                {
                  "name": "ClusterParameterGroupFamily",
                  "type": "string",
                  "description": "The name of the cluster parameter group family for the cluster.",
                  "nested_items": []
                },
                {
                  "name": "Description",
                  "type": "string",
                  "description": "The description of the cluster version.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}