{
  "method_name": "modify_cluster_parameter_group",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/redshift/client/modify_cluster_parameter_group.html",
  "description": "Modifies the parameters of a parameter group. For the parameters parameter, it can't contain ASCII characters. For more information about parameters and parameter groups, go to Amazon Redshift Parameter Groups in the Amazon Redshift Cluster Management Guide.",
  "parameters": [
    {
      "name": "ParameterGroupName",
      "type": "string",
      "required": true,
      "description": "The name of the parameter group to be modified.",
      "nested_params": []
    },
    {
      "name": "Parameters",
      "type": "list",
      "required": true,
      "description": "An array of parameters to be modified. A maximum of 20 parameters can be modified in a single request. For each parameter to be modified, you must supply at least the parameter name and parameter value; other name-value pairs of the parameter are optional. For the workload management (WLM) configuration, you must supply all the name-value pairs in the wlm_json_configuration parameter. (dict) --- Describes a parameter in a cluster parameter group. ParameterName (string) --- The name of the parameter. ParameterValue (string) --- The value of the parameter. If ParameterName is wlm_json_configuration, then the maximum size of ParameterValue is 8000 characters. Description (string) --- A description of the parameter. Source (string) --- The source of the parameter value, such as 'engine-default' or 'user'. DataType (string) --- The data type of the parameter. AllowedValues (string) --- The valid range of values for the parameter. ApplyType (string) --- Specifies how to apply the WLM configuration parameter. Some properties can be applied dynamically, while other properties require that any associated clusters be rebooted for the configuration changes to be applied. For more information about parameters and parameter groups, go to Amazon Redshift Parameter Groups in the Amazon Redshift Cluster Management Guide. IsModifiable (boolean) --- If true, the parameter can be modified. Some parameters have security or operational implications that prevent them from being changed. MinimumEngineVersion (string) --- The earliest engine version to which the parameter can apply.",
      "nested_params": [
        {
          "name": "ParameterName",
          "type": "string",
          "required": false,
          "description": "The name of the parameter.",
          "nested_params": []
        },
        {
          "name": "ParameterValue",
          "type": "string",
          "required": false,
          "description": "The value of the parameter. If ParameterName is wlm_json_configuration, then the maximum size of ParameterValue is 8000 characters.",
          "nested_params": []
        },
        {
          "name": "Description",
          "type": "string",
          "required": false,
          "description": "A description of the parameter.",
          "nested_params": []
        },
        {
          "name": "Source",
          "type": "string",
          "required": false,
          "description": "The source of the parameter value, such as 'engine-default' or 'user'.",
          "nested_params": []
        },
        {
          "name": "DataType",
          "type": "string",
          "required": false,
          "description": "The data type of the parameter.",
          "nested_params": []
        },
        {
          "name": "AllowedValues",
          "type": "string",
          "required": false,
          "description": "The valid range of values for the parameter.",
          "nested_params": []
        },
        {
          "name": "ApplyType",
          "type": "string",
          "required": false,
          "description": "Specifies how to apply the WLM configuration parameter. Some properties can be applied dynamically, while other properties require that any associated clusters be rebooted for the configuration changes to be applied. For more information about parameters and parameter groups, go to Amazon Redshift Parameter Groups in the Amazon Redshift Cluster Management Guide.",
          "nested_params": []
        },
        {
          "name": "IsModifiable",
          "type": "boolean",
          "required": false,
          "description": "If true, the parameter can be modified. Some parameters have security or operational implications that prevent them from being changed.",
          "nested_params": []
        },
        {
          "name": "MinimumEngineVersion",
          "type": "string",
          "required": false,
          "description": "The earliest engine version to which the parameter can apply.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ParameterGroupName",
          "type": "string",
          "description": "The name of the cluster parameter group.",
          "nested_items": []
        },
        {
          "name": "ParameterGroupStatus",
          "type": "string",
          "description": "The status of the parameter group. For example, if you made a change to a parameter group name-value pair, then the change could be pending a reboot of an associated cluster.",
          "nested_items": []
        }
      ]
    }
  ]
}