{
  "method_name": "add_application_input_processing_configuration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kinesisanalytics/client/add_application_input_processing_configuration.html",
  "description": "Adds an InputProcessingConfiguration to an application. An input processor preprocesses records on the input stream before the application's SQL code executes. Currently, the only input processor available is AWS Lambda.",
  "parameters": [
    {
      "name": "ApplicationName",
      "type": "string",
      "required": true,
      "description": "Name of the application to which you want to add the input processing configuration.",
      "nested_params": []
    },
    {
      "name": "CurrentApplicationVersionId",
      "type": "integer",
      "required": true,
      "description": "Version of the application to which you want to add the input processing configuration. You can use the DescribeApplication operation to get the current application version. If the version specified is not the current version, the ConcurrentModificationException is returned.",
      "nested_params": []
    },
    {
      "name": "InputId",
      "type": "string",
      "required": true,
      "description": "The ID of the input configuration to add the input processing configuration to. You can get a list of the input IDs for an application using the DescribeApplication operation.",
      "nested_params": []
    },
    {
      "name": "InputProcessingConfiguration",
      "type": "dict",
      "required": true,
      "description": "The InputProcessingConfiguration to add to the application. The InputLambdaProcessor that is used to preprocess the records in the stream before being processed by your application code. The ARN of the AWS Lambda function that operates on records in the stream. The ARN of the IAM role that is used to access the AWS Lambda function.",
      "nested_params": [
        {
          "name": "InputLambdaProcessor",
          "type": "dict",
          "required": false,
          "description": "The InputLambdaProcessor that is used to preprocess the records in the stream before being processed by your application code.",
          "nested_params": [
            {
              "name": "ResourceARN",
              "type": "string",
              "required": false,
              "description": "The ARN of the AWS Lambda function that operates on records in the stream.",
              "nested_params": []
            },
            {
              "name": "RoleARN",
              "type": "string",
              "required": false,
              "description": "The ARN of the IAM role that is used to access the AWS Lambda function.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}