{
  "method_name": "update_application",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kinesisanalytics/client/update_application.html",
  "description": "Updates an existing Amazon Kinesis Analytics application. Using this API, you can update application code, input configuration, and output configuration. Note that Amazon Kinesis Analytics updates the CurrentApplicationVersionId each time you update your application. This operation requires permission for the kinesisanalytics:UpdateApplication action.",
  "parameters": [
    {
      "name": "ApplicationName",
      "type": "string",
      "required": true,
      "description": "Name of the Amazon Kinesis Analytics application to update.",
      "nested_params": []
    },
    {
      "name": "CurrentApplicationVersionId",
      "type": "integer",
      "required": true,
      "description": "The current application version ID. You can use the DescribeApplication operation to get this value.",
      "nested_params": []
    },
    {
      "name": "ApplicationUpdate",
      "type": "dict",
      "required": true,
      "description": "Describes application updates. InputUpdates (list) --- Describes application input configuration updates. (dict) --- Describes updates to a specific input configuration (identified by the InputId of an application). Input ID of the application input to be updated. NamePrefixUpdate (string) --- Name prefix for in-application streams that Amazon Kinesis Analytics creates for the specific streaming source. InputProcessingConfigurationUpdate (dict) --- Describes updates for an input processing configuration. Provides update information for an InputLambdaProcessor. ResourceARNUpdate (string) --- The Amazon Resource Name (ARN) of the new AWS Lambda function that is used to preprocess the records in the stream. RoleARNUpdate (string) --- The ARN of the new IAM role that is used to access the AWS Lambda function. KinesisStreamsInputUpdate (dict) --- If an Amazon Kinesis stream is the streaming source to be updated, provides an updated stream Amazon Resource Name (ARN) and IAM role ARN. ResourceARNUpdate (string) --- Amazon Resource Name (ARN) of the input Amazon Kinesis stream to read. RoleARNUpdate (string) --- ARN of the IAM role that Amazon Kinesis Analytics can assume to access the stream on your behalf. You need to grant the necessary permissions to this role. KinesisFirehoseInputUpdate (dict) --- If an Amazon Kinesis Firehose delivery stream is the streaming source to be updated, provides an updated stream ARN and IAM role ARN. ResourceARNUpdate (string) --- Amazon Resource Name (ARN) of the input Amazon Kinesis Firehose delivery stream to read. InputSchemaUpdate (dict) --- Describes the data format on the streaming source, and how record elements on the streaming source map to columns of the in-application stream that is created. RecordFormatUpdate (dict) --- Specifies the format of the records on the streaming source. The type of record format. MappingParameters (dict) --- When configuring application input at the time of creating or updating an application, provides additional mapping information specific to the record format (such as JSON, CSV, or record fields delimited by some delimiter) on the streaming source. JSONMappingParameters (dict) --- Provides additional mapping information when JSON is the record format on the streaming source. Path to the top-level parent that contains the records. CSVMappingParameters (dict) --- Provides additional mapping information when the record format uses delimiters (for example, CSV). Row delimiter. For example, in a CSV format, --\u0098n' is the typical row delimiter. Column delimiter. For example, in a CSV format, a comma (',') is the typical column delimiter. RecordEncodingUpdate (string) --- Specifies the encoding of the records in the streaming source. For example, UTF-8. RecordColumnUpdates (list) --- A list of RecordColumn objects. Each object describes the mapping of the streaming source element to the corresponding column in the in-application stream. (dict) --- Describes the mapping of each data element in the streaming source to the corresponding column in the in-application stream. Also used to describe the format of the reference data source. Name of the column created in the in-application input stream or reference table. Mapping (string) --- Reference to the data element in the streaming input or the reference data source. This element is required if the RecordFormatType is JSON. Type of column created in the in-application input stream or reference table. InputParallelismUpdate (dict) --- Describes the parallelism updates (the number in-application streams Amazon Kinesis Analytics creates for the specific streaming source). CountUpdate (integer) --- Number of in-application streams to create for the specified streaming source. ApplicationCodeUpdate (string) --- Describes application code updates. OutputUpdates (list) --- Describes application output configuration updates. (dict) --- Describes updates to the output configuration identified by the OutputId. Identifies the specific output configuration that you want to update. NameUpdate (string) --- If you want to specify a different in-application stream for this output configuration, use this field to specify the new in-application stream name. KinesisStreamsOutputUpdate (dict) --- Describes an Amazon Kinesis stream as the destination for the output. ResourceARNUpdate (string) --- Amazon Resource Name (ARN) of the Amazon Kinesis stream where you want to write the output. KinesisFirehoseOutputUpdate (dict) --- Describes an Amazon Kinesis Firehose delivery stream as the destination for the output. ResourceARNUpdate (string) --- Amazon Resource Name (ARN) of the Amazon Kinesis Firehose delivery stream to write to. LambdaOutputUpdate (dict) --- Describes an AWS Lambda function as the destination for the output. ResourceARNUpdate (string) --- Amazon Resource Name (ARN) of the destination Lambda function. RoleARNUpdate (string) --- ARN of the IAM role that Amazon Kinesis Analytics can assume to write to the destination function on your behalf. DestinationSchemaUpdate (dict) --- Describes the data format when records are written to the destination. For more information, see Configuring Application Output. Specifies the format of the records on the output stream. ReferenceDataSourceUpdates (list) --- Describes application reference data source updates. (dict) --- When you update a reference data source configuration for an application, this object provides all the updated values (such as the source bucket name and object key name), the in-application table name that is created, and updated mapping information that maps the data in the Amazon S3 object to the in-application reference table that is created. ID of the reference data source being updated. You can use the DescribeApplication operation to get this value. TableNameUpdate (string) --- In-application table name that is created by this update. S3ReferenceDataSourceUpdate (dict) --- Describes the S3 bucket name, object key name, and IAM role that Amazon Kinesis Analytics can assume to read the Amazon S3 object on your behalf and populate the in-application reference table. BucketARNUpdate (string) --- Amazon Resource Name (ARN) of the S3 bucket. FileKeyUpdate (string) --- Object key name. ReferenceRoleARNUpdate (string) --- ARN of the IAM role that Amazon Kinesis Analytics can assume to read the Amazon S3 object and populate the in-application. ReferenceSchemaUpdate (dict) --- Describes the format of the data in the streaming source, and how each data element maps to corresponding columns created in the in-application stream. Specifies the format of the records on the streaming source. RecordEncoding (string) --- Specifies the encoding of the records in the streaming source. A list of RecordColumn objects. CloudWatchLoggingOptionUpdates (list) --- Describes application CloudWatch logging option updates. (dict) --- Describes CloudWatch logging option updates. ID of the CloudWatch logging option to update LogStreamARNUpdate (string) --- ARN of the CloudWatch log to receive application messages. RoleARNUpdate (string) --- IAM ARN of the role to use to send application messages. Note: To write application messages to CloudWatch, the IAM role used must have the PutLogEvents policy action enabled.",
      "nested_params": [
        {
          "name": "InputUpdates",
          "type": "list",
          "required": false,
          "description": "Describes application input configuration updates.",
          "nested_params": [
            {
              "name": "InputId",
              "type": "string",
              "required": false,
              "description": "Input ID of the application input to be updated.",
              "nested_params": []
            },
            {
              "name": "NamePrefixUpdate",
              "type": "string",
              "required": false,
              "description": "Name prefix for in-application streams that Amazon Kinesis Analytics creates for the specific streaming source.",
              "nested_params": []
            },
            {
              "name": "InputProcessingConfigurationUpdate",
              "type": "dict",
              "required": false,
              "description": "Describes updates for an input processing configuration.",
              "nested_params": [
                {
                  "name": "InputLambdaProcessorUpdate",
                  "type": "dict",
                  "required": false,
                  "description": "Provides update information for an InputLambdaProcessor.",
                  "nested_params": [
                    {
                      "name": "ResourceARNUpdate",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Resource Name (ARN) of the new AWS Lambda function that is used to preprocess the records in the stream.",
                      "nested_params": []
                    },
                    {
                      "name": "RoleARNUpdate",
                      "type": "string",
                      "required": false,
                      "description": "The ARN of the new IAM role that is used to access the AWS Lambda function.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "KinesisStreamsInputUpdate",
              "type": "dict",
              "required": false,
              "description": "If an Amazon Kinesis stream is the streaming source to be updated, provides an updated stream Amazon Resource Name (ARN) and IAM role ARN.",
              "nested_params": [
                {
                  "name": "ResourceARNUpdate",
                  "type": "string",
                  "required": false,
                  "description": "Amazon Resource Name (ARN) of the input Amazon Kinesis stream to read.",
                  "nested_params": []
                },
                {
                  "name": "RoleARNUpdate",
                  "type": "string",
                  "required": false,
                  "description": "ARN of the IAM role that Amazon Kinesis Analytics can assume to access the stream on your behalf. You need to grant the necessary permissions to this role.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "KinesisFirehoseInputUpdate",
              "type": "dict",
              "required": false,
              "description": "If an Amazon Kinesis Firehose delivery stream is the streaming source to be updated, provides an updated stream ARN and IAM role ARN.",
              "nested_params": [
                {
                  "name": "ResourceARNUpdate",
                  "type": "string",
                  "required": false,
                  "description": "Amazon Resource Name (ARN) of the input Amazon Kinesis Firehose delivery stream to read.",
                  "nested_params": []
                },
                {
                  "name": "RoleARNUpdate",
                  "type": "string",
                  "required": false,
                  "description": "ARN of the IAM role that Amazon Kinesis Analytics can assume to access the stream on your behalf. You need to grant the necessary permissions to this role.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "InputSchemaUpdate",
              "type": "dict",
              "required": false,
              "description": "Describes the data format on the streaming source, and how record elements on the streaming source map to columns of the in-application stream that is created.",
              "nested_params": [
                {
                  "name": "RecordFormatUpdate",
                  "type": "dict",
                  "required": false,
                  "description": "Specifies the format of the records on the streaming source.",
                  "nested_params": [
                    {
                      "name": "RecordFormatType",
                      "type": "string",
                      "required": false,
                      "description": "The type of record format.",
                      "nested_params": []
                    },
                    {
                      "name": "MappingParameters",
                      "type": "dict",
                      "required": false,
                      "description": "When configuring application input at the time of creating or updating an application, provides additional mapping information specific to the record format (such as JSON, CSV, or record fields delimited by some delimiter) on the streaming source.",
                      "nested_params": [
                        {
                          "name": "JSONMappingParameters",
                          "type": "dict",
                          "required": false,
                          "description": "Provides additional mapping information when JSON is the record format on the streaming source.",
                          "nested_params": [
                            {
                              "name": "RecordRowPath",
                              "type": "string",
                              "required": false,
                              "description": "Path to the top-level parent that contains the records.",
                              "nested_params": []
                            }
                          ]
                        },
                        {
                          "name": "CSVMappingParameters",
                          "type": "dict",
                          "required": false,
                          "description": "Provides additional mapping information when the record format uses delimiters (for example, CSV).",
                          "nested_params": [
                            {
                              "name": "RecordRowDelimiter",
                              "type": "string",
                              "required": false,
                              "description": "Row delimiter. For example, in a CSV format, --\u0098n' is the typical row delimiter.",
                              "nested_params": []
                            },
                            {
                              "name": "RecordColumnDelimiter",
                              "type": "string",
                              "required": false,
                              "description": "Column delimiter. For example, in a CSV format, a comma (',') is the typical column delimiter.",
                              "nested_params": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "RecordEncodingUpdate",
                  "type": "string",
                  "required": false,
                  "description": "Specifies the encoding of the records in the streaming source. For example, UTF-8.",
                  "nested_params": []
                },
                {
                  "name": "RecordColumnUpdates",
                  "type": "list",
                  "required": false,
                  "description": "A list of RecordColumn objects. Each object describes the mapping of the streaming source element to the corresponding column in the in-application stream.",
                  "nested_params": [
                    {
                      "name": "Name",
                      "type": "string",
                      "required": false,
                      "description": "Name of the column created in the in-application input stream or reference table.",
                      "nested_params": []
                    },
                    {
                      "name": "Mapping",
                      "type": "string",
                      "required": false,
                      "description": "Reference to the data element in the streaming input or the reference data source. This element is required if the RecordFormatType is JSON.",
                      "nested_params": []
                    },
                    {
                      "name": "SqlType",
                      "type": "string",
                      "required": false,
                      "description": "Type of column created in the in-application input stream or reference table.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "InputParallelismUpdate",
              "type": "dict",
              "required": false,
              "description": "Describes the parallelism updates (the number in-application streams Amazon Kinesis Analytics creates for the specific streaming source).",
              "nested_params": [
                {
                  "name": "CountUpdate",
                  "type": "integer",
                  "required": false,
                  "description": "Number of in-application streams to create for the specified streaming source.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "ApplicationCodeUpdate",
          "type": "string",
          "required": false,
          "description": "Describes application code updates.",
          "nested_params": []
        },
        {
          "name": "OutputUpdates",
          "type": "list",
          "required": false,
          "description": "Describes application output configuration updates.",
          "nested_params": [
            {
              "name": "OutputId",
              "type": "string",
              "required": false,
              "description": "Identifies the specific output configuration that you want to update.",
              "nested_params": []
            },
            {
              "name": "NameUpdate",
              "type": "string",
              "required": false,
              "description": "If you want to specify a different in-application stream for this output configuration, use this field to specify the new in-application stream name.",
              "nested_params": []
            },
            {
              "name": "KinesisStreamsOutputUpdate",
              "type": "dict",
              "required": false,
              "description": "Describes an Amazon Kinesis stream as the destination for the output.",
              "nested_params": [
                {
                  "name": "ResourceARNUpdate",
                  "type": "string",
                  "required": false,
                  "description": "Amazon Resource Name (ARN) of the Amazon Kinesis stream where you want to write the output.",
                  "nested_params": []
                },
                {
                  "name": "RoleARNUpdate",
                  "type": "string",
                  "required": false,
                  "description": "ARN of the IAM role that Amazon Kinesis Analytics can assume to access the stream on your behalf. You need to grant the necessary permissions to this role.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "KinesisFirehoseOutputUpdate",
              "type": "dict",
              "required": false,
              "description": "Describes an Amazon Kinesis Firehose delivery stream as the destination for the output.",
              "nested_params": [
                {
                  "name": "ResourceARNUpdate",
                  "type": "string",
                  "required": false,
                  "description": "Amazon Resource Name (ARN) of the Amazon Kinesis Firehose delivery stream to write to.",
                  "nested_params": []
                },
                {
                  "name": "RoleARNUpdate",
                  "type": "string",
                  "required": false,
                  "description": "ARN of the IAM role that Amazon Kinesis Analytics can assume to access the stream on your behalf. You need to grant the necessary permissions to this role.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "LambdaOutputUpdate",
              "type": "dict",
              "required": false,
              "description": "Describes an AWS Lambda function as the destination for the output.",
              "nested_params": [
                {
                  "name": "ResourceARNUpdate",
                  "type": "string",
                  "required": false,
                  "description": "Amazon Resource Name (ARN) of the destination Lambda function.",
                  "nested_params": []
                },
                {
                  "name": "RoleARNUpdate",
                  "type": "string",
                  "required": false,
                  "description": "ARN of the IAM role that Amazon Kinesis Analytics can assume to write to the destination function on your behalf. You need to grant the necessary permissions to this role.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "DestinationSchemaUpdate",
              "type": "dict",
              "required": false,
              "description": "Describes the data format when records are written to the destination. For more information, see Configuring Application Output.",
              "nested_params": [
                {
                  "name": "RecordFormatType",
                  "type": "string",
                  "required": false,
                  "description": "Specifies the format of the records on the output stream.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "ReferenceDataSourceUpdates",
          "type": "list",
          "required": false,
          "description": "Describes application reference data source updates.",
          "nested_params": [
            {
              "name": "ReferenceId",
              "type": "string",
              "required": false,
              "description": "ID of the reference data source being updated. You can use the DescribeApplication operation to get this value.",
              "nested_params": []
            },
            {
              "name": "TableNameUpdate",
              "type": "string",
              "required": false,
              "description": "In-application table name that is created by this update.",
              "nested_params": []
            },
            {
              "name": "S3ReferenceDataSourceUpdate",
              "type": "dict",
              "required": false,
              "description": "Describes the S3 bucket name, object key name, and IAM role that Amazon Kinesis Analytics can assume to read the Amazon S3 object on your behalf and populate the in-application reference table.",
              "nested_params": [
                {
                  "name": "BucketARNUpdate",
                  "type": "string",
                  "required": false,
                  "description": "Amazon Resource Name (ARN) of the S3 bucket.",
                  "nested_params": []
                },
                {
                  "name": "FileKeyUpdate",
                  "type": "string",
                  "required": false,
                  "description": "Object key name.",
                  "nested_params": []
                },
                {
                  "name": "ReferenceRoleARNUpdate",
                  "type": "string",
                  "required": false,
                  "description": "ARN of the IAM role that Amazon Kinesis Analytics can assume to read the Amazon S3 object and populate the in-application.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ReferenceSchemaUpdate",
              "type": "dict",
              "required": false,
              "description": "Describes the format of the data in the streaming source, and how each data element maps to corresponding columns created in the in-application stream.",
              "nested_params": [
                {
                  "name": "RecordFormat",
                  "type": "dict",
                  "required": false,
                  "description": "Specifies the format of the records on the streaming source.",
                  "nested_params": [
                    {
                      "name": "RecordFormatType",
                      "type": "string",
                      "required": false,
                      "description": "The type of record format.",
                      "nested_params": []
                    },
                    {
                      "name": "MappingParameters",
                      "type": "dict",
                      "required": false,
                      "description": "When configuring application input at the time of creating or updating an application, provides additional mapping information specific to the record format (such as JSON, CSV, or record fields delimited by some delimiter) on the streaming source.",
                      "nested_params": [
                        {
                          "name": "JSONMappingParameters",
                          "type": "dict",
                          "required": false,
                          "description": "Provides additional mapping information when JSON is the record format on the streaming source.",
                          "nested_params": [
                            {
                              "name": "RecordRowPath",
                              "type": "string",
                              "required": false,
                              "description": "Path to the top-level parent that contains the records.",
                              "nested_params": []
                            }
                          ]
                        },
                        {
                          "name": "CSVMappingParameters",
                          "type": "dict",
                          "required": false,
                          "description": "Provides additional mapping information when the record format uses delimiters (for example, CSV).",
                          "nested_params": [
                            {
                              "name": "RecordRowDelimiter",
                              "type": "string",
                              "required": false,
                              "description": "Row delimiter. For example, in a CSV format, --\u0098n' is the typical row delimiter.",
                              "nested_params": []
                            },
                            {
                              "name": "RecordColumnDelimiter",
                              "type": "string",
                              "required": false,
                              "description": "Column delimiter. For example, in a CSV format, a comma (',') is the typical column delimiter.",
                              "nested_params": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "RecordEncoding",
                  "type": "string",
                  "required": false,
                  "description": "Specifies the encoding of the records in the streaming source. For example, UTF-8.",
                  "nested_params": []
                },
                {
                  "name": "RecordColumns",
                  "type": "list",
                  "required": false,
                  "description": "A list of RecordColumn objects.",
                  "nested_params": [
                    {
                      "name": "Name",
                      "type": "string",
                      "required": false,
                      "description": "Name of the column created in the in-application input stream or reference table.",
                      "nested_params": []
                    },
                    {
                      "name": "Mapping",
                      "type": "string",
                      "required": false,
                      "description": "Reference to the data element in the streaming input or the reference data source. This element is required if the RecordFormatType is JSON.",
                      "nested_params": []
                    },
                    {
                      "name": "SqlType",
                      "type": "string",
                      "required": false,
                      "description": "Type of column created in the in-application input stream or reference table.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "CloudWatchLoggingOptionUpdates",
          "type": "list",
          "required": false,
          "description": "Describes application CloudWatch logging option updates.",
          "nested_params": [
            {
              "name": "CloudWatchLoggingOptionId",
              "type": "string",
              "required": false,
              "description": "ID of the CloudWatch logging option to update.",
              "nested_params": []
            },
            {
              "name": "LogStreamARNUpdate",
              "type": "string",
              "required": false,
              "description": "ARN of the CloudWatch log to receive application messages.",
              "nested_params": []
            },
            {
              "name": "RoleARNUpdate",
              "type": "string",
              "required": false,
              "description": "IAM ARN of the role to use to send application messages. Note: To write application messages to CloudWatch, the IAM role used must have the PutLogEvents policy action enabled.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}