{
  "method_name": "describe_account_settings",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/timestream-query/client/describe_account_settings.html",
  "description": "Describes the settings for your account that include the query pricing model and the configured maximum TCUs the service can use for your query workload. You're charged only for the duration of compute units used for your workloads.",
  "parameters": [],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "MaxQueryTCU",
          "type": "integer",
          "description": "The maximum number of Timestream compute units (TCUs) the service will use at any point in time to serve your queries. To run queries, you must set a minimum capacity of 4 TCU. You can set the maximum number of TCU in multiples of 4, for example, 4, 8, 16, 32, and so on. This configuration is applicable only for on-demand usage of (TCUs).",
          "nested_items": []
        },
        {
          "name": "QueryPricingModel",
          "type": "string",
          "description": "The pricing model for queries in your account.",
          "nested_items": []
        },
        {
          "name": "QueryCompute",
          "type": "dict",
          "description": "An object that contains the usage settings for Timestream Compute Units (TCUs) in your account for the query workload.",
          "nested_items": [
            {
              "name": "ComputeMode",
              "type": "string",
              "description": "The mode in which Timestream Compute Units (TCUs) are allocated and utilized within an account. Note that in the Asia Pacific (Mumbai) region, the API operation only recognizes the value PROVISIONED.",
              "nested_items": []
            },
            {
              "name": "ProvisionedCapacity",
              "type": "dict",
              "description": "Configuration object that contains settings for provisioned Timestream Compute Units (TCUs) in your account.",
              "nested_items": [
                {
                  "name": "ActiveQueryTCU",
                  "type": "integer",
                  "description": "The number of Timestream Compute Units (TCUs) provisioned in the account. This field is only visible when the compute mode is PROVISIONED.",
                  "nested_items": []
                },
                {
                  "name": "NotificationConfiguration",
                  "type": "dict",
                  "description": "An object that contains settings for notifications that are sent whenever the provisioned capacity settings are modified. This field is only visible when the compute mode is PROVISIONED.",
                  "nested_items": [
                    {
                      "name": "SnsConfiguration",
                      "type": "dict",
                      "description": "Details on SNS that are required to send the notification.",
                      "nested_items": [
                        {
                          "name": "TopicArn",
                          "type": "string",
                          "description": "SNS topic ARN that the scheduled query status notifications will be sent to.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "RoleArn",
                      "type": "string",
                      "description": "An Amazon Resource Name (ARN) that grants Timestream permission to publish notifications. This field is only visible if SNS Topic is provided when updating the account settings.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "LastUpdate",
                  "type": "dict",
                  "description": "Information about the last update to the provisioned capacity settings.",
                  "nested_items": [
                    {
                      "name": "TargetQueryTCU",
                      "type": "integer",
                      "description": "The number of TimeStream Compute Units (TCUs) requested in the last account settings update.",
                      "nested_items": []
                    },
                    {
                      "name": "Status",
                      "type": "string",
                      "description": "The status of the last update. Can be either PENDING, FAILED, or SUCCEEDED.",
                      "nested_items": []
                    },
                    {
                      "name": "StatusMessage",
                      "type": "string",
                      "description": "Error message describing the last account settings update status, visible only if an error occurred.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}