{
  "method_name": "execute_scheduled_query",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/timestream-query/client/execute_scheduled_query.html",
  "description": "You can use this API to run a scheduled query manually. If you enabled QueryInsights, this API also returns insights and metrics related to the query that you executed as part of an Amazon SNS notification. QueryInsights helps with performance tuning of your query. For more information about QueryInsights, see Using query insights to optimize queries in Amazon Timestream.",
  "parameters": [
    {
      "name": "ScheduledQueryArn",
      "type": "string",
      "required": true,
      "description": "ARN of the scheduled query.",
      "nested_params": []
    },
    {
      "name": "InvocationTime",
      "type": "datetime",
      "required": true,
      "description": "The timestamp in UTC. Query will be run as if it was invoked at this timestamp.",
      "nested_params": []
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": false,
      "description": "Not used. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "QueryInsights",
      "type": "dict",
      "required": true,
      "description": "Encapsulates settings for enabling QueryInsights. Enabling QueryInsights returns insights and metrics as a part of the Amazon SNS notification for the query that you executed. You can use QueryInsights to tune your query performance and cost. Provides the following modes to enable ScheduledQueryInsights: ENABLED_WITH_RATE_CONTROL --- Enables ScheduledQueryInsights for the queries being processed. This mode also includes a rate control mechanism, which limits the QueryInsights feature to 1 query per second (QPS). DISABLED --- Disables ScheduledQueryInsights.",
      "nested_params": [
        {
          "name": "Mode",
          "type": "string",
          "required": false,
          "description": "Provides the following modes to enable ScheduledQueryInsights:",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}