{
  "method_name": "update_account_settings",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/timestream-query/client/update_account_settings.html",
  "description": "Transitions your account to use TCUs for query pricing and modifies the maximum query compute units that you've configured. If you reduce the value of MaxQueryTCU to a desired configuration, the new value can take up to 24 hours to be effective.",
  "parameters": [
    {
      "name": "MaxQueryTCU",
      "type": "integer",
      "required": false,
      "description": "The maximum number of compute units the service will use at any point in time to serve your queries. To run queries, you must set a minimum capacity of 4 TCU. You can set the maximum number of TCU in multiples of 4, for example, 4, 8, 16, 32, and so on. The maximum value supported for MaxQueryTCU is 1000. To request an increase to this soft limit, contact Amazon Web Services Support. For information about the default quota for maxQueryTCU, see Default quotas. This configuration is applicable only for on-demand usage of Timestream Compute Units (TCUs). For information about the default quota for maxQueryTCU, see Default quotas.",
      "nested_params": []
    },
    {
      "name": "QueryPricingModel",
      "type": "string",
      "required": false,
      "description": "The pricing model for queries in an account.",
      "nested_params": []
    },
    {
      "name": "QueryCompute",
      "type": "dict",
      "required": true,
      "description": "Modifies the query compute settings configured in your account, including the query pricing model and provisioned Timestream Compute Units (TCUs) in your account. ComputeMode (string) --- The mode in which Timestream Compute Units (TCUs) are allocated and utilized within an account. Note that in the Asia Pacific (Mumbai) region, the API operation only recognizes the value PROVISIONED. ProvisionedCapacity (dict) --- Configuration object that contains settings for provisioned Timestream Compute Units (TCUs) in your account. The target compute capacity for querying data, specified in Timestream Compute Units (TCUs). NotificationConfiguration (dict) --- Configuration settings for notifications related to the provisioned capacity update. SnsConfiguration (dict) --- Details on SNS that are required to send the notification. SNS topic ARN that the scheduled query status notifications will be sent to. An Amazon Resource Name (ARN) that grants Timestream permission to publish notifications. This field is only visible if SNS Topic is provided when updating the account settings.",
      "nested_params": [
        {
          "name": "ComputeMode",
          "type": "string",
          "required": false,
          "description": "The mode in which Timestream Compute Units (TCUs) are allocated and utilized within an account. Note that in the Asia Pacific (Mumbai) region, the API operation only recognizes the value PROVISIONED.",
          "nested_params": []
        },
        {
          "name": "ProvisionedCapacity",
          "type": "dict",
          "required": false,
          "description": "Configuration object that contains settings for provisioned Timestream Compute Units (TCUs) in your account.",
          "nested_params": [
            {
              "name": "TargetQueryTCU",
              "type": "integer",
              "required": false,
              "description": "The target compute capacity for querying data, specified in Timestream Compute Units (TCUs).",
              "nested_params": []
            },
            {
              "name": "NotificationConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration settings for notifications related to the provisioned capacity update.",
              "nested_params": [
                {
                  "name": "SnsConfiguration",
                  "type": "dict",
                  "required": false,
                  "description": "Details on SNS that are required to send the notification.",
                  "nested_params": [
                    {
                      "name": "TopicArn",
                      "type": "string",
                      "required": false,
                      "description": "SNS topic ARN that the scheduled query status notifications will be sent to.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "RoleArn",
                  "type": "string",
                  "required": false,
                  "description": "An Amazon Resource Name (ARN) that grants Timestream permission to publish notifications. This field is only visible if SNS Topic is provided when updating the account settings.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "MaxQueryTCU",
          "type": "integer",
          "description": "The configured maximum number of compute units the service will use at any point in time to serve your queries.",
          "nested_items": []
        },
        {
          "name": "QueryPricingModel",
          "type": "string",
          "description": "The pricing model for an account.",
          "nested_items": []
        },
        {
          "name": "QueryCompute",
          "type": "dict",
          "description": "Confirms the updated account settings for querying data in your account.",
          "nested_items": [
            {
              "name": "ComputeMode",
              "type": "string",
              "description": "The mode in which Timestream Compute Units (TCUs) are allocated and utilized within an account. Note that in the Asia Pacific (Mumbai) region, the API operation only recognizes the value PROVISIONED.",
              "nested_items": []
            },
            {
              "name": "ProvisionedCapacity",
              "type": "dict",
              "description": "Configuration object that contains settings for provisioned Timestream Compute Units (TCUs) in your account.",
              "nested_items": [
                {
                  "name": "ActiveQueryTCU",
                  "type": "integer",
                  "description": "The number of Timestream Compute Units (TCUs) provisioned in the account. This field is only visible when the compute mode is PROVISIONED.",
                  "nested_items": []
                },
                {
                  "name": "NotificationConfiguration",
                  "type": "dict",
                  "description": "An object that contains settings for notifications that are sent whenever the provisioned capacity settings are modified. This field is only visible when the compute mode is PROVISIONED.",
                  "nested_items": [
                    {
                      "name": "SnsConfiguration",
                      "type": "dict",
                      "description": "Details on SNS that are required to send the notification.",
                      "nested_items": [
                        {
                          "name": "TopicArn",
                          "type": "string",
                          "description": "SNS topic ARN that the scheduled query status notifications will be sent to.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "RoleArn",
                      "type": "string",
                      "description": "An Amazon Resource Name (ARN) that grants Timestream permission to publish notifications. This field is only visible if SNS Topic is provided when updating the account settings.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "LastUpdate",
                  "type": "dict",
                  "description": "Information about the last update to the provisioned capacity settings.",
                  "nested_items": [
                    {
                      "name": "TargetQueryTCU",
                      "type": "integer",
                      "description": "The number of TimeStream Compute Units (TCUs) requested in the last account settings update.",
                      "nested_items": []
                    },
                    {
                      "name": "Status",
                      "type": "string",
                      "description": "The status of the last update. Can be either PENDING, FAILED, or SUCCEEDED.",
                      "nested_items": []
                    },
                    {
                      "name": "StatusMessage",
                      "type": "string",
                      "description": "Error message describing the last account settings update status, visible only if an error occurred.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}