{
  "method_name": "untag_resource",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/memorydb/client/untag_resource.html",
  "description": "Use this operation to remove tags on a resource. A tag is a key-value pair where the key and value are case-sensitive. You can use tags to categorize and track all your MemoryDB resources. For more information, see Tagging your MemoryDB resources. When you remove tags from multi region clusters, you might not immediately see the latest effective tags in the ListTags API response due to it being eventually consistent specifically for multi region clusters. For more information, see Tagging your MemoryDB resources. You can specify cost-allocation tags for your MemoryDB resources, Amazon generates a cost allocation report as a comma-separated value (CSV) file with your usage and costs aggregated by your tags. You can apply tags that represent business categories (such as cost centers, application names, or owners) to organize your costs across multiple services. For more information, see Using Cost Allocation Tags.",
  "parameters": [
    {
      "name": "ResourceArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the resource to which the tags are to be removed.",
      "nested_params": []
    },
    {
      "name": "TagKeys",
      "type": "list",
      "required": true,
      "description": "The list of keys of the tags that are to be removed. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "TagList",
          "type": "list",
          "description": "The list of tags removed.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Key",
                  "type": "string",
                  "description": "The key for the tag. May not be null.",
                  "nested_items": []
                },
                {
                  "name": "Value",
                  "type": "string",
                  "description": "The tag's value. May be null.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}