{
  "method_name": "update_domain_contact_privacy",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/route53domains/client/update_domain_contact_privacy.html",
  "description": "This operation updates the specified domain contact's privacy setting. When privacy protection is enabled, your contact information is replaced with contact information for the registrar or with the phrase 'REDACTED FOR PRIVACY', or 'On behalf of <domain name> owner.' This operation affects only the contact information for the specified contact type (administrative, registrant, or technical). If the request succeeds, Amazon Route 53 returns an operation ID that you can use with GetOperationDetail to track the progress and completion of the action. If the request doesn't complete successfully, the domain registrant will be notified by email.",
  "parameters": [
    {
      "name": "DomainName",
      "type": "string",
      "required": true,
      "description": "The name of the domain that you want to update the privacy setting for.",
      "nested_params": []
    },
    {
      "name": "AdminPrivacy",
      "type": "boolean",
      "required": false,
      "description": "Whether you want to conceal contact information from WHOIS queries. If you specify true, WHOIS ('who is') queries return contact information either for Amazon Registrar or for our registrar associate, Gandi. If you specify false, WHOIS queries return the information that you entered for the admin contact.",
      "nested_params": []
    },
    {
      "name": "RegistrantPrivacy",
      "type": "boolean",
      "required": false,
      "description": "Whether you want to conceal contact information from WHOIS queries. If you specify true, WHOIS ('who is') queries return contact information either for Amazon Registrar or for our registrar associate, Gandi. If you specify false, WHOIS queries return the information that you entered for the registrant contact (domain owner).",
      "nested_params": []
    },
    {
      "name": "TechPrivacy",
      "type": "boolean",
      "required": false,
      "description": "Whether you want to conceal contact information from WHOIS queries. If you specify true, WHOIS ('who is') queries return contact information either for Amazon Registrar or for our registrar associate, Gandi. If you specify false, WHOIS queries return the information that you entered for the technical contact.",
      "nested_params": []
    },
    {
      "name": "BillingPrivacy",
      "type": "boolean",
      "required": false,
      "description": "Whether you want to conceal contact information from WHOIS queries. If you specify true, WHOIS ('who is') queries return contact information either for Amazon Registrar or for our registrar associate, Gandi. If you specify false, WHOIS queries return the information that you entered for the billing contact.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "OperationId",
          "type": "string",
          "description": "Identifier for tracking the progress of the request. To use this ID to query the operation status, use GetOperationDetail.",
          "nested_items": []
        }
      ]
    }
  ]
}