{
  "method_name": "update_domain_nameservers",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/route53domains/client/update_domain_nameservers.html",
  "description": "This operation replaces the current set of name servers for the domain with the specified set of name servers. If you use Amazon Route 53 as your DNS service, specify the four name servers in the delegation set for the hosted zone for the domain. If successful, this operation returns an operation ID that you can use to track the progress and completion of the action. If the request is not completed successfully, the domain registrant will be notified by email.",
  "parameters": [
    {
      "name": "DomainName",
      "type": "string",
      "required": true,
      "description": "The name of the domain that you want to change name servers for.",
      "nested_params": []
    },
    {
      "name": "FIAuthKey",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Nameservers",
      "type": "list",
      "required": true,
      "description": "A list of new name servers for the domain. (dict) --- Name server includes the following elements. The fully qualified host name of the name server. Constraint: Maximum 255 characters GlueIps (list) --- Glue IP address of a name server entry. Glue IP addresses are required only when the name of the name server is a subdomain of the domain. For example, if your domain is example.com and the name server for the domain is ns.example.com, you need to specify the IP address for ns.example.com. Constraints: The list can contain only one IPv4 and one IPv6 address. (string) ---",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The fully qualified host name of the name server. Constraint: Maximum 255 characters.",
          "nested_params": []
        },
        {
          "name": "GlueIps",
          "type": "list",
          "required": false,
          "description": "Glue IP address of a name server entry. Glue IP addresses are required only when the name of the name server is a subdomain of the domain. For example, if your domain is example.com and the name server for the domain is ns.example.com, you need to specify the IP address for ns.example.com. Constraints: The list can contain only one IPv4 and one IPv6 address.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "OperationId",
          "type": "string",
          "description": "Identifier for tracking the progress of the request. To query the operation status, use GetOperationDetail.",
          "nested_items": []
        }
      ]
    }
  ]
}