{
  "method_name": "create_table_bucket",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3tables/client/create_table_bucket.html",
  "description": "Creates a table bucket. For more information, see Creating a table bucket in the Amazon Simple Storage Service User Guide.",
  "parameters": [
    {
      "name": "name",
      "type": "string",
      "required": true,
      "description": "The name for the table bucket.",
      "nested_params": []
    },
    {
      "name": "encryptionConfiguration",
      "type": "dict",
      "required": true,
      "description": "The encryption configuration to use for the table bucket. This configuration specifies the default encryption settings that will be applied to all tables created in this bucket unless overridden at the table level. The configuration includes the encryption algorithm and, if using SSE-KMS, the KMS key to use. The server-side encryption algorithm to use. Valid values are AES256 for S3-managed encryption keys, or aws:kms for Amazon Web Services KMS-managed encryption keys. If you choose SSE-KMS encryption you must grant the S3 Tables maintenance principal access to your KMS key. For more information, see Permissions requirements for S3 Tables SSE-KMS encryption. kmsKeyArn (string) --- The Amazon Resource Name (ARN) of the KMS key to use for encryption. This field is required only when sseAlgorithm is set to aws:kms.",
      "nested_params": [
        {
          "name": "sseAlgorithm",
          "type": "string",
          "required": false,
          "description": "The server-side encryption algorithm to use. Valid values are AES256 for S3-managed encryption keys, or aws:kms for Amazon Web Services KMS-managed encryption keys. If you choose SSE-KMS encryption you must grant the S3 Tables maintenance principal access to your KMS key. For more information, see Permissions requirements for S3 Tables SSE-KMS encryption.",
          "nested_params": []
        },
        {
          "name": "kmsKeyArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the KMS key to use for encryption. This field is required only when sseAlgorithm is set to aws:kms.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "arn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the table bucket.",
          "nested_items": []
        }
      ]
    }
  ]
}