{
  "method_name": "start_entities_detection_v2_job",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/comprehendmedical/client/start_entities_detection_v2_job.html",
  "description": "Starts an asynchronous medical entity detection job for a collection of documents. Use the DescribeEntitiesDetectionV2Job operation to track the status of a job.",
  "parameters": [
    {
      "name": "InputDataConfig",
      "type": "dict",
      "required": true,
      "description": "The input configuration that specifies the format and location of the input data for the job. The URI of the S3 bucket that contains the input data. The bucket must be in the same region as the API endpoint that you are calling. S3Key (string) --- The path to the input data files in the S3 bucket.",
      "nested_params": [
        {
          "name": "S3Bucket",
          "type": "string",
          "required": false,
          "description": "The URI of the S3 bucket that contains the input data. The bucket must be in the same region as the API endpoint that you are calling.",
          "nested_params": []
        },
        {
          "name": "S3Key",
          "type": "string",
          "required": false,
          "description": "The path to the input data files in the S3 bucket.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "OutputDataConfig",
      "type": "dict",
      "required": true,
      "description": "The output configuration that specifies where to send the output files. When you use the OutputDataConfig object with asynchronous operations, you specify the Amazon S3 location where you want to write the output data. The URI must be in the same region as the API endpoint that you are calling. The location is used as the prefix for the actual location of the output. S3Key (string) --- The path to the output data files in the S3 bucket. Amazon Comprehend Medical creates an output directory using the job ID so that the output from one job does not overwrite the output of another.",
      "nested_params": [
        {
          "name": "S3Bucket",
          "type": "string",
          "required": false,
          "description": "When you use the OutputDataConfig object with asynchronous operations, you specify the Amazon S3 location where you want to write the output data. The URI must be in the same region as the API endpoint that you are calling. The location is used as the prefix for the actual location of the output.",
          "nested_params": []
        },
        {
          "name": "S3Key",
          "type": "string",
          "required": false,
          "description": "The path to the output data files in the S3 bucket. Amazon Comprehend Medical creates an output directory using the job ID so that the output from one job does not overwrite the output of another.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "DataAccessRoleArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the AWS Identity and Access Management (IAM) role that grants Amazon Comprehend Medical read access to your input data. For more information, see Role-Based Permissions Required for Asynchronous Operations.",
      "nested_params": []
    },
    {
      "name": "JobName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ClientRequestToken",
      "type": "string",
      "required": false,
      "description": "A unique identifier for the request. If you don't set the client request token, Amazon Comprehend Medical generates one for you. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "KMSKey",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "LanguageCode",
      "type": "string",
      "required": true,
      "description": "The language of the input documents. All documents must be in the same language. Amazon Comprehend Medical processes files in US English (en).",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "JobId",
          "type": "string",
          "description": "The identifier generated for the job. To get the status of a job, use this identifier with the DescribeEntitiesDetectionV2Job operation.",
          "nested_items": []
        }
      ]
    }
  ]
}