{
  "method_name": "post_whatsapp_message_media",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/socialmessaging/client/post_whatsapp_message_media.html",
  "description": "Upload a media file to the WhatsApp service. Only the specified originationPhoneNumberId has the permissions to send the media file when using SendWhatsAppMessage. You must use either sourceS3File or sourceS3PresignedUrl for the source. If both or neither are specified then an InvalidParameterException is returned.",
  "parameters": [
    {
      "name": "originationPhoneNumberId",
      "type": "string",
      "required": true,
      "description": "The ID of the phone number to associate with the WhatsApp media file. The phone number identifiers are formatted as phone-number-id-01234567890123456789012345678901. Use GetLinkedWhatsAppBusinessAccount to find a phone number's id.",
      "nested_params": []
    },
    {
      "name": "sourceS3PresignedUrl",
      "type": "dict",
      "required": true,
      "description": "The source presign url of the media file. The presign url to the object. A map of headers and their values. You must specify the Content-Type header when using PostWhatsAppMessageMedia. For a list of common headers, see Common Request Headers in the Amazon S3 API Reference (string) --- (string) ---",
      "nested_params": [
        {
          "name": "url",
          "type": "string",
          "required": false,
          "description": "The presign url to the object.",
          "nested_params": []
        },
        {
          "name": "headers",
          "type": "dict",
          "required": false,
          "description": "A map of headers and their values. You must specify the Content-Type header when using PostWhatsAppMessageMedia. For a list of common headers, see Common Request Headers in the Amazon S3 API Reference.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "sourceS3File",
      "type": "dict",
      "required": true,
      "description": "The source S3 url for the media file. The bucket name. The object key of the media file.",
      "nested_params": [
        {
          "name": "bucketName",
          "type": "string",
          "required": false,
          "description": "The bucket name.",
          "nested_params": []
        },
        {
          "name": "key",
          "type": "string",
          "required": false,
          "description": "The object key of the media file.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "mediaId",
          "type": "string",
          "description": "The unique identifier of the posted WhatsApp message.",
          "nested_items": []
        }
      ]
    }
  ]
}