{
  "method_name": "update_account_audit_configuration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iot/client/update_account_audit_configuration.html",
  "description": "Configures or reconfigures the Device Defender audit settings for this account. Settings include how audit notifications are sent and which audit checks are enabled or disabled. Requires permission to access the UpdateAccountAuditConfiguration action.",
  "parameters": [
    {
      "name": "roleArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "auditNotificationTargetConfigurations",
      "type": "dict",
      "required": false,
      "description": "Information about the targets to which audit notifications are sent. (string) --- (dict) --- Information about the targets to which audit notifications are sent. targetArn (string) --- The ARN of the target (SNS topic) to which audit notifications are sent. roleArn (string) --- The ARN of the role that grants permission to send notifications to the target. enabled (boolean) --- True if notifications to the target are enabled.",
      "nested_params": [
        {
          "name": "targetArn",
          "type": "string",
          "required": false,
          "description": "The ARN of the target (SNS topic) to which audit notifications are sent.",
          "nested_params": []
        },
        {
          "name": "roleArn",
          "type": "string",
          "required": false,
          "description": "The ARN of the role that grants permission to send notifications to the target.",
          "nested_params": []
        },
        {
          "name": "enabled",
          "type": "boolean",
          "required": false,
          "description": "True if notifications to the target are enabled.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "auditCheckConfigurations",
      "type": "dict",
      "required": false,
      "description": "Specifies which audit checks are enabled and disabled for this account. Use DescribeAccountAuditConfiguration to see the list of all checks, including those that are currently enabled. Some data collection might start immediately when certain checks are enabled. When a check is disabled, any data collected so far in relation to the check is deleted. You cannot disable a check if it's used by any scheduled audit. You must first delete the check from the scheduled audit or delete the scheduled audit itself. On the first call to UpdateAccountAuditConfiguration, this parameter is required and must specify at least one enabled check. (string) --- An audit check name. Checks must be enabled for your account. (Use DescribeAccountAuditConfiguration to see the list of all checks, including those that are enabled or use UpdateAccountAuditConfiguration to select which checks are enabled.) (dict) --- Which audit checks are enabled and disabled for this account. enabled (boolean) --- True if this audit check is enabled for this account. configuration (dict) --- A structure containing the configName and corresponding configValue for configuring audit checks. (string) --- (string) ---",
      "nested_params": [
        {
          "name": "enabled",
          "type": "boolean",
          "required": false,
          "description": "True if this audit check is enabled for this account.",
          "nested_params": []
        },
        {
          "name": "configuration",
          "type": "dict",
          "required": false,
          "description": "A structure containing the configName and corresponding configValue for configuring audit checks.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}