{
  "method_name": "create_traffic_policy",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/mailmanager/client/create_traffic_policy.html",
  "description": "Provision a new traffic policy resource.",
  "parameters": [
    {
      "name": "ClientToken",
      "type": "string",
      "required": false,
      "description": "A unique token that Amazon SES uses to recognize subsequent retries of the same request. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "DefaultAction",
      "type": "string",
      "required": true,
      "description": "Default action instructs the traï¬\u0083c policy to either Allow or Deny (block) messages that fall outside of (or not addressed by) the conditions of your policy statements.",
      "nested_params": []
    },
    {
      "name": "MaxMessageSizeBytes",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "PolicyStatements",
      "type": "list",
      "required": true,
      "description": "Conditional statements for filtering email traffic. (dict) --- The structure containing traffic policy conditions and actions. The action that informs a traffic policy resource to either allow or block the email if it matches a condition in the policy statement. The list of conditions to apply to incoming messages for filtering email traffic. (dict) --- The email traffic filtering conditions which are contained in a traffic policy resource. BooleanExpression (dict) --- This represents a boolean type condition matching on the incoming mail. It performs the boolean operation configured in --\u0098Operator' and evaluates the --\u0098Protocol' object against the --\u0098Value'. The operand on which to perform a boolean condition operation. Analysis (dict) --- The structure type for a boolean condition stating the Add On ARN and its returned value. The Amazon Resource Name (ARN) of an Add On. The returned value from an Add On. IsInAddressList (dict) --- The structure type for a boolean condition that provides the address lists to evaluate incoming traffic on. The address lists that will be used for evaluation. (string) --- The email attribute that needs to be evaluated against the address list. The matching operator for a boolean condition expression. IpExpression (dict) --- This represents an IP based condition matching on the incoming mail. It performs the operation configured in --\u0098Operator' and evaluates the --\u0098Protocol' object against the --\u0098Value'. The left hand side argument of an IP condition expression. Attribute (string) --- An enum type representing the allowed attribute types for an IP condition. The matching operator for an IP condition expression. The right hand side argument of an IP condition expression. (string) --- Ipv6Expression (dict) --- This represents an IPv6 based condition matching on the incoming mail. The left hand side argument of an IPv6 condition expression. Attribute (string) --- An enum type representing the allowed attribute types for an IPv6 condition. The matching operator for an IPv6 condition expression. The right hand side argument of an IPv6 condition expression. (string) --- StringExpression (dict) --- This represents a string based condition matching on the incoming mail. It performs the string operation configured in --\u0098Operator' and evaluates the --\u0098Protocol' object against the --\u0098Value'. The left hand side argument of a string condition expression. Analysis (dict) --- The structure type for a string condition stating the Add On ARN and its returned value. Attribute (string) --- The enum type representing the allowed attribute types for a string condition. The matching operator for a string condition expression. The right hand side argument of a string condition expression. (string) --- TlsExpression (dict) --- This represents a TLS based condition matching on the incoming mail. The left hand side argument of a TLS condition expression. Attribute (string) --- The enum type representing the allowed attribute types for the TLS condition. The matching operator for a TLS condition expression. The right hand side argument of a TLS condition expression.",
      "nested_params": [
        {
          "name": "Action",
          "type": "string",
          "required": false,
          "description": "The action that informs a traffic policy resource to either allow or block the email if it matches a condition in the policy statement.",
          "nested_params": []
        },
        {
          "name": "Conditions",
          "type": "list",
          "required": false,
          "description": "The list of conditions to apply to incoming messages for filtering email traffic.",
          "nested_params": [
            {
              "name": "BooleanExpression",
              "type": "dict",
              "required": false,
              "description": "This represents a boolean type condition matching on the incoming mail. It performs the boolean operation configured in --\u0098Operator' and evaluates the --\u0098Protocol' object against the --\u0098Value'.",
              "nested_params": [
                {
                  "name": "Evaluate",
                  "type": "dict",
                  "required": false,
                  "description": "The operand on which to perform a boolean condition operation.",
                  "nested_params": [
                    {
                      "name": "Analysis",
                      "type": "dict",
                      "required": false,
                      "description": "The structure type for a boolean condition stating the Add On ARN and its returned value.",
                      "nested_params": [
                        {
                          "name": "Analyzer",
                          "type": "string",
                          "required": false,
                          "description": "The Amazon Resource Name (ARN) of an Add On.",
                          "nested_params": []
                        },
                        {
                          "name": "ResultField",
                          "type": "string",
                          "required": false,
                          "description": "The returned value from an Add On.",
                          "nested_params": []
                        }
                      ]
                    },
                    {
                      "name": "IsInAddressList",
                      "type": "dict",
                      "required": false,
                      "description": "The structure type for a boolean condition that provides the address lists to evaluate incoming traffic on.",
                      "nested_params": [
                        {
                          "name": "AddressLists",
                          "type": "list",
                          "required": false,
                          "description": "The address lists that will be used for evaluation.",
                          "nested_params": []
                        },
                        {
                          "name": "Attribute",
                          "type": "string",
                          "required": false,
                          "description": "The email attribute that needs to be evaluated against the address list.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "Operator",
                  "type": "string",
                  "required": false,
                  "description": "The matching operator for a boolean condition expression.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "IpExpression",
              "type": "dict",
              "required": false,
              "description": "This represents an IP based condition matching on the incoming mail. It performs the operation configured in --\u0098Operator' and evaluates the --\u0098Protocol' object against the --\u0098Value'.",
              "nested_params": [
                {
                  "name": "Evaluate",
                  "type": "dict",
                  "required": false,
                  "description": "The left hand side argument of an IP condition expression.",
                  "nested_params": [
                    {
                      "name": "Attribute",
                      "type": "string",
                      "required": false,
                      "description": "An enum type representing the allowed attribute types for an IP condition.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "Operator",
                  "type": "string",
                  "required": false,
                  "description": "The matching operator for an IP condition expression.",
                  "nested_params": []
                },
                {
                  "name": "Values",
                  "type": "list",
                  "required": false,
                  "description": "The right hand side argument of an IP condition expression.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Ipv6Expression",
              "type": "dict",
              "required": false,
              "description": "This represents an IPv6 based condition matching on the incoming mail. It performs the operation configured in --\u0098Operator' and evaluates the --\u0098Protocol' object against the --\u0098Value'.",
              "nested_params": [
                {
                  "name": "Evaluate",
                  "type": "dict",
                  "required": false,
                  "description": "The left hand side argument of an IPv6 condition expression.",
                  "nested_params": [
                    {
                      "name": "Attribute",
                      "type": "string",
                      "required": false,
                      "description": "An enum type representing the allowed attribute types for an IPv6 condition.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "Operator",
                  "type": "string",
                  "required": false,
                  "description": "The matching operator for an IPv6 condition expression.",
                  "nested_params": []
                },
                {
                  "name": "Values",
                  "type": "list",
                  "required": false,
                  "description": "The right hand side argument of an IPv6 condition expression.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "StringExpression",
              "type": "dict",
              "required": false,
              "description": "This represents a string based condition matching on the incoming mail. It performs the string operation configured in --\u0098Operator' and evaluates the --\u0098Protocol' object against the --\u0098Value'.",
              "nested_params": [
                {
                  "name": "Evaluate",
                  "type": "dict",
                  "required": false,
                  "description": "The left hand side argument of a string condition expression.",
                  "nested_params": [
                    {
                      "name": "Analysis",
                      "type": "dict",
                      "required": false,
                      "description": "The structure type for a string condition stating the Add On ARN and its returned value.",
                      "nested_params": [
                        {
                          "name": "Analyzer",
                          "type": "string",
                          "required": false,
                          "description": "The Amazon Resource Name (ARN) of an Add On.",
                          "nested_params": []
                        },
                        {
                          "name": "ResultField",
                          "type": "string",
                          "required": false,
                          "description": "The returned value from an Add On.",
                          "nested_params": []
                        }
                      ]
                    },
                    {
                      "name": "Attribute",
                      "type": "string",
                      "required": false,
                      "description": "The enum type representing the allowed attribute types for a string condition.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "Operator",
                  "type": "string",
                  "required": false,
                  "description": "The matching operator for a string condition expression.",
                  "nested_params": []
                },
                {
                  "name": "Values",
                  "type": "list",
                  "required": false,
                  "description": "The right hand side argument of a string condition expression.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "TlsExpression",
              "type": "dict",
              "required": false,
              "description": "This represents a TLS based condition matching on the incoming mail. It performs the operation configured in --\u0098Operator' and evaluates the --\u0098Protocol' object against the --\u0098Value'.",
              "nested_params": [
                {
                  "name": "Evaluate",
                  "type": "dict",
                  "required": false,
                  "description": "The left hand side argument of a TLS condition expression.",
                  "nested_params": [
                    {
                      "name": "Attribute",
                      "type": "string",
                      "required": false,
                      "description": "The enum type representing the allowed attribute types for the TLS condition.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "Operator",
                  "type": "string",
                  "required": false,
                  "description": "The matching operator for a TLS condition expression.",
                  "nested_params": []
                },
                {
                  "name": "Value",
                  "type": "string",
                  "required": false,
                  "description": "The right hand side argument of a TLS condition expression.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "The tags used to organize, track, or control access for the resource. For example, { 'tags': {'key1':'value1', 'key2':'value2'} }. (dict) --- A key-value pair (the value is optional), that you can define and assign to Amazon Web Services resources. The key of the key-value tag. The value of the key-value tag.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key of the key-value tag.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value of the key-value tag.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "TrafficPolicyName",
      "type": "string",
      "required": true,
      "description": "A user-friendly name for the traffic policy resource.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "TrafficPolicyId",
          "type": "string",
          "description": "The identifier of the traffic policy resource.",
          "nested_items": []
        }
      ]
    }
  ]
}