{
  "method_name": "associate_file_system_aliases",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/fsx/client/associate_file_system_aliases.html",
  "description": "Use this action to associate one or more Domain Name Server (DNS) aliases with an existing Amazon FSx for Windows File Server file system. A file system can have a maximum of 50 DNS aliases associated with it at any one time. If you try to associate a DNS alias that is already associated with the file system, FSx takes no action on that alias in the request. For more information, see Working with DNS Aliases and Walkthrough 5: Using DNS aliases to access your file system, including additional steps you must take to be able to access your file system using a DNS alias. The system response shows the DNS aliases that Amazon FSx is attempting to associate with the file system. Use the API operation to monitor the status of the aliases Amazon FSx is associating with the file system.",
  "parameters": [
    {
      "name": "ClientRequestToken",
      "type": "string",
      "required": false,
      "description": "(Optional) An idempotency token for resource creation, in a string of up to 63 ASCII characters. This token is automatically filled on your behalf when you use the Command Line Interface (CLI) or an Amazon Web Services SDK. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "FileSystemId",
      "type": "string",
      "required": true,
      "description": "Specifies the file system with which you want to associate one or more DNS aliases.",
      "nested_params": []
    },
    {
      "name": "Aliases",
      "type": "list",
      "required": true,
      "description": "An array of one or more DNS alias names to associate with the file system. The alias name has to comply with the following formatting requirements: Formatted as a fully-qualified domain name (FQDN), hostname.domain , for example, accounting.corp.example.com. Can contain alphanumeric characters and the hyphen (-). Cannot start or end with a hyphen. Can start with a numeric. For DNS alias names, Amazon FSx stores alphabetic characters as lowercase letters (a-z), regardless of how you specify them: as uppercase letters, lowercase letters, or the corresponding letters in escape codes. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Aliases",
          "type": "list",
          "description": "An array of the DNS aliases that Amazon FSx is associating with the file system.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The name of the DNS alias. The alias name has to meet the following requirements:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "FQDN",
                      "description": "Formatted as a fully-qualified domain name (FQDN), hostname.domain, for example, accounting.example.com.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "_",
                      "description": "Can contain alphanumeric characters, the underscore (_), and the hyphen (-).",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Cannot start or end with a hyphen.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Can start with a numeric.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Lifecycle",
                  "type": "string",
                  "description": "Describes the state of the DNS alias.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "AVAILABLE - The DNS alias is associated with an Amazon FSx file system.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "CREATING - Amazon FSx is creating the DNS alias and associating it with the file system.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "CREATE_FAILED - Amazon FSx was unable to associate the DNS alias with the file system.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "DELETING - Amazon FSx is disassociating the DNS alias from the file system and deleting it.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "DELETE_FAILED - Amazon FSx was unable to disassociate the DNS alias from the file system.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}