{
  "method_name": "create_storage_virtual_machine",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/fsx/client/create_storage_virtual_machine.html",
  "description": "Creates a storage virtual machine (SVM) for an Amazon FSx for ONTAP file system.",
  "parameters": [
    {
      "name": "ActiveDirectoryConfiguration",
      "type": "dict",
      "required": true,
      "description": "Describes the self-managed Microsoft Active Directory to which you want to join the SVM. Joining an Active Directory provides user authentication and access control for SMB clients, including Microsoft Windows and macOS clients accessing the file system. The NetBIOS name of the Active Directory computer object that will be created for your SVM. SelfManagedActiveDirectoryConfiguration (dict) --- The configuration that Amazon FSx uses to join a FSx for Windows File Server file system or an FSx for ONTAP storage virtual machine (SVM) to a self-managed (including on-premises) Microsoft Active Directory (AD) directory. For more information, see Using Amazon FSx for Windows with your self-managed Microsoft Active Directory or Managing FSx for ONTAP SVMs. The fully qualified domain name of the self-managed AD directory, such as corp.example.com. OrganizationalUnitDistinguishedName (string) --- (Optional) The fully qualified distinguished name of the organizational unit within your self-managed AD directory. Amazon FSx only accepts OU as the direct parent of the file system. An example is OU=FSx,DC=yourdomain,DC=corp,DC=com. To learn more, see RFC 2253. If none is provided, the FSx file system is created in the default location of your self-managed AD directory. FileSystemAdministratorsGroup (string) --- (Optional) The name of the domain group whose members are granted administrative privileges for the file system. Administrative privileges include taking ownership of files and folders, setting audit controls (audit ACLs) on files and folders, and administering the file system remotely by using the FSx Remote PowerShell. The group that you specify must already exist in your domain. If you don't provide one, your AD domain's Domain Admins group is used. The user name for the service account on your self-managed AD domain that Amazon FSx will use to join to your AD domain. This account must have the permission to join computers to the domain in the organizational unit provided in OrganizationalUnitDistinguishedName, or in the default location of your AD domain. The password for the service account on your self-managed AD domain that Amazon FSx will use to join to your AD domain. A list of up to three IP addresses of DNS servers or domain controllers in the self-managed AD directory. (string) ---",
      "nested_params": [
        {
          "name": "NetBiosName",
          "type": "string",
          "required": false,
          "description": "The NetBIOS name of the Active Directory computer object that will be created for your SVM.",
          "nested_params": []
        },
        {
          "name": "SelfManagedActiveDirectoryConfiguration",
          "type": "dict",
          "required": false,
          "description": "The configuration that Amazon FSx uses to join a FSx for Windows File Server file system or an FSx for ONTAP storage virtual machine (SVM) to a self-managed (including on-premises) Microsoft Active Directory (AD) directory. For more information, see Using Amazon FSx for Windows with your self-managed Microsoft Active Directory or Managing FSx for ONTAP SVMs.",
          "nested_params": [
            {
              "name": "DomainName",
              "type": "string",
              "required": false,
              "description": "The fully qualified domain name of the self-managed AD directory, such as corp.example.com.",
              "nested_params": []
            },
            {
              "name": "OrganizationalUnitDistinguishedName",
              "type": "string",
              "required": false,
              "description": "(Optional) The fully qualified distinguished name of the organizational unit within your self-managed AD directory. Amazon FSx only accepts OU as the direct parent of the file system. An example is OU=FSx,DC=yourdomain,DC=corp,DC=com. To learn more, see RFC 2253. If none is provided, the FSx file system is created in the default location of your self-managed AD directory.",
              "nested_params": []
            },
            {
              "name": "FileSystemAdministratorsGroup",
              "type": "string",
              "required": false,
              "description": "(Optional) The name of the domain group whose members are granted administrative privileges for the file system. Administrative privileges include taking ownership of files and folders, setting audit controls (audit ACLs) on files and folders, and administering the file system remotely by using the FSx Remote PowerShell. The group that you specify must already exist in your domain. If you don't provide one, your AD domain's Domain Admins group is used.",
              "nested_params": []
            },
            {
              "name": "UserName",
              "type": "string",
              "required": false,
              "description": "The user name for the service account on your self-managed AD domain that Amazon FSx will use to join to your AD domain. This account must have the permission to join computers to the domain in the organizational unit provided in OrganizationalUnitDistinguishedName, or in the default location of your AD domain.",
              "nested_params": []
            },
            {
              "name": "Password",
              "type": "string",
              "required": false,
              "description": "The password for the service account on your self-managed AD domain that Amazon FSx will use to join to your AD domain.",
              "nested_params": []
            },
            {
              "name": "DnsIps",
              "type": "list",
              "required": false,
              "description": "A list of up to three IP addresses of DNS servers or domain controllers in the self-managed AD directory.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "ClientRequestToken",
      "type": "string",
      "required": false,
      "description": "(Optional) An idempotency token for resource creation, in a string of up to 63 ASCII characters. This token is automatically filled on your behalf when you use the Command Line Interface (CLI) or an Amazon Web Services SDK. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "FileSystemId",
      "type": "string",
      "required": true,
      "description": "The globally unique ID of the file system, assigned by Amazon FSx.",
      "nested_params": []
    },
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "The name of the SVM.",
      "nested_params": []
    },
    {
      "name": "SvmAdminPassword",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "A list of Tag values, with a maximum of 50 elements. (dict) --- Specifies a key-value pair for a resource tag. A value that specifies the TagKey, the name of the tag. Tag keys must be unique for the resource to which they are attached. A value that specifies the TagValue, the value assigned to the corresponding tag key. Tag values can be null and don't have to be unique in a tag set. For example, you can have a key-value pair in a tag set of finances : April and also of payroll : April.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "A value that specifies the TagKey, the name of the tag. Tag keys must be unique for the resource to which they are attached.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "A value that specifies the TagValue, the value assigned to the corresponding tag key. Tag values can be null and don't have to be unique in a tag set. For example, you can have a key-value pair in a tag set of finances : April and also of payroll : April.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "RootVolumeSecurityStyle",
      "type": "string",
      "required": false,
      "description": "The security style of the root volume of the SVM. Specify one of the following values: UNIX if the file system is managed by a UNIX administrator, the majority of users are NFS clients, and an application accessing the data uses a UNIX user as the service account. NTFS if the file system is managed by a Microsoft Windows administrator, the majority of users are SMB clients, and an application accessing the data uses a Microsoft Windows user as the service account. MIXED This is an advanced setting. For more information, see Volume security style in the Amazon FSx for NetApp ONTAP User Guide.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "StorageVirtualMachine",
          "type": "dict",
          "description": "Returned after a successful CreateStorageVirtualMachine operation; describes the SVM just created.",
          "nested_items": [
            {
              "name": "ActiveDirectoryConfiguration",
              "type": "dict",
              "description": "Describes the Microsoft Active Directory configuration to which the SVM is joined, if applicable.",
              "nested_items": [
                {
                  "name": "NetBiosName",
                  "type": "string",
                  "description": "The NetBIOS name of the AD computer object to which the SVM is joined.",
                  "nested_items": []
                },
                {
                  "name": "SelfManagedActiveDirectoryConfiguration",
                  "type": "dict",
                  "description": "The configuration of the self-managed Microsoft Active Directory (AD) directory to which the Windows File Server or ONTAP storage virtual machine (SVM) instance is joined.",
                  "nested_items": [
                    {
                      "name": "DomainName",
                      "type": "string",
                      "description": "The fully qualified domain name of the self-managed AD directory.",
                      "nested_items": []
                    },
                    {
                      "name": "OrganizationalUnitDistinguishedName",
                      "type": "string",
                      "description": "The fully qualified distinguished name of the organizational unit within the self-managed AD directory to which the Windows File Server or ONTAP storage virtual machine (SVM) instance is joined.",
                      "nested_items": []
                    },
                    {
                      "name": "FileSystemAdministratorsGroup",
                      "type": "string",
                      "description": "The name of the domain group whose members have administrative privileges for the FSx file system.",
                      "nested_items": []
                    },
                    {
                      "name": "UserName",
                      "type": "string",
                      "description": "The user name for the service account on your self-managed AD domain that FSx uses to join to your AD domain.",
                      "nested_items": []
                    },
                    {
                      "name": "DnsIps",
                      "type": "list",
                      "description": "A list of up to three IP addresses of DNS servers or domain controllers in the self-managed AD directory.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "CreationTime",
              "type": "datetime",
              "description": "The time that the resource was created, in seconds (since 1970-01-01T00:00:00Z), also known as Unix time.",
              "nested_items": []
            },
            {
              "name": "Endpoints",
              "type": "dict",
              "description": "The endpoints that are used to access data or to manage the SVM using the NetApp ONTAP CLI, REST API, or NetApp CloudManager. They are the Iscsi, Management, Nfs, and Smb endpoints.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "DNSName",
                      "type": "string",
                      "description": "The file system's DNS name. You can mount your file system using its DNS name.",
                      "nested_items": []
                    },
                    {
                      "name": "IpAddresses",
                      "type": "list",
                      "description": "The SVM endpoint's IP addresses.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "Management",
                  "type": "dict",
                  "description": "An endpoint for managing SVMs using the NetApp ONTAP CLI, NetApp ONTAP API, or NetApp CloudManager.",
                  "nested_items": [
                    {
                      "name": "DNSName",
                      "type": "string",
                      "description": "The file system's DNS name. You can mount your file system using its DNS name.",
                      "nested_items": []
                    },
                    {
                      "name": "IpAddresses",
                      "type": "list",
                      "description": "The SVM endpoint's IP addresses.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "DNSName",
                      "type": "string",
                      "description": "The file system's DNS name. You can mount your file system using its DNS name.",
                      "nested_items": []
                    },
                    {
                      "name": "IpAddresses",
                      "type": "list",
                      "description": "The SVM endpoint's IP addresses.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "DNSName",
                      "type": "string",
                      "description": "The file system's DNS name. You can mount your file system using its DNS name.",
                      "nested_items": []
                    },
                    {
                      "name": "IpAddresses",
                      "type": "list",
                      "description": "The SVM endpoint's IP addresses.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "FileSystemId",
              "type": "string",
              "description": "The globally unique ID of the file system, assigned by Amazon FSx.",
              "nested_items": []
            },
            {
              "name": "Lifecycle",
              "type": "string",
              "description": "Describes the SVM's lifecycle status.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "CREATED - The SVM is fully available for use.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "CREATING - Amazon FSx is creating the new SVM.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "DELETING - Amazon FSx is deleting an existing SVM.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "FAILED - Amazon FSx was unable to create the SVM.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "MISCONFIGURED - The SVM is in a failed but recoverable state.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "PENDING - Amazon FSx has not started creating the SVM.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Name",
              "type": "string",
              "description": "The name of the SVM, if provisioned.",
              "nested_items": []
            },
            {
              "name": "ResourceARN",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) for a given resource. ARNs uniquely identify Amazon Web Services resources. We require an ARN when you need to specify a resource unambiguously across all of Amazon Web Services. For more information, see Amazon Resource Names (ARNs) in the Amazon Web Services General Reference.",
              "nested_items": []
            },
            {
              "name": "StorageVirtualMachineId",
              "type": "string",
              "description": "The SVM's system generated unique ID.",
              "nested_items": []
            },
            {
              "name": "Subtype",
              "type": "string",
              "description": "Describes the SVM's subtype.",
              "nested_items": []
            },
            {
              "name": "UUID",
              "type": "string",
              "description": "The SVM's UUID (universally unique identifier).",
              "nested_items": []
            },
            {
              "name": "Tags",
              "type": "list",
              "description": "A list of Tag values, with a maximum of 50 elements.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Key",
                      "type": "string",
                      "description": "A value that specifies the TagKey, the name of the tag. Tag keys must be unique for the resource to which they are attached.",
                      "nested_items": []
                    },
                    {
                      "name": "Value",
                      "type": "string",
                      "description": "A value that specifies the TagValue, the value assigned to the corresponding tag key. Tag values can be null and don't have to be unique in a tag set. For example, you can have a key-value pair in a tag set of finances : April and also of payroll : April.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "LifecycleTransitionReason",
              "type": "dict",
              "description": "Describes why the SVM lifecycle state changed.",
              "nested_items": [
                {
                  "name": "Message",
                  "type": "string",
                  "description": "A detailed error message.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "RootVolumeSecurityStyle",
              "type": "string",
              "description": "The security style of the root volume of the SVM.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}