{
  "method_name": "list_tags_for_resource",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/fsx/client/list_tags_for_resource.html",
  "description": "Lists tags for Amazon FSx resources. When retrieving all tags, you can optionally specify the MaxResults parameter to limit the number of tags in a response. If more tags remain, Amazon FSx returns a NextToken value in the response. In this case, send a later request with the NextToken request parameter set to the value of NextToken from the last response. This action is used in an iterative process to retrieve a list of your tags. ListTagsForResource is called first without a NextToken``value. Then the action continues to be called with the ``NextToken parameter set to the value of the last NextToken value until a response has no NextToken. When using this action, keep the following in mind:",
  "parameters": [
    {
      "name": "ResourceARN",
      "type": "string",
      "required": true,
      "description": "The ARN of the Amazon FSx resource that will have its tags listed.",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Tags",
          "type": "list",
          "description": "A list of tags on the resource.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Key",
                  "type": "string",
                  "description": "A value that specifies the TagKey, the name of the tag. Tag keys must be unique for the resource to which they are attached.",
                  "nested_items": []
                },
                {
                  "name": "Value",
                  "type": "string",
                  "description": "A value that specifies the TagValue, the value assigned to the corresponding tag key. Tag values can be null and don't have to be unique in a tag set. For example, you can have a key-value pair in a tag set of finances : April and also of payroll : April.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "This is present if there are more tags than returned in the response (String). You can use the NextToken value in the later request to fetch the tags.",
          "nested_items": []
        }
      ]
    }
  ]
}