{
  "method_name": "create_assessment_template",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/inspector/client/create_assessment_template.html",
  "description": "Creates an assessment template for the assessment target that is specified by the ARN of the assessment target. If the service-linked role isn't already registered, this action also creates and registers a service-linked role to grant Amazon Inspector access to AWS Services needed to perform security assessments.",
  "parameters": [
    {
      "name": "assessmentTargetArn",
      "type": "string",
      "required": true,
      "description": "The ARN that specifies the assessment target for which you want to create the assessment template.",
      "nested_params": []
    },
    {
      "name": "assessmentTemplateName",
      "type": "string",
      "required": true,
      "description": "The user-defined name that identifies the assessment template that you want to create. You can create several assessment templates for an assessment target. The names of the assessment templates that correspond to a particular assessment target must be unique.",
      "nested_params": []
    },
    {
      "name": "durationInSeconds",
      "type": "integer",
      "required": true,
      "description": "The duration of the assessment run in seconds.",
      "nested_params": []
    },
    {
      "name": "rulesPackageArns",
      "type": "list",
      "required": true,
      "description": "The ARNs that specify the rules packages that you want to attach to the assessment template. (string) ---",
      "nested_params": []
    },
    {
      "name": "userAttributesForFindings",
      "type": "list",
      "required": true,
      "description": "The user-defined attributes that are assigned to every finding that is generated by the assessment run that uses this assessment template. An attribute is a key and value pair (an  Attribute object). Within an assessment template, each key must be unique. (dict) --- This data type is used as a request parameter in the  AddAttributesToFindings and  CreateAssessmentTemplate actions. The attribute key. value (string) --- The value assigned to the attribute key.",
      "nested_params": [
        {
          "name": "key",
          "type": "string",
          "required": false,
          "description": "The attribute key.",
          "nested_params": []
        },
        {
          "name": "value",
          "type": "string",
          "required": false,
          "description": "The value assigned to the attribute key.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "assessmentTemplateArn",
          "type": "string",
          "description": "The ARN that specifies the assessment template that is created.",
          "nested_items": []
        }
      ]
    }
  ]
}