{
  "method_name": "list_webhooks",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/codepipeline/client/list_webhooks.html",
  "description": "Gets a listing of all the webhooks in this Amazon Web Services Region for this account. The output lists all webhooks and includes the webhook URL and ARN and the configuration for each webhook.",
  "parameters": [
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "webhooks",
          "type": "list",
          "description": "The JSON detail returned for each webhook in the list output for the ListWebhooks call.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "definition",
                  "type": "dict",
                  "description": "The detail returned for each webhook, such as the webhook authentication type and filter rules.",
                  "nested_items": [
                    {
                      "name": "name",
                      "type": "string",
                      "description": "The name of the webhook.",
                      "nested_items": []
                    },
                    {
                      "name": "targetPipeline",
                      "type": "string",
                      "description": "The name of the pipeline you want to connect to the webhook.",
                      "nested_items": []
                    },
                    {
                      "name": "targetAction",
                      "type": "string",
                      "description": "The name of the action in a pipeline you want to connect to the webhook. The action must be from the source (first) stage of the pipeline.",
                      "nested_items": []
                    },
                    {
                      "name": "filters",
                      "type": "list",
                      "description": "A list of rules applied to the body/payload sent in the POST request to a webhook URL. All defined rules must pass for the request to be accepted and the pipeline started.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "jsonPath",
                              "type": "string",
                              "description": "A JsonPath expression that is applied to the body/payload of the webhook. The value selected by the JsonPath expression must match the value specified in the MatchEquals field. Otherwise, the request is ignored. For more information, see Java JsonPath implementation in GitHub.",
                              "nested_items": []
                            },
                            {
                              "name": "matchEquals",
                              "type": "string",
                              "description": "The value selected by the JsonPath expression must match what is supplied in the MatchEquals field. Otherwise, the request is ignored. Properties from the target action configuration can be included as placeholders in this value by surrounding the action configuration key with curly brackets. For example, if the value supplied here is 'refs/heads/{Branch}' and the target action has an action configuration property called 'Branch' with a value of 'main', the MatchEquals value is evaluated as 'refs/heads/main'. For a list of action configuration properties for built-in action types, see Pipeline Structure Reference Action Requirements.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "authentication",
                      "type": "string",
                      "description": "Supported options are GITHUB_HMAC, IP, and UNAUTHENTICATED.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "For information about the authentication scheme implemented by GITHUB_HMAC, see Securing your webhooks on the GitHub Developer website.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "IP rejects webhooks trigger requests unless they originate from an IP address in the IP range whitelisted in the authentication configuration.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "UNAUTHENTICATED accepts all webhook trigger requests regardless of origin.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "authenticationConfiguration",
                      "type": "dict",
                      "description": "Properties that configure the authentication applied to incoming webhook trigger requests. The required properties depend on the authentication type. For GITHUB_HMAC, only the ``SecretToken ``property must be set. For IP, only the ``AllowedIPRange ``property must be set to a valid CIDR range. For UNAUTHENTICATED, no properties can be set.",
                      "nested_items": [
                        {
                          "name": "AllowedIPRange",
                          "type": "string",
                          "description": "The property used to configure acceptance of webhooks in an IP address range. For IP, only the AllowedIPRange property must be set. This property must be set to a valid CIDR range.",
                          "nested_items": []
                        },
                        {
                          "name": "SecretToken",
                          "type": "string",
                          "description": "The property used to configure GitHub authentication. For GITHUB_HMAC, only the SecretToken property must be set.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "url",
                  "type": "string",
                  "description": "A unique URL generated by CodePipeline. When a POST request is made to this URL, the defined pipeline is started as long as the body of the post request satisfies the defined authentication and filtering conditions. Deleting and re-creating a webhook makes the old URL invalid and generates a new one.",
                  "nested_items": []
                },
                {
                  "name": "errorMessage",
                  "type": "string",
                  "description": "The text of the error message about the webhook.",
                  "nested_items": []
                },
                {
                  "name": "errorCode",
                  "type": "string",
                  "description": "The number code of the error.",
                  "nested_items": []
                },
                {
                  "name": "lastTriggered",
                  "type": "datetime",
                  "description": "The date and time a webhook was last successfully triggered, in timestamp format.",
                  "nested_items": []
                },
                {
                  "name": "arn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the webhook.",
                  "nested_items": []
                },
                {
                  "name": "tags",
                  "type": "list",
                  "description": "Specifies the tags applied to the webhook.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "key",
                          "type": "string",
                          "description": "The tag's key.",
                          "nested_items": []
                        },
                        {
                          "name": "value",
                          "type": "string",
                          "description": "The tag's value.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "If the amount of returned information is significantly large, an identifier is also returned and can be used in a subsequent ListWebhooks call to return the next set of webhooks in the list.",
          "nested_items": []
        }
      ]
    }
  ]
}