{
  "method_name": "get_control",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/controlcatalog/client/get_control.html",
  "description": "Returns details about a specific control, most notably a list of Amazon Web Services Regions where this control is supported. Input a value for the ControlArn parameter, in ARN form. GetControl accepts controltower or controlcatalog control ARNs as input. Returns a controlcatalog ARN format. In the API response, controls that have the value GLOBAL in the Scope field do not show the DeployableRegions field, because it does not apply. Controls that have the value REGIONAL in the Scope field return a value for the DeployableRegions field, as shown in the example.",
  "parameters": [
    {
      "name": "ControlArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the control. It has one of the following formats: Global format arn:{PARTITION}:controlcatalog:::control/{CONTROL_CATALOG_OPAQUE_ID} Or Regional format arn:{PARTITION}:controltower:{REGION}::control/{CONTROL_TOWER_OPAQUE_ID} Here is a more general pattern that covers Amazon Web Services Control Tower and Control Catalog ARNs: ^arn:(aws(?:[-a-z]*)?):(controlcatalog|controltower):[a-zA-Z0-9-]*::control/[0-9a-zA-Z_\\\\-]+$",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Arn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the control.",
          "nested_items": []
        },
        {
          "name": "Name",
          "type": "string",
          "description": "The display name of the control.",
          "nested_items": []
        },
        {
          "name": "Description",
          "type": "string",
          "description": "A description of what the control does.",
          "nested_items": []
        },
        {
          "name": "Behavior",
          "type": "string",
          "description": "A term that identifies the control's functional behavior. One of Preventive, Detective, Proactive.",
          "nested_items": []
        },
        {
          "name": "Severity",
          "type": "string",
          "description": "An enumerated type, with the following possible values:",
          "nested_items": []
        },
        {
          "name": "RegionConfiguration",
          "type": "dict",
          "description": "Returns information about the control, including the scope of the control, if enabled, and the Regions in which the control currently is available for deployment. For more information about scope, see Global services.",
          "nested_items": [
            {
              "name": "Scope",
              "type": "string",
              "description": "The coverage of the control, if deployed. Scope is an enumerated type, with value Regional, or Global. A control with Global scope is effective in all Amazon Web Services Regions, regardless of the Region from which it is enabled, or to which it is deployed. A control implemented by an SCP is usually Global in scope. A control with Regional scope has operations that are restricted specifically to the Region from which it is enabled and to which it is deployed. Controls implemented by Config rules and CloudFormation hooks usually are Regional in scope. Security Hub controls usually are Regional in scope.",
              "nested_items": []
            },
            {
              "name": "DeployableRegions",
              "type": "list",
              "description": "Regions in which the control is available to be deployed.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "Implementation",
          "type": "dict",
          "description": "Returns information about the control, as an ImplementationDetails object that shows the underlying implementation type for a control.",
          "nested_items": [
            {
              "name": "Type",
              "type": "string",
              "description": "A string that describes a control's implementation type.",
              "nested_items": []
            },
            {
              "name": "Identifier",
              "type": "string",
              "description": "A service-specific identifier for the control, assigned by the service that implemented the control. For example, this identifier could be an Amazon Web Services Config Rule ID or a Security Hub Control ID.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "Parameters",
          "type": "list",
          "description": "Returns an array of ControlParameter objects that specify the parameters a control supports. An empty list is returned for controls that don't support parameters.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "AllowedRegions",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "ExemptedActions",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "ExemptedPrincipalArns",
                  "type": "aws|aws-us-gov",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "ExemptedResourceArns",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "ExemptAssumeRoot",
                  "type": "",
                  "description": "",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "CreateTime",
          "type": "datetime",
          "description": "A timestamp that notes the time when the control was released (start of its life) as a governance capability in Amazon Web Services.",
          "nested_items": []
        }
      ]
    }
  ]
}