{
  "method_name": "get_signaling_channel_endpoint",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kinesisvideo/client/get_signaling_channel_endpoint.html",
  "description": "Provides an endpoint for the specified signaling channel to send and receive messages. This API uses the SingleMasterChannelEndpointConfiguration input parameter, which consists of the Protocols and Role properties. Protocols is used to determine the communication mechanism. For example, if you specify WSS as the protocol, this API produces a secure websocket endpoint. If you specify HTTPS as the protocol, this API generates an HTTPS endpoint. Role determines the messaging permissions. A MASTER role results in this API generating an endpoint that a client can use to communicate with any of the viewers on the channel. A VIEWER role results in this API generating an endpoint that a client can use to communicate only with a MASTER.",
  "parameters": [
    {
      "name": "ChannelARN",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the signalling channel for which you want to get an endpoint.",
      "nested_params": []
    },
    {
      "name": "SingleMasterChannelEndpointConfiguration",
      "type": "dict",
      "required": false,
      "description": "A structure containing the endpoint configuration for the SINGLE_MASTER channel type. Protocols (list) --- This property is used to determine the nature of communication over this SINGLE_MASTER signaling channel. If WSS is specified, this API returns a websocket endpoint. If HTTPS is specified, this API returns an HTTPS endpoint. (string) --- Role (string) --- This property is used to determine messaging permissions in this SINGLE_MASTER signaling channel. If MASTER is specified, this API returns an endpoint that a client can use to receive offers from and send answers to any of the viewers on this signaling channel. If VIEWER is specified, this API returns an endpoint that a client can use only to send offers to another MASTER client on this signaling channel.",
      "nested_params": [
        {
          "name": "Protocols",
          "type": "list",
          "required": false,
          "description": "This property is used to determine the nature of communication over this SINGLE_MASTER signaling channel. If WSS is specified, this API returns a websocket endpoint. If HTTPS is specified, this API returns an HTTPS endpoint.",
          "nested_params": []
        },
        {
          "name": "Role",
          "type": "string",
          "required": false,
          "description": "This property is used to determine messaging permissions in this SINGLE_MASTER signaling channel. If MASTER is specified, this API returns an endpoint that a client can use to receive offers from and send answers to any of the viewers on this signaling channel. If VIEWER is specified, this API returns an endpoint that a client can use only to send offers to another MASTER client on this signaling channel.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ResourceEndpointList",
          "type": "list",
          "description": "A list of endpoints for the specified signaling channel.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Protocol",
                  "type": "string",
                  "description": "The protocol of the signaling channel returned by the GetSignalingChannelEndpoint API.",
                  "nested_items": []
                },
                {
                  "name": "ResourceEndpoint",
                  "type": "string",
                  "description": "The endpoint of the signaling channel returned by the GetSignalingChannelEndpoint API.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}