{
  "method_name": "update_stream",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kinesisvideo/client/update_stream.html",
  "description": "Updates stream metadata, such as the device name and media type. You must provide the stream name or the Amazon Resource Name (ARN) of the stream. To make sure that you have the latest version of the stream before updating it, you can specify the stream version. Kinesis Video Streams assigns a version to each stream. When you update a stream, Kinesis Video Streams assigns a new version number. To get the latest stream version, use the DescribeStream API. UpdateStream is an asynchronous operation, and takes time to complete.",
  "parameters": [
    {
      "name": "StreamName",
      "type": "string",
      "required": false,
      "description": "The name of the stream whose metadata you want to update. The stream name is an identifier for the stream, and must be unique for each account and region.",
      "nested_params": []
    },
    {
      "name": "StreamARN",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "CurrentVersion",
      "type": "string",
      "required": true,
      "description": "The version of the stream whose metadata you want to update.",
      "nested_params": []
    },
    {
      "name": "DeviceName",
      "type": "string",
      "required": false,
      "description": "The name of the device that is writing to the stream.",
      "nested_params": []
    },
    {
      "name": "MediaType",
      "type": "string",
      "required": false,
      "description": "The stream's media type. Use MediaType to specify the type of content that the stream contains to the consumers of the stream. For more information about media types, see Media Types. If you choose to specify the MediaType, see Naming Requirements. To play video on the console, you must specify the correct video type. For example, if the video in the stream is H.264, specify video/h264 as the MediaType.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}