{
  "method_name": "execute_fast_reset",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/neptunedata/client/execute_fast_reset.html",
  "description": "The fast reset REST API lets you reset a Neptune graph quicky and easily, removing all of its data. Neptune fast reset is a two-step process. First you call ExecuteFastReset with action set to initiateDatabaseReset. This returns a UUID token which you then include when calling ExecuteFastReset again with action set to performDatabaseReset. See Empty an Amazon Neptune DB cluster using the fast reset API. When invoking this operation in a Neptune cluster that has IAM authentication enabled, the IAM user or role making the request must have a policy attached that allows the neptune-db:ResetDatabase IAM action in that cluster.",
  "parameters": [
    {
      "name": "action",
      "type": "string",
      "required": true,
      "description": "The fast reset action. One of the following values: initiateDatabaseReset Â  --- This action generates a unique token needed to actually perform the fast reset. performDatabaseReset Â  --- This action uses the token generated by the initiateDatabaseReset action to actually perform the fast reset.",
      "nested_params": []
    },
    {
      "name": "token",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "status",
          "type": "string",
          "description": "The status is only returned for the performDatabaseReset action, and indicates whether or not the fast reset rquest is accepted.",
          "nested_items": []
        },
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "token",
              "type": "string",
              "description": "A UUID generated by the database in the initiateDatabaseReset action, and then consumed by the performDatabaseReset to reset the database.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}