{
  "method_name": "delete_schema_versions",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/glue/client/delete_schema_versions.html",
  "description": "Remove versions from the specified schema. A version number or range may be supplied. If the compatibility mode forbids deleting of a version that is necessary, such as BACKWARDS_FULL, an error is returned. Calling the GetSchemaVersions API after this call will list the status of the deleted versions. When the range of version numbers contain check pointed version, the API will return a 409 conflict and will not proceed with the deletion. You have to remove the checkpoint first using the DeleteSchemaCheckpoint API before using this API. You cannot use the DeleteSchemaVersions API to delete the first schema version in the schema set. The first schema version can only be deleted by the DeleteSchema API. This operation will also delete the attached SchemaVersionMetadata under the schema versions. Hard deletes will be enforced on the database. If the compatibility mode forbids deleting of a version that is necessary, such as BACKWARDS_FULL, an error is returned.",
  "parameters": [
    {
      "name": "SchemaId",
      "type": "dict",
      "required": true,
      "description": "This is a wrapper structure that may contain the schema name and Amazon Resource Name (ARN). SchemaArn (string) --- The Amazon Resource Name (ARN) of the schema. One of SchemaArn or SchemaName has to be provided. SchemaName (string) --- The name of the schema. RegistryName (string) --- The name of the schema registry that contains the schema.",
      "nested_params": [
        {
          "name": "SchemaArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the schema. One of SchemaArn or SchemaName has to be provided.",
          "nested_params": []
        },
        {
          "name": "SchemaName",
          "type": "string",
          "required": false,
          "description": "The name of the schema. One of SchemaArn or SchemaName has to be provided.",
          "nested_params": []
        },
        {
          "name": "RegistryName",
          "type": "string",
          "required": false,
          "description": "The name of the schema registry that contains the schema.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Versions",
      "type": "string",
      "required": true,
      "description": "A version range may be supplied which may be of the format: a single version number, 5 a range, 5-8 : deletes versions 5, 6, 7, 8",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "SchemaVersionErrors",
          "type": "list",
          "description": "A list of SchemaVersionErrorItem objects, each containing an error and schema version.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "VersionNumber",
                  "type": "integer",
                  "description": "The version number of the schema.",
                  "nested_items": []
                },
                {
                  "name": "ErrorDetails",
                  "type": "dict",
                  "description": "The details of the error for the schema version.",
                  "nested_items": [
                    {
                      "name": "ErrorCode",
                      "type": "string",
                      "description": "The error code for an error.",
                      "nested_items": []
                    },
                    {
                      "name": "ErrorMessage",
                      "type": "string",
                      "description": "The error message for an error.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}