{
  "method_name": "get_schema_by_definition",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/glue/client/get_schema_by_definition.html",
  "description": "Retrieves a schema by the SchemaDefinition. The schema definition is sent to the Schema Registry, canonicalized, and hashed. If the hash is matched within the scope of the SchemaName or ARN (or the default registry, if none is supplied), that schema's metadata is returned. Otherwise, a 404 or NotFound error is returned. Schema versions in Deleted statuses will not be included in the results.",
  "parameters": [
    {
      "name": "SchemaId",
      "type": "dict",
      "required": true,
      "description": "This is a wrapper structure to contain schema identity fields. The structure contains: SchemaId$SchemaArn: The Amazon Resource Name (ARN) of the schema. One of SchemaArn or SchemaName has to be provided. SchemaId$SchemaName: The name of the schema. SchemaArn (string) --- The Amazon Resource Name (ARN) of the schema. SchemaName (string) --- The name of the schema. RegistryName (string) --- The name of the schema registry that contains the schema.",
      "nested_params": []
    },
    {
      "name": "SchemaDefinition",
      "type": "string",
      "required": true,
      "description": "The definition of the schema for which schema details are required.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "SchemaVersionId",
          "type": "string",
          "description": "The schema ID of the schema version.",
          "nested_items": []
        },
        {
          "name": "SchemaArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the schema.",
          "nested_items": []
        },
        {
          "name": "DataFormat",
          "type": "string",
          "description": "The data format of the schema definition. Currently AVRO, JSON and PROTOBUF are supported.",
          "nested_items": []
        },
        {
          "name": "Status",
          "type": "string",
          "description": "The status of the schema version.",
          "nested_items": []
        },
        {
          "name": "CreatedTime",
          "type": "string",
          "description": "The date and time the schema was created.",
          "nested_items": []
        }
      ]
    }
  ]
}