{
  "method_name": "update_table_optimizer",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/glue/client/update_table_optimizer.html",
  "description": "Updates the configuration for an existing table optimizer.",
  "parameters": [
    {
      "name": "CatalogId",
      "type": "string",
      "required": true,
      "description": "The Catalog ID of the table.",
      "nested_params": []
    },
    {
      "name": "DatabaseName",
      "type": "string",
      "required": true,
      "description": "The name of the database in the catalog in which the table resides.",
      "nested_params": []
    },
    {
      "name": "TableName",
      "type": "string",
      "required": true,
      "description": "The name of the table.",
      "nested_params": []
    },
    {
      "name": "Type",
      "type": "string",
      "required": true,
      "description": "The type of table optimizer.",
      "nested_params": []
    },
    {
      "name": "TableOptimizerConfiguration",
      "type": "dict",
      "required": true,
      "description": "A TableOptimizerConfiguration object representing the configuration of a table optimizer. roleArn (string) --- A role passed by the caller which gives the service permission to update the resources associated with the optimizer on the caller's behalf. enabled (boolean) --- Whether table optimization is enabled. vpcConfiguration (dict) --- A TableOptimizerVpcConfiguration object representing the VPC configuration for a table optimizer. This configuration is necessary to perform optimization on tables that are in a customer VPC. glueConnectionName (string) --- The name of the Glue connection used for the VPC for the table optimizer. retentionConfiguration (dict) --- The configuration for a snapshot retention optimizer. icebergConfiguration (dict) --- The configuration for an Iceberg snapshot retention optimizer. snapshotRetentionPeriodInDays (integer) --- The number of days to retain the Iceberg snapshots. If an input is not provided, the corresponding Iceberg table configuration field will be used or if not present, the default value 5 will be used. numberOfSnapshotsToRetain (integer) --- The number of Iceberg snapshots to retain within the retention period. If an input is not provided, the corresponding Iceberg table configuration field will be used or if not present, the default value 1 will be used. cleanExpiredFiles (boolean) --- If set to false, snapshots are only deleted from table metadata, and the underlying data and metadata files are not deleted. orphanFileDeletionConfiguration (dict) --- The configuration for an orphan file deletion optimizer. icebergConfiguration (dict) --- The configuration for an Iceberg orphan file deletion optimizer. orphanFileRetentionPeriodInDays (integer) --- The number of days that orphan files should be retained before file deletion. If an input is not provided, the default value 3 will be used. location (string) --- Specifies a directory in which to look for files (defaults to the table's location). You may choose a sub-directory rather than the top-level table location.",
      "nested_params": [
        {
          "name": "roleArn",
          "type": "string",
          "required": false,
          "description": "A role passed by the caller which gives the service permission to update the resources associated with the optimizer on the caller's behalf.",
          "nested_params": []
        },
        {
          "name": "enabled",
          "type": "boolean",
          "required": false,
          "description": "Whether table optimization is enabled.",
          "nested_params": []
        },
        {
          "name": "vpcConfiguration",
          "type": "dict",
          "required": false,
          "description": "A TableOptimizerVpcConfiguration object representing the VPC configuration for a table optimizer. This configuration is necessary to perform optimization on tables that are in a customer VPC.",
          "nested_params": [
            {
              "name": "glueConnectionName",
              "type": "string",
              "required": false,
              "description": "The name of the Glue connection used for the VPC for the table optimizer.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "retentionConfiguration",
          "type": "dict",
          "required": false,
          "description": "The configuration for a snapshot retention optimizer.",
          "nested_params": [
            {
              "name": "icebergConfiguration",
              "type": "dict",
              "required": false,
              "description": "The configuration for an Iceberg snapshot retention optimizer.",
              "nested_params": [
                {
                  "name": "snapshotRetentionPeriodInDays",
                  "type": "integer",
                  "required": false,
                  "description": "The number of days to retain the Iceberg snapshots. If an input is not provided, the corresponding Iceberg table configuration field will be used or if not present, the default value 5 will be used.",
                  "nested_params": []
                },
                {
                  "name": "numberOfSnapshotsToRetain",
                  "type": "integer",
                  "required": false,
                  "description": "The number of Iceberg snapshots to retain within the retention period. If an input is not provided, the corresponding Iceberg table configuration field will be used or if not present, the default value 1 will be used.",
                  "nested_params": []
                },
                {
                  "name": "cleanExpiredFiles",
                  "type": "boolean",
                  "required": false,
                  "description": "If set to false, snapshots are only deleted from table metadata, and the underlying data and metadata files are not deleted.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "orphanFileDeletionConfiguration",
          "type": "dict",
          "required": false,
          "description": "The configuration for an orphan file deletion optimizer.",
          "nested_params": [
            {
              "name": "icebergConfiguration",
              "type": "dict",
              "required": false,
              "description": "The configuration for an Iceberg orphan file deletion optimizer.",
              "nested_params": [
                {
                  "name": "orphanFileRetentionPeriodInDays",
                  "type": "integer",
                  "required": false,
                  "description": "The number of days that orphan files should be retained before file deletion. If an input is not provided, the default value 3 will be used.",
                  "nested_params": []
                },
                {
                  "name": "location",
                  "type": "string",
                  "required": false,
                  "description": "Specifies a directory in which to look for files (defaults to the table's location). You may choose a sub-directory rather than the top-level table location.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}