{
  "method_name": "update_schema",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/glue/client/update_schema.html",
  "description": "Updates the description, compatibility setting, or version checkpoint for a schema set. For updating the compatibility setting, the call will not validate compatibility for the entire set of schema versions with the new compatibility setting. If the value for Compatibility is provided, the VersionNumber (a checkpoint) is also required. The API will validate the checkpoint version number for consistency. If the value for the VersionNumber (checkpoint) is provided, Compatibility is optional and this can be used to set/reset a checkpoint for the schema. This update will happen only if the schema is in the AVAILABLE state.",
  "parameters": [
    {
      "name": "SchemaId",
      "type": "dict",
      "required": true,
      "description": "This is a wrapper structure to contain schema identity fields. The structure contains: SchemaId$SchemaArn: The Amazon Resource Name (ARN) of the schema. One of SchemaArn or SchemaName has to be provided. SchemaId$SchemaName: The name of the schema. SchemaArn (string) --- The Amazon Resource Name (ARN) of the schema. SchemaName (string) --- The name of the schema. RegistryName (string) --- The name of the schema registry that contains the schema.",
      "nested_params": []
    },
    {
      "name": "SchemaVersionNumber",
      "type": "dict",
      "required": false,
      "description": "Version number required for check pointing. One of VersionNumber or Compatibility has to be provided. LatestVersion (boolean) --- The latest version available for the schema. VersionNumber (integer) --- The version number of the schema.",
      "nested_params": [
        {
          "name": "LatestVersion",
          "type": "boolean",
          "required": false,
          "description": "The latest version available for the schema.",
          "nested_params": []
        },
        {
          "name": "VersionNumber",
          "type": "integer",
          "required": false,
          "description": "The version number of the schema.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Compatibility",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "SchemaArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the schema.",
          "nested_items": []
        },
        {
          "name": "SchemaName",
          "type": "string",
          "description": "The name of the schema.",
          "nested_items": []
        },
        {
          "name": "RegistryName",
          "type": "string",
          "description": "The name of the registry that contains the schema.",
          "nested_items": []
        }
      ]
    }
  ]
}