{
  "method_name": "attach_volume",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/storagegateway/client/attach_volume.html",
  "description": "Connects a volume to an iSCSI connection and then attaches the volume to the specified gateway. Detaching and attaching a volume enables you to recover your data from one gateway to a different gateway without creating a snapshot. It also makes it easier to move your volumes from an on-premises gateway to a gateway hosted on an Amazon EC2 instance.",
  "parameters": [
    {
      "name": "GatewayARN",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the gateway that you want to attach the volume to.",
      "nested_params": []
    },
    {
      "name": "TargetName",
      "type": "string",
      "required": false,
      "description": "The name of the iSCSI target used by an initiator to connect to a volume and used as a suffix for the target ARN. For example, specifying TargetName as myvolume results in the target ARN of arn:aws:storagegateway:us-east-2:111122223333:gateway/sgw-12A3456B/target/iqn.1997-05.com.amazon:myvolume. The target name must be unique across all volumes on a gateway. If you don't specify a value, Storage Gateway uses the value that was previously used for this volume as the new target name.",
      "nested_params": []
    },
    {
      "name": "VolumeARN",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the volume to attach to the specified gateway.",
      "nested_params": []
    },
    {
      "name": "NetworkInterfaceId",
      "type": "string",
      "required": true,
      "description": "The network interface of the gateway on which to expose the iSCSI target. Accepts IPv4 and IPv6 addresses. Use  DescribeGatewayInformation to get a list of the network interfaces available on a gateway. Valid Values: A valid IP address.",
      "nested_params": []
    },
    {
      "name": "DiskId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "VolumeARN",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the volume that was attached to the gateway.",
          "nested_items": []
        },
        {
          "name": "TargetARN",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the volume target, which includes the iSCSI name for the initiator that was used to connect to the target.",
          "nested_items": []
        }
      ]
    }
  ]
}