{
  "method_name": "create_nfs_file_share",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/storagegateway/client/create_nfs_file_share.html",
  "description": "Creates a Network File System (NFS) file share on an existing S3 File Gateway. In Storage Gateway, a file share is a file system mount point backed by Amazon S3 cloud storage. Storage Gateway exposes file shares using an NFS interface. This operation is only supported for S3 File Gateways.",
  "parameters": [
    {
      "name": "ClientToken",
      "type": "string",
      "required": true,
      "description": "A unique string value that you supply that is used by S3 File Gateway to ensure idempotent file share creation.",
      "nested_params": []
    },
    {
      "name": "NFSFileShareDefaults",
      "type": "dict",
      "required": false,
      "description": "File share default values. Optional. FileMode (string) --- The Unix file mode in the form 'nnnn'. For example, 0666 represents the default file mode inside the file share. The default value is 0666. DirectoryMode (string) --- The Unix directory mode in the form 'nnnn'. For example, 0666 represents the default access mode for all directories inside the file share. The default value is 0777. GroupId (integer) --- The default group ID for the file share (unless the files have another group ID specified). The default value is nfsnobody. OwnerId (integer) --- The default owner ID for files in the file share (unless the files have another owner ID specified). The default value is nfsnobody.",
      "nested_params": [
        {
          "name": "FileMode",
          "type": "string",
          "required": false,
          "description": "The Unix file mode in the form 'nnnn'. For example, 0666 represents the default file mode inside the file share. The default value is 0666.",
          "nested_params": []
        },
        {
          "name": "DirectoryMode",
          "type": "string",
          "required": false,
          "description": "The Unix directory mode in the form 'nnnn'. For example, 0666 represents the default access mode for all directories inside the file share. The default value is 0777.",
          "nested_params": []
        },
        {
          "name": "GroupId",
          "type": "integer",
          "required": false,
          "description": "The default group ID for the file share (unless the files have another group ID specified). The default value is nfsnobody.",
          "nested_params": []
        },
        {
          "name": "OwnerId",
          "type": "integer",
          "required": false,
          "description": "The default owner ID for files in the file share (unless the files have another owner ID specified). The default value is nfsnobody.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "GatewayARN",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the S3 File Gateway on which you want to create a file share.",
      "nested_params": []
    },
    {
      "name": "EncryptionType",
      "type": "string",
      "required": false,
      "description": "A value that specifies the type of server-side encryption that the file share will use for the data that it stores in Amazon S3.",
      "nested_params": []
    },
    {
      "name": "KMSEncrypted",
      "type": "boolean",
      "required": false,
      "description": "Optional. Set to true to use Amazon S3 server-side encryption with your own KMS key (SSE-KMS), or false to use a key managed by Amazon S3 (SSE-S3). To use dual-layer encryption (DSSE-KMS), set the EncryptionType parameter instead. Valid Values: true | false.",
      "nested_params": []
    },
    {
      "name": "KMSKey",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Role",
      "type": "string",
      "required": true,
      "description": "The ARN of the Identity and Access Management (IAM) role that an S3 File Gateway assumes when it accesses the underlying storage.",
      "nested_params": []
    },
    {
      "name": "LocationARN",
      "type": "string",
      "required": true,
      "description": "A custom ARN for the backend storage used for storing data for file shares. It includes a resource ARN with an optional prefix concatenation. The prefix must end with a forward slash (/).",
      "nested_params": []
    },
    {
      "name": "DefaultStorageClass",
      "type": "string",
      "required": false,
      "description": "The default storage class for objects put into an Amazon S3 bucket by the S3 File Gateway. The default value is S3_STANDARD. Optional. Valid Values: S3_STANDARD | S3_INTELLIGENT_TIERING | S3_STANDARD_IA | S3_ONEZONE_IA.",
      "nested_params": []
    },
    {
      "name": "ObjectACL",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ClientList",
      "type": "list",
      "required": false,
      "description": "The list of clients that are allowed to access the S3 File Gateway. The list must contain either valid IPv4/IPv6 addresses or valid CIDR blocks. (string) ---",
      "nested_params": []
    },
    {
      "name": "Squash",
      "type": "string",
      "required": false,
      "description": "A value that maps a user to anonymous user. Valid values are the following: RootSquash: Only root is mapped to anonymous user. NoSquash: No one is mapped to anonymous user. AllSquash: Everyone is mapped to anonymous user.",
      "nested_params": []
    },
    {
      "name": "ReadOnly",
      "type": "boolean",
      "required": false,
      "description": "A value that sets the write status of a file share. Set this value to true to set the write status to read-only, otherwise set to false. Valid Values: true | false.",
      "nested_params": []
    },
    {
      "name": "GuessMIMETypeEnabled",
      "type": "boolean",
      "required": false,
      "description": "A value that enables guessing of the MIME type for uploaded objects based on file extensions. Set this value to true to enable MIME type guessing, otherwise set to false. The default value is true. Valid Values: true | false.",
      "nested_params": []
    },
    {
      "name": "RequesterPays",
      "type": "boolean",
      "required": false,
      "description": "A value that sets who pays the cost of the request and the cost associated with data download from the S3 bucket. If this value is set to true, the requester pays the costs; otherwise, the S3 bucket owner pays. However, the S3 bucket owner always pays the cost of storing data. Valid Values: true | false.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "A list of up to 50 tags that can be assigned to the NFS file share. Each tag is a key-value pair. (dict) --- A key-value pair that helps you manage, filter, and search for your resource. Allowed characters: letters, white space, and numbers, representable in UTF-8, and the following characters: + - = . _ : /. Tag key. The key can't start with aws:. Value of the tag key.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "Tag key. The key can't start with aws:.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "Value of the tag key.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "FileShareName",
      "type": "string",
      "required": false,
      "description": "The name of the file share. Optional.",
      "nested_params": []
    },
    {
      "name": "CacheAttributes",
      "type": "dict",
      "required": false,
      "description": "Specifies refresh cache information for the file share. CacheStaleTimeoutInSeconds (integer) --- Refreshes a file share's cache by using Time To Live (TTL). TTL is the length of time since the last refresh after which access to the directory would cause the file gateway to first refresh that directory's contents from the Amazon S3 bucket or Amazon FSx file system. The TTL duration is in seconds. Valid Values:0, 300 to 2,592,000 seconds (5 minutes to 30 days)",
      "nested_params": [
        {
          "name": "CacheStaleTimeoutInSeconds",
          "type": "integer",
          "required": false,
          "description": "Refreshes a file share's cache by using Time To Live (TTL). TTL is the length of time since the last refresh after which access to the directory would cause the file gateway to first refresh that directory's contents from the Amazon S3 bucket or Amazon FSx file system. The TTL duration is in seconds. Valid Values:0, 300 to 2,592,000 seconds (5 minutes to 30 days)",
          "nested_params": []
        }
      ]
    },
    {
      "name": "NotificationPolicy",
      "type": "string",
      "required": false,
      "description": "The notification policy of the file share. SettlingTimeInSeconds controls the number of seconds to wait after the last point in time a client wrote to a file before generating an ObjectUploaded notification. Because clients can make many small writes to files, it's best to set this parameter for as long as possible to avoid generating multiple notifications for the same file in a small time period. The following example sets NotificationPolicy on with SettlingTimeInSeconds set to 60. {\\\"Upload\\\": {\\\"SettlingTimeInSeconds\\\": 60}} The following example sets NotificationPolicy off. {}",
      "nested_params": []
    },
    {
      "name": "VPCEndpointDNSName",
      "type": "string",
      "required": false,
      "description": "Specifies the DNS name for the VPC endpoint that the NFS file share uses to connect to Amazon S3.",
      "nested_params": []
    },
    {
      "name": "BucketRegion",
      "type": "string",
      "required": false,
      "description": "Specifies the Region of the S3 bucket where the NFS file share stores files.",
      "nested_params": []
    },
    {
      "name": "AuditDestinationARN",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "FileShareARN",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the newly created file share.",
          "nested_items": []
        }
      ]
    }
  ]
}