{
  "method_name": "create_snapshot",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/storagegateway/client/create_snapshot.html",
  "description": "Initiates a snapshot of a volume. Storage Gateway provides the ability to back up point-in-time snapshots of your data to Amazon Simple Storage (Amazon S3) for durable off-site recovery, and also import the data to an Amazon Elastic Block Store (EBS) volume in Amazon Elastic Compute Cloud (EC2). You can take snapshots of your gateway volume on a scheduled or ad hoc basis. This API enables you to take an ad hoc snapshot. For more information, see Editing a snapshot schedule. In the CreateSnapshot request, you identify the volume by providing its Amazon Resource Name (ARN). You must also provide description for the snapshot. When Storage Gateway takes the snapshot of specified volume, the snapshot and description appears in the Storage Gateway console. In response, Storage Gateway returns you a snapshot ID. You can use this snapshot ID to check the snapshot progress or later use it when you want to create a volume from a snapshot. This operation is only supported in stored and cached volume gateway type.",
  "parameters": [
    {
      "name": "VolumeARN",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the volume. Use the  ListVolumes operation to return a list of gateway volumes.",
      "nested_params": []
    },
    {
      "name": "SnapshotDescription",
      "type": "string",
      "required": true,
      "description": "Textual description of the snapshot that appears in the Amazon EC2 console, Elastic Block Store snapshots panel in the Description field, and in the Storage Gateway snapshot Details pane, Description field.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "A list of up to 50 tags that can be assigned to a snapshot. Each tag is a key-value pair. (dict) --- A key-value pair that helps you manage, filter, and search for your resource. Allowed characters: letters, white space, and numbers, representable in UTF-8, and the following characters: + - = . _ : /. Tag key. The key can't start with aws:. Value of the tag key.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "Tag key. The key can't start with aws:.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "Value of the tag key.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "VolumeARN",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the volume of which the snapshot was taken.",
          "nested_items": []
        },
        {
          "name": "SnapshotId",
          "type": "string",
          "description": "The snapshot ID that is used to refer to the snapshot in future operations such as describing snapshots (Amazon Elastic Compute Cloud API DescribeSnapshots) or creating a volume from a snapshot (  CreateStorediSCSIVolume).",
          "nested_items": []
        }
      ]
    }
  ]
}