{
  "method_name": "describe_stored_iscsi_volumes",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/storagegateway/client/describe_stored_iscsi_volumes.html",
  "description": "Returns the description of the gateway volumes specified in the request. The list of gateway volumes in the request must be from one gateway. In the response, Storage Gateway returns volume information sorted by volume ARNs. This operation is only supported in stored volume gateway type.",
  "parameters": [],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "StorediSCSIVolumes",
          "type": "list",
          "description": "Describes a single unit of output from  DescribeStorediSCSIVolumes. The following fields are returned:",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "ChapEnabled: Indicates whether mutual CHAP is enabled for the iSCSI target.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "LunNumber: The logical disk number.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "NetworkInterfaceId: The network interface ID of the stored volume that initiator use to map the stored volume as an iSCSI target.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "NetworkInterfacePort: The port used to communicate with iSCSI targets.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "PreservedExistingData: Indicates when the stored volume was created, existing data on the underlying local disk was preserved.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "SourceSnapshotId: If the stored volume was created from a snapshot, this field contains the snapshot ID used, e.g. snap-1122aabb. Otherwise, this field is not included.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "StorediSCSIVolumes: An array of StorediSCSIVolume objects where each object contains metadata about one stored volume.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "ARN",
              "description": "TargetARN: The Amazon Resource Name (ARN) of the volume target.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "ARN",
              "description": "VolumeARN: The Amazon Resource Name (ARN) of the stored volume.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "VolumeDiskId: The disk ID of the local disk that was specified in the  CreateStorediSCSIVolume operation.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "VolumeId: The unique identifier of the storage volume, e.g. vol-1122AABB.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "VolumeiSCSIAttributes: An  VolumeiSCSIAttributes object that represents a collection of iSCSI attributes for one stored volume.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "VolumeProgress: Represents the percentage complete if the volume is restoring or bootstrapping that represents the percent of data transferred. This field does not appear in the response if the stored volume is not restoring or bootstrapping.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "VolumeSizeInBytes: The size of the volume in bytes.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "VolumeStatus: One of the VolumeStatus values that indicates the state of the volume.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "VolumeType: One of the enumeration values describing the type of the volume. Currently, only STORED volumes are supported.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}