{
  "method_name": "describe_cached_iscsi_volumes",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/storagegateway/client/describe_cached_iscsi_volumes.html",
  "description": "Returns a description of the gateway volumes specified in the request. This operation is only supported in the cached volume gateway types. The list of gateway volumes in the request must be from one gateway. In the response, Storage Gateway returns volume information sorted by volume Amazon Resource Name (ARN).",
  "parameters": [],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "CachediSCSIVolumes",
          "type": "list",
          "description": "An array of objects where each object contains metadata about one cached volume.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "VolumeARN",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the storage volume.",
                  "nested_items": []
                },
                {
                  "name": "VolumeId",
                  "type": "string",
                  "description": "The unique identifier of the volume, e.g., vol-AE4B946D.",
                  "nested_items": []
                },
                {
                  "name": "VolumeType",
                  "type": "string",
                  "description": "One of the VolumeType enumeration values that describes the type of the volume.",
                  "nested_items": []
                },
                {
                  "name": "VolumeStatus",
                  "type": "string",
                  "description": "One of the VolumeStatus values that indicates the state of the storage volume.",
                  "nested_items": []
                },
                {
                  "name": "VolumeAttachmentStatus",
                  "type": "string",
                  "description": "A value that indicates whether a storage volume is attached to or detached from a gateway. For more information, see Moving your volumes to a different gateway.",
                  "nested_items": []
                },
                {
                  "name": "VolumeSizeInBytes",
                  "type": "integer",
                  "description": "The size, in bytes, of the volume capacity.",
                  "nested_items": []
                },
                {
                  "name": "VolumeProgress",
                  "type": "float",
                  "description": "Represents the percentage complete if the volume is restoring or bootstrapping that represents the percent of data transferred. This field does not appear in the response if the cached volume is not restoring or bootstrapping.",
                  "nested_items": []
                },
                {
                  "name": "SourceSnapshotId",
                  "type": "string",
                  "description": "If the cached volume was created from a snapshot, this field contains the snapshot ID used, e.g., snap-78e22663. Otherwise, this field is not included.",
                  "nested_items": []
                },
                {
                  "name": "VolumeiSCSIAttributes",
                  "type": "dict",
                  "description": "An  VolumeiSCSIAttributes object that represents a collection of iSCSI attributes for one stored volume.",
                  "nested_items": [
                    {
                      "name": "TargetARN",
                      "type": "string",
                      "description": "The Amazon Resource Name (ARN) of the volume target.",
                      "nested_items": []
                    },
                    {
                      "name": "NetworkInterfaceId",
                      "type": "string",
                      "description": "The network interface identifier.",
                      "nested_items": []
                    },
                    {
                      "name": "NetworkInterfacePort",
                      "type": "integer",
                      "description": "The port used to communicate with iSCSI targets.",
                      "nested_items": []
                    },
                    {
                      "name": "LunNumber",
                      "type": "integer",
                      "description": "The logical disk number.",
                      "nested_items": []
                    },
                    {
                      "name": "ChapEnabled",
                      "type": "boolean",
                      "description": "Indicates whether mutual CHAP is enabled for the iSCSI target.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "CreatedDate",
                  "type": "datetime",
                  "description": "The date the volume was created. Volumes created prior to March 28, 2017 don't have this timestamp.",
                  "nested_items": []
                },
                {
                  "name": "VolumeUsedInBytes",
                  "type": "integer",
                  "description": "The size of the data stored on the volume in bytes. This value is calculated based on the number of blocks that are touched, instead of the actual amount of data written. This value can be useful for sequential write patterns but less accurate for random write patterns. VolumeUsedInBytes is different from the compressed size of the volume, which is the value that is used to calculate your bill.",
                  "nested_items": []
                },
                {
                  "name": "KMSKey",
                  "type": "string",
                  "description": "Optional. The Amazon Resource Name (ARN) of a symmetric customer master key (CMK) used for Amazon S3 server-side encryption. Storage Gateway does not support asymmetric CMKs. This value must be set if KMSEncrypted is true, or if EncryptionType is SseKms or DsseKms.",
                  "nested_items": []
                },
                {
                  "name": "TargetName",
                  "type": "string",
                  "description": "The name of the iSCSI target used by an initiator to connect to a volume and used as a suffix for the target ARN. For example, specifying TargetName as myvolume results in the target ARN of arn:aws:storagegateway:us-east-2:111122223333:gateway/sgw-12A3456B/target/iqn.1997-05.com.amazon:myvolume. The target name must be unique across all volumes on a gateway.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}