{
  "method_name": "describe_smb_file_shares",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/storagegateway/client/describe_smb_file_shares.html",
  "description": "Gets a description for one or more Server Message Block (SMB) file shares from a S3 File Gateway. This operation is only supported for S3 File Gateways.",
  "parameters": [
    {
      "name": "FileShareARNList",
      "type": "list",
      "required": true,
      "description": "An array containing the Amazon Resource Name (ARN) of each file share to be described. (string) --- The Amazon Resource Name (ARN) of the file share.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "SMBFileShareInfoList",
          "type": "list",
          "description": "An array containing a description for each requested file share.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "FileShareARN",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the file share.",
                  "nested_items": []
                },
                {
                  "name": "FileShareId",
                  "type": "string",
                  "description": "The ID of the file share.",
                  "nested_items": []
                },
                {
                  "name": "FileShareStatus",
                  "type": "string",
                  "description": "The status of the file share.",
                  "nested_items": []
                },
                {
                  "name": "GatewayARN",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the gateway. Use the  ListGateways operation to return a list of gateways for your account and Amazon Web Services Region.",
                  "nested_items": []
                },
                {
                  "name": "EncryptionType",
                  "type": "string",
                  "description": "A value that specifies the type of server-side encryption that the file share will use for the data that it stores in Amazon S3.",
                  "nested_items": []
                },
                {
                  "name": "KMSEncrypted",
                  "type": "boolean",
                  "description": "Optional. Set to true to use Amazon S3 server-side encryption with your own KMS key (SSE-KMS), or false to use a key managed by Amazon S3 (SSE-S3). To use dual-layer encryption (DSSE-KMS), set the EncryptionType parameter instead.",
                  "nested_items": []
                },
                {
                  "name": "KMSKey",
                  "type": "string",
                  "description": "Optional. The Amazon Resource Name (ARN) of a symmetric customer master key (CMK) used for Amazon S3 server-side encryption. Storage Gateway does not support asymmetric CMKs. This value must be set if KMSEncrypted is true, or if EncryptionType is SseKms or DsseKms.",
                  "nested_items": []
                },
                {
                  "name": "Path",
                  "type": "string",
                  "description": "The file share path used by the SMB client to identify the mount point.",
                  "nested_items": []
                },
                {
                  "name": "Role",
                  "type": "string",
                  "description": "The ARN of the IAM role that an S3 File Gateway assumes when it accesses the underlying storage.",
                  "nested_items": []
                },
                {
                  "name": "LocationARN",
                  "type": "string",
                  "description": "A custom ARN for the backend storage used for storing data for file shares. It includes a resource ARN with an optional prefix concatenation. The prefix must end with a forward slash (/).",
                  "nested_items": []
                },
                {
                  "name": "DefaultStorageClass",
                  "type": "string",
                  "description": "The default storage class for objects put into an Amazon S3 bucket by the S3 File Gateway. The default value is S3_STANDARD. Optional.",
                  "nested_items": []
                },
                {
                  "name": "ObjectACL",
                  "type": "string",
                  "description": "A value that sets the access control list (ACL) permission for objects in the S3 bucket that an S3 File Gateway puts objects into. The default value is private.",
                  "nested_items": []
                },
                {
                  "name": "ReadOnly",
                  "type": "boolean",
                  "description": "A value that sets the write status of a file share. Set this value to true to set the write status to read-only, otherwise set to false.",
                  "nested_items": []
                },
                {
                  "name": "GuessMIMETypeEnabled",
                  "type": "boolean",
                  "description": "A value that enables guessing of the MIME type for uploaded objects based on file extensions. Set this value to true to enable MIME type guessing, otherwise set to false. The default value is true.",
                  "nested_items": []
                },
                {
                  "name": "RequesterPays",
                  "type": "boolean",
                  "description": "A value that sets who pays the cost of the request and the cost associated with data download from the S3 bucket. If this value is set to true, the requester pays the costs; otherwise, the S3 bucket owner pays. However, the S3 bucket owner always pays the cost of storing data.",
                  "nested_items": []
                },
                {
                  "name": "SMBACLEnabled",
                  "type": "boolean",
                  "description": "If this value is set to true, it indicates that access control list (ACL) is enabled on the SMB file share. If it is set to false, it indicates that file and directory permissions are mapped to the POSIX permission.",
                  "nested_items": []
                },
                {
                  "name": "AccessBasedEnumeration",
                  "type": "boolean",
                  "description": "Indicates whether AccessBasedEnumeration is enabled.",
                  "nested_items": []
                },
                {
                  "name": "AdminUserList",
                  "type": "list",
                  "description": "A list of users or groups in the Active Directory that have administrator rights to the file share. A group must be prefixed with the @ character. Acceptable formats include: DOMAIN\\User1, user1, @group1, and @DOMAIN\\group1. Can only be set if Authentication is set to ActiveDirectory.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "ValidUserList",
                  "type": "list",
                  "description": "A list of users or groups in the Active Directory that are allowed to access the file share. A group must be prefixed with the @ character. Acceptable formats include: DOMAIN\\User1, user1, @group1, and @DOMAIN\\group1. Can only be set if Authentication is set to ActiveDirectory.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "InvalidUserList",
                  "type": "list",
                  "description": "A list of users or groups in the Active Directory that are not allowed to access the file share. A group must be prefixed with the @ character. Acceptable formats include: DOMAIN\\User1, user1, @group1, and @DOMAIN\\group1. Can only be set if Authentication is set to ActiveDirectory.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "AuditDestinationARN",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the storage used for audit logs.",
                  "nested_items": []
                },
                {
                  "name": "Authentication",
                  "type": "string",
                  "description": "The authentication method of the file share. The default is ActiveDirectory.",
                  "nested_items": []
                },
                {
                  "name": "CaseSensitivity",
                  "type": "string",
                  "description": "The case of an object name in an Amazon S3 bucket. For ClientSpecified, the client determines the case sensitivity. For CaseSensitive, the gateway determines the case sensitivity. The default value is ClientSpecified.",
                  "nested_items": []
                },
                {
                  "name": "Tags",
                  "type": "list",
                  "description": "A list of up to 50 tags assigned to the SMB file share, sorted alphabetically by key name. Each tag is a key-value pair. For a gateway with more than 10 tags assigned, you can view all tags using the ListTagsForResource API operation.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Key",
                          "type": "string",
                          "description": "Tag key. The key can't start with aws:.",
                          "nested_items": []
                        },
                        {
                          "name": "Value",
                          "type": "string",
                          "description": "Value of the tag key.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "FileShareName",
                  "type": "string",
                  "description": "The name of the file share. Optional.",
                  "nested_items": []
                },
                {
                  "name": "CacheAttributes",
                  "type": "dict",
                  "description": "Refresh cache information for the file share.",
                  "nested_items": [
                    {
                      "name": "CacheStaleTimeoutInSeconds",
                      "type": "integer",
                      "description": "Refreshes a file share's cache by using Time To Live (TTL). TTL is the length of time since the last refresh after which access to the directory would cause the file gateway to first refresh that directory's contents from the Amazon S3 bucket or Amazon FSx file system. The TTL duration is in seconds.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "NotificationPolicy",
                  "type": "string",
                  "description": "The notification policy of the file share. SettlingTimeInSeconds controls the number of seconds to wait after the last point in time a client wrote to a file before generating an ObjectUploaded notification. Because clients can make many small writes to files, it's best to set this parameter for as long as possible to avoid generating multiple notifications for the same file in a small time period.",
                  "nested_items": []
                },
                {
                  "name": "VPCEndpointDNSName",
                  "type": "string",
                  "description": "Specifies the DNS name for the VPC endpoint that the SMB file share uses to connect to Amazon S3.",
                  "nested_items": []
                },
                {
                  "name": "BucketRegion",
                  "type": "string",
                  "description": "Specifies the Region of the S3 bucket where the SMB file share stores files.",
                  "nested_items": []
                },
                {
                  "name": "OplocksEnabled",
                  "type": "boolean",
                  "description": "Specifies whether opportunistic locking is enabled for the SMB file share.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}