{
  "method_name": "describe_smb_settings",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/storagegateway/client/describe_smb_settings.html",
  "description": "Gets a description of a Server Message Block (SMB) file share settings from a file gateway. This operation is only supported for file gateways.",
  "parameters": [
    {
      "name": "GatewayARN",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the gateway. Use the  ListGateways operation to return a list of gateways for your account and Amazon Web Services Region.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "GatewayARN",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the gateway. Use the  ListGateways operation to return a list of gateways for your account and Amazon Web Services Region.",
          "nested_items": []
        },
        {
          "name": "DomainName",
          "type": "string",
          "description": "The name of the domain that the gateway is joined to.",
          "nested_items": []
        },
        {
          "name": "ActiveDirectoryStatus",
          "type": "string",
          "description": "Indicates the status of a gateway that is a member of the Active Directory domain.",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "ACCESS_DENIED: Indicates that the JoinDomain operation failed due to an authentication error.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "DETACHED: Indicates that gateway is not joined to a domain.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "JOINED: Indicates that the gateway has successfully joined a domain.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "JOINING: Indicates that a JoinDomain operation is in progress.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "NETWORK_ERROR: Indicates that JoinDomain operation failed due to a network or connectivity error.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "TIMEOUT: Indicates that the JoinDomain operation failed because the operation didn't complete within the allotted time.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "UNKNOWN_ERROR: Indicates that the JoinDomain operation failed due to another type of error.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "SMBGuestPasswordSet",
          "type": "boolean",
          "description": "This value is true if a password for the guest user smbguest is set, otherwise false. Only supported for S3 File Gateways.",
          "nested_items": []
        },
        {
          "name": "SMBSecurityStrategy",
          "type": "string",
          "description": "The type of security strategy that was specified for file gateway.",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "ClientSpecified: If you choose this option, requests are established based on what is negotiated by the client. This option is recommended when you want to maximize compatibility across different clients in your environment. Supported only for S3 File Gateway.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "MandatorySigning: If you choose this option, File Gateway only allows connections from SMBv2 or SMBv3 clients that have signing turned on. This option works with SMB clients on Microsoft Windows Vista, Windows Server 2008, or later.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "MandatoryEncryption: If you choose this option, File Gateway only allows connections from SMBv3 clients that have encryption turned on. Both 256-bit and 128-bit algorithms are allowed. This option is recommended for environments that handle sensitive data. It works with SMB clients on Microsoft Windows 8, Windows Server 2012, or later.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "MandatoryEncryptionNoAes128: If you choose this option, File Gateway only allows connections from SMBv3 clients that use 256-bit AES encryption algorithms. 128-bit algorithms are not allowed. This option is recommended for environments that handle sensitive data. It works with SMB clients on Microsoft Windows 8, Windows Server 2012, or later.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "FileSharesVisible",
          "type": "boolean",
          "description": "The shares on this gateway appear when listing shares. Only supported for S3 File Gateways.",
          "nested_items": []
        },
        {
          "name": "SMBLocalGroups",
          "type": "dict",
          "description": "A list of Active Directory users and groups that have special permissions for SMB file shares on the gateway.",
          "nested_items": [
            {
              "name": "GatewayAdmins",
              "type": "list",
              "description": "A list of Active Directory users and groups that have local Gateway Admin permissions. Acceptable formats include: DOMAIN\\User1, user1, DOMAIN\\group1, and group1.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}