{
  "method_name": "describe_bandwidth_rate_limit_schedule",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/storagegateway/client/describe_bandwidth_rate_limit_schedule.html",
  "description": "Returns information about the bandwidth rate limit schedule of a gateway. By default, gateways do not have bandwidth rate limit schedules, which means no bandwidth rate limiting is in effect. This operation is supported only for volume, tape and S3 file gateways. FSx file gateways do not support bandwidth rate limits. This operation returns information about a gateway's bandwidth rate limit schedule. A bandwidth rate limit schedule consists of one or more bandwidth rate limit intervals. A bandwidth rate limit interval defines a period of time on one or more days of the week, during which bandwidth rate limits are specified for uploading, downloading, or both. A bandwidth rate limit interval consists of one or more days of the week, a start hour and minute, an ending hour and minute, and bandwidth rate limits for uploading and downloading. If no bandwidth rate limit schedule intervals are set for the gateway, this operation returns an empty response. To specify which gateway to describe, use the Amazon Resource Name (ARN) of the gateway in your request.",
  "parameters": [
    {
      "name": "GatewayARN",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the gateway. Use the  ListGateways operation to return a list of gateways for your account and Amazon Web Services Region.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "GatewayARN",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the gateway. Use the  ListGateways operation to return a list of gateways for your account and Amazon Web Services Region.",
          "nested_items": []
        },
        {
          "name": "BandwidthRateLimitIntervals",
          "type": "list",
          "description": "An array that contains the bandwidth rate limit intervals for a tape or volume gateway.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "StartHourOfDay",
                  "type": "integer",
                  "description": "The hour of the day to start the bandwidth rate limit interval.",
                  "nested_items": []
                },
                {
                  "name": "StartMinuteOfHour",
                  "type": "integer",
                  "description": "The minute of the hour to start the bandwidth rate limit interval. The interval begins at the start of that minute. To begin an interval exactly at the start of the hour, use the value 0.",
                  "nested_items": []
                },
                {
                  "name": "EndHourOfDay",
                  "type": "integer",
                  "description": "The hour of the day to end the bandwidth rate limit interval.",
                  "nested_items": []
                },
                {
                  "name": "EndMinuteOfHour",
                  "type": "integer",
                  "description": "The minute of the hour to end the bandwidth rate limit interval.",
                  "nested_items": []
                },
                {
                  "name": "DaysOfWeek",
                  "type": "list",
                  "description": "The days of the week component of the bandwidth rate limit interval, represented as ordinal numbers from 0 to 6, where 0 represents Sunday and 6 represents Saturday.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "integer",
                      "description": "(integer) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "AverageUploadRateLimitInBitsPerSec",
                  "type": "integer",
                  "description": "The average upload rate limit component of the bandwidth rate limit interval, in bits per second. This field does not appear in the response if the upload rate limit is not set.",
                  "nested_items": []
                },
                {
                  "name": "AverageDownloadRateLimitInBitsPerSec",
                  "type": "integer",
                  "description": "The average download rate limit component of the bandwidth rate limit interval, in bits per second. This field does not appear in the response if the download rate limit is not set.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}