{
  "method_name": "describe_tapes",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/storagegateway/client/describe_tapes.html",
  "description": "Returns a description of virtual tapes that correspond to the specified Amazon Resource Names (ARNs). If TapeARN is not specified, returns a description of the virtual tapes associated with the specified gateway. This operation is only supported for the tape gateway type. The operation supports pagination. By default, the operation returns a maximum of up to 100 tapes. You can optionally specify the Limit field in the body to limit the number of tapes in the response. If the number of tapes returned in the response is truncated, the response includes a Marker field. You can use this Marker value in your subsequent request to retrieve the next set of tapes.",
  "parameters": [
    {
      "name": "GatewayARN",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the gateway. Use the  ListGateways operation to return a list of gateways for your account and Amazon Web Services Region.",
      "nested_params": []
    },
    {
      "name": "TapeARNs",
      "type": "list",
      "required": false,
      "description": "Specifies one or more unique Amazon Resource Names (ARNs) that represent the virtual tapes you want to describe. If this parameter is not specified, Tape gateway returns a description of all virtual tapes associated with the specified gateway. (string) ---",
      "nested_params": []
    },
    {
      "name": "Marker",
      "type": "string",
      "required": false,
      "description": "A marker value, obtained in a previous call to DescribeTapes. This marker indicates which page of results to retrieve. If not specified, the first page of results is retrieved.",
      "nested_params": []
    },
    {
      "name": "Limit",
      "type": "integer",
      "required": false,
      "description": "Specifies that the number of virtual tapes described be limited to the specified number.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Tapes",
          "type": "list",
          "description": "An array of virtual tape descriptions.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "TapeARN",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the virtual tape.",
                  "nested_items": []
                },
                {
                  "name": "TapeBarcode",
                  "type": "string",
                  "description": "The barcode that identifies a specific virtual tape.",
                  "nested_items": []
                },
                {
                  "name": "TapeCreatedDate",
                  "type": "datetime",
                  "description": "The date the virtual tape was created.",
                  "nested_items": []
                },
                {
                  "name": "TapeSizeInBytes",
                  "type": "integer",
                  "description": "The size, in bytes, of the virtual tape capacity.",
                  "nested_items": []
                },
                {
                  "name": "TapeStatus",
                  "type": "string",
                  "description": "The current state of the virtual tape.",
                  "nested_items": []
                },
                {
                  "name": "VTLDevice",
                  "type": "string",
                  "description": "The virtual tape library (VTL) device that the virtual tape is associated with.",
                  "nested_items": []
                },
                {
                  "name": "Progress",
                  "type": "float",
                  "description": "For archiving virtual tapes, indicates how much data remains to be uploaded before archiving is complete.",
                  "nested_items": []
                },
                {
                  "name": "TapeUsedInBytes",
                  "type": "integer",
                  "description": "The size, in bytes, of data stored on the virtual tape.",
                  "nested_items": []
                },
                {
                  "name": "KMSKey",
                  "type": "string",
                  "description": "Optional. The Amazon Resource Name (ARN) of a symmetric customer master key (CMK) used for Amazon S3 server-side encryption. Storage Gateway does not support asymmetric CMKs. This value must be set if KMSEncrypted is true, or if EncryptionType is SseKms or DsseKms.",
                  "nested_items": []
                },
                {
                  "name": "PoolId",
                  "type": "string",
                  "description": "The ID of the pool that contains tapes that will be archived. The tapes in this pool are archived in the S3 storage class that is associated with the pool. When you use your backup application to eject the tape, the tape is archived directly into the storage class (S3 Glacier or S3 Glacier Deep Archive) that corresponds to the pool.",
                  "nested_items": []
                },
                {
                  "name": "Worm",
                  "type": "boolean",
                  "description": "If the tape is archived as write-once-read-many (WORM), this value is true.",
                  "nested_items": []
                },
                {
                  "name": "RetentionStartDate",
                  "type": "datetime",
                  "description": "The date that the tape is first archived with tape retention lock enabled.",
                  "nested_items": []
                },
                {
                  "name": "PoolEntryDate",
                  "type": "datetime",
                  "description": "The date that the tape enters a custom tape pool.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "Marker",
          "type": "string",
          "description": "An opaque string that can be used as part of a subsequent DescribeTapes call to retrieve the next page of results.",
          "nested_items": []
        }
      ]
    }
  ]
}