{
  "method_name": "list_tape_pools",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/storagegateway/client/list_tape_pools.html",
  "description": "Lists custom tape pools. You specify custom tape pools to list by specifying one or more custom tape pool Amazon Resource Names (ARNs). If you don't specify a custom tape pool ARN, the operation lists all custom tape pools. This operation supports pagination. You can optionally specify the Limit parameter in the body to limit the number of tape pools in the response. If the number of tape pools returned in the response is truncated, the response includes a Marker element that you can use in your subsequent request to retrieve the next set of tape pools.",
  "parameters": [
    {
      "name": "PoolARNs",
      "type": "list",
      "required": false,
      "description": "The Amazon Resource Name (ARN) of each of the custom tape pools you want to list. If you don't specify a custom tape pool ARN, the response lists all custom tape pools. (string) ---",
      "nested_params": []
    },
    {
      "name": "Marker",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Limit",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "PoolInfos",
          "type": "list",
          "description": "An array of PoolInfo objects, where each object describes a single custom tape pool. If there are no custom tape pools, the PoolInfos is an empty array.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "PoolARN",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the custom tape pool. Use the  ListTapePools operation to return a list of custom tape pools for your account and Amazon Web Services Region.",
                  "nested_items": []
                },
                {
                  "name": "PoolName",
                  "type": "string",
                  "description": "The name of the custom tape pool. PoolName can use all ASCII characters, except --\u0098/' and --\u0098'.",
                  "nested_items": []
                },
                {
                  "name": "StorageClass",
                  "type": "string",
                  "description": "The storage class that is associated with the custom pool. When you use your backup application to eject the tape, the tape is archived directly into the storage class (S3 Glacier or S3 Glacier Deep Archive) that corresponds to the pool.",
                  "nested_items": []
                },
                {
                  "name": "RetentionLockType",
                  "type": "string",
                  "description": "Tape retention lock type, which can be configured in two modes. When configured in governance mode, Amazon Web Services accounts with specific IAM permissions are authorized to remove the tape retention lock from archived virtual tapes. When configured in compliance mode, the tape retention lock cannot be removed by any user, including the root Amazon Web Services account.",
                  "nested_items": []
                },
                {
                  "name": "RetentionLockTimeInDays",
                  "type": "integer",
                  "description": "Tape retention lock time is set in days. Tape retention lock can be enabled for up to 100 years (36,500 days).",
                  "nested_items": []
                },
                {
                  "name": "PoolStatus",
                  "type": "string",
                  "description": "Status of the custom tape pool. Pool can be ACTIVE or DELETED.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "Marker",
          "type": "string",
          "description": "A string that indicates the position at which to begin the returned list of tape pools. Use the marker in your next request to continue pagination of tape pools. If there are no more tape pools to list, this element does not appear in the response body.",
          "nested_items": []
        }
      ]
    }
  ]
}