{
  "method_name": "list_automatic_tape_creation_policies",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/storagegateway/client/list_automatic_tape_creation_policies.html",
  "description": "Lists the automatic tape creation policies for a gateway. If there are no automatic tape creation policies for the gateway, it returns an empty list. This operation is only supported for tape gateways.",
  "parameters": [
    {
      "name": "GatewayARN",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "AutomaticTapeCreationPolicyInfos",
          "type": "list",
          "description": "Gets a listing of information about the gateway's automatic tape creation policies, including the automatic tape creation rules and the gateway that is using the policies.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "AutomaticTapeCreationRules",
                  "type": "list",
                  "description": "An automatic tape creation policy consists of a list of automatic tape creation rules. This returns the rules that determine when and how to automatically create new tapes.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "TapeBarcodePrefix",
                          "type": "string",
                          "description": "A prefix that you append to the barcode of the virtual tape that you are creating. This prefix makes the barcode unique.",
                          "nested_items": []
                        },
                        {
                          "name": "PoolId",
                          "type": "string",
                          "description": "The ID of the pool that you want to add your tape to for archiving. The tape in this pool is archived in the Amazon S3 storage class that is associated with the pool. When you use your backup application to eject the tape, the tape is archived directly into the storage class (S3 Glacier or S3 Glacier Deep Archive) that corresponds to the pool.",
                          "nested_items": []
                        },
                        {
                          "name": "TapeSizeInBytes",
                          "type": "integer",
                          "description": "The size, in bytes, of the virtual tape capacity.",
                          "nested_items": []
                        },
                        {
                          "name": "MinimumNumTapes",
                          "type": "integer",
                          "description": "The minimum number of available virtual tapes that the gateway maintains at all times. If the number of tapes on the gateway goes below this value, the gateway creates as many new tapes as are needed to have MinimumNumTapes on the gateway. For more information about automatic tape creation, see Creating Tapes Automatically.",
                          "nested_items": []
                        },
                        {
                          "name": "Worm",
                          "type": "boolean",
                          "description": "Set to true to indicate that tapes are to be archived as write-once-read-many (WORM). Set to false when WORM is not enabled for tapes.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "GatewayARN",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the gateway. Use the  ListGateways operation to return a list of gateways for your account and Amazon Web Services Region.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}