{
  "method_name": "update_automatic_tape_creation_policy",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/storagegateway/client/update_automatic_tape_creation_policy.html",
  "description": "Updates the automatic tape creation policy of a gateway. Use this to update the policy with a new set of automatic tape creation rules. This is only supported for tape gateways. By default, there is no automatic tape creation policy.",
  "parameters": [
    {
      "name": "AutomaticTapeCreationRules",
      "type": "list",
      "required": true,
      "description": "An automatic tape creation policy consists of a list of automatic tape creation rules. The rules determine when and how to automatically create new tapes. (dict) --- An automatic tape creation policy consists of automatic tape creation rules where each rule defines when and how to create new tapes. For more information about automatic tape creation, see Creating Tapes Automatically. A prefix that you append to the barcode of the virtual tape that you are creating. This prefix makes the barcode unique. The ID of the pool that you want to add your tape to for archiving. The tape in this pool is archived in the Amazon S3 storage class that is associated with the pool. When you use your backup application to eject the tape, the tape is archived directly into the storage class (S3 Glacier or S3 Glacier Deep Archive) that corresponds to the pool. The size, in bytes, of the virtual tape capacity. The minimum number of available virtual tapes that the gateway maintains at all times. If the number of tapes on the gateway goes below this value, the gateway creates as many new tapes as are needed to have MinimumNumTapes on the gateway. Worm (boolean) --- Set to true to indicate that tapes are to be archived as write-once-read-many (WORM). Set to false when WORM is not enabled for tapes.",
      "nested_params": [
        {
          "name": "TapeBarcodePrefix",
          "type": "string",
          "required": false,
          "description": "A prefix that you append to the barcode of the virtual tape that you are creating. This prefix makes the barcode unique.",
          "nested_params": []
        },
        {
          "name": "PoolId",
          "type": "string",
          "required": false,
          "description": "The ID of the pool that you want to add your tape to for archiving. The tape in this pool is archived in the Amazon S3 storage class that is associated with the pool. When you use your backup application to eject the tape, the tape is archived directly into the storage class (S3 Glacier or S3 Glacier Deep Archive) that corresponds to the pool.",
          "nested_params": []
        },
        {
          "name": "TapeSizeInBytes",
          "type": "integer",
          "required": false,
          "description": "The size, in bytes, of the virtual tape capacity.",
          "nested_params": []
        },
        {
          "name": "MinimumNumTapes",
          "type": "integer",
          "required": false,
          "description": "The minimum number of available virtual tapes that the gateway maintains at all times. If the number of tapes on the gateway goes below this value, the gateway creates as many new tapes as are needed to have MinimumNumTapes on the gateway. For more information about automatic tape creation, see Creating Tapes Automatically.",
          "nested_params": []
        },
        {
          "name": "Worm",
          "type": "boolean",
          "required": false,
          "description": "Set to true to indicate that tapes are to be archived as write-once-read-many (WORM). Set to false when WORM is not enabled for tapes.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "GatewayARN",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the gateway. Use the  ListGateways operation to return a list of gateways for your account and Amazon Web Services Region.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "GatewayARN",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the gateway. Use the  ListGateways operation to return a list of gateways for your account and Amazon Web Services Region.",
          "nested_items": []
        }
      ]
    }
  ]
}