{
  "method_name": "update_snapshot_schedule",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/storagegateway/client/update_snapshot_schedule.html",
  "description": "Updates a snapshot schedule configured for a gateway volume. This operation is only supported in the cached volume and stored volume gateway types. The default snapshot schedule for volume is once every 24 hours, starting at the creation time of the volume. You can use this API to change the snapshot schedule configured for the volume. In the request you must identify the gateway volume whose snapshot schedule you want to update, and the schedule information, including when you want the snapshot to begin on a day and the frequency (in hours) of snapshots.",
  "parameters": [
    {
      "name": "VolumeARN",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the volume. Use the  ListVolumes operation to return a list of gateway volumes.",
      "nested_params": []
    },
    {
      "name": "StartAt",
      "type": "integer",
      "required": true,
      "description": "The hour of the day at which the snapshot schedule begins represented as hh, where hh is the hour (0 to 23). The hour of the day is in the time zone of the gateway.",
      "nested_params": []
    },
    {
      "name": "RecurrenceInHours",
      "type": "integer",
      "required": true,
      "description": "Frequency of snapshots. Specify the number of hours between snapshots.",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "A list of up to 50 tags that can be assigned to a snapshot. Each tag is a key-value pair. (dict) --- A key-value pair that helps you manage, filter, and search for your resource. Allowed characters: letters, white space, and numbers, representable in UTF-8, and the following characters: + - = . _ : /. Tag key. The key can't start with aws:. Value of the tag key.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "Tag key. The key can't start with aws:.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "Value of the tag key.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "VolumeARN",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the volume. Use the  ListVolumes operation to return a list of gateway volumes.",
          "nested_items": []
        }
      ]
    }
  ]
}