{
  "method_name": "create_model",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/lookoutequipment/client/create_model.html",
  "description": "Creates a machine learning model for data inference. A machine-learning (ML) model is a mathematical model that finds patterns in your data. In Amazon Lookout for Equipment, the model learns the patterns of normal behavior and detects abnormal behavior that could be potential equipment failure (or maintenance events). The models are made by analyzing normal data and abnormalities in machine behavior that have already occurred. Your model is trained using a portion of the data from your dataset and uses that data to learn patterns of normal behavior and abnormal patterns that lead to equipment failure. Another portion of the data is used to evaluate the model's accuracy.",
  "parameters": [
    {
      "name": "ModelName",
      "type": "string",
      "required": true,
      "description": "The name for the machine learning model to be created.",
      "nested_params": []
    },
    {
      "name": "DatasetName",
      "type": "string",
      "required": true,
      "description": "The name of the dataset for the machine learning model being created.",
      "nested_params": []
    },
    {
      "name": "DatasetSchema",
      "type": "dict",
      "required": false,
      "description": "The data schema for the machine learning model being created. InlineDataSchema (string) --- The data schema used within the given dataset.",
      "nested_params": [
        {
          "name": "InlineDataSchema",
          "type": "string",
          "required": false,
          "description": "The data schema used within the given dataset.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "LabelsInputConfiguration",
      "type": "dict",
      "required": true,
      "description": "The input configuration for the labels being used for the machine learning model that's being created. S3InputConfiguration (dict) --- Contains location information for the S3 location being used for label data. The name of the S3 bucket holding the label data. Prefix (string) --- The prefix for the S3 bucket used for the label data. LabelGroupName (string) --- The name of the label group to be used for label data.",
      "nested_params": [
        {
          "name": "S3InputConfiguration",
          "type": "dict",
          "required": false,
          "description": "Contains location information for the S3 location being used for label data.",
          "nested_params": [
            {
              "name": "Bucket",
              "type": "string",
              "required": false,
              "description": "The name of the S3 bucket holding the label data.",
              "nested_params": []
            },
            {
              "name": "Prefix",
              "type": "string",
              "required": false,
              "description": "The prefix for the S3 bucket used for the label data.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "LabelGroupName",
          "type": "string",
          "required": false,
          "description": "The name of the label group to be used for label data.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": true,
      "description": "A unique identifier for the request. If you do not set the client request token, Amazon Lookout for Equipment generates one. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "TrainingDataStartTime",
      "type": "datetime",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "TrainingDataEndTime",
      "type": "datetime",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "EvaluationDataStartTime",
      "type": "datetime",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "EvaluationDataEndTime",
      "type": "datetime",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "RoleArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DataPreProcessingConfiguration",
      "type": "dict",
      "required": false,
      "description": "The configuration is the TargetSamplingRate, which is the sampling rate of the data after post processing by Amazon Lookout for Equipment. For example, if you provide data that has been collected at a 1 second level and you want the system to resample the data at a 1 minute rate before training, the TargetSamplingRate is 1 minute. When providing a value for the TargetSamplingRate, you must attach the prefix 'PT' to the rate you want. The value for a 1 second rate is therefore PT1S, the value for a 15 minute rate is PT15M, and the value for a 1 hour rate is PT1H TargetSamplingRate (string) --- The sampling rate of the data after post processing by Amazon Lookout for Equipment. The value for a 1 second rate is therefore PT1S, the value for a 15 minute rate is PT15M, and the value for a 1 hour rate is PT1H.",
      "nested_params": [
        {
          "name": "TargetSamplingRate",
          "type": "string",
          "required": false,
          "description": "The sampling rate of the data after post processing by Amazon Lookout for Equipment. For example, if you provide data that has been collected at a 1 second level and you want the system to resample the data at a 1 minute rate before training, the TargetSamplingRate is 1 minute. When providing a value for the TargetSamplingRate, you must attach the prefix 'PT' to the rate you want. The value for a 1 second rate is therefore PT1S, the value for a 15 minute rate is PT15M, and the value for a 1 hour rate is PT1H.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ServerSideKmsKeyId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "Any tags associated with the machine learning model being created. (dict) --- A tag is a key-value pair that can be added to a resource as metadata. The key for the specified tag. The value for the specified tag.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key for the specified tag.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value for the specified tag.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "OffCondition",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ModelDiagnosticsOutputConfiguration",
      "type": "dict",
      "required": true,
      "description": "The Amazon S3 location where you want Amazon Lookout for Equipment to save the pointwise model diagnostics. You must also specify the RoleArn request parameter. The Amazon S3 location for the pointwise model diagnostics. The name of the Amazon S3 bucket where the pointwise model diagnostics are located. You must be the owner of the Amazon S3 bucket. Prefix (string) --- The Amazon S3 prefix for the location of the pointwise model diagnostics. The prefix specifies the folder and evaluation result file name. ( bucket). When you call CreateModel or UpdateModel, specify the path within the bucket that you want Lookout for Equipment to save the model to. During training, Lookout for Equipment creates the model evaluation model as a compressed JSON file with the name model_diagnostics_results.json.gz. When you call DescribeModel or DescribeModelVersion, prefix contains the file path and filename of the model evaluation file. KmsKeyId (string) --- The Amazon Web Services Key Management Service (KMS) key identifier to encrypt the pointwise model diagnostics files.",
      "nested_params": [
        {
          "name": "S3OutputConfiguration",
          "type": "dict",
          "required": false,
          "description": "The Amazon S3 location for the pointwise model diagnostics.",
          "nested_params": [
            {
              "name": "Bucket",
              "type": "string",
              "required": false,
              "description": "The name of the Amazon S3 bucket where the pointwise model diagnostics are located. You must be the owner of the Amazon S3 bucket.",
              "nested_params": []
            },
            {
              "name": "Prefix",
              "type": "string",
              "required": false,
              "description": "The Amazon S3 prefix for the location of the pointwise model diagnostics. The prefix specifies the folder and evaluation result file name. ( bucket). When you call CreateModel or UpdateModel, specify the path within the bucket that you want Lookout for Equipment to save the model to. During training, Lookout for Equipment creates the model evaluation model as a compressed JSON file with the name model_diagnostics_results.json.gz. When you call DescribeModel or DescribeModelVersion, prefix contains the file path and filename of the model evaluation file.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "KmsKeyId",
          "type": "string",
          "required": false,
          "description": "The Amazon Web Services Key Management Service (KMS) key identifier to encrypt the pointwise model diagnostics files.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ModelArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the model being created.",
          "nested_items": []
        },
        {
          "name": "Status",
          "type": "string",
          "description": "Indicates the status of the CreateModel operation.",
          "nested_items": []
        }
      ]
    }
  ]
}