{
  "method_name": "describe_model",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/lookoutequipment/client/describe_model.html",
  "description": "Provides a JSON containing the overall information about a specific machine learning model, including model name and ARN, dataset, training and evaluation information, status, and so on.",
  "parameters": [
    {
      "name": "ModelName",
      "type": "string",
      "required": true,
      "description": "The name of the machine learning model to be described.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ModelName",
          "type": "string",
          "description": "The name of the machine learning model being described.",
          "nested_items": []
        },
        {
          "name": "ModelArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the machine learning model being described.",
          "nested_items": []
        },
        {
          "name": "DatasetName",
          "type": "string",
          "description": "The name of the dataset being used by the machine learning being described.",
          "nested_items": []
        },
        {
          "name": "DatasetArn",
          "type": "string",
          "description": "The Amazon Resouce Name (ARN) of the dataset used to create the machine learning model being described.",
          "nested_items": []
        },
        {
          "name": "Schema",
          "type": "string",
          "description": "A JSON description of the data that is in each time series dataset, including names, column names, and data types.",
          "nested_items": []
        },
        {
          "name": "LabelsInputConfiguration",
          "type": "dict",
          "description": "Specifies configuration information about the labels input, including its S3 location.",
          "nested_items": [
            {
              "name": "S3InputConfiguration",
              "type": "dict",
              "description": "Contains location information for the S3 location being used for label data.",
              "nested_items": [
                {
                  "name": "Bucket",
                  "type": "string",
                  "description": "The name of the S3 bucket holding the label data.",
                  "nested_items": []
                },
                {
                  "name": "Prefix",
                  "type": "string",
                  "description": "The prefix for the S3 bucket used for the label data.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "LabelGroupName",
              "type": "string",
              "description": "The name of the label group to be used for label data.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "TrainingDataStartTime",
          "type": "datetime",
          "description": "Indicates the time reference in the dataset that was used to begin the subset of training data for the machine learning model.",
          "nested_items": []
        },
        {
          "name": "TrainingDataEndTime",
          "type": "datetime",
          "description": "Indicates the time reference in the dataset that was used to end the subset of training data for the machine learning model.",
          "nested_items": []
        },
        {
          "name": "EvaluationDataStartTime",
          "type": "datetime",
          "description": "Indicates the time reference in the dataset that was used to begin the subset of evaluation data for the machine learning model.",
          "nested_items": []
        },
        {
          "name": "EvaluationDataEndTime",
          "type": "datetime",
          "description": "Indicates the time reference in the dataset that was used to end the subset of evaluation data for the machine learning model.",
          "nested_items": []
        },
        {
          "name": "RoleArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of a role with permission to access the data source for the machine learning model being described.",
          "nested_items": []
        },
        {
          "name": "DataPreProcessingConfiguration",
          "type": "dict",
          "description": "The configuration is the TargetSamplingRate, which is the sampling rate of the data after post processing by Amazon Lookout for Equipment. For example, if you provide data that has been collected at a 1 second level and you want the system to resample the data at a 1 minute rate before training, the TargetSamplingRate is 1 minute.",
          "nested_items": [
            {
              "name": "TargetSamplingRate",
              "type": "string",
              "description": "The sampling rate of the data after post processing by Amazon Lookout for Equipment. For example, if you provide data that has been collected at a 1 second level and you want the system to resample the data at a 1 minute rate before training, the TargetSamplingRate is 1 minute.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "Status",
          "type": "string",
          "description": "Specifies the current status of the model being described. Status describes the status of the most recent action of the model.",
          "nested_items": []
        },
        {
          "name": "TrainingExecutionStartTime",
          "type": "datetime",
          "description": "Indicates the time at which the training of the machine learning model began.",
          "nested_items": []
        },
        {
          "name": "TrainingExecutionEndTime",
          "type": "datetime",
          "description": "Indicates the time at which the training of the machine learning model was completed.",
          "nested_items": []
        },
        {
          "name": "FailedReason",
          "type": "string",
          "description": "If the training of the machine learning model failed, this indicates the reason for that failure.",
          "nested_items": []
        },
        {
          "name": "ModelMetrics",
          "type": "string",
          "description": "The Model Metrics show an aggregated summary of the model's performance within the evaluation time range. This is the JSON content of the metrics created when evaluating the model.",
          "nested_items": []
        },
        {
          "name": "LastUpdatedTime",
          "type": "datetime",
          "description": "Indicates the last time the machine learning model was updated. The type of update is not specified.",
          "nested_items": []
        },
        {
          "name": "CreatedAt",
          "type": "datetime",
          "description": "Indicates the time and date at which the machine learning model was created.",
          "nested_items": []
        },
        {
          "name": "ServerSideKmsKeyId",
          "type": "string",
          "description": "Provides the identifier of the KMS key used to encrypt model data by Amazon Lookout for Equipment.",
          "nested_items": []
        },
        {
          "name": "OffCondition",
          "type": "string",
          "description": "Indicates that the asset associated with this sensor has been shut off. As long as this condition is met, Lookout for Equipment will not use data from this asset for training, evaluation, or inference.",
          "nested_items": []
        },
        {
          "name": "SourceModelVersionArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the source model version. This field appears if the active model version was imported.",
          "nested_items": []
        },
        {
          "name": "ImportJobStartTime",
          "type": "datetime",
          "description": "The date and time when the import job was started. This field appears if the active model version was imported.",
          "nested_items": []
        },
        {
          "name": "ImportJobEndTime",
          "type": "datetime",
          "description": "The date and time when the import job was completed. This field appears if the active model version was imported.",
          "nested_items": []
        },
        {
          "name": "ActiveModelVersion",
          "type": "integer",
          "description": "The name of the model version used by the inference schedular when running a scheduled inference execution.",
          "nested_items": []
        },
        {
          "name": "ActiveModelVersionArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the model version used by the inference scheduler when running a scheduled inference execution.",
          "nested_items": []
        },
        {
          "name": "ModelVersionActivatedAt",
          "type": "datetime",
          "description": "The date the active model version was activated.",
          "nested_items": []
        },
        {
          "name": "PreviousActiveModelVersion",
          "type": "integer",
          "description": "The model version that was set as the active model version prior to the current active model version.",
          "nested_items": []
        },
        {
          "name": "PreviousActiveModelVersionArn",
          "type": "string",
          "description": "The ARN of the model version that was set as the active model version prior to the current active model version.",
          "nested_items": []
        },
        {
          "name": "PreviousModelVersionActivatedAt",
          "type": "datetime",
          "description": "The date and time when the previous active model version was activated.",
          "nested_items": []
        },
        {
          "name": "PriorModelMetrics",
          "type": "string",
          "description": "If the model version was retrained, this field shows a summary of the performance of the prior model on the new training range. You can use the information in this JSON-formatted object to compare the new model version and the prior model version.",
          "nested_items": []
        },
        {
          "name": "LatestScheduledRetrainingFailedReason",
          "type": "string",
          "description": "If the model version was generated by retraining and the training failed, this indicates the reason for that failure.",
          "nested_items": []
        },
        {
          "name": "LatestScheduledRetrainingStatus",
          "type": "string",
          "description": "Indicates the status of the most recent scheduled retraining run.",
          "nested_items": []
        },
        {
          "name": "LatestScheduledRetrainingModelVersion",
          "type": "integer",
          "description": "Indicates the most recent model version that was generated by retraining.",
          "nested_items": []
        },
        {
          "name": "LatestScheduledRetrainingStartTime",
          "type": "datetime",
          "description": "Indicates the start time of the most recent scheduled retraining run.",
          "nested_items": []
        },
        {
          "name": "LatestScheduledRetrainingAvailableDataInDays",
          "type": "integer",
          "description": "Indicates the number of days of data used in the most recent scheduled retraining run.",
          "nested_items": []
        },
        {
          "name": "NextScheduledRetrainingStartDate",
          "type": "datetime",
          "description": "Indicates the date and time that the next scheduled retraining run will start on. Lookout for Equipment truncates the time you provide to the nearest UTC day.",
          "nested_items": []
        },
        {
          "name": "AccumulatedInferenceDataStartTime",
          "type": "datetime",
          "description": "Indicates the start time of the inference data that has been accumulated.",
          "nested_items": []
        },
        {
          "name": "AccumulatedInferenceDataEndTime",
          "type": "datetime",
          "description": "Indicates the end time of the inference data that has been accumulated.",
          "nested_items": []
        },
        {
          "name": "RetrainingSchedulerStatus",
          "type": "string",
          "description": "Indicates the status of the retraining scheduler.",
          "nested_items": []
        },
        {
          "name": "ModelDiagnosticsOutputConfiguration",
          "type": "dict",
          "description": "Configuration information for the model's pointwise model diagnostics.",
          "nested_items": [
            {
              "name": "S3OutputConfiguration",
              "type": "dict",
              "description": "The Amazon S3 location for the pointwise model diagnostics.",
              "nested_items": [
                {
                  "name": "Bucket",
                  "type": "string",
                  "description": "The name of the Amazon S3 bucket where the pointwise model diagnostics are located. You must be the owner of the Amazon S3 bucket.",
                  "nested_items": []
                },
                {
                  "name": "Prefix",
                  "type": "string",
                  "description": "The Amazon S3 prefix for the location of the pointwise model diagnostics. The prefix specifies the folder and evaluation result file name. ( bucket).",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "KmsKeyId",
              "type": "string",
              "description": "The Amazon Web Services Key Management Service (KMS) key identifier to encrypt the pointwise model diagnostics files.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "ModelQuality",
          "type": "string",
          "description": "Provides a quality assessment for a model that uses labels. If Lookout for Equipment determines that the model quality is poor based on training metrics, the value is POOR_QUALITY_DETECTED. Otherwise, the value is QUALITY_THRESHOLD_MET.",
          "nested_items": []
        }
      ]
    }
  ]
}