{
  "method_name": "describe_model_version",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/lookoutequipment/client/describe_model_version.html",
  "description": "Retrieves information about a specific machine learning model version.",
  "parameters": [
    {
      "name": "ModelName",
      "type": "string",
      "required": true,
      "description": "The name of the machine learning model that this version belongs to.",
      "nested_params": []
    },
    {
      "name": "ModelVersion",
      "type": "integer",
      "required": true,
      "description": "The version of the machine learning model.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ModelName",
          "type": "string",
          "description": "The name of the machine learning model that this version belongs to.",
          "nested_items": []
        },
        {
          "name": "ModelArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the parent machine learning model that this version belong to.",
          "nested_items": []
        },
        {
          "name": "ModelVersion",
          "type": "integer",
          "description": "The version of the machine learning model.",
          "nested_items": []
        },
        {
          "name": "ModelVersionArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the model version.",
          "nested_items": []
        },
        {
          "name": "Status",
          "type": "string",
          "description": "The current status of the model version.",
          "nested_items": []
        },
        {
          "name": "SourceType",
          "type": "string",
          "description": "Indicates whether this model version was created by training or by importing.",
          "nested_items": []
        },
        {
          "name": "DatasetName",
          "type": "string",
          "description": "The name of the dataset used to train the model version.",
          "nested_items": []
        },
        {
          "name": "DatasetArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the dataset used to train the model version.",
          "nested_items": []
        },
        {
          "name": "Schema",
          "type": "string",
          "description": "The schema of the data used to train the model version.",
          "nested_items": []
        },
        {
          "name": "LabelsInputConfiguration",
          "type": "dict",
          "description": "Contains the configuration information for the S3 location being used to hold label data.",
          "nested_items": [
            {
              "name": "S3InputConfiguration",
              "type": "dict",
              "description": "Contains location information for the S3 location being used for label data.",
              "nested_items": [
                {
                  "name": "Bucket",
                  "type": "string",
                  "description": "The name of the S3 bucket holding the label data.",
                  "nested_items": []
                },
                {
                  "name": "Prefix",
                  "type": "string",
                  "description": "The prefix for the S3 bucket used for the label data.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "LabelGroupName",
              "type": "string",
              "description": "The name of the label group to be used for label data.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "TrainingDataStartTime",
          "type": "datetime",
          "description": "The date on which the training data began being gathered. If you imported the version, this is the date that the training data in the source version began being gathered.",
          "nested_items": []
        },
        {
          "name": "TrainingDataEndTime",
          "type": "datetime",
          "description": "The date on which the training data finished being gathered. If you imported the version, this is the date that the training data in the source version finished being gathered.",
          "nested_items": []
        },
        {
          "name": "EvaluationDataStartTime",
          "type": "datetime",
          "description": "The date on which the data in the evaluation set began being gathered. If you imported the version, this is the date that the evaluation set data in the source version began being gathered.",
          "nested_items": []
        },
        {
          "name": "EvaluationDataEndTime",
          "type": "datetime",
          "description": "The date on which the data in the evaluation set began being gathered. If you imported the version, this is the date that the evaluation set data in the source version finished being gathered.",
          "nested_items": []
        },
        {
          "name": "RoleArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the role that was used to train the model version.",
          "nested_items": []
        },
        {
          "name": "DataPreProcessingConfiguration",
          "type": "dict",
          "description": "The configuration is the TargetSamplingRate, which is the sampling rate of the data after post processing by Amazon Lookout for Equipment. For example, if you provide data that has been collected at a 1 second level and you want the system to resample the data at a 1 minute rate before training, the TargetSamplingRate is 1 minute.",
          "nested_items": [
            {
              "name": "TargetSamplingRate",
              "type": "string",
              "description": "The sampling rate of the data after post processing by Amazon Lookout for Equipment. For example, if you provide data that has been collected at a 1 second level and you want the system to resample the data at a 1 minute rate before training, the TargetSamplingRate is 1 minute.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "TrainingExecutionStartTime",
          "type": "datetime",
          "description": "The time when the training of the version began.",
          "nested_items": []
        },
        {
          "name": "TrainingExecutionEndTime",
          "type": "datetime",
          "description": "The time when the training of the version completed.",
          "nested_items": []
        },
        {
          "name": "FailedReason",
          "type": "string",
          "description": "The failure message if the training of the model version failed.",
          "nested_items": []
        },
        {
          "name": "ModelMetrics",
          "type": "string",
          "description": "Shows an aggregated summary, in JSON format, of the model's performance within the evaluation time range. These metrics are created when evaluating the model.",
          "nested_items": []
        },
        {
          "name": "LastUpdatedTime",
          "type": "datetime",
          "description": "Indicates the last time the machine learning model version was updated.",
          "nested_items": []
        },
        {
          "name": "CreatedAt",
          "type": "datetime",
          "description": "Indicates the time and date at which the machine learning model version was created.",
          "nested_items": []
        },
        {
          "name": "ServerSideKmsKeyId",
          "type": "string",
          "description": "The identifier of the KMS key key used to encrypt model version data by Amazon Lookout for Equipment.",
          "nested_items": []
        },
        {
          "name": "OffCondition",
          "type": "string",
          "description": "Indicates that the asset associated with this sensor has been shut off. As long as this condition is met, Lookout for Equipment will not use data from this asset for training, evaluation, or inference.",
          "nested_items": []
        },
        {
          "name": "SourceModelVersionArn",
          "type": "string",
          "description": "If model version was imported, then this field is the arn of the source model version.",
          "nested_items": []
        },
        {
          "name": "ImportJobStartTime",
          "type": "datetime",
          "description": "The date and time when the import job began. This field appears if the model version was imported.",
          "nested_items": []
        },
        {
          "name": "ImportJobEndTime",
          "type": "datetime",
          "description": "The date and time when the import job completed. This field appears if the model version was imported.",
          "nested_items": []
        },
        {
          "name": "ImportedDataSizeInBytes",
          "type": "integer",
          "description": "The size in bytes of the imported data. This field appears if the model version was imported.",
          "nested_items": []
        },
        {
          "name": "PriorModelMetrics",
          "type": "string",
          "description": "If the model version was retrained, this field shows a summary of the performance of the prior model on the new training range. You can use the information in this JSON-formatted object to compare the new model version and the prior model version.",
          "nested_items": []
        },
        {
          "name": "RetrainingAvailableDataInDays",
          "type": "integer",
          "description": "Indicates the number of days of data used in the most recent scheduled retraining run.",
          "nested_items": []
        },
        {
          "name": "AutoPromotionResult",
          "type": "string",
          "description": "Indicates whether the model version was promoted to be the active version after retraining or if there was an error with or cancellation of the retraining.",
          "nested_items": []
        },
        {
          "name": "AutoPromotionResultReason",
          "type": "string",
          "description": "Indicates the reason for the AutoPromotionResult. For example, a model might not be promoted if its performance was worse than the active version, if there was an error during training, or if the retraining scheduler was using MANUAL promote mode. The model will be promoted in MANAGED promote mode if the performance is better than the previous model.",
          "nested_items": []
        },
        {
          "name": "ModelDiagnosticsOutputConfiguration",
          "type": "dict",
          "description": "The Amazon S3 location where Amazon Lookout for Equipment saves the pointwise model diagnostics for the model version.",
          "nested_items": [
            {
              "name": "S3OutputConfiguration",
              "type": "dict",
              "description": "The Amazon S3 location for the pointwise model diagnostics.",
              "nested_items": [
                {
                  "name": "Bucket",
                  "type": "string",
                  "description": "The name of the Amazon S3 bucket where the pointwise model diagnostics are located. You must be the owner of the Amazon S3 bucket.",
                  "nested_items": []
                },
                {
                  "name": "Prefix",
                  "type": "string",
                  "description": "The Amazon S3 prefix for the location of the pointwise model diagnostics. The prefix specifies the folder and evaluation result file name. ( bucket).",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "KmsKeyId",
              "type": "string",
              "description": "The Amazon Web Services Key Management Service (KMS) key identifier to encrypt the pointwise model diagnostics files.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "ModelDiagnosticsResultsObject",
          "type": "dict",
          "description": "The Amazon S3 output prefix for where Lookout for Equipment saves the pointwise model diagnostics for the model version.",
          "nested_items": [
            {
              "name": "Bucket",
              "type": "string",
              "description": "The name of the specific S3 bucket.",
              "nested_items": []
            },
            {
              "name": "Key",
              "type": "string",
              "description": "The Amazon Web Services Key Management Service (KMS key) key being used to encrypt the S3 object. Without this key, data in the bucket is not accessible.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "ModelQuality",
          "type": "string",
          "description": "Provides a quality assessment for a model that uses labels. If Lookout for Equipment determines that the model quality is poor based on training metrics, the value is POOR_QUALITY_DETECTED. Otherwise, the value is QUALITY_THRESHOLD_MET.",
          "nested_items": []
        }
      ]
    }
  ]
}