{
  "method_name": "create_contact",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ssm-contacts/client/create_contact.html",
  "description": "Contacts are either the contacts that Incident Manager engages during an incident or the escalation plans that Incident Manager uses to engage contacts in phases during an incident.",
  "parameters": [
    {
      "name": "Alias",
      "type": "string",
      "required": true,
      "description": "The short name to quickly identify a contact or escalation plan. The contact alias must be unique and identifiable.",
      "nested_params": []
    },
    {
      "name": "DisplayName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Type",
      "type": "string",
      "required": true,
      "description": "To create an escalation plan use ESCALATION. To create a contact use PERSONAL.",
      "nested_params": []
    },
    {
      "name": "Plan",
      "type": "dict",
      "required": true,
      "description": "A list of stages. A contact has an engagement plan with stages that contact specified contact channels. An escalation plan uses stages that contact specified contacts. Stages (list) --- A list of stages that the escalation plan or engagement plan uses to engage contacts and contact methods. (dict) --- A set amount of time that an escalation plan or engagement plan engages the specified contacts or contact methods. The time to wait until beginning the next stage. The duration can only be set to 0 if a target is specified. The contacts or contact methods that the escalation plan or engagement plan is engaging. (dict) --- The contact or contact channel that's being engaged. ChannelTargetInfo (dict) --- Information about the contact channel Incident Manager is engaging. The Amazon Resource Name (ARN) of the contact channel. RetryIntervalInMinutes (integer) --- The number of minutes to wait to retry sending engagement in the case the engagement initially fails. ContactTargetInfo (dict) --- Information about the contact that Incident Manager is engaging. ContactId (string) --- The Amazon Resource Name (ARN) of the contact. A Boolean value determining if the contact's acknowledgement stops the progress of stages in the plan. RotationIds (list) --- The Amazon Resource Names (ARNs) of the on-call rotations associated with the plan. (string) ---",
      "nested_params": [
        {
          "name": "Stages",
          "type": "list",
          "required": false,
          "description": "A list of stages that the escalation plan or engagement plan uses to engage contacts and contact methods.",
          "nested_params": [
            {
              "name": "DurationInMinutes",
              "type": "integer",
              "required": false,
              "description": "The time to wait until beginning the next stage. The duration can only be set to 0 if a target is specified.",
              "nested_params": []
            },
            {
              "name": "Targets",
              "type": "list",
              "required": false,
              "description": "The contacts or contact methods that the escalation plan or engagement plan is engaging.",
              "nested_params": [
                {
                  "name": "ChannelTargetInfo",
                  "type": "dict",
                  "required": false,
                  "description": "Information about the contact channel Incident Manager is engaging.",
                  "nested_params": [
                    {
                      "name": "ContactChannelId",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Resource Name (ARN) of the contact channel.",
                      "nested_params": []
                    },
                    {
                      "name": "RetryIntervalInMinutes",
                      "type": "integer",
                      "required": false,
                      "description": "The number of minutes to wait to retry sending engagement in the case the engagement initially fails.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "ContactTargetInfo",
                  "type": "dict",
                  "required": false,
                  "description": "Information about the contact that Incident Manager is engaging.",
                  "nested_params": [
                    {
                      "name": "ContactId",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Resource Name (ARN) of the contact.",
                      "nested_params": []
                    },
                    {
                      "name": "IsEssential",
                      "type": "boolean",
                      "required": false,
                      "description": "A Boolean value determining if the contact's acknowledgement stops the progress of stages in the plan.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "RotationIds",
          "type": "list",
          "required": false,
          "description": "The Amazon Resource Names (ARNs) of the on-call rotations associated with the plan.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": false,
      "description": "Adds a tag to the target. You can only tag resources created in the first Region of your replication set. (dict) --- A container of a key-value name pair. Key (string) --- Name of the object key. Value (string) --- Value of the tag.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "Name of the object key.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "Value of the tag.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "IdempotencyToken",
      "type": "string",
      "required": false,
      "description": "A token ensuring that the operation is called only once with the specified details. This field is autopopulated if not provided.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ContactArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the created contact or escalation plan.",
          "nested_items": []
        }
      ]
    }
  ]
}