{
  "method_name": "update_contact",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ssm-contacts/client/update_contact.html",
  "description": "Updates the contact or escalation plan specified.",
  "parameters": [
    {
      "name": "ContactId",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the contact or escalation plan you're updating.",
      "nested_params": []
    },
    {
      "name": "DisplayName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Plan",
      "type": "dict",
      "required": true,
      "description": "A list of stages. A contact has an engagement plan with stages for specified contact channels. An escalation plan uses these stages to contact specified contacts. Stages (list) --- A list of stages that the escalation plan or engagement plan uses to engage contacts and contact methods. (dict) --- A set amount of time that an escalation plan or engagement plan engages the specified contacts or contact methods. The time to wait until beginning the next stage. The duration can only be set to 0 if a target is specified. The contacts or contact methods that the escalation plan or engagement plan is engaging. (dict) --- The contact or contact channel that's being engaged. ChannelTargetInfo (dict) --- Information about the contact channel Incident Manager is engaging. The Amazon Resource Name (ARN) of the contact channel. RetryIntervalInMinutes (integer) --- The number of minutes to wait to retry sending engagement in the case the engagement initially fails. ContactTargetInfo (dict) --- Information about the contact that Incident Manager is engaging. ContactId (string) --- The Amazon Resource Name (ARN) of the contact. A Boolean value determining if the contact's acknowledgement stops the progress of stages in the plan. RotationIds (list) --- The Amazon Resource Names (ARNs) of the on-call rotations associated with the plan. (string) ---",
      "nested_params": [
        {
          "name": "Stages",
          "type": "list",
          "required": false,
          "description": "A list of stages that the escalation plan or engagement plan uses to engage contacts and contact methods.",
          "nested_params": [
            {
              "name": "DurationInMinutes",
              "type": "integer",
              "required": false,
              "description": "The time to wait until beginning the next stage. The duration can only be set to 0 if a target is specified.",
              "nested_params": []
            },
            {
              "name": "Targets",
              "type": "list",
              "required": false,
              "description": "The contacts or contact methods that the escalation plan or engagement plan is engaging.",
              "nested_params": [
                {
                  "name": "ChannelTargetInfo",
                  "type": "dict",
                  "required": false,
                  "description": "Information about the contact channel Incident Manager is engaging.",
                  "nested_params": [
                    {
                      "name": "ContactChannelId",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Resource Name (ARN) of the contact channel.",
                      "nested_params": []
                    },
                    {
                      "name": "RetryIntervalInMinutes",
                      "type": "integer",
                      "required": false,
                      "description": "The number of minutes to wait to retry sending engagement in the case the engagement initially fails.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "ContactTargetInfo",
                  "type": "dict",
                  "required": false,
                  "description": "Information about the contact that Incident Manager is engaging.",
                  "nested_params": [
                    {
                      "name": "ContactId",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Resource Name (ARN) of the contact.",
                      "nested_params": []
                    },
                    {
                      "name": "IsEssential",
                      "type": "boolean",
                      "required": false,
                      "description": "A Boolean value determining if the contact's acknowledgement stops the progress of stages in the plan.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "RotationIds",
          "type": "list",
          "required": false,
          "description": "The Amazon Resource Names (ARNs) of the on-call rotations associated with the plan.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}