{
  "method_name": "start_audit_mitigation_actions_task",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iot/client/start_audit_mitigation_actions_task.html",
  "description": "Starts a task that applies a set of mitigation actions to the specified target. Requires permission to access the StartAuditMitigationActionsTask action.",
  "parameters": [
    {
      "name": "taskId",
      "type": "string",
      "required": true,
      "description": "A unique identifier for the task. You can use this identifier to check the status of the task or to cancel it.",
      "nested_params": []
    },
    {
      "name": "target",
      "type": "dict",
      "required": true,
      "description": "Specifies the audit findings to which the mitigation actions are applied. You can apply them to a type of audit check, to all findings from an audit, or to a specific set of findings. auditTaskId (string) --- If the task will apply a mitigation action to findings from a specific audit, this value uniquely identifies the audit. findingIds (list) --- If the task will apply a mitigation action to one or more listed findings, this value uniquely identifies those findings. (string) --- auditCheckToReasonCodeFilter (dict) --- Specifies a filter in the form of an audit check and set of reason codes that identify the findings from the audit to which the audit mitigation actions task apply. (string) --- An audit check name. Checks must be enabled for your account. (Use DescribeAccountAuditConfiguration to see the list of all checks, including those that are enabled or use UpdateAccountAuditConfiguration to select which checks are enabled.) (list) --- (string) ---",
      "nested_params": [
        {
          "name": "auditTaskId",
          "type": "string",
          "required": false,
          "description": "If the task will apply a mitigation action to findings from a specific audit, this value uniquely identifies the audit.",
          "nested_params": []
        },
        {
          "name": "findingIds",
          "type": "list",
          "required": false,
          "description": "If the task will apply a mitigation action to one or more listed findings, this value uniquely identifies those findings.",
          "nested_params": []
        },
        {
          "name": "auditCheckToReasonCodeFilter",
          "type": "dict",
          "required": false,
          "description": "Specifies a filter in the form of an audit check and set of reason codes that identify the findings from the audit to which the audit mitigation actions task apply.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "auditCheckToActionsMapping",
      "type": "dict",
      "required": true,
      "description": "For an audit check, specifies which mitigation actions to apply. Those actions must be defined in your Amazon Web Services accounts. (string) --- An audit check name. Checks must be enabled for your account. (Use DescribeAccountAuditConfiguration to see the list of all checks, including those that are enabled or use UpdateAccountAuditConfiguration to select which checks are enabled.) (list) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "clientRequestToken",
      "type": "string",
      "required": true,
      "description": "Each audit mitigation task must have a unique client request token. If you try to start a new task with the same token as a task that already exists, an exception occurs. If you omit this value, a unique client request token is generated automatically. This field is autopopulated if not provided.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "taskId",
          "type": "string",
          "description": "The unique identifier for the audit mitigation task. This matches the taskId that you specified in the request.",
          "nested_items": []
        }
      ]
    }
  ]
}