{
  "method_name": "update_mitigation_action",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iot/client/update_mitigation_action.html",
  "description": "Updates the definition for the specified mitigation action. Requires permission to access the UpdateMitigationAction action.",
  "parameters": [
    {
      "name": "actionName",
      "type": "string",
      "required": true,
      "description": "The friendly name for the mitigation action. You cannot change the name by using UpdateMitigationAction. Instead, you must delete and recreate the mitigation action with the new name.",
      "nested_params": []
    },
    {
      "name": "roleArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "actionParams",
      "type": "dict",
      "required": true,
      "description": "Defines the type of action and the parameters for that action. updateDeviceCertificateParams (dict) --- Parameters to define a mitigation action that changes the state of the device certificate to inactive. The action that you want to apply to the device certificate. The only supported value is DEACTIVATE. updateCACertificateParams (dict) --- Parameters to define a mitigation action that changes the state of the CA certificate to inactive. The action that you want to apply to the CA certificate. addThingsToThingGroupParams (dict) --- Parameters to define a mitigation action that moves devices associated with a certificate to one or more specified thing groups, typically for quarantine. The list of groups to which you want to add the things that triggered the mitigation action. You can add a thing to a maximum of 10 groups, but you can't add a thing to more than one group in the same hierarchy. (string) --- overrideDynamicGroups (boolean) --- Specifies if this mitigation action can move the things that triggered the mitigation action even if they are part of one or more dynamic thing groups. replaceDefaultPolicyVersionParams (dict) --- Parameters to define a mitigation action that adds a blank policy to restrict permissions. The name of the template to be applied. The only supported value is BLANK_POLICY. enableIoTLoggingParams (dict) --- Parameters to define a mitigation action that enables Amazon Web Services IoT Core logging at a specified level of detail. The Amazon Resource Name (ARN) of the IAM role used for logging. Specifies the type of information to be logged. publishFindingToSnsParams (dict) --- Parameters to define a mitigation action that publishes findings to Amazon Simple Notification Service (Amazon SNS. You can implement your own custom actions in response to the Amazon SNS messages. The ARN of the topic to which you want to publish the findings.",
      "nested_params": [
        {
          "name": "updateDeviceCertificateParams",
          "type": "dict",
          "required": false,
          "description": "Parameters to define a mitigation action that changes the state of the device certificate to inactive.",
          "nested_params": [
            {
              "name": "action",
              "type": "string",
              "required": false,
              "description": "The action that you want to apply to the device certificate. The only supported value is DEACTIVATE.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "updateCACertificateParams",
          "type": "dict",
          "required": false,
          "description": "Parameters to define a mitigation action that changes the state of the CA certificate to inactive.",
          "nested_params": [
            {
              "name": "action",
              "type": "string",
              "required": false,
              "description": "The action that you want to apply to the CA certificate. The only supported value is DEACTIVATE.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "addThingsToThingGroupParams",
          "type": "dict",
          "required": false,
          "description": "Parameters to define a mitigation action that moves devices associated with a certificate to one or more specified thing groups, typically for quarantine.",
          "nested_params": [
            {
              "name": "thingGroupNames",
              "type": "list",
              "required": false,
              "description": "The list of groups to which you want to add the things that triggered the mitigation action. You can add a thing to a maximum of 10 groups, but you can't add a thing to more than one group in the same hierarchy.",
              "nested_params": []
            },
            {
              "name": "overrideDynamicGroups",
              "type": "boolean",
              "required": false,
              "description": "Specifies if this mitigation action can move the things that triggered the mitigation action even if they are part of one or more dynamic thing groups.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "replaceDefaultPolicyVersionParams",
          "type": "dict",
          "required": false,
          "description": "Parameters to define a mitigation action that adds a blank policy to restrict permissions.",
          "nested_params": [
            {
              "name": "templateName",
              "type": "string",
              "required": false,
              "description": "The name of the template to be applied. The only supported value is BLANK_POLICY.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "enableIoTLoggingParams",
          "type": "dict",
          "required": false,
          "description": "Parameters to define a mitigation action that enables Amazon Web Services IoT Core logging at a specified level of detail.",
          "nested_params": [
            {
              "name": "roleArnForLogging",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of the IAM role used for logging.",
              "nested_params": []
            },
            {
              "name": "logLevel",
              "type": "string",
              "required": false,
              "description": "Specifies the type of information to be logged.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "publishFindingToSnsParams",
          "type": "dict",
          "required": false,
          "description": "Parameters to define a mitigation action that publishes findings to Amazon Simple Notification Service (Amazon SNS. You can implement your own custom actions in response to the Amazon SNS messages.",
          "nested_params": [
            {
              "name": "topicArn",
              "type": "string",
              "required": false,
              "description": "The ARN of the topic to which you want to publish the findings.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "actionArn",
          "type": "string",
          "description": "The ARN for the new mitigation action.",
          "nested_items": []
        },
        {
          "name": "actionId",
          "type": "string",
          "description": "A unique identifier for the mitigation action.",
          "nested_items": []
        }
      ]
    }
  ]
}