{
  "method_name": "assume_root",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sts/client/assume_root.html",
  "description": "Returns a set of short term credentials you can use to perform privileged tasks on a member account in your organization. Before you can launch a privileged session, you must have centralized root access in your organization. For steps to enable this feature, see Centralize root access for member accounts in the IAM User Guide. You can track AssumeRoot in CloudTrail logs to determine what actions were performed in a session. For more information, see Track privileged tasks in CloudTrail in the IAM User Guide.",
  "parameters": [
    {
      "name": "TargetPrincipal",
      "type": "string",
      "required": true,
      "description": "The member account principal ARN or account ID.",
      "nested_params": []
    },
    {
      "name": "TaskPolicyArn",
      "type": "dict",
      "required": true,
      "description": "The identity based policy that scopes the session to the privileged tasks that can be performed. You can use one of following Amazon Web Services managed policies to scope root session actions. IAMAuditRootUserCredentials IAMCreateRootUserPassword IAMDeleteRootUserCredentials S3UnlockBucketPolicy SQSUnlockQueuePolicy arn (string) --- The Amazon Resource Name (ARN) of the IAM managed policy to use as a session policy for the role. For more information about ARNs, see Amazon Resource Names (ARNs) and Amazon Web Services Service Namespaces in the Amazon Web Services General Reference.",
      "nested_params": []
    },
    {
      "name": "DurationSeconds",
      "type": "integer",
      "required": false,
      "description": "The duration, in seconds, of the privileged session. The value can range from 0 seconds up to the maximum session duration of 900 seconds (15 minutes). If you specify a value higher than this setting, the operation fails. By default, the value is set to 900 seconds.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Credentials",
          "type": "dict",
          "description": "The temporary security credentials, which include an access key ID, a secret access key, and a security token.",
          "nested_items": [
            {
              "name": "AccessKeyId",
              "type": "string",
              "description": "The access key ID that identifies the temporary security credentials.",
              "nested_items": []
            },
            {
              "name": "SecretAccessKey",
              "type": "string",
              "description": "The secret access key that can be used to sign requests.",
              "nested_items": []
            },
            {
              "name": "SessionToken",
              "type": "string",
              "description": "The token that users must pass to the service API to use the temporary credentials.",
              "nested_items": []
            },
            {
              "name": "Expiration",
              "type": "datetime",
              "description": "The date on which the current credentials expire.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "SourceIdentity",
          "type": "string",
          "description": "The source identity specified by the principal that is calling the AssumeRoot operation.",
          "nested_items": []
        }
      ]
    }
  ]
}