{
  "method_name": "verify_pin_data",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/payment-cryptography-data/client/verify_pin_data.html",
  "description": "Verifies pin-related data such as PIN and PIN Offset using algorithms including VISA PVV and IBM3624. For more information, see Verify PIN data in the Amazon Web Services Payment Cryptography User Guide. This operation verifies PIN data for user payment card. A card holder PIN data is never transmitted in clear to or from Amazon Web Services Payment Cryptography. This operation uses PIN Verification Key (PVK) for PIN or PIN Offset generation and then encrypts it using PIN Encryption Key (PEK) to create an EncryptedPinBlock for transmission from Amazon Web Services Payment Cryptography. For information about valid keys for this operation, see Understanding key attributes and Key types for specific data operations in the Amazon Web Services Payment Cryptography User Guide. Cross-account use: This operation can't be used across different Amazon Web Services accounts.",
  "parameters": [
    {
      "name": "VerificationKeyIdentifier",
      "type": "string",
      "required": true,
      "description": "The keyARN of the PIN verification key.",
      "nested_params": []
    },
    {
      "name": "EncryptionKeyIdentifier",
      "type": "string",
      "required": true,
      "description": "The keyARN of the encryption key under which the PIN block data is encrypted. This key type can be PEK or BDK.",
      "nested_params": []
    },
    {
      "name": "VerificationAttributes",
      "type": "dict",
      "required": true,
      "description": "The attributes and values for PIN data verification. VisaPin (dict) --- Parameters that are required to generate or verify Visa PIN. The value for PIN verification index. It is used in the Visa PIN algorithm to calculate the PVV (PIN Verification Value). Parameters that are required to generate or verify Visa PVV (PIN Verification Value). Ibm3624Pin (dict) --- Parameters that are required to generate or verify Ibm3624 PIN. The decimalization table to use for IBM 3624 PIN algorithm. The table is used to convert the algorithm intermediate result from hexadecimal characters to decimal. The padding character for validation data. The unique data for cardholder identification. The PIN offset value.",
      "nested_params": [
        {
          "name": "VisaPin",
          "type": "dict",
          "required": false,
          "description": "Parameters that are required to generate or verify Visa PIN.",
          "nested_params": [
            {
              "name": "PinVerificationKeyIndex",
              "type": "integer",
              "required": false,
              "description": "The value for PIN verification index. It is used in the Visa PIN algorithm to calculate the PVV (PIN Verification Value).",
              "nested_params": []
            },
            {
              "name": "VerificationValue",
              "type": "string",
              "required": false,
              "description": "Parameters that are required to generate or verify Visa PVV (PIN Verification Value).",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Ibm3624Pin",
          "type": "dict",
          "required": false,
          "description": "Parameters that are required to generate or verify Ibm3624 PIN.",
          "nested_params": [
            {
              "name": "DecimalizationTable",
              "type": "string",
              "required": false,
              "description": "The decimalization table to use for IBM 3624 PIN algorithm. The table is used to convert the algorithm intermediate result from hexadecimal characters to decimal.",
              "nested_params": []
            },
            {
              "name": "PinValidationDataPadCharacter",
              "type": "string",
              "required": false,
              "description": "The padding character for validation data.",
              "nested_params": []
            },
            {
              "name": "PinValidationData",
              "type": "string",
              "required": false,
              "description": "The unique data for cardholder identification.",
              "nested_params": []
            },
            {
              "name": "PinOffset",
              "type": "string",
              "required": false,
              "description": "The PIN offset value.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "EncryptedPinBlock",
      "type": "string",
      "required": true,
      "description": "The encrypted PIN block data that Amazon Web Services Payment Cryptography verifies.",
      "nested_params": []
    },
    {
      "name": "PrimaryAccountNumber",
      "type": "string",
      "required": true,
      "description": "The Primary Account Number (PAN), a unique identifier for a payment credit or debit card that associates the card with a specific account holder.",
      "nested_params": []
    },
    {
      "name": "PinBlockFormat",
      "type": "string",
      "required": true,
      "description": "The PIN encoding format for pin data generation as specified in ISO 9564. Amazon Web Services Payment Cryptography supports ISO_Format_0 and ISO_Format_3. The ISO_Format_0 PIN block format is equivalent to the ANSI X9.8, VISA-1, and ECI-1 PIN block formats. It is similar to a VISA-4 PIN block format. It supports a PIN from 4 to 12 digits in length. The ISO_Format_3 PIN block format is the same as ISO_Format_0 except that the fill digits are random values from 10 to 15.",
      "nested_params": []
    },
    {
      "name": "PinDataLength",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DukptAttributes",
      "type": "dict",
      "required": true,
      "description": "The attributes and values for the DUKPT encrypted PIN block data. The unique identifier known as Key Serial Number (KSN) that comes from an encrypting device using DUKPT encryption method. The KSN is derived from the encrypting device unique identifier and an internal transaction counter. The key type derived using DUKPT from a Base Derivation Key (BDK) and Key Serial Number (KSN). This must be less than or equal to the strength of the BDK. For example, you can't use AES_128 as a derivation type for a BDK of AES_128 or TDES_2KEY.",
      "nested_params": [
        {
          "name": "KeySerialNumber",
          "type": "string",
          "required": false,
          "description": "The unique identifier known as Key Serial Number (KSN) that comes from an encrypting device using DUKPT encryption method. The KSN is derived from the encrypting device unique identifier and an internal transaction counter.",
          "nested_params": []
        },
        {
          "name": "DukptDerivationType",
          "type": "string",
          "required": false,
          "description": "The key type derived using DUKPT from a Base Derivation Key (BDK) and Key Serial Number (KSN). This must be less than or equal to the strength of the BDK. For example, you can't use AES_128 as a derivation type for a BDK of AES_128 or TDES_2KEY.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "EncryptionWrappedKey",
      "type": "dict",
      "required": true,
      "description": "Parameter information of a WrappedKeyBlock for encryption key exchange. Tr31KeyBlock (string) --- The TR-31 wrapped key block. DiffieHellmanSymmetricKey (dict) --- The parameter information for deriving a ECDH shared key. The keyArn of the certificate that signed the client's PublicKeyCertificate. The client's public key certificate in PEM format (base64 encoded) to use for ECDH key derivation. The key algorithm of the derived ECDH key. The key derivation function to use for deriving a key using ECDH. The hash type to use for deriving a key using ECDH. A byte string containing information that binds the ECDH derived key to the two parties involved or to the context of the key. It may include details like identities of the two parties deriving the key, context of the operation, session IDs, and optionally a nonce. It must not contain zero bytes, and re-using shared information for multiple ECDH key derivations is not recommended. KeyCheckValueAlgorithm (string) --- The algorithm that Amazon Web Services Payment Cryptography uses to calculate the key check value (KCV). It is used to validate the key integrity. For TDES keys, the KCV is computed by encrypting 8 bytes, each with value of zero, with the key to be checked and retaining the 3 highest order bytes of the encrypted result. For AES keys, the KCV is computed using a CMAC algorithm where the input data is 16 bytes of zero and retaining the 3 highest order bytes of the encrypted result.",
      "nested_params": [
        {
          "name": "WrappedKeyMaterial",
          "type": "dict",
          "required": false,
          "description": "Parameter information of a WrappedKeyBlock for encryption key exchange.",
          "nested_params": [
            {
              "name": "Tr31KeyBlock",
              "type": "string",
              "required": false,
              "description": "The TR-31 wrapped key block.",
              "nested_params": []
            },
            {
              "name": "DiffieHellmanSymmetricKey",
              "type": "dict",
              "required": false,
              "description": "The parameter information for deriving a ECDH shared key.",
              "nested_params": [
                {
                  "name": "CertificateAuthorityPublicKeyIdentifier",
                  "type": "string",
                  "required": false,
                  "description": "The keyArn of the certificate that signed the client's PublicKeyCertificate.",
                  "nested_params": []
                },
                {
                  "name": "PublicKeyCertificate",
                  "type": "string",
                  "required": false,
                  "description": "The client's public key certificate in PEM format (base64 encoded) to use for ECDH key derivation.",
                  "nested_params": []
                },
                {
                  "name": "KeyAlgorithm",
                  "type": "string",
                  "required": false,
                  "description": "The key algorithm of the derived ECDH key.",
                  "nested_params": []
                },
                {
                  "name": "KeyDerivationFunction",
                  "type": "string",
                  "required": false,
                  "description": "The key derivation function to use for deriving a key using ECDH.",
                  "nested_params": []
                },
                {
                  "name": "KeyDerivationHashAlgorithm",
                  "type": "string",
                  "required": false,
                  "description": "The hash type to use for deriving a key using ECDH.",
                  "nested_params": []
                },
                {
                  "name": "SharedInformation",
                  "type": "string",
                  "required": false,
                  "description": "A byte string containing information that binds the ECDH derived key to the two parties involved or to the context of the key. It may include details like identities of the two parties deriving the key, context of the operation, session IDs, and optionally a nonce. It must not contain zero bytes, and re-using shared information for multiple ECDH key derivations is not recommended.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "KeyCheckValueAlgorithm",
          "type": "string",
          "required": false,
          "description": "The algorithm that Amazon Web Services Payment Cryptography uses to calculate the key check value (KCV). It is used to validate the key integrity. For TDES keys, the KCV is computed by encrypting 8 bytes, each with value of zero, with the key to be checked and retaining the 3 highest order bytes of the encrypted result. For AES keys, the KCV is computed using a CMAC algorithm where the input data is 16 bytes of zero and retaining the 3 highest order bytes of the encrypted result.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "VerificationKeyArn",
          "type": "string",
          "description": "The keyARN of the PIN encryption key that Amazon Web Services Payment Cryptography uses for PIN or PIN Offset verification.",
          "nested_items": []
        },
        {
          "name": "VerificationKeyCheckValue",
          "type": "string",
          "description": "The key check value (KCV) of the encryption key. The KCV is used to check if all parties holding a given key have the same key or to detect that a key has changed.",
          "nested_items": []
        },
        {
          "name": "EncryptionKeyArn",
          "type": "string",
          "description": "The keyARN of the PEK that Amazon Web Services Payment Cryptography uses for encrypted pin block generation.",
          "nested_items": []
        },
        {
          "name": "EncryptionKeyCheckValue",
          "type": "string",
          "description": "The key check value (KCV) of the encryption key. The KCV is used to check if all parties holding a given key have the same key or to detect that a key has changed.",
          "nested_items": []
        }
      ]
    }
  ]
}