{
  "method_name": "verify_auth_request_cryptogram",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/payment-cryptography-data/client/verify_auth_request_cryptogram.html",
  "description": "Verifies Authorization Request Cryptogram (ARQC) for a EMV chip payment card authorization. For more information, see Verify auth request cryptogram in the Amazon Web Services Payment Cryptography User Guide. ARQC generation is done outside of Amazon Web Services Payment Cryptography and is typically generated on a point of sale terminal for an EMV chip card to obtain payment authorization during transaction time. For ARQC verification, you must first import the ARQC generated outside of Amazon Web Services Payment Cryptography by calling ImportKey. This operation uses the imported ARQC and an major encryption key (DUKPT) created by calling CreateKey to either provide a boolean ARQC verification result or provide an APRC (Authorization Response Cryptogram) response using Method 1 or Method 2. The ARPC_METHOD_1 uses AuthResponseCode to generate ARPC and ARPC_METHOD_2 uses CardStatusUpdate to generate ARPC. For information about valid keys for this operation, see Understanding key attributes and Key types for specific data operations in the Amazon Web Services Payment Cryptography User Guide. Cross-account use: This operation can't be used across different Amazon Web Services accounts.",
  "parameters": [
    {
      "name": "KeyIdentifier",
      "type": "string",
      "required": true,
      "description": "The keyARN of the major encryption key that Amazon Web Services Payment Cryptography uses for ARQC verification.",
      "nested_params": []
    },
    {
      "name": "TransactionData",
      "type": "string",
      "required": true,
      "description": "The transaction data that Amazon Web Services Payment Cryptography uses for ARQC verification. The same transaction is used for ARQC generation outside of Amazon Web Services Payment Cryptography.",
      "nested_params": []
    },
    {
      "name": "AuthRequestCryptogram",
      "type": "string",
      "required": true,
      "description": "The auth request cryptogram imported into Amazon Web Services Payment Cryptography for ARQC verification using a major encryption key and transaction data.",
      "nested_params": []
    },
    {
      "name": "MajorKeyDerivationMode",
      "type": "string",
      "required": true,
      "description": "The method to use when deriving the major encryption key for ARQC verification within Amazon Web Services Payment Cryptography. The same key derivation mode was used for ARQC generation outside of Amazon Web Services Payment Cryptography.",
      "nested_params": []
    },
    {
      "name": "SessionKeyDerivationAttributes",
      "type": "dict",
      "required": true,
      "description": "The attributes and values to use for deriving a session key for ARQC verification within Amazon Web Services Payment Cryptography. The same attributes were used for ARQC generation outside of Amazon Web Services Payment Cryptography. EmvCommon (dict) --- Parameters to derive session key for an Emv common payment card for ARQC verification. The Primary Account Number (PAN) of the cardholder. A PAN is a unique identifier for a payment credit or debit card and associates the card to a specific account holder. A number that identifies and differentiates payment cards with the same Primary Account Number (PAN). The transaction counter that is provided by the terminal during transaction processing. Mastercard (dict) --- Parameters to derive session key for a Mastercard payment card for ARQC verification. A random number generated by the issuer. Emv2000 (dict) --- Parameters to derive session key for an Emv2000 payment card for ARQC verification. Amex (dict) --- Parameters to derive session key for an Amex payment card for ARQC verification. Visa (dict) --- Parameters to derive session key for a Visa payment cardfor ARQC verification. A number that identifies and differentiates payment cards with the same Primary Account Number (PAN).",
      "nested_params": [
        {
          "name": "EmvCommon",
          "type": "dict",
          "required": false,
          "description": "Parameters to derive session key for an Emv common payment card for ARQC verification.",
          "nested_params": [
            {
              "name": "PrimaryAccountNumber",
              "type": "string",
              "required": false,
              "description": "The Primary Account Number (PAN) of the cardholder. A PAN is a unique identifier for a payment credit or debit card and associates the card to a specific account holder.",
              "nested_params": []
            },
            {
              "name": "PanSequenceNumber",
              "type": "string",
              "required": false,
              "description": "A number that identifies and differentiates payment cards with the same Primary Account Number (PAN).",
              "nested_params": []
            },
            {
              "name": "ApplicationTransactionCounter",
              "type": "string",
              "required": false,
              "description": "The transaction counter that is provided by the terminal during transaction processing.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Mastercard",
          "type": "dict",
          "required": false,
          "description": "Parameters to derive session key for a Mastercard payment card for ARQC verification.",
          "nested_params": [
            {
              "name": "PrimaryAccountNumber",
              "type": "string",
              "required": false,
              "description": "The Primary Account Number (PAN) of the cardholder. A PAN is a unique identifier for a payment credit or debit card and associates the card to a specific account holder.",
              "nested_params": []
            },
            {
              "name": "PanSequenceNumber",
              "type": "string",
              "required": false,
              "description": "A number that identifies and differentiates payment cards with the same Primary Account Number (PAN).",
              "nested_params": []
            },
            {
              "name": "ApplicationTransactionCounter",
              "type": "string",
              "required": false,
              "description": "The transaction counter that is provided by the terminal during transaction processing.",
              "nested_params": []
            },
            {
              "name": "UnpredictableNumber",
              "type": "string",
              "required": false,
              "description": "A random number generated by the issuer.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Emv2000",
          "type": "dict",
          "required": false,
          "description": "Parameters to derive session key for an Emv2000 payment card for ARQC verification.",
          "nested_params": [
            {
              "name": "PrimaryAccountNumber",
              "type": "string",
              "required": false,
              "description": "The Primary Account Number (PAN) of the cardholder. A PAN is a unique identifier for a payment credit or debit card and associates the card to a specific account holder.",
              "nested_params": []
            },
            {
              "name": "PanSequenceNumber",
              "type": "string",
              "required": false,
              "description": "A number that identifies and differentiates payment cards with the same Primary Account Number (PAN).",
              "nested_params": []
            },
            {
              "name": "ApplicationTransactionCounter",
              "type": "string",
              "required": false,
              "description": "The transaction counter that is provided by the terminal during transaction processing.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Amex",
          "type": "dict",
          "required": false,
          "description": "Parameters to derive session key for an Amex payment card for ARQC verification.",
          "nested_params": [
            {
              "name": "PrimaryAccountNumber",
              "type": "string",
              "required": false,
              "description": "The Primary Account Number (PAN) of the cardholder. A PAN is a unique identifier for a payment credit or debit card and associates the card to a specific account holder.",
              "nested_params": []
            },
            {
              "name": "PanSequenceNumber",
              "type": "string",
              "required": false,
              "description": "A number that identifies and differentiates payment cards with the same Primary Account Number (PAN).",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Visa",
          "type": "dict",
          "required": false,
          "description": "Parameters to derive session key for a Visa payment cardfor ARQC verification.",
          "nested_params": [
            {
              "name": "PrimaryAccountNumber",
              "type": "string",
              "required": false,
              "description": "The Primary Account Number (PAN) of the cardholder. A PAN is a unique identifier for a payment credit or debit card and associates the card to a specific account holder.",
              "nested_params": []
            },
            {
              "name": "PanSequenceNumber",
              "type": "string",
              "required": false,
              "description": "A number that identifies and differentiates payment cards with the same Primary Account Number (PAN).",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "AuthResponseAttributes",
      "type": "dict",
      "required": true,
      "description": "The attributes and values for auth request cryptogram verification. These parameters are required in case using ARPC Method 1 or Method 2 for ARQC verification. ArpcMethod1 (dict) --- Parameters that are required for ARPC response generation using method1 after ARQC verification is successful. The auth code used to calculate APRC after ARQC verification is successful. This is the same auth code used for ARQC generation outside of Amazon Web Services Payment Cryptography. ArpcMethod2 (dict) --- Parameters that are required for ARPC response generation using method2 after ARQC verification is successful. The data indicating whether the issuer approves or declines an online transaction using an EMV chip card. ProprietaryAuthenticationData (string) --- The proprietary authentication data used by issuer for communication during online transaction using an EMV chip card.",
      "nested_params": [
        {
          "name": "ArpcMethod1",
          "type": "dict",
          "required": false,
          "description": "Parameters that are required for ARPC response generation using method1 after ARQC verification is successful.",
          "nested_params": [
            {
              "name": "AuthResponseCode",
              "type": "string",
              "required": false,
              "description": "The auth code used to calculate APRC after ARQC verification is successful. This is the same auth code used for ARQC generation outside of Amazon Web Services Payment Cryptography.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ArpcMethod2",
          "type": "dict",
          "required": false,
          "description": "Parameters that are required for ARPC response generation using method2 after ARQC verification is successful.",
          "nested_params": [
            {
              "name": "CardStatusUpdate",
              "type": "string",
              "required": false,
              "description": "The data indicating whether the issuer approves or declines an online transaction using an EMV chip card.",
              "nested_params": []
            },
            {
              "name": "ProprietaryAuthenticationData",
              "type": "string",
              "required": false,
              "description": "The proprietary authentication data used by issuer for communication during online transaction using an EMV chip card.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "KeyArn",
          "type": "string",
          "description": "The keyARN of the major encryption key that Amazon Web Services Payment Cryptography uses for ARQC verification.",
          "nested_items": []
        },
        {
          "name": "KeyCheckValue",
          "type": "string",
          "description": "The key check value (KCV) of the encryption key. The KCV is used to check if all parties holding a given key have the same key or to detect that a key has changed.",
          "nested_items": []
        },
        {
          "name": "AuthResponseValue",
          "type": "string",
          "description": "The result for ARQC verification or ARPC generation within Amazon Web Services Payment Cryptography.",
          "nested_items": []
        }
      ]
    }
  ]
}