{
  "method_name": "remove_permission",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/codeguruprofiler/client/remove_permission.html",
  "description": "Removes permissions from a profiling group's resource-based policy that are provided using an action group. The one supported action group that can be removed is agentPermission which grants ConfigureAgent and PostAgent permissions. For more information, see Resource-based policies in CodeGuru Profiler in the Amazon CodeGuru Profiler User Guide, ConfigureAgent, and PostAgentProfile.",
  "parameters": [
    {
      "name": "actionGroup",
      "type": "string",
      "required": true,
      "description": "Specifies an action group that contains the permissions to remove from a profiling group's resource-based policy. One action group is supported, agentPermissions, which grants ConfigureAgent and PostAgentProfile permissions.",
      "nested_params": []
    },
    {
      "name": "profilingGroupName",
      "type": "string",
      "required": true,
      "description": "The name of the profiling group.",
      "nested_params": []
    },
    {
      "name": "revisionId",
      "type": "string",
      "required": true,
      "description": "A universally unique identifier (UUID) for the revision of the resource-based policy from which you want to remove permissions.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "policy",
          "type": "string",
          "description": "The JSON-formatted resource-based policy on the profiling group after the specified permissions were removed.",
          "nested_items": []
        },
        {
          "name": "revisionId",
          "type": "string",
          "description": "A universally unique identifier (UUID) for the revision of the resource-based policy after the specified permissions were removed. The updated JSON-formatted policy is in the policy element of the response.",
          "nested_items": []
        }
      ]
    }
  ]
}