{
  "method_name": "create_data_set",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/quicksight/client/create_data_set.html",
  "description": "Creates a dataset. This operation doesn't support datasets that include uploaded files as a source.",
  "parameters": [
    {
      "name": "AwsAccountId",
      "type": "string",
      "required": true,
      "description": "The Amazon Web Services account ID.",
      "nested_params": []
    },
    {
      "name": "DataSetId",
      "type": "string",
      "required": true,
      "description": "An ID for the dataset that you want to create. This ID is unique per Amazon Web Services Region for each Amazon Web Services account.",
      "nested_params": []
    },
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "The display name for the dataset.",
      "nested_params": []
    },
    {
      "name": "PhysicalTableMap",
      "type": "dict",
      "required": true,
      "description": "Declares the physical tables that are available in the underlying data sources. (string) --- (dict) --- A view of a data source that contains information about the shape of the data in the underlying source. This is a variant type structure. For this structure to be valid, only one of the attributes can be non-null. RelationalTable (dict) --- A physical table type for relational data sources. The Amazon Resource Name (ARN) for the data source. Catalog (string) --- The catalog associated with a table. Schema (string) --- The schema name. This name applies to certain relational database engines. The name of the relational table. The column schema of the table. (dict) --- Metadata for a column that is used as the input of a transform operation. The name of this column in the underlying data source. The data type of the column. SubType (string) --- The sub data type of the column. Sub types are only available for decimal columns that are part of a SPICE dataset. CustomSql (dict) --- A physical table type built from the results of the custom SQL query. The Amazon Resource Name (ARN) of the data source. A display name for the SQL query result. The SQL query. Columns (list) --- The column schema from the SQL query result set. S3Source (dict) --- A physical table type for as S3 data source. UploadSettings (dict) --- Information about the format for the S3 source file or files. Format (string) --- File format. StartFromRow (integer) --- A row number to start reading data from. ContainsHeader (boolean) --- Whether the file has a header row, or the files each have a header row. TextQualifier (string) --- Text qualifier. Delimiter (string) --- The delimiter between values in the file. A physical table type for an S3 data source. Sub types are only available for decimal columns that are part of a SPICE dataset.",
      "nested_params": [
        {
          "name": "RelationalTable",
          "type": "dict",
          "required": false,
          "description": "A physical table type for relational data sources.",
          "nested_params": [
            {
              "name": "DataSourceArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) for the data source.",
              "nested_params": []
            },
            {
              "name": "Catalog",
              "type": "string",
              "required": false,
              "description": "The catalog associated with a table.",
              "nested_params": []
            },
            {
              "name": "Schema",
              "type": "string",
              "required": false,
              "description": "The schema name. This name applies to certain relational database engines.",
              "nested_params": []
            },
            {
              "name": "Name",
              "type": "string",
              "required": false,
              "description": "The name of the relational table.",
              "nested_params": []
            },
            {
              "name": "InputColumns",
              "type": "list",
              "required": false,
              "description": "The column schema of the table.",
              "nested_params": [
                {
                  "name": "Name",
                  "type": "string",
                  "required": false,
                  "description": "The name of this column in the underlying data source.",
                  "nested_params": []
                },
                {
                  "name": "Type",
                  "type": "string",
                  "required": false,
                  "description": "The data type of the column.",
                  "nested_params": []
                },
                {
                  "name": "SubType",
                  "type": "string",
                  "required": false,
                  "description": "The sub data type of the column. Sub types are only available for decimal columns that are part of a SPICE dataset.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "CustomSql",
          "type": "dict",
          "required": false,
          "description": "A physical table type built from the results of the custom SQL query.",
          "nested_params": [
            {
              "name": "DataSourceArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of the data source.",
              "nested_params": []
            },
            {
              "name": "Name",
              "type": "string",
              "required": false,
              "description": "A display name for the SQL query result.",
              "nested_params": []
            },
            {
              "name": "SqlQuery",
              "type": "string",
              "required": false,
              "description": "The SQL query.",
              "nested_params": []
            },
            {
              "name": "Columns",
              "type": "list",
              "required": false,
              "description": "The column schema from the SQL query result set.",
              "nested_params": [
                {
                  "name": "Name",
                  "type": "string",
                  "required": false,
                  "description": "The name of this column in the underlying data source.",
                  "nested_params": []
                },
                {
                  "name": "Type",
                  "type": "string",
                  "required": false,
                  "description": "The data type of the column.",
                  "nested_params": []
                },
                {
                  "name": "SubType",
                  "type": "string",
                  "required": false,
                  "description": "The sub data type of the column. Sub types are only available for decimal columns that are part of a SPICE dataset.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "S3Source",
          "type": "dict",
          "required": false,
          "description": "A physical table type for as S3 data source.",
          "nested_params": [
            {
              "name": "DataSourceArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) for the data source.",
              "nested_params": []
            },
            {
              "name": "UploadSettings",
              "type": "dict",
              "required": false,
              "description": "Information about the format for the S3 source file or files.",
              "nested_params": [
                {
                  "name": "Format",
                  "type": "string",
                  "required": false,
                  "description": "File format.",
                  "nested_params": []
                },
                {
                  "name": "StartFromRow",
                  "type": "integer",
                  "required": false,
                  "description": "A row number to start reading data from.",
                  "nested_params": []
                },
                {
                  "name": "ContainsHeader",
                  "type": "boolean",
                  "required": false,
                  "description": "Whether the file has a header row, or the files each have a header row.",
                  "nested_params": []
                },
                {
                  "name": "TextQualifier",
                  "type": "string",
                  "required": false,
                  "description": "Text qualifier.",
                  "nested_params": []
                },
                {
                  "name": "Delimiter",
                  "type": "string",
                  "required": false,
                  "description": "The delimiter between values in the file.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "InputColumns",
              "type": "list",
              "required": false,
              "description": "A physical table type for an S3 data source.",
              "nested_params": [
                {
                  "name": "Name",
                  "type": "string",
                  "required": false,
                  "description": "The name of this column in the underlying data source.",
                  "nested_params": []
                },
                {
                  "name": "Type",
                  "type": "string",
                  "required": false,
                  "description": "The data type of the column.",
                  "nested_params": []
                },
                {
                  "name": "SubType",
                  "type": "string",
                  "required": false,
                  "description": "The sub data type of the column. Sub types are only available for decimal columns that are part of a SPICE dataset.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "LogicalTableMap",
      "type": "dict",
      "required": true,
      "description": "Configures the combination and transformation of the data from the physical tables. (string) --- An identifier for the logical table that is defined in the dataset (dict) --- A logical table is a unit that joins and that data transformations operate on. A logical table has a source, which can be either a physical table or result of a join. When a logical table points to a physical table, the logical table acts as a mutable copy of that physical table through transform operations. A display name for the logical table. DataTransforms (list) --- Transform operations that act on this logical table. For this structure to be valid, only one of the attributes can be non-null. (dict) --- A data transformation on a logical table. This is a variant type structure. ProjectOperation (dict) --- An operation that projects columns. Operations that come after a projection can only refer to projected columns. Projected columns. (string) --- FilterOperation (dict) --- An operation that filters rows based on some condition. An expression that must evaluate to a Boolean value. Rows for which the expression evaluates to true are kept in the dataset. CreateColumnsOperation (dict) --- An operation that creates calculated columns. Columns created in one such operation form a lexical closure. Calculated columns to create. (dict) --- A calculated column for a dataset. Column name. A unique ID to identify a calculated column. During a dataset update, if the column ID of a calculated column matches that of an existing calculated column, Amazon QuickSight preserves the existing calculated column. An expression that defines the calculated column. RenameColumnOperation (dict) --- An operation that renames a column. The name of the column to be renamed. The new name for the column. CastColumnTypeOperation (dict) --- A transform operation that casts a column to a different type. New column data type. SubType (string) --- The sub data type of the new column. Sub types are only available for decimal columns that are part of a SPICE dataset. Format (string) --- When casting a column from string to datetime type, you can supply a string in a format supported by Amazon QuickSight to denote the source data format. TagColumnOperation (dict) --- An operation that tags a column with additional information. The column that this operation acts on. The dataset column tag, currently only used for geospatial type tagging. (dict) --- A tag for a column in a TagColumnOperation structure. ColumnGeographicRole (string) --- A geospatial role for a column. ColumnDescription (dict) --- A description for a column. Text (string) --- The text of a description for a column. UntagColumnOperation (dict) --- A transform operation that removes tags associated with a column. The column tags to remove from this column. (string) --- OverrideDatasetParameterOperation (dict) --- A transform operation that overrides the dataset parameter values that are defined in another dataset. The name of the parameter to be overridden with different values. NewParameterName (string) --- The new name for the parameter. NewDefaultValues (dict) --- The new default values for the parameter. StringStaticValues (list) --- A list of static default values for a given string parameter. (string) --- The default value for the string parameter. DecimalStaticValues (list) --- A list of static default values for a given decimal parameter. (float) --- The default value for the decimal parameter. DateTimeStaticValues (list) --- A list of static default values for a given date time parameter. (datetime) --- The default value for the date time parameter. IntegerStaticValues (list) --- A list of static default values for a given integer parameter. (integer) --- The default value for the integer parameter. Source of this logical table. JoinInstruction (dict) --- Specifies the result of a join of two logical tables. The operand on the left side of a join. The operand on the right side of a join. LeftJoinKeyProperties (dict) --- Join key properties of the left operand. UniqueKey (boolean) --- A value that indicates that a row in a table is uniquely identified by the columns in a join key. This is used by Amazon QuickSight to optimize query performance. RightJoinKeyProperties (dict) --- Join key properties of the right operand. The type of join that it is. The join instructions provided in the ON clause of a join. PhysicalTableId (string) --- Physical table ID. DataSetArn (string) --- The Amazon Resource Number (ARN) of the parent dataset.",
      "nested_params": [
        {
          "name": "Alias",
          "type": "string",
          "required": false,
          "description": "A display name for the logical table.",
          "nested_params": []
        },
        {
          "name": "DataTransforms",
          "type": "list",
          "required": false,
          "description": "Transform operations that act on this logical table. For this structure to be valid, only one of the attributes can be non-null.",
          "nested_params": [
            {
              "name": "ProjectOperation",
              "type": "dict",
              "required": false,
              "description": "An operation that projects columns. Operations that come after a projection can only refer to projected columns.",
              "nested_params": [
                {
                  "name": "ProjectedColumns",
                  "type": "list",
                  "required": false,
                  "description": "Projected columns.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "FilterOperation",
              "type": "dict",
              "required": false,
              "description": "An operation that filters rows based on some condition.",
              "nested_params": [
                {
                  "name": "ConditionExpression",
                  "type": "string",
                  "required": false,
                  "description": "An expression that must evaluate to a Boolean value. Rows for which the expression evaluates to true are kept in the dataset.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "CreateColumnsOperation",
              "type": "dict",
              "required": false,
              "description": "An operation that creates calculated columns. Columns created in one such operation form a lexical closure.",
              "nested_params": [
                {
                  "name": "Columns",
                  "type": "list",
                  "required": false,
                  "description": "Calculated columns to create.",
                  "nested_params": [
                    {
                      "name": "ColumnName",
                      "type": "string",
                      "required": false,
                      "description": "Column name.",
                      "nested_params": []
                    },
                    {
                      "name": "ColumnId",
                      "type": "string",
                      "required": false,
                      "description": "A unique ID to identify a calculated column. During a dataset update, if the column ID of a calculated column matches that of an existing calculated column, Amazon QuickSight preserves the existing calculated column.",
                      "nested_params": []
                    },
                    {
                      "name": "Expression",
                      "type": "string",
                      "required": false,
                      "description": "An expression that defines the calculated column.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "RenameColumnOperation",
              "type": "dict",
              "required": false,
              "description": "An operation that renames a column.",
              "nested_params": [
                {
                  "name": "ColumnName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the column to be renamed.",
                  "nested_params": []
                },
                {
                  "name": "NewColumnName",
                  "type": "string",
                  "required": false,
                  "description": "The new name for the column.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "CastColumnTypeOperation",
              "type": "dict",
              "required": false,
              "description": "A transform operation that casts a column to a different type.",
              "nested_params": [
                {
                  "name": "ColumnName",
                  "type": "string",
                  "required": false,
                  "description": "Column name.",
                  "nested_params": []
                },
                {
                  "name": "NewColumnType",
                  "type": "string",
                  "required": false,
                  "description": "New column data type.",
                  "nested_params": []
                },
                {
                  "name": "SubType",
                  "type": "string",
                  "required": false,
                  "description": "The sub data type of the new column. Sub types are only available for decimal columns that are part of a SPICE dataset.",
                  "nested_params": []
                },
                {
                  "name": "Format",
                  "type": "string",
                  "required": false,
                  "description": "When casting a column from string to datetime type, you can supply a string in a format supported by Amazon QuickSight to denote the source data format.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "TagColumnOperation",
              "type": "dict",
              "required": false,
              "description": "An operation that tags a column with additional information.",
              "nested_params": [
                {
                  "name": "ColumnName",
                  "type": "string",
                  "required": false,
                  "description": "The column that this operation acts on.",
                  "nested_params": []
                },
                {
                  "name": "Tags",
                  "type": "list",
                  "required": false,
                  "description": "The dataset column tag, currently only used for geospatial type tagging.",
                  "nested_params": [
                    {
                      "name": "ColumnGeographicRole",
                      "type": "string",
                      "required": false,
                      "description": "A geospatial role for a column.",
                      "nested_params": []
                    },
                    {
                      "name": "ColumnDescription",
                      "type": "dict",
                      "required": false,
                      "description": "A description for a column.",
                      "nested_params": [
                        {
                          "name": "Text",
                          "type": "string",
                          "required": false,
                          "description": "The text of a description for a column.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "UntagColumnOperation",
              "type": "dict",
              "required": false,
              "description": "A transform operation that removes tags associated with a column.",
              "nested_params": [
                {
                  "name": "ColumnName",
                  "type": "string",
                  "required": false,
                  "description": "The column that this operation acts on.",
                  "nested_params": []
                },
                {
                  "name": "TagNames",
                  "type": "list",
                  "required": false,
                  "description": "The column tags to remove from this column.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "OverrideDatasetParameterOperation",
              "type": "dict",
              "required": false,
              "description": "A transform operation that overrides the dataset parameter values that are defined in another dataset.",
              "nested_params": [
                {
                  "name": "ParameterName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the parameter to be overridden with different values.",
                  "nested_params": []
                },
                {
                  "name": "NewParameterName",
                  "type": "string",
                  "required": false,
                  "description": "The new name for the parameter.",
                  "nested_params": []
                },
                {
                  "name": "NewDefaultValues",
                  "type": "dict",
                  "required": false,
                  "description": "The new default values for the parameter.",
                  "nested_params": [
                    {
                      "name": "StringStaticValues",
                      "type": "list",
                      "required": false,
                      "description": "A list of static default values for a given string parameter.",
                      "nested_params": []
                    },
                    {
                      "name": "DecimalStaticValues",
                      "type": "list",
                      "required": false,
                      "description": "A list of static default values for a given decimal parameter.",
                      "nested_params": []
                    },
                    {
                      "name": "DateTimeStaticValues",
                      "type": "list",
                      "required": false,
                      "description": "A list of static default values for a given date time parameter.",
                      "nested_params": []
                    },
                    {
                      "name": "IntegerStaticValues",
                      "type": "list",
                      "required": false,
                      "description": "A list of static default values for a given integer parameter.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Source",
          "type": "dict",
          "required": false,
          "description": "Source of this logical table.",
          "nested_params": [
            {
              "name": "JoinInstruction",
              "type": "dict",
              "required": false,
              "description": "Specifies the result of a join of two logical tables.",
              "nested_params": [
                {
                  "name": "LeftOperand",
                  "type": "string",
                  "required": false,
                  "description": "The operand on the left side of a join.",
                  "nested_params": []
                },
                {
                  "name": "RightOperand",
                  "type": "string",
                  "required": false,
                  "description": "The operand on the right side of a join.",
                  "nested_params": []
                },
                {
                  "name": "LeftJoinKeyProperties",
                  "type": "dict",
                  "required": false,
                  "description": "Join key properties of the left operand.",
                  "nested_params": [
                    {
                      "name": "UniqueKey",
                      "type": "boolean",
                      "required": false,
                      "description": "A value that indicates that a row in a table is uniquely identified by the columns in a join key. This is used by Amazon QuickSight to optimize query performance.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "RightJoinKeyProperties",
                  "type": "dict",
                  "required": false,
                  "description": "Join key properties of the right operand.",
                  "nested_params": [
                    {
                      "name": "UniqueKey",
                      "type": "boolean",
                      "required": false,
                      "description": "A value that indicates that a row in a table is uniquely identified by the columns in a join key. This is used by Amazon QuickSight to optimize query performance.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "Type",
                  "type": "string",
                  "required": false,
                  "description": "The type of join that it is.",
                  "nested_params": []
                },
                {
                  "name": "OnClause",
                  "type": "string",
                  "required": false,
                  "description": "The join instructions provided in the ON clause of a join.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "PhysicalTableId",
              "type": "string",
              "required": false,
              "description": "Physical table ID.",
              "nested_params": []
            },
            {
              "name": "DataSetArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Number (ARN) of the parent dataset.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "ImportMode",
      "type": "string",
      "required": true,
      "description": "Indicates whether you want to import the data into SPICE.",
      "nested_params": []
    },
    {
      "name": "ColumnGroups",
      "type": "list",
      "required": true,
      "description": "Groupings of columns that work together in certain Amazon QuickSight features. Currently, only geospatial hierarchy is supported. (dict) --- Groupings of columns that work together in certain Amazon QuickSight features. This is a variant type structure. For this structure to be valid, only one of the attributes can be non-null. GeoSpatialColumnGroup (dict) --- Geospatial column group that denotes a hierarchy. A display name for the hierarchy. CountryCode (string) --- Country code. Columns in this hierarchy. (string) ---",
      "nested_params": [
        {
          "name": "GeoSpatialColumnGroup",
          "type": "dict",
          "required": false,
          "description": "Geospatial column group that denotes a hierarchy.",
          "nested_params": [
            {
              "name": "Name",
              "type": "string",
              "required": false,
              "description": "A display name for the hierarchy.",
              "nested_params": []
            },
            {
              "name": "CountryCode",
              "type": "string",
              "required": false,
              "description": "Country code.",
              "nested_params": []
            },
            {
              "name": "Columns",
              "type": "list",
              "required": false,
              "description": "Columns in this hierarchy.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "FieldFolders",
      "type": "dict",
      "required": false,
      "description": "The folder that contains fields and nested subfolders for your dataset. (string) --- (dict) --- A FieldFolder element is a folder that contains fields and nested subfolders. description (string) --- The description for a field folder. columns (list) --- A folder has a list of columns. A column can only be in one folder. (string) ---",
      "nested_params": [
        {
          "name": "description",
          "type": "string",
          "required": false,
          "description": "The description for a field folder.",
          "nested_params": []
        },
        {
          "name": "columns",
          "type": "list",
          "required": false,
          "description": "A folder has a list of columns. A column can only be in one folder.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Permissions",
      "type": "list",
      "required": true,
      "description": "A list of resource permissions on the dataset. (dict) --- Permission for the resource. The Amazon Resource Name (ARN) of the principal. This can be one of the following: The ARN of an Amazon QuickSight user or group associated with a data source or dataset. (This is common.) The ARN of an Amazon QuickSight user, group, or namespace associated with an analysis, dashboard, template, or theme. (This is common.) The ARN of an Amazon Web Services account root: This is an IAM ARN rather than a QuickSight ARN. Use this option only to share resources (templates) across Amazon Web Services accounts. (This is less common.) The IAM action to grant or revoke permissions on. (string) ---",
      "nested_params": [
        {
          "name": "Principal",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the principal. This can be one of the following:",
          "nested_params": []
        },
        {
          "name": "Actions",
          "type": "list",
          "required": false,
          "description": "The IAM action to grant or revoke permissions on.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "RowLevelPermissionDataSet",
      "type": "dict",
      "required": true,
      "description": "The row-level security configuration for the data that you want to create. Namespace (string) --- The namespace associated with the dataset that contains permissions for RLS. The Amazon Resource Name (ARN) of the dataset that contains permissions for RLS. The type of permissions to use when interpreting the permissions for RLS. DENY_ACCESS is included for backward compatibility only. FormatVersion (string) --- The user or group rules associated with the dataset that contains permissions for RLS. By default, FormatVersion is VERSION_1. When FormatVersion is VERSION_1, UserName and GroupName are required. When FormatVersion is VERSION_2, UserARN and GroupARN are required, and Namespace must not exist. Status (string) --- The status of the row-level security permission dataset. If enabled, the status is ENABLED. If disabled, the status is DISABLED.",
      "nested_params": [
        {
          "name": "Namespace",
          "type": "string",
          "required": false,
          "description": "The namespace associated with the dataset that contains permissions for RLS.",
          "nested_params": []
        },
        {
          "name": "Arn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the dataset that contains permissions for RLS.",
          "nested_params": []
        },
        {
          "name": "PermissionPolicy",
          "type": "string",
          "required": false,
          "description": "The type of permissions to use when interpreting the permissions for RLS. DENY_ACCESS is included for backward compatibility only.",
          "nested_params": []
        },
        {
          "name": "FormatVersion",
          "type": "string",
          "required": false,
          "description": "The user or group rules associated with the dataset that contains permissions for RLS. By default, FormatVersion is VERSION_1. When FormatVersion is VERSION_1, UserName and GroupName are required. When FormatVersion is VERSION_2, UserARN and GroupARN are required, and Namespace must not exist.",
          "nested_params": []
        },
        {
          "name": "Status",
          "type": "string",
          "required": false,
          "description": "The status of the row-level security permission dataset. If enabled, the status is ENABLED. If disabled, the status is DISABLED.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "RowLevelPermissionTagConfiguration",
      "type": "dict",
      "required": true,
      "description": "The configuration of tags on a dataset to set row-level security. Row-level security tags are currently supported for anonymous embedding only. Status (string) --- The status of row-level security tags. If enabled, the status is ENABLED. If disabled, the status is DISABLED. A set of rules associated with row-level security, such as the tag names and columns that they are assigned to. (dict) --- A set of rules associated with a tag. The unique key for a tag. The column name that a tag key is assigned to. TagMultiValueDelimiter (string) --- A string that you want to use to delimit the values when you pass the values at run time. For example, you can delimit the values with a comma. MatchAllValue (string) --- A string that you want to use to filter by all the values in a column in the dataset and don't want to list the values one by one. For example, you can use an asterisk as your match all value. TagRuleConfigurations (list) --- A list of tag configuration rules to apply to a dataset. All tag configurations have the OR condition. Tags within each tile will be joined (AND). At least one rule in this structure must have all tag values assigned to it to apply Row-level security (RLS) to the dataset. (list) --- (string) ---",
      "nested_params": [
        {
          "name": "Status",
          "type": "string",
          "required": false,
          "description": "The status of row-level security tags. If enabled, the status is ENABLED. If disabled, the status is DISABLED.",
          "nested_params": []
        },
        {
          "name": "TagRules",
          "type": "list",
          "required": false,
          "description": "A set of rules associated with row-level security, such as the tag names and columns that they are assigned to.",
          "nested_params": [
            {
              "name": "TagKey",
              "type": "string",
              "required": false,
              "description": "The unique key for a tag.",
              "nested_params": []
            },
            {
              "name": "ColumnName",
              "type": "string",
              "required": false,
              "description": "The column name that a tag key is assigned to.",
              "nested_params": []
            },
            {
              "name": "TagMultiValueDelimiter",
              "type": "string",
              "required": false,
              "description": "A string that you want to use to delimit the values when you pass the values at run time. For example, you can delimit the values with a comma.",
              "nested_params": []
            },
            {
              "name": "MatchAllValue",
              "type": "string",
              "required": false,
              "description": "A string that you want to use to filter by all the values in a column in the dataset and don't want to list the values one by one. For example, you can use an asterisk as your match all value.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "TagRuleConfigurations",
          "type": "list",
          "required": false,
          "description": "A list of tag configuration rules to apply to a dataset. All tag configurations have the OR condition. Tags within each tile will be joined (AND). At least one rule in this structure must have all tag values assigned to it to apply Row-level security (RLS) to the dataset.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ColumnLevelPermissionRules",
      "type": "list",
      "required": false,
      "description": "A set of one or more definitions of a ``ColumnLevelPermissionRule ``. (dict) --- A rule defined to grant access on one or more restricted columns. Each dataset can have multiple rules. To create a restricted column, you add it to one or more rules. Each rule must contain at least one column and at least one user or group. To be able to see a restricted column, a user or group needs to be added to a rule for that column. Principals (list) --- An array of Amazon Resource Names (ARNs) for Amazon QuickSight users or groups. (string) --- ColumnNames (list) --- An array of column names. (string) ---",
      "nested_params": [
        {
          "name": "Principals",
          "type": "list",
          "required": false,
          "description": "An array of Amazon Resource Names (ARNs) for Amazon QuickSight users or groups.",
          "nested_params": []
        },
        {
          "name": "ColumnNames",
          "type": "list",
          "required": false,
          "description": "An array of column names.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "Contains a map of the key-value pairs for the resource tag or tags assigned to the dataset. (dict) --- The key or keys of the key-value pairs for the resource tag or tags assigned to the resource. Tag key. Tag value.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "Tag key.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "Tag value.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "DataSetUsageConfiguration",
      "type": "dict",
      "required": false,
      "description": "The usage configuration to apply to child datasets that reference this dataset as a source. DisableUseAsDirectQuerySource (boolean) --- An option that controls whether a child dataset of a direct query can use this dataset as a source. DisableUseAsImportedSource (boolean) --- An option that controls whether a child dataset that's stored in QuickSight can use this dataset as a source.",
      "nested_params": [
        {
          "name": "DisableUseAsDirectQuerySource",
          "type": "boolean",
          "required": false,
          "description": "An option that controls whether a child dataset of a direct query can use this dataset as a source.",
          "nested_params": []
        },
        {
          "name": "DisableUseAsImportedSource",
          "type": "boolean",
          "required": false,
          "description": "An option that controls whether a child dataset that's stored in QuickSight can use this dataset as a source.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "DatasetParameters",
      "type": "list",
      "required": true,
      "description": "The parameter declarations of the dataset. (dict) --- A parameter that is created in a dataset. The parameter can be a string, integer, decimal, or datetime data type. StringDatasetParameter (dict) --- A string parameter that is created in the dataset. An identifier for the string parameter that is created in the dataset. The name of the string parameter that is created in the dataset. The value type of the dataset parameter. Valid values are single value or multi value. DefaultValues (dict) --- A list of default values for a given string dataset parameter type. This structure only accepts static values. StaticValues (list) --- A list of static default values for a given string parameter. (string) --- The default value for the string parameter. DecimalDatasetParameter (dict) --- A decimal parameter that is created in the dataset. An identifier for the decimal parameter created in the dataset. The name of the decimal parameter that is created in the dataset. DefaultValues (dict) --- A list of default values for a given decimal parameter. StaticValues (list) --- A list of static default values for a given decimal parameter. (float) --- The default value for the decimal parameter. IntegerDatasetParameter (dict) --- An integer parameter that is created in the dataset. An identifier for the integer parameter created in the dataset. The name of the integer parameter that is created in the dataset. DefaultValues (dict) --- A list of default values for a given integer parameter. StaticValues (list) --- A list of static default values for a given integer parameter. (integer) --- The default value for the integer parameter. DateTimeDatasetParameter (dict) --- A date time parameter that is created in the dataset. An identifier for the parameter that is created in the dataset. The name of the date time parameter that is created in the dataset. TimeGranularity (string) --- The time granularity of the date time parameter. DefaultValues (dict) --- A list of default values for a given date time parameter. StaticValues (list) --- A list of static default values for a given date time parameter. (datetime) --- The default value for the date time parameter.",
      "nested_params": [
        {
          "name": "StringDatasetParameter",
          "type": "dict",
          "required": false,
          "description": "A string parameter that is created in the dataset.",
          "nested_params": [
            {
              "name": "Id",
              "type": "string",
              "required": false,
              "description": "An identifier for the string parameter that is created in the dataset.",
              "nested_params": []
            },
            {
              "name": "Name",
              "type": "string",
              "required": false,
              "description": "The name of the string parameter that is created in the dataset.",
              "nested_params": []
            },
            {
              "name": "ValueType",
              "type": "string",
              "required": false,
              "description": "The value type of the dataset parameter. Valid values are single value or multi value.",
              "nested_params": []
            },
            {
              "name": "DefaultValues",
              "type": "dict",
              "required": false,
              "description": "A list of default values for a given string dataset parameter type. This structure only accepts static values.",
              "nested_params": [
                {
                  "name": "StaticValues",
                  "type": "list",
                  "required": false,
                  "description": "A list of static default values for a given string parameter.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "DecimalDatasetParameter",
          "type": "dict",
          "required": false,
          "description": "A decimal parameter that is created in the dataset.",
          "nested_params": [
            {
              "name": "Id",
              "type": "string",
              "required": false,
              "description": "An identifier for the decimal parameter created in the dataset.",
              "nested_params": []
            },
            {
              "name": "Name",
              "type": "string",
              "required": false,
              "description": "The name of the decimal parameter that is created in the dataset.",
              "nested_params": []
            },
            {
              "name": "ValueType",
              "type": "string",
              "required": false,
              "description": "The value type of the dataset parameter. Valid values are single value or multi value.",
              "nested_params": []
            },
            {
              "name": "DefaultValues",
              "type": "dict",
              "required": false,
              "description": "A list of default values for a given decimal parameter. This structure only accepts static values.",
              "nested_params": [
                {
                  "name": "StaticValues",
                  "type": "list",
                  "required": false,
                  "description": "A list of static default values for a given decimal parameter.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "IntegerDatasetParameter",
          "type": "dict",
          "required": false,
          "description": "An integer parameter that is created in the dataset.",
          "nested_params": [
            {
              "name": "Id",
              "type": "string",
              "required": false,
              "description": "An identifier for the integer parameter created in the dataset.",
              "nested_params": []
            },
            {
              "name": "Name",
              "type": "string",
              "required": false,
              "description": "The name of the integer parameter that is created in the dataset.",
              "nested_params": []
            },
            {
              "name": "ValueType",
              "type": "string",
              "required": false,
              "description": "The value type of the dataset parameter. Valid values are single value or multi value.",
              "nested_params": []
            },
            {
              "name": "DefaultValues",
              "type": "dict",
              "required": false,
              "description": "A list of default values for a given integer parameter. This structure only accepts static values.",
              "nested_params": [
                {
                  "name": "StaticValues",
                  "type": "list",
                  "required": false,
                  "description": "A list of static default values for a given integer parameter.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "DateTimeDatasetParameter",
          "type": "dict",
          "required": false,
          "description": "A date time parameter that is created in the dataset.",
          "nested_params": [
            {
              "name": "Id",
              "type": "string",
              "required": false,
              "description": "An identifier for the parameter that is created in the dataset.",
              "nested_params": []
            },
            {
              "name": "Name",
              "type": "string",
              "required": false,
              "description": "The name of the date time parameter that is created in the dataset.",
              "nested_params": []
            },
            {
              "name": "ValueType",
              "type": "string",
              "required": false,
              "description": "The value type of the dataset parameter. Valid values are single value or multi value.",
              "nested_params": []
            },
            {
              "name": "TimeGranularity",
              "type": "string",
              "required": false,
              "description": "The time granularity of the date time parameter.",
              "nested_params": []
            },
            {
              "name": "DefaultValues",
              "type": "dict",
              "required": false,
              "description": "A list of default values for a given date time parameter. This structure only accepts static values.",
              "nested_params": [
                {
                  "name": "StaticValues",
                  "type": "list",
                  "required": false,
                  "description": "A list of static default values for a given date time parameter.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "FolderArns",
      "type": "list",
      "required": false,
      "description": "When you create the dataset, Amazon QuickSight adds the dataset to these folders. (string) ---",
      "nested_params": []
    },
    {
      "name": "PerformanceConfiguration",
      "type": "dict",
      "required": true,
      "description": "The configuration for the performance optimization of the dataset that contains a UniqueKey configuration. UniqueKeys (list) --- A UniqueKey configuration. (dict) --- A UniqueKey configuration that references a dataset column. The name of the column that is referenced in the UniqueKey configuration. (string) ---",
      "nested_params": [
        {
          "name": "UniqueKeys",
          "type": "list",
          "required": false,
          "description": "A UniqueKey configuration.",
          "nested_params": [
            {
              "name": "ColumnNames",
              "type": "list",
              "required": false,
              "description": "The name of the column that is referenced in the UniqueKey configuration.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "UseAs",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Arn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the dataset.",
          "nested_items": []
        },
        {
          "name": "DataSetId",
          "type": "string",
          "description": "The ID for the dataset that you want to create. This ID is unique per Amazon Web Services Region for each Amazon Web Services account.",
          "nested_items": []
        },
        {
          "name": "IngestionArn",
          "type": "string",
          "description": "The ARN for the ingestion, which is triggered as a result of dataset creation if the import mode is SPICE.",
          "nested_items": []
        },
        {
          "name": "IngestionId",
          "type": "string",
          "description": "The ID of the ingestion, which is triggered as a result of dataset creation if the import mode is SPICE.",
          "nested_items": []
        },
        {
          "name": "RequestId",
          "type": "string",
          "description": "The Amazon Web Services request ID for this operation.",
          "nested_items": []
        },
        {
          "name": "Status",
          "type": "integer",
          "description": "The HTTP status of the request.",
          "nested_items": []
        }
      ]
    }
  ]
}