{
  "method_name": "create_namespace",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/quicksight/client/create_namespace.html",
  "description": "(Enterprise edition only) Creates a new namespace for you to use with Amazon QuickSight. A namespace allows you to isolate the Amazon QuickSight users and groups that are registered for that namespace. Users that access the namespace can share assets only with other users or groups in the same namespace. They can't see users and groups in other namespaces. You can create a namespace after your Amazon Web Services account is subscribed to Amazon QuickSight. The namespace must be unique within the Amazon Web Services account. By default, there is a limit of 100 namespaces per Amazon Web Services account. To increase your limit, create a ticket with Amazon Web ServicesSupport.",
  "parameters": [
    {
      "name": "AwsAccountId",
      "type": "string",
      "required": true,
      "description": "The ID for the Amazon Web Services account that you want to create the Amazon QuickSight namespace in.",
      "nested_params": []
    },
    {
      "name": "Namespace",
      "type": "string",
      "required": true,
      "description": "The name that you want to use to describe the new namespace.",
      "nested_params": []
    },
    {
      "name": "IdentityStore",
      "type": "string",
      "required": true,
      "description": "Specifies the type of your user identity directory. Currently, this supports users with an identity type of QUICKSIGHT.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "The tags that you want to associate with the namespace that you're creating. (dict) --- The key or keys of the key-value pairs for the resource tag or tags assigned to the resource. Tag key. Tag value.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "Tag key.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "Tag value.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Arn",
          "type": "string",
          "description": "The ARN of the Amazon QuickSight namespace you created.",
          "nested_items": []
        },
        {
          "name": "Name",
          "type": "string",
          "description": "The name of the new namespace that you created.",
          "nested_items": []
        },
        {
          "name": "CapacityRegion",
          "type": "string",
          "description": "The Amazon Web Services Region; that you want to use for the free SPICE capacity for the new namespace. This is set to the region that you run CreateNamespace in.",
          "nested_items": []
        },
        {
          "name": "CreationStatus",
          "type": "string",
          "description": "The status of the creation of the namespace. This is an asynchronous process. A status of CREATED means that your namespace is ready to use. If an error occurs, it indicates if the process is retryable or non-retryable. In the case of a non-retryable error, refer to the error message for follow-up tasks.",
          "nested_items": []
        },
        {
          "name": "IdentityStore",
          "type": "string",
          "description": "Specifies the type of your user identity directory. Currently, this supports users with an identity type of QUICKSIGHT.",
          "nested_items": []
        },
        {
          "name": "RequestId",
          "type": "string",
          "description": "The Amazon Web Services request ID for this operation.",
          "nested_items": []
        },
        {
          "name": "Status",
          "type": "integer",
          "description": "The HTTP status of the request.",
          "nested_items": []
        }
      ]
    }
  ]
}