{
  "method_name": "create_data_source",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/quicksight/client/create_data_source.html",
  "description": "Creates a data source.",
  "parameters": [
    {
      "name": "AwsAccountId",
      "type": "string",
      "required": true,
      "description": "The Amazon Web Services account ID.",
      "nested_params": []
    },
    {
      "name": "DataSourceId",
      "type": "string",
      "required": true,
      "description": "An ID for the data source. This ID is unique per Amazon Web Services Region for each Amazon Web Services account.",
      "nested_params": []
    },
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "A display name for the data source.",
      "nested_params": []
    },
    {
      "name": "Type",
      "type": "string",
      "required": true,
      "description": "The type of the data source. To return a list of all data sources, use ListDataSources. Use AMAZON_ELASTICSEARCH for Amazon OpenSearch Service.",
      "nested_params": []
    },
    {
      "name": "DataSourceParameters",
      "type": "dict",
      "required": true,
      "description": "The parameters that Amazon QuickSight uses to connect to your underlying source. AmazonElasticsearchParameters (dict) --- The parameters for OpenSearch. The OpenSearch domain. AthenaParameters (dict) --- The parameters for Amazon Athena. WorkGroup (string) --- The workgroup that Amazon Athena uses. RoleArn (string) --- Use the RoleArn structure to override an account-wide role for a specific Athena data source. For example, say an account administrator has turned off all Athena access with an account-wide role. The administrator can then use RoleArn to bypass the account-wide role and allow Athena access for the single Athena data source that is specified in the structure, even if the account-wide role forbidding Athena access is still active. IdentityCenterConfiguration (dict) --- An optional parameter that configures IAM Identity Center authentication to grant Amazon QuickSight access to your workgroup. This parameter can only be specified if your Amazon QuickSight account is configured with IAM Identity Center. EnableIdentityPropagation (boolean) --- A Boolean option that controls whether Trusted Identity Propagation should be used. AuroraParameters (dict) --- The parameters for Amazon Aurora MySQL. Host. Port. Database. AuroraPostgreSqlParameters (dict) --- The parameters for Amazon Aurora. The Amazon Aurora PostgreSQL-Compatible host to connect to. The port that Amazon Aurora PostgreSQL is listening on. The Amazon Aurora PostgreSQL database to connect to. AwsIotAnalyticsParameters (dict) --- The parameters for IoT Analytics. Dataset name. JiraParameters (dict) --- The parameters for Jira. The base URL of the Jira site. MariaDbParameters (dict) --- The parameters for MariaDB. MySqlParameters (dict) --- The parameters for MySQL. OracleParameters (dict) --- The parameters for Oracle. An Oracle host. The port. The database. UseServiceName (boolean) --- A Boolean value that indicates whether the Database uses a service name or an SID. If this value is left blank, the default value is SID. If this value is set to false, the value is SID. PostgreSqlParameters (dict) --- The parameters for PostgreSQL. PrestoParameters (dict) --- The parameters for Presto. Catalog. RdsParameters (dict) --- The parameters for Amazon RDS. Instance ID. RedshiftParameters (dict) --- The parameters for Amazon Redshift. Host (string) --- Host. This field can be blank if ClusterId is provided. Port (integer) --- Port. This field can be blank if the ClusterId is provided. ClusterId (string) --- Cluster ID. This field can be blank if the Host and Port are provided. IAMParameters (dict) --- An optional parameter that uses IAM authentication to grant Amazon QuickSight access to your cluster. This parameter can be used instead of DataSourceCredentials. Use the RoleArn structure to allow Amazon QuickSight to call redshift:GetClusterCredentials on your cluster. The calling principal must have iam:PassRole access to pass the role to Amazon QuickSight. The role's trust policy must allow the Amazon QuickSight service principal to assume the role. DatabaseUser (string) --- The user whose permissions and group memberships will be used by Amazon QuickSight to access the cluster. If this user already exists in your database, Amazon QuickSight is granted the same permissions that the user has. If the user doesn't exist, set the value of AutoCreateDatabaseUser to True to create a new user with PUBLIC permissions. DatabaseGroups (list) --- A list of groups whose permissions will be granted to Amazon QuickSight to access the cluster. These permissions are combined with the permissions granted to Amazon QuickSight by the DatabaseUser. If you choose to include this parameter, the RoleArn must grant access to redshift:JoinGroup. (string) --- AutoCreateDatabaseUser (boolean) --- Automatically creates a database user. If your database doesn't have a DatabaseUser, set this parameter to True. If there is no DatabaseUser, Amazon QuickSight can't connect to your cluster. The RoleArn that you use for this operation must grant access to redshift:CreateClusterUser to successfully create the user. IdentityCenterConfiguration (dict) --- An optional parameter that configures IAM Identity Center authentication to grant Amazon QuickSight access to your cluster. S3Parameters (dict) --- The parameters for S3. Location of the Amazon S3 manifest file. This is NULL if the manifest file was uploaded into Amazon QuickSight. Amazon S3 bucket. Amazon S3 key that identifies an object. RoleArn (string) --- Use the RoleArn structure to override an account-wide role for a specific S3 data source. For example, say an account administrator has turned off all S3 access with an account-wide role. The administrator can then use RoleArn to bypass the account-wide role and allow S3 access for the single S3 data source that is specified in the structure, even if the account-wide role forbidding S3 access is still active. ServiceNowParameters (dict) --- The parameters for ServiceNow. URL of the base site. SnowflakeParameters (dict) --- The parameters for Snowflake. Warehouse. AuthenticationType (string) --- The authentication type that you want to use for your connection. This parameter accepts OAuth and non-OAuth authentication types. DatabaseAccessControlRole (string) --- The database access control role. OAuthParameters (dict) --- An object that contains information needed to create a data source connection between an Amazon QuickSight account and Snowflake. The token endpoint URL of the identity provider. OAuthScope (string) --- The OAuth scope. IdentityProviderVpcConnectionProperties (dict) --- VPC connection properties. The Amazon Resource Name (ARN) for the VPC connection. IdentityProviderResourceUri (string) --- The resource uri of the identity provider. SparkParameters (dict) --- The parameters for Spark. SqlServerParameters (dict) --- The parameters for SQL Server. TeradataParameters (dict) --- The parameters for Teradata. TwitterParameters (dict) --- The parameters for Twitter. Twitter query string. Maximum number of rows to query Twitter. AmazonOpenSearchParameters (dict) --- The parameters for OpenSearch. ExasolParameters (dict) --- The parameters for Exasol. The hostname or IP address of the Exasol data source. The port for the Exasol data source. DatabricksParameters (dict) --- The parameters that are required to connect to a Databricks data source. The host name of the Databricks data source. The port for the Databricks data source. The HTTP path of the Databricks data source. StarburstParameters (dict) --- The parameters that are required to connect to a Starburst data source. The host name of the Starburst data source. The port for the Starburst data source. The catalog name for the Starburst data source. ProductType (string) --- The product type for the Starburst data source. OAuthParameters (dict) --- An object that contains information needed to create a data source connection between an Amazon QuickSight account and Starburst. TrinoParameters (dict) --- The parameters that are required to connect to a Trino data source. The host name of the Trino data source. The port for the Trino data source. The catalog name for the Trino data source. BigQueryParameters (dict) --- The parameters that are required to connect to a Google BigQuery data source. The Google Cloud Platform project ID where your datasource was created. DataSetRegion (string) --- The storage location where you create a Google BigQuery data source.",
      "nested_params": [
        {
          "name": "AmazonElasticsearchParameters",
          "type": "dict",
          "required": false,
          "description": "The parameters for OpenSearch.",
          "nested_params": [
            {
              "name": "Domain",
              "type": "string",
              "required": false,
              "description": "The OpenSearch domain.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "AthenaParameters",
          "type": "dict",
          "required": false,
          "description": "The parameters for Amazon Athena.",
          "nested_params": [
            {
              "name": "WorkGroup",
              "type": "string",
              "required": false,
              "description": "The workgroup that Amazon Athena uses.",
              "nested_params": []
            },
            {
              "name": "RoleArn",
              "type": "string",
              "required": false,
              "description": "Use the RoleArn structure to override an account-wide role for a specific Athena data source. For example, say an account administrator has turned off all Athena access with an account-wide role. The administrator can then use RoleArn to bypass the account-wide role and allow Athena access for the single Athena data source that is specified in the structure, even if the account-wide role forbidding Athena access is still active.",
              "nested_params": []
            },
            {
              "name": "IdentityCenterConfiguration",
              "type": "dict",
              "required": false,
              "description": "An optional parameter that configures IAM Identity Center authentication to grant Amazon QuickSight access to your workgroup. This parameter can only be specified if your Amazon QuickSight account is configured with IAM Identity Center.",
              "nested_params": [
                {
                  "name": "EnableIdentityPropagation",
                  "type": "boolean",
                  "required": false,
                  "description": "A Boolean option that controls whether Trusted Identity Propagation should be used.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "AuroraParameters",
          "type": "dict",
          "required": false,
          "description": "The parameters for Amazon Aurora MySQL.",
          "nested_params": [
            {
              "name": "Host",
              "type": "string",
              "required": false,
              "description": "Host.",
              "nested_params": []
            },
            {
              "name": "Port",
              "type": "integer",
              "required": false,
              "description": "Port.",
              "nested_params": []
            },
            {
              "name": "Database",
              "type": "string",
              "required": false,
              "description": "Database.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "AuroraPostgreSqlParameters",
          "type": "dict",
          "required": false,
          "description": "The parameters for Amazon Aurora.",
          "nested_params": [
            {
              "name": "Host",
              "type": "string",
              "required": false,
              "description": "The Amazon Aurora PostgreSQL-Compatible host to connect to.",
              "nested_params": []
            },
            {
              "name": "Port",
              "type": "integer",
              "required": false,
              "description": "The port that Amazon Aurora PostgreSQL is listening on.",
              "nested_params": []
            },
            {
              "name": "Database",
              "type": "string",
              "required": false,
              "description": "The Amazon Aurora PostgreSQL database to connect to.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "AwsIotAnalyticsParameters",
          "type": "dict",
          "required": false,
          "description": "The parameters for IoT Analytics.",
          "nested_params": [
            {
              "name": "DataSetName",
              "type": "string",
              "required": false,
              "description": "Dataset name.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "JiraParameters",
          "type": "dict",
          "required": false,
          "description": "The parameters for Jira.",
          "nested_params": [
            {
              "name": "SiteBaseUrl",
              "type": "string",
              "required": false,
              "description": "The base URL of the Jira site.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "MariaDbParameters",
          "type": "dict",
          "required": false,
          "description": "The parameters for MariaDB.",
          "nested_params": [
            {
              "name": "Host",
              "type": "string",
              "required": false,
              "description": "Host.",
              "nested_params": []
            },
            {
              "name": "Port",
              "type": "integer",
              "required": false,
              "description": "Port.",
              "nested_params": []
            },
            {
              "name": "Database",
              "type": "string",
              "required": false,
              "description": "Database.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "MySqlParameters",
          "type": "dict",
          "required": false,
          "description": "The parameters for MySQL.",
          "nested_params": [
            {
              "name": "Host",
              "type": "string",
              "required": false,
              "description": "Host.",
              "nested_params": []
            },
            {
              "name": "Port",
              "type": "integer",
              "required": false,
              "description": "Port.",
              "nested_params": []
            },
            {
              "name": "Database",
              "type": "string",
              "required": false,
              "description": "Database.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "OracleParameters",
          "type": "dict",
          "required": false,
          "description": "The parameters for Oracle.",
          "nested_params": [
            {
              "name": "Host",
              "type": "string",
              "required": false,
              "description": "An Oracle host.",
              "nested_params": []
            },
            {
              "name": "Port",
              "type": "integer",
              "required": false,
              "description": "The port.",
              "nested_params": []
            },
            {
              "name": "Database",
              "type": "string",
              "required": false,
              "description": "The database.",
              "nested_params": []
            },
            {
              "name": "UseServiceName",
              "type": "boolean",
              "required": false,
              "description": "A Boolean value that indicates whether the Database uses a service name or an SID. If this value is left blank, the default value is SID. If this value is set to false, the value is SID.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "PostgreSqlParameters",
          "type": "dict",
          "required": false,
          "description": "The parameters for PostgreSQL.",
          "nested_params": [
            {
              "name": "Host",
              "type": "string",
              "required": false,
              "description": "Host.",
              "nested_params": []
            },
            {
              "name": "Port",
              "type": "integer",
              "required": false,
              "description": "Port.",
              "nested_params": []
            },
            {
              "name": "Database",
              "type": "string",
              "required": false,
              "description": "Database.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "PrestoParameters",
          "type": "dict",
          "required": false,
          "description": "The parameters for Presto.",
          "nested_params": [
            {
              "name": "Host",
              "type": "string",
              "required": false,
              "description": "Host.",
              "nested_params": []
            },
            {
              "name": "Port",
              "type": "integer",
              "required": false,
              "description": "Port.",
              "nested_params": []
            },
            {
              "name": "Catalog",
              "type": "string",
              "required": false,
              "description": "Catalog.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "RdsParameters",
          "type": "dict",
          "required": false,
          "description": "The parameters for Amazon RDS.",
          "nested_params": [
            {
              "name": "InstanceId",
              "type": "string",
              "required": false,
              "description": "Instance ID.",
              "nested_params": []
            },
            {
              "name": "Database",
              "type": "string",
              "required": false,
              "description": "Database.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "RedshiftParameters",
          "type": "dict",
          "required": false,
          "description": "The parameters for Amazon Redshift.",
          "nested_params": [
            {
              "name": "Host",
              "type": "string",
              "required": false,
              "description": "Host. This field can be blank if ClusterId is provided.",
              "nested_params": []
            },
            {
              "name": "Port",
              "type": "integer",
              "required": false,
              "description": "Port. This field can be blank if the ClusterId is provided.",
              "nested_params": []
            },
            {
              "name": "Database",
              "type": "string",
              "required": false,
              "description": "Database.",
              "nested_params": []
            },
            {
              "name": "ClusterId",
              "type": "string",
              "required": false,
              "description": "Cluster ID. This field can be blank if the Host and Port are provided.",
              "nested_params": []
            },
            {
              "name": "IAMParameters",
              "type": "dict",
              "required": false,
              "description": "An optional parameter that uses IAM authentication to grant Amazon QuickSight access to your cluster. This parameter can be used instead of DataSourceCredentials.",
              "nested_params": [
                {
                  "name": "RoleArn",
                  "type": "string",
                  "required": false,
                  "description": "Use the RoleArn structure to allow Amazon QuickSight to call redshift:GetClusterCredentials on your cluster. The calling principal must have iam:PassRole access to pass the role to Amazon QuickSight. The role's trust policy must allow the Amazon QuickSight service principal to assume the role.",
                  "nested_params": []
                },
                {
                  "name": "DatabaseUser",
                  "type": "string",
                  "required": false,
                  "description": "The user whose permissions and group memberships will be used by Amazon QuickSight to access the cluster. If this user already exists in your database, Amazon QuickSight is granted the same permissions that the user has. If the user doesn't exist, set the value of AutoCreateDatabaseUser to True to create a new user with PUBLIC permissions.",
                  "nested_params": []
                },
                {
                  "name": "DatabaseGroups",
                  "type": "list",
                  "required": false,
                  "description": "A list of groups whose permissions will be granted to Amazon QuickSight to access the cluster. These permissions are combined with the permissions granted to Amazon QuickSight by the DatabaseUser. If you choose to include this parameter, the RoleArn must grant access to redshift:JoinGroup.",
                  "nested_params": []
                },
                {
                  "name": "AutoCreateDatabaseUser",
                  "type": "boolean",
                  "required": false,
                  "description": "Automatically creates a database user. If your database doesn't have a DatabaseUser, set this parameter to True. If there is no DatabaseUser, Amazon QuickSight can't connect to your cluster. The RoleArn that you use for this operation must grant access to redshift:CreateClusterUser to successfully create the user.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "IdentityCenterConfiguration",
              "type": "dict",
              "required": false,
              "description": "An optional parameter that configures IAM Identity Center authentication to grant Amazon QuickSight access to your cluster. This parameter can only be specified if your Amazon QuickSight account is configured with IAM Identity Center.",
              "nested_params": [
                {
                  "name": "EnableIdentityPropagation",
                  "type": "boolean",
                  "required": false,
                  "description": "A Boolean option that controls whether Trusted Identity Propagation should be used.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "S3Parameters",
          "type": "dict",
          "required": false,
          "description": "The parameters for S3.",
          "nested_params": [
            {
              "name": "ManifestFileLocation",
              "type": "dict",
              "required": false,
              "description": "Location of the Amazon S3 manifest file. This is NULL if the manifest file was uploaded into Amazon QuickSight.",
              "nested_params": [
                {
                  "name": "Bucket",
                  "type": "string",
                  "required": false,
                  "description": "Amazon S3 bucket.",
                  "nested_params": []
                },
                {
                  "name": "Key",
                  "type": "string",
                  "required": false,
                  "description": "Amazon S3 key that identifies an object.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "RoleArn",
              "type": "string",
              "required": false,
              "description": "Use the RoleArn structure to override an account-wide role for a specific S3 data source. For example, say an account administrator has turned off all S3 access with an account-wide role. The administrator can then use RoleArn to bypass the account-wide role and allow S3 access for the single S3 data source that is specified in the structure, even if the account-wide role forbidding S3 access is still active.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ServiceNowParameters",
          "type": "dict",
          "required": false,
          "description": "The parameters for ServiceNow.",
          "nested_params": [
            {
              "name": "SiteBaseUrl",
              "type": "string",
              "required": false,
              "description": "URL of the base site.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "SnowflakeParameters",
          "type": "dict",
          "required": false,
          "description": "The parameters for Snowflake.",
          "nested_params": [
            {
              "name": "Host",
              "type": "string",
              "required": false,
              "description": "Host.",
              "nested_params": []
            },
            {
              "name": "Database",
              "type": "string",
              "required": false,
              "description": "Database.",
              "nested_params": []
            },
            {
              "name": "Warehouse",
              "type": "string",
              "required": false,
              "description": "Warehouse.",
              "nested_params": []
            },
            {
              "name": "AuthenticationType",
              "type": "string",
              "required": false,
              "description": "The authentication type that you want to use for your connection. This parameter accepts OAuth and non-OAuth authentication types.",
              "nested_params": []
            },
            {
              "name": "DatabaseAccessControlRole",
              "type": "string",
              "required": false,
              "description": "The database access control role.",
              "nested_params": []
            },
            {
              "name": "OAuthParameters",
              "type": "dict",
              "required": false,
              "description": "An object that contains information needed to create a data source connection between an Amazon QuickSight account and Snowflake.",
              "nested_params": [
                {
                  "name": "TokenProviderUrl",
                  "type": "string",
                  "required": false,
                  "description": "The token endpoint URL of the identity provider.",
                  "nested_params": []
                },
                {
                  "name": "OAuthScope",
                  "type": "string",
                  "required": false,
                  "description": "The OAuth scope.",
                  "nested_params": []
                },
                {
                  "name": "IdentityProviderVpcConnectionProperties",
                  "type": "dict",
                  "required": false,
                  "description": "VPC connection properties.",
                  "nested_params": [
                    {
                      "name": "VpcConnectionArn",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Resource Name (ARN) for the VPC connection.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "IdentityProviderResourceUri",
                  "type": "string",
                  "required": false,
                  "description": "The resource uri of the identity provider.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "SparkParameters",
          "type": "dict",
          "required": false,
          "description": "The parameters for Spark.",
          "nested_params": [
            {
              "name": "Host",
              "type": "string",
              "required": false,
              "description": "Host.",
              "nested_params": []
            },
            {
              "name": "Port",
              "type": "integer",
              "required": false,
              "description": "Port.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "SqlServerParameters",
          "type": "dict",
          "required": false,
          "description": "The parameters for SQL Server.",
          "nested_params": [
            {
              "name": "Host",
              "type": "string",
              "required": false,
              "description": "Host.",
              "nested_params": []
            },
            {
              "name": "Port",
              "type": "integer",
              "required": false,
              "description": "Port.",
              "nested_params": []
            },
            {
              "name": "Database",
              "type": "string",
              "required": false,
              "description": "Database.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "TeradataParameters",
          "type": "dict",
          "required": false,
          "description": "The parameters for Teradata.",
          "nested_params": [
            {
              "name": "Host",
              "type": "string",
              "required": false,
              "description": "Host.",
              "nested_params": []
            },
            {
              "name": "Port",
              "type": "integer",
              "required": false,
              "description": "Port.",
              "nested_params": []
            },
            {
              "name": "Database",
              "type": "string",
              "required": false,
              "description": "Database.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "TwitterParameters",
          "type": "dict",
          "required": false,
          "description": "The parameters for Twitter.",
          "nested_params": [
            {
              "name": "Query",
              "type": "string",
              "required": false,
              "description": "Twitter query string.",
              "nested_params": []
            },
            {
              "name": "MaxRows",
              "type": "integer",
              "required": false,
              "description": "Maximum number of rows to query Twitter.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "AmazonOpenSearchParameters",
          "type": "dict",
          "required": false,
          "description": "The parameters for OpenSearch.",
          "nested_params": [
            {
              "name": "Domain",
              "type": "string",
              "required": false,
              "description": "The OpenSearch domain.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ExasolParameters",
          "type": "dict",
          "required": false,
          "description": "The parameters for Exasol.",
          "nested_params": [
            {
              "name": "Host",
              "type": "string",
              "required": false,
              "description": "The hostname or IP address of the Exasol data source.",
              "nested_params": []
            },
            {
              "name": "Port",
              "type": "integer",
              "required": false,
              "description": "The port for the Exasol data source.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "DatabricksParameters",
          "type": "dict",
          "required": false,
          "description": "The parameters that are required to connect to a Databricks data source.",
          "nested_params": [
            {
              "name": "Host",
              "type": "string",
              "required": false,
              "description": "The host name of the Databricks data source.",
              "nested_params": []
            },
            {
              "name": "Port",
              "type": "integer",
              "required": false,
              "description": "The port for the Databricks data source.",
              "nested_params": []
            },
            {
              "name": "SqlEndpointPath",
              "type": "string",
              "required": false,
              "description": "The HTTP path of the Databricks data source.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "StarburstParameters",
          "type": "dict",
          "required": false,
          "description": "The parameters that are required to connect to a Starburst data source.",
          "nested_params": [
            {
              "name": "Host",
              "type": "string",
              "required": false,
              "description": "The host name of the Starburst data source.",
              "nested_params": []
            },
            {
              "name": "Port",
              "type": "integer",
              "required": false,
              "description": "The port for the Starburst data source.",
              "nested_params": []
            },
            {
              "name": "Catalog",
              "type": "string",
              "required": false,
              "description": "The catalog name for the Starburst data source.",
              "nested_params": []
            },
            {
              "name": "ProductType",
              "type": "string",
              "required": false,
              "description": "The product type for the Starburst data source.",
              "nested_params": []
            },
            {
              "name": "DatabaseAccessControlRole",
              "type": "string",
              "required": false,
              "description": "The database access control role.",
              "nested_params": []
            },
            {
              "name": "AuthenticationType",
              "type": "string",
              "required": false,
              "description": "The authentication type that you want to use for your connection. This parameter accepts OAuth and non-OAuth authentication types.",
              "nested_params": []
            },
            {
              "name": "OAuthParameters",
              "type": "dict",
              "required": false,
              "description": "An object that contains information needed to create a data source connection between an Amazon QuickSight account and Starburst.",
              "nested_params": [
                {
                  "name": "TokenProviderUrl",
                  "type": "string",
                  "required": false,
                  "description": "The token endpoint URL of the identity provider.",
                  "nested_params": []
                },
                {
                  "name": "OAuthScope",
                  "type": "string",
                  "required": false,
                  "description": "The OAuth scope.",
                  "nested_params": []
                },
                {
                  "name": "IdentityProviderVpcConnectionProperties",
                  "type": "dict",
                  "required": false,
                  "description": "VPC connection properties.",
                  "nested_params": [
                    {
                      "name": "VpcConnectionArn",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Resource Name (ARN) for the VPC connection.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "IdentityProviderResourceUri",
                  "type": "string",
                  "required": false,
                  "description": "The resource uri of the identity provider.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "TrinoParameters",
          "type": "dict",
          "required": false,
          "description": "The parameters that are required to connect to a Trino data source.",
          "nested_params": [
            {
              "name": "Host",
              "type": "string",
              "required": false,
              "description": "The host name of the Trino data source.",
              "nested_params": []
            },
            {
              "name": "Port",
              "type": "integer",
              "required": false,
              "description": "The port for the Trino data source.",
              "nested_params": []
            },
            {
              "name": "Catalog",
              "type": "string",
              "required": false,
              "description": "The catalog name for the Trino data source.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "BigQueryParameters",
          "type": "dict",
          "required": false,
          "description": "The parameters that are required to connect to a Google BigQuery data source.",
          "nested_params": [
            {
              "name": "ProjectId",
              "type": "string",
              "required": false,
              "description": "The Google Cloud Platform project ID where your datasource was created.",
              "nested_params": []
            },
            {
              "name": "DataSetRegion",
              "type": "string",
              "required": false,
              "description": "The storage location where you create a Google BigQuery data source.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "Credentials",
      "type": "dict",
      "required": true,
      "description": "The credentials Amazon QuickSight that uses to connect to your underlying source. Currently, only credentials based on user name and password are supported. CredentialPair (dict) --- Credential pair. For more information, see ``CredentialPair ``. User name. Password. AlternateDataSourceParameters (list) --- A set of alternate data source parameters that you want to share for these credentials. The credentials are applied in tandem with the data source parameters when you copy a data source by using a create or update request. The API operation compares the DataSourceParameters structure that's in the request with the structures in the AlternateDataSourceParameters allow list. If the structures are an exact match, the request is allowed to use the new data source with the existing credentials. If the AlternateDataSourceParameters list is null, the DataSourceParameters originally used with these Credentials is automatically allowed. (dict) --- The parameters that Amazon QuickSight uses to connect to your underlying data source. This is a variant type structure. For this structure to be valid, only one of the attributes can be non-null. AmazonElasticsearchParameters (dict) --- The parameters for OpenSearch. The OpenSearch domain. AthenaParameters (dict) --- The parameters for Amazon Athena. WorkGroup (string) --- The workgroup that Amazon Athena uses. RoleArn (string) --- Use the RoleArn structure to override an account-wide role for a specific Athena data source. For example, say an account administrator has turned off all Athena access with an account-wide role. The administrator can then use RoleArn to bypass the account-wide role and allow Athena access for the single Athena data source that is specified in the structure, even if the account-wide role forbidding Athena access is still active. IdentityCenterConfiguration (dict) --- An optional parameter that configures IAM Identity Center authentication to grant Amazon QuickSight access to your workgroup. This parameter can only be specified if your Amazon QuickSight account is configured with IAM Identity Center. EnableIdentityPropagation (boolean) --- A Boolean option that controls whether Trusted Identity Propagation should be used. AuroraParameters (dict) --- The parameters for Amazon Aurora MySQL. Host. Port. Database. AuroraPostgreSqlParameters (dict) --- The parameters for Amazon Aurora. The Amazon Aurora PostgreSQL-Compatible host to connect to. The port that Amazon Aurora PostgreSQL is listening on. The Amazon Aurora PostgreSQL database to connect to. AwsIotAnalyticsParameters (dict) --- The parameters for IoT Analytics. Dataset name. JiraParameters (dict) --- The parameters for Jira. The base URL of the Jira site. MariaDbParameters (dict) --- The parameters for MariaDB. MySqlParameters (dict) --- The parameters for MySQL. OracleParameters (dict) --- The parameters for Oracle. An Oracle host. The port. The database. UseServiceName (boolean) --- A Boolean value that indicates whether the Database uses a service name or an SID. If this value is left blank, the default value is SID. If this value is set to false, the value is SID. PostgreSqlParameters (dict) --- The parameters for PostgreSQL. PrestoParameters (dict) --- The parameters for Presto. Catalog. RdsParameters (dict) --- The parameters for Amazon RDS. Instance ID. RedshiftParameters (dict) --- The parameters for Amazon Redshift. Host (string) --- Host. This field can be blank if ClusterId is provided. Port (integer) --- Port. This field can be blank if the ClusterId is provided. ClusterId (string) --- Cluster ID. This field can be blank if the Host and Port are provided. IAMParameters (dict) --- An optional parameter that uses IAM authentication to grant Amazon QuickSight access to your cluster. This parameter can be used instead of DataSourceCredentials. Use the RoleArn structure to allow Amazon QuickSight to call redshift:GetClusterCredentials on your cluster. The calling principal must have iam:PassRole access to pass the role to Amazon QuickSight. The role's trust policy must allow the Amazon QuickSight service principal to assume the role. DatabaseUser (string) --- The user whose permissions and group memberships will be used by Amazon QuickSight to access the cluster. If this user already exists in your database, Amazon QuickSight is granted the same permissions that the user has. If the user doesn't exist, set the value of AutoCreateDatabaseUser to True to create a new user with PUBLIC permissions. DatabaseGroups (list) --- A list of groups whose permissions will be granted to Amazon QuickSight to access the cluster. These permissions are combined with the permissions granted to Amazon QuickSight by the DatabaseUser. If you choose to include this parameter, the RoleArn must grant access to redshift:JoinGroup. (string) --- AutoCreateDatabaseUser (boolean) --- Automatically creates a database user. If your database doesn't have a DatabaseUser, set this parameter to True. If there is no DatabaseUser, Amazon QuickSight can't connect to your cluster. The RoleArn that you use for this operation must grant access to redshift:CreateClusterUser to successfully create the user. IdentityCenterConfiguration (dict) --- An optional parameter that configures IAM Identity Center authentication to grant Amazon QuickSight access to your cluster. S3Parameters (dict) --- The parameters for S3. Location of the Amazon S3 manifest file. This is NULL if the manifest file was uploaded into Amazon QuickSight. Amazon S3 bucket. Amazon S3 key that identifies an object. RoleArn (string) --- Use the RoleArn structure to override an account-wide role for a specific S3 data source. For example, say an account administrator has turned off all S3 access with an account-wide role. The administrator can then use RoleArn to bypass the account-wide role and allow S3 access for the single S3 data source that is specified in the structure, even if the account-wide role forbidding S3 access is still active. ServiceNowParameters (dict) --- The parameters for ServiceNow. URL of the base site. SnowflakeParameters (dict) --- The parameters for Snowflake. Warehouse. AuthenticationType (string) --- The authentication type that you want to use for your connection. This parameter accepts OAuth and non-OAuth authentication types. DatabaseAccessControlRole (string) --- The database access control role. OAuthParameters (dict) --- An object that contains information needed to create a data source connection between an Amazon QuickSight account and Snowflake. The token endpoint URL of the identity provider. OAuthScope (string) --- The OAuth scope. IdentityProviderVpcConnectionProperties (dict) --- VPC connection properties. The Amazon Resource Name (ARN) for the VPC connection. IdentityProviderResourceUri (string) --- The resource uri of the identity provider. SparkParameters (dict) --- The parameters for Spark. SqlServerParameters (dict) --- The parameters for SQL Server. TeradataParameters (dict) --- The parameters for Teradata. TwitterParameters (dict) --- The parameters for Twitter. Twitter query string. Maximum number of rows to query Twitter. AmazonOpenSearchParameters (dict) --- The parameters for OpenSearch. ExasolParameters (dict) --- The parameters for Exasol. The hostname or IP address of the Exasol data source. The port for the Exasol data source. DatabricksParameters (dict) --- The parameters that are required to connect to a Databricks data source. The host name of the Databricks data source. The port for the Databricks data source. The HTTP path of the Databricks data source. StarburstParameters (dict) --- The parameters that are required to connect to a Starburst data source. The host name of the Starburst data source. The port for the Starburst data source. The catalog name for the Starburst data source. ProductType (string) --- The product type for the Starburst data source. OAuthParameters (dict) --- An object that contains information needed to create a data source connection between an Amazon QuickSight account and Starburst. TrinoParameters (dict) --- The parameters that are required to connect to a Trino data source. The host name of the Trino data source. The port for the Trino data source. The catalog name for the Trino data source. BigQueryParameters (dict) --- The parameters that are required to connect to a Google BigQuery data source. The Google Cloud Platform project ID where your datasource was created. DataSetRegion (string) --- The storage location where you create a Google BigQuery data source. CopySourceArn (string) --- The Amazon Resource Name (ARN) of a data source that has the credential pair that you want to use. When CopySourceArn is not null, the credential pair from the data source in the ARN is used as the credentials for the DataSourceCredentials structure. SecretArn (string) --- The Amazon Resource Name (ARN) of the secret associated with the data source in Amazon Secrets Manager.",
      "nested_params": [
        {
          "name": "CredentialPair",
          "type": "dict",
          "required": false,
          "description": "Credential pair. For more information, see ``CredentialPair ``.",
          "nested_params": [
            {
              "name": "Username",
              "type": "string",
              "required": false,
              "description": "User name.",
              "nested_params": []
            },
            {
              "name": "Password",
              "type": "string",
              "required": false,
              "description": "Password.",
              "nested_params": []
            },
            {
              "name": "AlternateDataSourceParameters",
              "type": "list",
              "required": false,
              "description": "A set of alternate data source parameters that you want to share for these credentials. The credentials are applied in tandem with the data source parameters when you copy a data source by using a create or update request. The API operation compares the DataSourceParameters structure that's in the request with the structures in the AlternateDataSourceParameters allow list. If the structures are an exact match, the request is allowed to use the new data source with the existing credentials. If the AlternateDataSourceParameters list is null, the DataSourceParameters originally used with these Credentials is automatically allowed.",
              "nested_params": [
                {
                  "name": "AmazonElasticsearchParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters for OpenSearch.",
                  "nested_params": [
                    {
                      "name": "Domain",
                      "type": "string",
                      "required": false,
                      "description": "The OpenSearch domain.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "AthenaParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters for Amazon Athena.",
                  "nested_params": [
                    {
                      "name": "WorkGroup",
                      "type": "string",
                      "required": false,
                      "description": "The workgroup that Amazon Athena uses.",
                      "nested_params": []
                    },
                    {
                      "name": "RoleArn",
                      "type": "string",
                      "required": false,
                      "description": "Use the RoleArn structure to override an account-wide role for a specific Athena data source. For example, say an account administrator has turned off all Athena access with an account-wide role. The administrator can then use RoleArn to bypass the account-wide role and allow Athena access for the single Athena data source that is specified in the structure, even if the account-wide role forbidding Athena access is still active.",
                      "nested_params": []
                    },
                    {
                      "name": "IdentityCenterConfiguration",
                      "type": "dict",
                      "required": false,
                      "description": "An optional parameter that configures IAM Identity Center authentication to grant Amazon QuickSight access to your workgroup. This parameter can only be specified if your Amazon QuickSight account is configured with IAM Identity Center.",
                      "nested_params": [
                        {
                          "name": "EnableIdentityPropagation",
                          "type": "boolean",
                          "required": false,
                          "description": "A Boolean option that controls whether Trusted Identity Propagation should be used.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "AuroraParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters for Amazon Aurora MySQL.",
                  "nested_params": [
                    {
                      "name": "Host",
                      "type": "string",
                      "required": false,
                      "description": "Host.",
                      "nested_params": []
                    },
                    {
                      "name": "Port",
                      "type": "integer",
                      "required": false,
                      "description": "Port.",
                      "nested_params": []
                    },
                    {
                      "name": "Database",
                      "type": "string",
                      "required": false,
                      "description": "Database.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "AuroraPostgreSqlParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters for Amazon Aurora.",
                  "nested_params": [
                    {
                      "name": "Host",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Aurora PostgreSQL-Compatible host to connect to.",
                      "nested_params": []
                    },
                    {
                      "name": "Port",
                      "type": "integer",
                      "required": false,
                      "description": "The port that Amazon Aurora PostgreSQL is listening on.",
                      "nested_params": []
                    },
                    {
                      "name": "Database",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Aurora PostgreSQL database to connect to.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "AwsIotAnalyticsParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters for IoT Analytics.",
                  "nested_params": [
                    {
                      "name": "DataSetName",
                      "type": "string",
                      "required": false,
                      "description": "Dataset name.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "JiraParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters for Jira.",
                  "nested_params": [
                    {
                      "name": "SiteBaseUrl",
                      "type": "string",
                      "required": false,
                      "description": "The base URL of the Jira site.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "MariaDbParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters for MariaDB.",
                  "nested_params": [
                    {
                      "name": "Host",
                      "type": "string",
                      "required": false,
                      "description": "Host.",
                      "nested_params": []
                    },
                    {
                      "name": "Port",
                      "type": "integer",
                      "required": false,
                      "description": "Port.",
                      "nested_params": []
                    },
                    {
                      "name": "Database",
                      "type": "string",
                      "required": false,
                      "description": "Database.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "MySqlParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters for MySQL.",
                  "nested_params": [
                    {
                      "name": "Host",
                      "type": "string",
                      "required": false,
                      "description": "Host.",
                      "nested_params": []
                    },
                    {
                      "name": "Port",
                      "type": "integer",
                      "required": false,
                      "description": "Port.",
                      "nested_params": []
                    },
                    {
                      "name": "Database",
                      "type": "string",
                      "required": false,
                      "description": "Database.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "OracleParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters for Oracle.",
                  "nested_params": [
                    {
                      "name": "Host",
                      "type": "string",
                      "required": false,
                      "description": "An Oracle host.",
                      "nested_params": []
                    },
                    {
                      "name": "Port",
                      "type": "integer",
                      "required": false,
                      "description": "The port.",
                      "nested_params": []
                    },
                    {
                      "name": "Database",
                      "type": "string",
                      "required": false,
                      "description": "The database.",
                      "nested_params": []
                    },
                    {
                      "name": "UseServiceName",
                      "type": "boolean",
                      "required": false,
                      "description": "A Boolean value that indicates whether the Database uses a service name or an SID. If this value is left blank, the default value is SID. If this value is set to false, the value is SID.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "PostgreSqlParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters for PostgreSQL.",
                  "nested_params": [
                    {
                      "name": "Host",
                      "type": "string",
                      "required": false,
                      "description": "Host.",
                      "nested_params": []
                    },
                    {
                      "name": "Port",
                      "type": "integer",
                      "required": false,
                      "description": "Port.",
                      "nested_params": []
                    },
                    {
                      "name": "Database",
                      "type": "string",
                      "required": false,
                      "description": "Database.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "PrestoParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters for Presto.",
                  "nested_params": [
                    {
                      "name": "Host",
                      "type": "string",
                      "required": false,
                      "description": "Host.",
                      "nested_params": []
                    },
                    {
                      "name": "Port",
                      "type": "integer",
                      "required": false,
                      "description": "Port.",
                      "nested_params": []
                    },
                    {
                      "name": "Catalog",
                      "type": "string",
                      "required": false,
                      "description": "Catalog.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "RdsParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters for Amazon RDS.",
                  "nested_params": [
                    {
                      "name": "InstanceId",
                      "type": "string",
                      "required": false,
                      "description": "Instance ID.",
                      "nested_params": []
                    },
                    {
                      "name": "Database",
                      "type": "string",
                      "required": false,
                      "description": "Database.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "RedshiftParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters for Amazon Redshift.",
                  "nested_params": [
                    {
                      "name": "Host",
                      "type": "string",
                      "required": false,
                      "description": "Host. This field can be blank if ClusterId is provided.",
                      "nested_params": []
                    },
                    {
                      "name": "Port",
                      "type": "integer",
                      "required": false,
                      "description": "Port. This field can be blank if the ClusterId is provided.",
                      "nested_params": []
                    },
                    {
                      "name": "Database",
                      "type": "string",
                      "required": false,
                      "description": "Database.",
                      "nested_params": []
                    },
                    {
                      "name": "ClusterId",
                      "type": "string",
                      "required": false,
                      "description": "Cluster ID. This field can be blank if the Host and Port are provided.",
                      "nested_params": []
                    },
                    {
                      "name": "IAMParameters",
                      "type": "dict",
                      "required": false,
                      "description": "An optional parameter that uses IAM authentication to grant Amazon QuickSight access to your cluster. This parameter can be used instead of DataSourceCredentials.",
                      "nested_params": [
                        {
                          "name": "RoleArn",
                          "type": "string",
                          "required": false,
                          "description": "Use the RoleArn structure to allow Amazon QuickSight to call redshift:GetClusterCredentials on your cluster. The calling principal must have iam:PassRole access to pass the role to Amazon QuickSight. The role's trust policy must allow the Amazon QuickSight service principal to assume the role.",
                          "nested_params": []
                        },
                        {
                          "name": "DatabaseUser",
                          "type": "string",
                          "required": false,
                          "description": "The user whose permissions and group memberships will be used by Amazon QuickSight to access the cluster. If this user already exists in your database, Amazon QuickSight is granted the same permissions that the user has. If the user doesn't exist, set the value of AutoCreateDatabaseUser to True to create a new user with PUBLIC permissions.",
                          "nested_params": []
                        },
                        {
                          "name": "DatabaseGroups",
                          "type": "list",
                          "required": false,
                          "description": "A list of groups whose permissions will be granted to Amazon QuickSight to access the cluster. These permissions are combined with the permissions granted to Amazon QuickSight by the DatabaseUser. If you choose to include this parameter, the RoleArn must grant access to redshift:JoinGroup.",
                          "nested_params": []
                        },
                        {
                          "name": "AutoCreateDatabaseUser",
                          "type": "boolean",
                          "required": false,
                          "description": "Automatically creates a database user. If your database doesn't have a DatabaseUser, set this parameter to True. If there is no DatabaseUser, Amazon QuickSight can't connect to your cluster. The RoleArn that you use for this operation must grant access to redshift:CreateClusterUser to successfully create the user.",
                          "nested_params": []
                        }
                      ]
                    },
                    {
                      "name": "IdentityCenterConfiguration",
                      "type": "dict",
                      "required": false,
                      "description": "An optional parameter that configures IAM Identity Center authentication to grant Amazon QuickSight access to your cluster. This parameter can only be specified if your Amazon QuickSight account is configured with IAM Identity Center.",
                      "nested_params": [
                        {
                          "name": "EnableIdentityPropagation",
                          "type": "boolean",
                          "required": false,
                          "description": "A Boolean option that controls whether Trusted Identity Propagation should be used.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "S3Parameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters for S3.",
                  "nested_params": [
                    {
                      "name": "ManifestFileLocation",
                      "type": "dict",
                      "required": false,
                      "description": "Location of the Amazon S3 manifest file. This is NULL if the manifest file was uploaded into Amazon QuickSight.",
                      "nested_params": [
                        {
                          "name": "Bucket",
                          "type": "string",
                          "required": false,
                          "description": "Amazon S3 bucket.",
                          "nested_params": []
                        },
                        {
                          "name": "Key",
                          "type": "string",
                          "required": false,
                          "description": "Amazon S3 key that identifies an object.",
                          "nested_params": []
                        }
                      ]
                    },
                    {
                      "name": "RoleArn",
                      "type": "string",
                      "required": false,
                      "description": "Use the RoleArn structure to override an account-wide role for a specific S3 data source. For example, say an account administrator has turned off all S3 access with an account-wide role. The administrator can then use RoleArn to bypass the account-wide role and allow S3 access for the single S3 data source that is specified in the structure, even if the account-wide role forbidding S3 access is still active.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "ServiceNowParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters for ServiceNow.",
                  "nested_params": [
                    {
                      "name": "SiteBaseUrl",
                      "type": "string",
                      "required": false,
                      "description": "URL of the base site.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "SnowflakeParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters for Snowflake.",
                  "nested_params": [
                    {
                      "name": "Host",
                      "type": "string",
                      "required": false,
                      "description": "Host.",
                      "nested_params": []
                    },
                    {
                      "name": "Database",
                      "type": "string",
                      "required": false,
                      "description": "Database.",
                      "nested_params": []
                    },
                    {
                      "name": "Warehouse",
                      "type": "string",
                      "required": false,
                      "description": "Warehouse.",
                      "nested_params": []
                    },
                    {
                      "name": "AuthenticationType",
                      "type": "string",
                      "required": false,
                      "description": "The authentication type that you want to use for your connection. This parameter accepts OAuth and non-OAuth authentication types.",
                      "nested_params": []
                    },
                    {
                      "name": "DatabaseAccessControlRole",
                      "type": "string",
                      "required": false,
                      "description": "The database access control role.",
                      "nested_params": []
                    },
                    {
                      "name": "OAuthParameters",
                      "type": "dict",
                      "required": false,
                      "description": "An object that contains information needed to create a data source connection between an Amazon QuickSight account and Snowflake.",
                      "nested_params": [
                        {
                          "name": "TokenProviderUrl",
                          "type": "string",
                          "required": false,
                          "description": "The token endpoint URL of the identity provider.",
                          "nested_params": []
                        },
                        {
                          "name": "OAuthScope",
                          "type": "string",
                          "required": false,
                          "description": "The OAuth scope.",
                          "nested_params": []
                        },
                        {
                          "name": "IdentityProviderVpcConnectionProperties",
                          "type": "dict",
                          "required": false,
                          "description": "VPC connection properties.",
                          "nested_params": [
                            {
                              "name": "VpcConnectionArn",
                              "type": "string",
                              "required": false,
                              "description": "The Amazon Resource Name (ARN) for the VPC connection.",
                              "nested_params": []
                            }
                          ]
                        },
                        {
                          "name": "IdentityProviderResourceUri",
                          "type": "string",
                          "required": false,
                          "description": "The resource uri of the identity provider.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "SparkParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters for Spark.",
                  "nested_params": [
                    {
                      "name": "Host",
                      "type": "string",
                      "required": false,
                      "description": "Host.",
                      "nested_params": []
                    },
                    {
                      "name": "Port",
                      "type": "integer",
                      "required": false,
                      "description": "Port.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "SqlServerParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters for SQL Server.",
                  "nested_params": [
                    {
                      "name": "Host",
                      "type": "string",
                      "required": false,
                      "description": "Host.",
                      "nested_params": []
                    },
                    {
                      "name": "Port",
                      "type": "integer",
                      "required": false,
                      "description": "Port.",
                      "nested_params": []
                    },
                    {
                      "name": "Database",
                      "type": "string",
                      "required": false,
                      "description": "Database.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "TeradataParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters for Teradata.",
                  "nested_params": [
                    {
                      "name": "Host",
                      "type": "string",
                      "required": false,
                      "description": "Host.",
                      "nested_params": []
                    },
                    {
                      "name": "Port",
                      "type": "integer",
                      "required": false,
                      "description": "Port.",
                      "nested_params": []
                    },
                    {
                      "name": "Database",
                      "type": "string",
                      "required": false,
                      "description": "Database.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "TwitterParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters for Twitter.",
                  "nested_params": [
                    {
                      "name": "Query",
                      "type": "string",
                      "required": false,
                      "description": "Twitter query string.",
                      "nested_params": []
                    },
                    {
                      "name": "MaxRows",
                      "type": "integer",
                      "required": false,
                      "description": "Maximum number of rows to query Twitter.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "AmazonOpenSearchParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters for OpenSearch.",
                  "nested_params": [
                    {
                      "name": "Domain",
                      "type": "string",
                      "required": false,
                      "description": "The OpenSearch domain.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "ExasolParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters for Exasol.",
                  "nested_params": [
                    {
                      "name": "Host",
                      "type": "string",
                      "required": false,
                      "description": "The hostname or IP address of the Exasol data source.",
                      "nested_params": []
                    },
                    {
                      "name": "Port",
                      "type": "integer",
                      "required": false,
                      "description": "The port for the Exasol data source.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "DatabricksParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters that are required to connect to a Databricks data source.",
                  "nested_params": [
                    {
                      "name": "Host",
                      "type": "string",
                      "required": false,
                      "description": "The host name of the Databricks data source.",
                      "nested_params": []
                    },
                    {
                      "name": "Port",
                      "type": "integer",
                      "required": false,
                      "description": "The port for the Databricks data source.",
                      "nested_params": []
                    },
                    {
                      "name": "SqlEndpointPath",
                      "type": "string",
                      "required": false,
                      "description": "The HTTP path of the Databricks data source.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "StarburstParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters that are required to connect to a Starburst data source.",
                  "nested_params": [
                    {
                      "name": "Host",
                      "type": "string",
                      "required": false,
                      "description": "The host name of the Starburst data source.",
                      "nested_params": []
                    },
                    {
                      "name": "Port",
                      "type": "integer",
                      "required": false,
                      "description": "The port for the Starburst data source.",
                      "nested_params": []
                    },
                    {
                      "name": "Catalog",
                      "type": "string",
                      "required": false,
                      "description": "The catalog name for the Starburst data source.",
                      "nested_params": []
                    },
                    {
                      "name": "ProductType",
                      "type": "string",
                      "required": false,
                      "description": "The product type for the Starburst data source.",
                      "nested_params": []
                    },
                    {
                      "name": "DatabaseAccessControlRole",
                      "type": "string",
                      "required": false,
                      "description": "The database access control role.",
                      "nested_params": []
                    },
                    {
                      "name": "AuthenticationType",
                      "type": "string",
                      "required": false,
                      "description": "The authentication type that you want to use for your connection. This parameter accepts OAuth and non-OAuth authentication types.",
                      "nested_params": []
                    },
                    {
                      "name": "OAuthParameters",
                      "type": "dict",
                      "required": false,
                      "description": "An object that contains information needed to create a data source connection between an Amazon QuickSight account and Starburst.",
                      "nested_params": [
                        {
                          "name": "TokenProviderUrl",
                          "type": "string",
                          "required": false,
                          "description": "The token endpoint URL of the identity provider.",
                          "nested_params": []
                        },
                        {
                          "name": "OAuthScope",
                          "type": "string",
                          "required": false,
                          "description": "The OAuth scope.",
                          "nested_params": []
                        },
                        {
                          "name": "IdentityProviderVpcConnectionProperties",
                          "type": "dict",
                          "required": false,
                          "description": "VPC connection properties.",
                          "nested_params": [
                            {
                              "name": "VpcConnectionArn",
                              "type": "string",
                              "required": false,
                              "description": "The Amazon Resource Name (ARN) for the VPC connection.",
                              "nested_params": []
                            }
                          ]
                        },
                        {
                          "name": "IdentityProviderResourceUri",
                          "type": "string",
                          "required": false,
                          "description": "The resource uri of the identity provider.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "TrinoParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters that are required to connect to a Trino data source.",
                  "nested_params": [
                    {
                      "name": "Host",
                      "type": "string",
                      "required": false,
                      "description": "The host name of the Trino data source.",
                      "nested_params": []
                    },
                    {
                      "name": "Port",
                      "type": "integer",
                      "required": false,
                      "description": "The port for the Trino data source.",
                      "nested_params": []
                    },
                    {
                      "name": "Catalog",
                      "type": "string",
                      "required": false,
                      "description": "The catalog name for the Trino data source.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "BigQueryParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters that are required to connect to a Google BigQuery data source.",
                  "nested_params": [
                    {
                      "name": "ProjectId",
                      "type": "string",
                      "required": false,
                      "description": "The Google Cloud Platform project ID where your datasource was created.",
                      "nested_params": []
                    },
                    {
                      "name": "DataSetRegion",
                      "type": "string",
                      "required": false,
                      "description": "The storage location where you create a Google BigQuery data source.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "CopySourceArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of a data source that has the credential pair that you want to use. When CopySourceArn is not null, the credential pair from the data source in the ARN is used as the credentials for the DataSourceCredentials structure.",
          "nested_params": []
        },
        {
          "name": "SecretArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the secret associated with the data source in Amazon Secrets Manager.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Permissions",
      "type": "list",
      "required": true,
      "description": "A list of resource permissions on the data source. (dict) --- Permission for the resource. The Amazon Resource Name (ARN) of the principal. This can be one of the following: The ARN of an Amazon QuickSight user or group associated with a data source or dataset. (This is common.) The ARN of an Amazon QuickSight user, group, or namespace associated with an analysis, dashboard, template, or theme. (This is common.) The ARN of an Amazon Web Services account root: This is an IAM ARN rather than a QuickSight ARN. Use this option only to share resources (templates) across Amazon Web Services accounts. (This is less common.) The IAM action to grant or revoke permissions on. (string) ---",
      "nested_params": [
        {
          "name": "Principal",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the principal. This can be one of the following:",
          "nested_params": []
        },
        {
          "name": "Actions",
          "type": "list",
          "required": false,
          "description": "The IAM action to grant or revoke permissions on.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "VpcConnectionProperties",
      "type": "dict",
      "required": true,
      "description": "Use this parameter only when you want Amazon QuickSight to use a VPC connection when connecting to your underlying source. The Amazon Resource Name (ARN) for the VPC connection.",
      "nested_params": [
        {
          "name": "VpcConnectionArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) for the VPC connection.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "SslProperties",
      "type": "dict",
      "required": false,
      "description": "Secure Socket Layer (SSL) properties that apply when Amazon QuickSight connects to your underlying source. DisableSsl (boolean) --- A Boolean option to control whether SSL should be disabled.",
      "nested_params": [
        {
          "name": "DisableSsl",
          "type": "boolean",
          "required": false,
          "description": "A Boolean option to control whether SSL should be disabled.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "Contains a map of the key-value pairs for the resource tag or tags assigned to the data source. (dict) --- The key or keys of the key-value pairs for the resource tag or tags assigned to the resource. Tag key. Tag value.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "Tag key.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "Tag value.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "FolderArns",
      "type": "list",
      "required": false,
      "description": "When you create the data source, Amazon QuickSight adds the data source to these folders. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Arn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the data source.",
          "nested_items": []
        },
        {
          "name": "DataSourceId",
          "type": "string",
          "description": "The ID of the data source. This ID is unique per Amazon Web Services Region for each Amazon Web Services account.",
          "nested_items": []
        },
        {
          "name": "CreationStatus",
          "type": "string",
          "description": "The status of creating the data source.",
          "nested_items": []
        },
        {
          "name": "RequestId",
          "type": "string",
          "description": "The Amazon Web Services request ID for this operation.",
          "nested_items": []
        },
        {
          "name": "Status",
          "type": "integer",
          "description": "The HTTP status of the request.",
          "nested_items": []
        }
      ]
    }
  ]
}