{
  "method_name": "create_account_subscription",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/quicksight/client/create_account_subscription.html",
  "description": "Creates an Amazon QuickSight account, or subscribes to Amazon QuickSight Q. The Amazon Web Services Region for the account is derived from what is configured in the CLI or SDK. Before you use this operation, make sure that you can connect to an existing Amazon Web Services account. If you don't have an Amazon Web Services account, see Sign up for Amazon Web Services in the Amazon QuickSight User Guide. The person who signs up for Amazon QuickSight needs to have the correct Identity and Access Management (IAM) permissions. For more information, see IAM Policy Examples for Amazon QuickSight in the Amazon QuickSight User Guide. If your IAM policy includes both the Subscribe and CreateAccountSubscription actions, make sure that both actions are set to Allow. If either action is set to Deny, the Deny action prevails and your API call fails. You can't pass an existing IAM role to access other Amazon Web Services services using this API operation. To pass your existing IAM role to Amazon QuickSight, see Passing IAM roles to Amazon QuickSight in the Amazon QuickSight User Guide. You can't set default resource access on the new account from the Amazon QuickSight API. Instead, add default resource access from the Amazon QuickSight console. For more information about setting default resource access to Amazon Web Services services, see Setting default resource access to Amazon Web Services services in the Amazon QuickSight User Guide.",
  "parameters": [
    {
      "name": "Edition",
      "type": "string",
      "required": false,
      "description": "The edition of Amazon QuickSight that you want your account to have. Currently, you can choose from ENTERPRISE or ENTERPRISE_AND_Q. If you choose ENTERPRISE_AND_Q, the following parameters are required: FirstName LastName EmailAddress ContactNumber.",
      "nested_params": []
    },
    {
      "name": "AuthenticationMethod",
      "type": "string",
      "required": true,
      "description": "The method that you want to use to authenticate your Amazon QuickSight account. If you choose ACTIVE_DIRECTORY, provide an ActiveDirectoryName and an AdminGroup associated with your Active Directory. If you choose IAM_IDENTITY_CENTER, provide an AdminGroup associated with your IAM Identity Center account.",
      "nested_params": []
    },
    {
      "name": "AwsAccountId",
      "type": "string",
      "required": true,
      "description": "The Amazon Web Services account ID of the account that you're using to create your Amazon QuickSight account.",
      "nested_params": []
    },
    {
      "name": "AccountName",
      "type": "string",
      "required": true,
      "description": "The name of your Amazon QuickSight account. This name is unique over all of Amazon Web Services, and it appears only when users sign in. You can't change AccountName value after the Amazon QuickSight account is created.",
      "nested_params": []
    },
    {
      "name": "NotificationEmail",
      "type": "string",
      "required": true,
      "description": "The email address that you want Amazon QuickSight to send notifications to regarding your Amazon QuickSight account or Amazon QuickSight subscription.",
      "nested_params": []
    },
    {
      "name": "ActiveDirectoryName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Realm",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DirectoryId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "AdminGroup",
      "type": "list",
      "required": false,
      "description": "The admin group associated with your Active Directory or IAM Identity Center account. Either this field or the AdminProGroup field is required if ACTIVE_DIRECTORY or IAM_IDENTITY_CENTER is the selected authentication method of the new Amazon QuickSight account. For more information about using IAM Identity Center in Amazon QuickSight, see Using IAM Identity Center with Amazon QuickSight Enterprise Edition in the Amazon QuickSight User Guide. For more information about using Active Directory in Amazon QuickSight, see Using Active Directory with Amazon QuickSight Enterprise Edition in the Amazon QuickSight User Guide. (string) ---",
      "nested_params": []
    },
    {
      "name": "AuthorGroup",
      "type": "list",
      "required": false,
      "description": "The author group associated with your Active Directory or IAM Identity Center account. For more information about using IAM Identity Center in Amazon QuickSight, see Using IAM Identity Center with Amazon QuickSight Enterprise Edition in the Amazon QuickSight User Guide. For more information about using Active Directory in Amazon QuickSight, see Using Active Directory with Amazon QuickSight Enterprise Edition in the Amazon QuickSight User Guide. (string) ---",
      "nested_params": []
    },
    {
      "name": "ReaderGroup",
      "type": "list",
      "required": false,
      "description": "The reader group associated with your Active Directory or IAM Identity Center account. For more information about using IAM Identity Center in Amazon QuickSight, see Using IAM Identity Center with Amazon QuickSight Enterprise Edition in the Amazon QuickSight User Guide. For more information about using Active Directory in Amazon QuickSight, see Using Active Directory with Amazon QuickSight Enterprise Edition in the Amazon QuickSight User Guide. (string) ---",
      "nested_params": []
    },
    {
      "name": "AdminProGroup",
      "type": "list",
      "required": false,
      "description": "The admin pro group associated with your Active Directory or IAM Identity Center account. Either this field or the AdminGroup field is required if ACTIVE_DIRECTORY or IAM_IDENTITY_CENTER is the selected authentication method of the new Amazon QuickSight account. For more information about using IAM Identity Center in Amazon QuickSight, see Using IAM Identity Center with Amazon QuickSight Enterprise Edition in the Amazon QuickSight User Guide. For more information about using Active Directory in Amazon QuickSight, see Using Active Directory with Amazon QuickSight Enterprise Edition in the Amazon QuickSight User Guide. (string) ---",
      "nested_params": []
    },
    {
      "name": "AuthorProGroup",
      "type": "list",
      "required": false,
      "description": "The author pro group associated with your Active Directory or IAM Identity Center account. For more information about using IAM Identity Center in Amazon QuickSight, see Using IAM Identity Center with Amazon QuickSight Enterprise Edition in the Amazon QuickSight User Guide. For more information about using Active Directory in Amazon QuickSight, see Using Active Directory with Amazon QuickSight Enterprise Edition in the Amazon QuickSight User Guide. (string) ---",
      "nested_params": []
    },
    {
      "name": "ReaderProGroup",
      "type": "list",
      "required": false,
      "description": "The reader pro group associated with your Active Directory or IAM Identity Center account. For more information about using IAM Identity Center in Amazon QuickSight, see Using IAM Identity Center with Amazon QuickSight Enterprise Edition in the Amazon QuickSight User Guide. For more information about using Active Directory in Amazon QuickSight, see Using Active Directory with Amazon QuickSight Enterprise Edition in the Amazon QuickSight User Guide. (string) ---",
      "nested_params": []
    },
    {
      "name": "FirstName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "LastName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "EmailAddress",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ContactNumber",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "IAMIdentityCenterInstanceArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "SignupResponse",
          "type": "dict",
          "description": "A SignupResponse object that returns information about a newly created Amazon QuickSight account.",
          "nested_items": [
            {
              "name": "IAMUser",
              "type": "boolean",
              "description": "A Boolean that is TRUE if the Amazon QuickSight uses IAM as an authentication method.",
              "nested_items": []
            },
            {
              "name": "userLoginName",
              "type": "string",
              "description": "The user login name for your Amazon QuickSight account.",
              "nested_items": []
            },
            {
              "name": "accountName",
              "type": "string",
              "description": "The name of your Amazon QuickSight account.",
              "nested_items": []
            },
            {
              "name": "directoryType",
              "type": "string",
              "description": "The type of Active Directory that is being used to authenticate the Amazon QuickSight account. Valid values are SIMPLE_AD, AD_CONNECTOR, and MICROSOFT_AD.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "Status",
          "type": "integer",
          "description": "The HTTP status of the request.",
          "nested_items": []
        },
        {
          "name": "RequestId",
          "type": "string",
          "description": "The Amazon Web Services request ID for this operation.",
          "nested_items": []
        }
      ]
    }
  ]
}