{
  "method_name": "describe_account_settings",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/quicksight/client/describe_account_settings.html",
  "description": "Describes the settings that were used when your Amazon QuickSight subscription was first created in this Amazon Web Services account.",
  "parameters": [
    {
      "name": "AwsAccountId",
      "type": "string",
      "required": true,
      "description": "The ID for the Amazon Web Services account that contains the settings that you want to list.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "AccountSettings",
          "type": "dict",
          "description": "The Amazon QuickSight settings for this Amazon Web Services account. This information includes the edition of Amazon Amazon QuickSight that you subscribed to (Standard or Enterprise) and the notification email for the Amazon QuickSight subscription.",
          "nested_items": [
            {
              "name": "AccountName",
              "type": "string",
              "description": "The 'account name' you provided for the Amazon QuickSight subscription in your Amazon Web Services account. You create this name when you sign up for Amazon QuickSight. It is unique in all of Amazon Web Services and it appears only when users sign in.",
              "nested_items": []
            },
            {
              "name": "Edition",
              "type": "string",
              "description": "The edition of Amazon QuickSight that you're currently subscribed to: Enterprise edition or Standard edition.",
              "nested_items": []
            },
            {
              "name": "DefaultNamespace",
              "type": "string",
              "description": "The default Amazon QuickSight namespace for your Amazon Web Services account.",
              "nested_items": []
            },
            {
              "name": "NotificationEmail",
              "type": "string",
              "description": "The main notification email for your Amazon QuickSight subscription.",
              "nested_items": []
            },
            {
              "name": "PublicSharingEnabled",
              "type": "boolean",
              "description": "A Boolean value that indicates whether public sharing is turned on for an Amazon QuickSight account. For more information about turning on public sharing, see UpdatePublicSharingSettings.",
              "nested_items": []
            },
            {
              "name": "TerminationProtectionEnabled",
              "type": "boolean",
              "description": "A boolean value that determines whether or not an Amazon QuickSight account can be deleted. A True value doesn't allow the account to be deleted and results in an error message if a user tries to make a DeleteAccountSubsctiption request. A False value will allow the ccount to be deleted.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "RequestId",
          "type": "string",
          "description": "The Amazon Web Services request ID for this operation.",
          "nested_items": []
        },
        {
          "name": "Status",
          "type": "integer",
          "description": "The HTTP status of the request.",
          "nested_items": []
        }
      ]
    }
  ]
}