{
  "method_name": "generate_embed_url_for_anonymous_user",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/quicksight/client/generate_embed_url_for_anonymous_user.html",
  "description": "Generates an embed URL that you can use to embed an Amazon QuickSight dashboard or visual in your website, without having to register any reader users. Before you use this action, make sure that you have configured the dashboards and permissions. The following rules apply to the generated URL: For more information, see Embedded Analytics in the Amazon QuickSight User Guide. For more information about the high-level steps for embedding and for an interactive demo of the ways you can customize embedding, visit the Amazon QuickSight Developer Portal.",
  "parameters": [
    {
      "name": "AwsAccountId",
      "type": "string",
      "required": true,
      "description": "The ID for the Amazon Web Services account that contains the dashboard that you're embedding.",
      "nested_params": []
    },
    {
      "name": "SessionLifetimeInMinutes",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Namespace",
      "type": "string",
      "required": true,
      "description": "The Amazon QuickSight namespace that the anonymous user virtually belongs to. If you are not using an Amazon QuickSight custom namespace, set this to default.",
      "nested_params": []
    },
    {
      "name": "SessionTags",
      "type": "list",
      "required": true,
      "description": "The session tags used for row-level security. Before you use this parameter, make sure that you have configured the relevant datasets using the DataSet$RowLevelPermissionTagConfiguration parameter so that session tags can be used to provide row-level security. These are not the tags used for the Amazon Web Services resource tagging feature. For more information, see `Using Row-Level Security (RLS) with Tags <https://docs.aws.amazon.com/quicksight/latest/user/quicksight-dev-rls-tags.html>`__in the Amazon QuickSight User Guide. (dict) --- The key-value pair used for the row-level security tags feature. The key for the tag. The value that you want to assign the tag.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key for the tag.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value that you want to assign the tag.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "AuthorizedResourceArns",
      "type": "list",
      "required": true,
      "description": "The Amazon Resource Names (ARNs) for the Amazon QuickSight resources that the user is authorized to access during the lifetime of the session. If you choose Dashboard embedding experience, pass the list of dashboard ARNs in the account that you want the user to be able to view. If you want to make changes to the theme of your embedded content, pass a list of theme ARNs that the anonymous users need access to. Currently, you can pass up to 25 theme ARNs in each API call. (string) ---",
      "nested_params": []
    },
    {
      "name": "ExperienceConfiguration",
      "type": "dict",
      "required": true,
      "description": "The configuration of the experience that you are embedding. Dashboard (dict) --- The type of embedding experience. In this case, Amazon QuickSight dashboards. The dashboard ID for the dashboard that you want the user to see first. This ID is included in the output URL. When the URL in response is accessed, Amazon QuickSight renders this dashboard. The Amazon Resource Name (ARN) of this dashboard must be included in the AuthorizedResourceArns parameter. Otherwise, the request will fail with InvalidParameterValueException. EnabledFeatures (list) --- A list of all enabled features of a specified anonymous dashboard. (string) --- DisabledFeatures (list) --- A list of all disabled features of a specified anonymous dashboard. (string) --- FeatureConfigurations (dict) --- The feature configuration for an embedded dashboard. SharedView (dict) --- The shared view settings of an embedded dashboard. The shared view settings of an embedded dashboard. DashboardVisual (dict) --- The type of embedding experience. In this case, Amazon QuickSight visuals. The visual ID for the visual that you want the user to see. When the URL in response is accessed, Amazon QuickSight renders this visual. The Amazon Resource Name (ARN) of the dashboard that the visual belongs to must be included in the AuthorizedResourceArns parameter. The ID of the dashboard that has the visual that you want to embed. The DashboardId can be found in the IDs for developers section of the Embed visual pane of the visual's on-visual menu of the Amazon QuickSight console. You can also get the DashboardId with a ListDashboards API operation. The ID of the sheet that the has visual that you want to embed. The SheetId can be found in the IDs for developers section of the Embed visual pane of the visual's on-visual menu of the Amazon QuickSight console. The ID of the visual that you want to embed. The VisualID can be found in the IDs for developers section of the Embed visual pane of the visual's on-visual menu of the Amazon QuickSight console. QSearchBar (dict) --- The Q search bar that you want to use for anonymous user embedding. The Amazon QuickSight Q topic ID of the legacy topic that you want the anonymous user to see first. When the URL in response is accessed, Amazon QuickSight renders the Q search bar with this legacy topic pre-selected. The Amazon Resource Name (ARN) of this Q legacy topic must be included in the AuthorizedResourceArns parameter. Otherwise, the request fails with an InvalidParameterValueException error. GenerativeQnA (dict) --- The Generative Q&A experience that you want to use for anonymous user embedding. The Amazon QuickSight Q topic ID of the new reader experience topic that you want the anonymous user to see first. When the URL in response is accessed, Amazon QuickSight renders the Generative Q&A experience with this new reader experience topic pre selected. The Amazon Resource Name (ARN) of this Q new reader experience topic must be included in the AuthorizedResourceArns parameter. Otherwise, the request fails with an InvalidParameterValueException error.",
      "nested_params": [
        {
          "name": "Dashboard",
          "type": "dict",
          "required": false,
          "description": "The type of embedding experience. In this case, Amazon QuickSight dashboards.",
          "nested_params": [
            {
              "name": "InitialDashboardId",
              "type": "string",
              "required": false,
              "description": "The dashboard ID for the dashboard that you want the user to see first. This ID is included in the output URL. When the URL in response is accessed, Amazon QuickSight renders this dashboard. The Amazon Resource Name (ARN) of this dashboard must be included in the AuthorizedResourceArns parameter. Otherwise, the request will fail with InvalidParameterValueException.",
              "nested_params": []
            },
            {
              "name": "EnabledFeatures",
              "type": "list",
              "required": false,
              "description": "A list of all enabled features of a specified anonymous dashboard.",
              "nested_params": []
            },
            {
              "name": "DisabledFeatures",
              "type": "list",
              "required": false,
              "description": "A list of all disabled features of a specified anonymous dashboard.",
              "nested_params": []
            },
            {
              "name": "FeatureConfigurations",
              "type": "dict",
              "required": false,
              "description": "The feature configuration for an embedded dashboard.",
              "nested_params": [
                {
                  "name": "SharedView",
                  "type": "dict",
                  "required": false,
                  "description": "The shared view settings of an embedded dashboard.",
                  "nested_params": [
                    {
                      "name": "Enabled",
                      "type": "boolean",
                      "required": false,
                      "description": "The shared view settings of an embedded dashboard.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "DashboardVisual",
          "type": "dict",
          "required": false,
          "description": "The type of embedding experience. In this case, Amazon QuickSight visuals.",
          "nested_params": [
            {
              "name": "InitialDashboardVisualId",
              "type": "dict",
              "required": false,
              "description": "The visual ID for the visual that you want the user to see. This ID is included in the output URL. When the URL in response is accessed, Amazon QuickSight renders this visual. The Amazon Resource Name (ARN) of the dashboard that the visual belongs to must be included in the AuthorizedResourceArns parameter. Otherwise, the request will fail with InvalidParameterValueException.",
              "nested_params": [
                {
                  "name": "DashboardId",
                  "type": "string",
                  "required": false,
                  "description": "The ID of the dashboard that has the visual that you want to embed. The DashboardId can be found in the IDs for developers section of the Embed visual pane of the visual's on-visual menu of the Amazon QuickSight console. You can also get the DashboardId with a ListDashboards API operation.",
                  "nested_params": []
                },
                {
                  "name": "SheetId",
                  "type": "string",
                  "required": false,
                  "description": "The ID of the sheet that the has visual that you want to embed. The SheetId can be found in the IDs for developers section of the Embed visual pane of the visual's on-visual menu of the Amazon QuickSight console.",
                  "nested_params": []
                },
                {
                  "name": "VisualId",
                  "type": "string",
                  "required": false,
                  "description": "The ID of the visual that you want to embed. The VisualID can be found in the IDs for developers section of the Embed visual pane of the visual's on-visual menu of the Amazon QuickSight console.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "QSearchBar",
          "type": "dict",
          "required": false,
          "description": "The Q search bar that you want to use for anonymous user embedding.",
          "nested_params": [
            {
              "name": "InitialTopicId",
              "type": "string",
              "required": false,
              "description": "The Amazon QuickSight Q topic ID of the legacy topic that you want the anonymous user to see first. This ID is included in the output URL. When the URL in response is accessed, Amazon QuickSight renders the Q search bar with this legacy topic pre-selected. The Amazon Resource Name (ARN) of this Q legacy topic must be included in the AuthorizedResourceArns parameter. Otherwise, the request fails with an InvalidParameterValueException error.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "GenerativeQnA",
          "type": "dict",
          "required": false,
          "description": "The Generative Q&A experience that you want to use for anonymous user embedding.",
          "nested_params": [
            {
              "name": "InitialTopicId",
              "type": "string",
              "required": false,
              "description": "The Amazon QuickSight Q topic ID of the new reader experience topic that you want the anonymous user to see first. This ID is included in the output URL. When the URL in response is accessed, Amazon QuickSight renders the Generative Q&A experience with this new reader experience topic pre selected. The Amazon Resource Name (ARN) of this Q new reader experience topic must be included in the AuthorizedResourceArns parameter. Otherwise, the request fails with an InvalidParameterValueException error.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "AllowedDomains",
      "type": "list",
      "required": false,
      "description": "The domains that you want to add to the allow list for access to the generated URL that is then embedded. This optional parameter overrides the static domains that are configured in the Manage QuickSight menu in the Amazon QuickSight console. Instead, it allows only the domains that you include in this parameter. You can list up to three domains or subdomains in each API call. To include all subdomains under a specific domain to the allow list, use *. For example, https://*.sapp.amazon.com includes all subdomains under https://sapp.amazon.com. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "EmbedUrl",
          "type": "string",
          "description": "The embed URL for the dashboard.",
          "nested_items": []
        },
        {
          "name": "Status",
          "type": "integer",
          "description": "The HTTP status of the request.",
          "nested_items": []
        },
        {
          "name": "RequestId",
          "type": "string",
          "description": "The Amazon Web Services request ID for this operation.",
          "nested_items": []
        },
        {
          "name": "AnonymousUserArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) to use for the anonymous Amazon QuickSight user.",
          "nested_items": []
        }
      ]
    }
  ]
}