{
  "method_name": "get_dashboard_embed_url",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/quicksight/client/get_dashboard_embed_url.html",
  "description": "Generates a temporary session URL and authorization code(bearer token) that you can use to embed an Amazon QuickSight read-only dashboard in your website or application. Before you use this command, make sure that you have configured the dashboards and permissions. Currently, you can use GetDashboardEmbedURL only from the server, not from the user's browser. The following rules apply to the generated URL: For more information, see Embedding Analytics Using GetDashboardEmbedUrl in the Amazon QuickSight User Guide. For more information about the high-level steps for embedding and for an interactive demo of the ways you can customize embedding, visit the Amazon QuickSight Developer Portal.",
  "parameters": [
    {
      "name": "AwsAccountId",
      "type": "string",
      "required": true,
      "description": "The ID for the Amazon Web Services account that contains the dashboard that you're embedding.",
      "nested_params": []
    },
    {
      "name": "DashboardId",
      "type": "string",
      "required": true,
      "description": "The ID for the dashboard, also added to the Identity and Access Management (IAM) policy.",
      "nested_params": []
    },
    {
      "name": "IdentityType",
      "type": "string",
      "required": true,
      "description": "The authentication method that the user uses to sign in.",
      "nested_params": []
    },
    {
      "name": "SessionLifetimeInMinutes",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "UndoRedoDisabled",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ResetDisabled",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "StatePersistenceEnabled",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "UserArn",
      "type": "string",
      "required": false,
      "description": "The Amazon QuickSight user's Amazon Resource Name (ARN), for use with QUICKSIGHT identity type. You can use this for any Amazon QuickSight users in your account (readers, authors, or admins) authenticated as one of the following: Active Directory (AD) users or group members Invited nonfederated users IAM users and IAM role-based sessions authenticated through Federated Single Sign-On using SAML, OpenID Connect, or IAM federation. Omit this parameter for users in the third group --- IAM users and IAM role-based sessions.",
      "nested_params": []
    },
    {
      "name": "Namespace",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "AdditionalDashboardIds",
      "type": "list",
      "required": false,
      "description": "A list of one or more dashboard IDs that you want anonymous users to have tempporary access to. Currently, the IdentityType parameter must be set to ANONYMOUS because other identity types authenticate as Amazon QuickSight or IAM users. For example, if you set ' --dashboard-id dash_id1 --dashboard-id dash_id2 dash_id3 identity-type ANONYMOUS', the session can access all three dashboards. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "EmbedUrl",
          "type": "string",
          "description": "A single-use URL that you can put into your server-side webpage to embed your dashboard. This URL is valid for 5 minutes. The API operation provides the URL with an auth_code value that enables one (and only one) sign-on to a user session that is valid for 10 hours.",
          "nested_items": []
        },
        {
          "name": "Status",
          "type": "integer",
          "description": "The HTTP status of the request.",
          "nested_items": []
        },
        {
          "name": "RequestId",
          "type": "string",
          "description": "The Amazon Web Services request ID for this operation.",
          "nested_items": []
        }
      ]
    }
  ]
}