{
  "method_name": "register_user",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/quicksight/client/register_user.html",
  "description": "Creates an Amazon QuickSight user whose identity is associated with the Identity and Access Management (IAM) identity or role specified in the request. When you register a new user from the Amazon QuickSight API, Amazon QuickSight generates a registration URL. The user accesses this registration URL to create their account. Amazon QuickSight doesn't send a registration email to users who are registered from the Amazon QuickSight API. If you want new users to receive a registration email, then add those users in the Amazon QuickSight console. For more information on registering a new user in the Amazon QuickSight console, see Inviting users to access Amazon QuickSight.",
  "parameters": [
    {
      "name": "IdentityType",
      "type": "string",
      "required": true,
      "description": "The identity type that your Amazon QuickSight account uses to manage the identity of users.",
      "nested_params": []
    },
    {
      "name": "Email",
      "type": "string",
      "required": true,
      "description": "The email address of the user that you want to register.",
      "nested_params": []
    },
    {
      "name": "UserRole",
      "type": "string",
      "required": true,
      "description": "The Amazon QuickSight role for the user. The user role can be one of the following: READER: A user who has read-only access to dashboards. AUTHOR: A user who can create data sources, datasets, analyses, and dashboards. ADMIN: A user who is an author, who can also manage Amazon QuickSight settings. READER_PRO: Reader Pro adds Generative BI capabilities to the Reader role. Reader Pros have access to Amazon Q in Amazon QuickSight, can build stories with Amazon Q, and can generate executive summaries from dashboards. AUTHOR_PRO: Author Pro adds Generative BI capabilities to the Author role. Author Pros can author dashboards with natural language with Amazon Q, build stories with Amazon Q, create Topics for Q&A, and generate executive summaries from dashboards. ADMIN_PRO: Admin Pros are Author Pros who can also manage Amazon QuickSight administrative settings. Admin Pro users are billed at Author Pro pricing. RESTRICTED_READER: This role isn't currently available for use. RESTRICTED_AUTHOR: This role isn't currently available for use.",
      "nested_params": []
    },
    {
      "name": "IamArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "SessionName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "AwsAccountId",
      "type": "string",
      "required": true,
      "description": "The ID for the Amazon Web Services account that the user is in. Currently, you use the ID for the Amazon Web Services account that contains your Amazon QuickSight account.",
      "nested_params": []
    },
    {
      "name": "Namespace",
      "type": "string",
      "required": true,
      "description": "The namespace. Currently, you should set this to default.",
      "nested_params": []
    },
    {
      "name": "UserName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "CustomPermissionsName",
      "type": "string",
      "required": false,
      "description": "(Enterprise edition only) The name of the custom permissions profile that you want to assign to this user. Customized permissions allows you to control a user's access by restricting access the following operations: Create and update data sources Create and update datasets Create and update email reports Subscribe to email reports To add custom permissions to an existing user, use UpdateUser instead. A set of custom permissions includes any combination of these restrictions. Currently, you need to create the profile names for custom permission sets by using the Amazon QuickSight console. Then, you use the RegisterUser API operation to assign the named set of permissions to a Amazon QuickSight user. Amazon QuickSight custom permissions are applied through IAM policies. Therefore, they override the permissions typically granted by assigning Amazon QuickSight users to one of the default security cohorts in Amazon QuickSight (admin, author, reader, admin pro, author pro, reader pro). This feature is available only to Amazon QuickSight Enterprise edition subscriptions.",
      "nested_params": []
    },
    {
      "name": "ExternalLoginFederationProviderType",
      "type": "string",
      "required": false,
      "description": "The type of supported external login provider that provides identity to let a user federate into Amazon QuickSight with an associated Identity and Access Management(IAM) role. The type of supported external login provider can be one of the following. COGNITO: Amazon Cognito. The provider URL is cognito-identity.amazonaws.com. When choosing the COGNITO provider type, don't use the 'CustomFederationProviderUrl' parameter which is only needed when the external provider is custom. CUSTOM_OIDC: Custom OpenID Connect (OIDC) provider. When choosing CUSTOM_OIDC type, use the CustomFederationProviderUrl parameter to provide the custom OIDC provider URL.",
      "nested_params": []
    },
    {
      "name": "CustomFederationProviderUrl",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ExternalLoginId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "The tags to associate with the user. (dict) --- The key or keys of the key-value pairs for the resource tag or tags assigned to the resource. Tag key. Tag value.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "Tag key.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "Tag value.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "Arn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) for the user.",
              "nested_items": []
            },
            {
              "name": "UserName",
              "type": "string",
              "description": "The user's user name. This value is required if you are registering a user that will be managed in Amazon QuickSight. In the output, the value for UserName is N/A when the value for IdentityType is IAM and the corresponding IAM user is deleted.",
              "nested_items": []
            },
            {
              "name": "Email",
              "type": "string",
              "description": "The user's email address.",
              "nested_items": []
            },
            {
              "name": "Role",
              "type": "string",
              "description": "The Amazon QuickSight role for the user. The user role can be one of the following:.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "READER: A user who has read-only access to dashboards.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "AUTHOR: A user who can create data sources, datasets, analyses, and dashboards.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "ADMIN: A user who is an author, who can also manage Amazon Amazon QuickSight settings.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "READER_PRO: Reader Pro adds Generative BI capabilities to the Reader role. Reader Pros have access to Amazon Q in Amazon QuickSight, can build stories with Amazon Q, and can generate executive summaries from dashboards.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "AUTHOR_PRO: Author Pro adds Generative BI capabilities to the Author role. Author Pros can author dashboards with natural language with Amazon Q, build stories with Amazon Q, create Topics for Q&A, and generate executive summaries from dashboards.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "ADMIN_PRO: Admin Pros are Author Pros who can also manage Amazon QuickSight administrative settings. Admin Pro users are billed at Author Pro pricing.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "RESTRICTED_READER: This role isn't currently available for use.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "RESTRICTED_AUTHOR: This role isn't currently available for use.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "IdentityType",
              "type": "string",
              "description": "The type of identity authentication used by the user.",
              "nested_items": []
            },
            {
              "name": "Active",
              "type": "boolean",
              "description": "The active status of user. When you create an Amazon QuickSight user that's not an IAM user or an Active Directory user, that user is inactive until they sign in and provide a password.",
              "nested_items": []
            },
            {
              "name": "PrincipalId",
              "type": "string",
              "description": "The principal ID of the user.",
              "nested_items": []
            },
            {
              "name": "CustomPermissionsName",
              "type": "string",
              "description": "The custom permissions profile associated with this user.",
              "nested_items": []
            },
            {
              "name": "ExternalLoginFederationProviderType",
              "type": "string",
              "description": "The type of supported external login provider that provides identity to let the user federate into Amazon QuickSight with an associated IAM role. The type can be one of the following.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "COGNITO: Amazon Cognito. The provider URL is cognito-identity.amazonaws.com.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "OIDC",
                  "description": "CUSTOM_OIDC: Custom OpenID Connect (OIDC) provider.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "ExternalLoginFederationProviderUrl",
              "type": "string",
              "description": "The URL of the external login provider.",
              "nested_items": []
            },
            {
              "name": "ExternalLoginId",
              "type": "string",
              "description": "The identity ID for the user in the external login provider.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "UserInvitationUrl",
          "type": "string",
          "description": "The URL the user visits to complete registration and provide a password. This is returned only for users with an identity type of QUICKSIGHT.",
          "nested_items": []
        },
        {
          "name": "RequestId",
          "type": "string",
          "description": "The Amazon Web Services request ID for this operation.",
          "nested_items": []
        },
        {
          "name": "Status",
          "type": "integer",
          "description": "The HTTP status of the request.",
          "nested_items": []
        }
      ]
    }
  ]
}