{
  "method_name": "start_asset_bundle_export_job",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/quicksight/client/start_asset_bundle_export_job.html",
  "description": "Starts an Asset Bundle export job. An Asset Bundle export job exports specified Amazon QuickSight assets. You can also choose to export any asset dependencies in the same job. Export jobs run asynchronously and can be polled with a DescribeAssetBundleExportJob API call. When a job is successfully completed, a download URL that contains the exported assets is returned. The URL is valid for 5 minutes and can be refreshed with a DescribeAssetBundleExportJob API call. Each Amazon QuickSight account can run up to 5 export jobs concurrently. The API caller must have the necessary permissions in their IAM role to access each resource before the resources can be exported.",
  "parameters": [
    {
      "name": "AwsAccountId",
      "type": "string",
      "required": true,
      "description": "The ID of the Amazon Web Services account to export assets from.",
      "nested_params": []
    },
    {
      "name": "AssetBundleExportJobId",
      "type": "string",
      "required": true,
      "description": "The ID of the job. This ID is unique while the job is running. After the job is completed, you can reuse this ID for another job.",
      "nested_params": []
    },
    {
      "name": "ResourceArns",
      "type": "list",
      "required": true,
      "description": "An array of resource ARNs to export. The following resources are supported. Analysis Dashboard DataSet DataSource RefreshSchedule Theme VPCConnection The API caller must have the necessary permissions in their IAM role to access each resource before the resources can be exported. (string) ---",
      "nested_params": []
    },
    {
      "name": "IncludeAllDependencies",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ExportFormat",
      "type": "string",
      "required": true,
      "description": "The export data format.",
      "nested_params": []
    },
    {
      "name": "CloudFormationOverridePropertyConfiguration",
      "type": "dict",
      "required": true,
      "description": "An optional collection of structures that generate CloudFormation parameters to override the existing resource property values when the resource is exported to a new CloudFormation template. Use this field if the ExportFormat field of a StartAssetBundleExportJobRequest API call is set to CLOUDFORMATION_JSON. ResourceIdOverrideConfiguration (dict) --- An optional list of structures that control how resource IDs are parameterized in the returned CloudFormation template. PrefixForAllResources (boolean) --- An option to request a CloudFormation variable for a prefix to be prepended to each resource's ID before import. The prefix is only added to the asset IDs and does not change the name of the asset. VPCConnections (list) --- An optional list of structures that control how VPCConnection resources are parameterized in the returned CloudFormation template. (dict) --- Controls how a specific VPCConnection resource is parameterized in the outputted CloudFormation template. The ARN of the specific VPCConnection resource whose override properties are configured in this structure. A list of VPCConnection resource properties to generate variables for in the returned CloudFormation template. (string) --- RefreshSchedules (list) --- An optional list of structures that control how RefreshSchedule resources are parameterized in the returned CloudFormation template. (dict) --- Controls how a specific RefreshSchedule resource is parameterized in the returned CloudFormation template. The ARN of the specific RefreshSchedule resource whose override properties are configured in this structure. A list of RefreshSchedule resource properties to generate variables for in the returned CloudFormation template. (string) --- DataSources (list) --- An optional list of structures that control how DataSource resources are parameterized in the returned CloudFormation template. (dict) --- Controls how a specific DataSource resource is parameterized in the returned CloudFormation template. The ARN of the specific DataSource resource whose override properties are configured in this structure. A list of DataSource resource properties to generate variables for in the returned CloudFormation template. (string) --- DataSets (list) --- An optional list of structures that control how DataSet resources are parameterized in the returned CloudFormation template. (dict) --- Controls how a specific DataSet resource is parameterized in the returned CloudFormation template. The ARN of the specific DataSet resource whose override properties are configured in this structure. A list of DataSet resource properties to generate variables for in the returned CloudFormation template. (string) --- Themes (list) --- An optional list of structures that control how Theme resources are parameterized in the returned CloudFormation template. (dict) --- Controls how a specific Theme resource is parameterized in the returned CloudFormation template. The ARN of the specific Theme resource whose override properties are configured in this structure. A list of Theme resource properties to generate variables for in the returned CloudFormation template. (string) --- Analyses (list) --- An optional list of structures that control how Analysis resources are parameterized in the returned CloudFormation template. (dict) --- Controls how a specific Analysis resource is parameterized in the returned CloudFormation template. The ARN of the specific Analysis resource whose override properties are configured in this structure. A list of Analysis resource properties to generate variables for in the returned CloudFormation template. (string) --- Dashboards (list) --- An optional list of structures that control how Dashboard resources are parameterized in the returned CloudFormation template. (dict) --- Controls how a specific Dashboard resource is parameterized in the returned CloudFormation template. The ARN of the specific Dashboard resource whose override properties are configured in this structure. A list of Dashboard resource properties to generate variables for in the returned CloudFormation template. (string) --- Folders (list) --- An optional list of structures that controls how Folder resources are parameterized in the returned CloudFormation template. (dict) --- Controls how a specific Folder resource is parameterized in the returned CloudFormation template. The ARN of the specific Folder resource whose override properties are configured in this structure. A list of Folder resource properties to generate variables for in the returned CloudFormation template. (string) ---",
      "nested_params": [
        {
          "name": "ResourceIdOverrideConfiguration",
          "type": "dict",
          "required": false,
          "description": "An optional list of structures that control how resource IDs are parameterized in the returned CloudFormation template.",
          "nested_params": [
            {
              "name": "PrefixForAllResources",
              "type": "boolean",
              "required": false,
              "description": "An option to request a CloudFormation variable for a prefix to be prepended to each resource's ID before import. The prefix is only added to the asset IDs and does not change the name of the asset.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "VPCConnections",
          "type": "list",
          "required": false,
          "description": "An optional list of structures that control how VPCConnection resources are parameterized in the returned CloudFormation template.",
          "nested_params": [
            {
              "name": "Arn",
              "type": "string",
              "required": false,
              "description": "The ARN of the specific VPCConnection resource whose override properties are configured in this structure.",
              "nested_params": []
            },
            {
              "name": "Properties",
              "type": "list",
              "required": false,
              "description": "A list of VPCConnection resource properties to generate variables for in the returned CloudFormation template.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "RefreshSchedules",
          "type": "list",
          "required": false,
          "description": "An optional list of structures that control how RefreshSchedule resources are parameterized in the returned CloudFormation template.",
          "nested_params": [
            {
              "name": "Arn",
              "type": "string",
              "required": false,
              "description": "The ARN of the specific RefreshSchedule resource whose override properties are configured in this structure.",
              "nested_params": []
            },
            {
              "name": "Properties",
              "type": "list",
              "required": false,
              "description": "A list of RefreshSchedule resource properties to generate variables for in the returned CloudFormation template.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "DataSources",
          "type": "list",
          "required": false,
          "description": "An optional list of structures that control how DataSource resources are parameterized in the returned CloudFormation template.",
          "nested_params": [
            {
              "name": "Arn",
              "type": "string",
              "required": false,
              "description": "The ARN of the specific DataSource resource whose override properties are configured in this structure.",
              "nested_params": []
            },
            {
              "name": "Properties",
              "type": "list",
              "required": false,
              "description": "A list of DataSource resource properties to generate variables for in the returned CloudFormation template.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "DataSets",
          "type": "list",
          "required": false,
          "description": "An optional list of structures that control how DataSet resources are parameterized in the returned CloudFormation template.",
          "nested_params": [
            {
              "name": "Arn",
              "type": "string",
              "required": false,
              "description": "The ARN of the specific DataSet resource whose override properties are configured in this structure.",
              "nested_params": []
            },
            {
              "name": "Properties",
              "type": "list",
              "required": false,
              "description": "A list of DataSet resource properties to generate variables for in the returned CloudFormation template.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Themes",
          "type": "list",
          "required": false,
          "description": "An optional list of structures that control how Theme resources are parameterized in the returned CloudFormation template.",
          "nested_params": [
            {
              "name": "Arn",
              "type": "string",
              "required": false,
              "description": "The ARN of the specific Theme resource whose override properties are configured in this structure.",
              "nested_params": []
            },
            {
              "name": "Properties",
              "type": "list",
              "required": false,
              "description": "A list of Theme resource properties to generate variables for in the returned CloudFormation template.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Analyses",
          "type": "list",
          "required": false,
          "description": "An optional list of structures that control how Analysis resources are parameterized in the returned CloudFormation template.",
          "nested_params": [
            {
              "name": "Arn",
              "type": "string",
              "required": false,
              "description": "The ARN of the specific Analysis resource whose override properties are configured in this structure.",
              "nested_params": []
            },
            {
              "name": "Properties",
              "type": "list",
              "required": false,
              "description": "A list of Analysis resource properties to generate variables for in the returned CloudFormation template.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Dashboards",
          "type": "list",
          "required": false,
          "description": "An optional list of structures that control how Dashboard resources are parameterized in the returned CloudFormation template.",
          "nested_params": [
            {
              "name": "Arn",
              "type": "string",
              "required": false,
              "description": "The ARN of the specific Dashboard resource whose override properties are configured in this structure.",
              "nested_params": []
            },
            {
              "name": "Properties",
              "type": "list",
              "required": false,
              "description": "A list of Dashboard resource properties to generate variables for in the returned CloudFormation template.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Folders",
          "type": "list",
          "required": false,
          "description": "An optional list of structures that controls how Folder resources are parameterized in the returned CloudFormation template.",
          "nested_params": [
            {
              "name": "Arn",
              "type": "string",
              "required": false,
              "description": "The ARN of the specific Folder resource whose override properties are configured in this structure.",
              "nested_params": []
            },
            {
              "name": "Properties",
              "type": "list",
              "required": false,
              "description": "A list of Folder resource properties to generate variables for in the returned CloudFormation template.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "IncludePermissions",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "IncludeTags",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ValidationStrategy",
      "type": "dict",
      "required": false,
      "description": "An optional parameter that determines which validation strategy to use for the export job. If StrictModeForAllResources is set to TRUE, strict validation for every error is enforced. If it is set to FALSE, validation is skipped for specific UI errors that are shown as warnings. The default value for StrictModeForAllResources is FALSE. StrictModeForAllResources (boolean) --- A Boolean value that indicates whether to export resources under strict or lenient mode.",
      "nested_params": [
        {
          "name": "StrictModeForAllResources",
          "type": "boolean",
          "required": false,
          "description": "A Boolean value that indicates whether to export resources under strict or lenient mode.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "IncludeFolderMemberships",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "IncludeFolderMembers",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Arn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) for the export job.",
          "nested_items": []
        },
        {
          "name": "AssetBundleExportJobId",
          "type": "string",
          "description": "The ID of the job. This ID is unique while the job is running. After the job is completed, you can reuse this ID for another job.",
          "nested_items": []
        },
        {
          "name": "RequestId",
          "type": "string",
          "description": "The Amazon Web Services response ID for this operation.",
          "nested_items": []
        },
        {
          "name": "Status",
          "type": "integer",
          "description": "The HTTP status of the response.",
          "nested_items": []
        }
      ]
    }
  ]
}