{
  "method_name": "update_key_registration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/quicksight/client/update_key_registration.html",
  "description": "Updates a customer managed key in a Amazon QuickSight account.",
  "parameters": [
    {
      "name": "AwsAccountId",
      "type": "string",
      "required": true,
      "description": "The ID of the Amazon Web Services account that contains the customer managed key registration that you want to update.",
      "nested_params": []
    },
    {
      "name": "KeyRegistration",
      "type": "list",
      "required": true,
      "description": "A list of RegisteredCustomerManagedKey objects to be updated to the Amazon QuickSight account. (dict) --- A customer managed key structure that contains the information listed below: KeyArn - The ARN of a KMS key that is registered to a Amazon QuickSight account for encryption and decryption use. DefaultKey - Indicates whether the current key is set as the default key for encryption and decryption use. KeyArn (string) --- The ARN of the KMS key that is registered to a Amazon QuickSight account for encryption and decryption use. DefaultKey (boolean) --- Indicates whether a RegisteredCustomerManagedKey is set as the default key for encryption and decryption use.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "FailedKeyRegistration",
          "type": "list",
          "description": "A list of all customer managed key registrations that failed to update.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "KeyArn",
                  "type": "string",
                  "description": "The ARN of the KMS key that failed to update.",
                  "nested_items": []
                },
                {
                  "name": "Message",
                  "type": "string",
                  "description": "A message that provides information about why a FailedKeyRegistrationEntry error occurred.",
                  "nested_items": []
                },
                {
                  "name": "StatusCode",
                  "type": "integer",
                  "description": "The HTTP status of a FailedKeyRegistrationEntry error.",
                  "nested_items": []
                },
                {
                  "name": "SenderFault",
                  "type": "boolean",
                  "description": "A boolean that indicates whether a FailedKeyRegistrationEntry resulted from user error. If the value of this property is True, the error was caused by user error. If the value of this property is False, the error occurred on the backend. If your job continues fail and with a False SenderFault value, contact Amazon Web ServicesSupport.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "SuccessfulKeyRegistration",
          "type": "list",
          "description": "A list of all customer managed key registrations that were successfully updated.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "KeyArn",
                  "type": "string",
                  "description": "The ARN of the KMS key that is associated with the SuccessfulKeyRegistrationEntry entry.",
                  "nested_items": []
                },
                {
                  "name": "StatusCode",
                  "type": "integer",
                  "description": "The HTTP status of a SuccessfulKeyRegistrationEntry entry.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "RequestId",
          "type": "string",
          "description": "The Amazon Web Services request ID for this operation.",
          "nested_items": []
        }
      ]
    }
  ]
}