{
  "method_name": "meter_usage",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/meteringmarketplace/client/meter_usage.html",
  "description": "API to emit metering records. For identical requests, the API is idempotent and returns the metering record ID. This is used for metering flexible consumption pricing (FCP) Amazon Machine Images (AMI) and container products. MeterUsage is authenticated on the buyer's Amazon Web Services account using credentials from the Amazon EC2 instance, Amazon ECS task, or Amazon EKS pod. MeterUsage can optionally include multiple usage allocations, to provide customers with usage data split into buckets by tags that you define (or allow the customer to define). Usage records are expected to be submitted as quickly as possible after the event that is being recorded, and are not accepted more than 6 hours after the event. For Amazon Web Services Regions that support MeterUsage, see MeterUsage Region support for Amazon EC2 and MeterUsage Region support for Amazon ECS and Amazon EKS.",
  "parameters": [
    {
      "name": "ProductCode",
      "type": "string",
      "required": true,
      "description": "Product code is used to uniquely identify a product in Amazon Web Services Marketplace. The product code should be the same as the one used during the publishing of a new product.",
      "nested_params": []
    },
    {
      "name": "Timestamp",
      "type": "datetime",
      "required": true,
      "description": "Timestamp, in UTC, for which the usage is being reported. Your application can meter usage for up to six hours in the past. Make sure the timestamp value is not before the start of the software usage.",
      "nested_params": []
    },
    {
      "name": "UsageDimension",
      "type": "string",
      "required": true,
      "description": "It will be one of the fcp dimension name provided during the publishing of the product.",
      "nested_params": []
    },
    {
      "name": "UsageQuantity",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "UsageAllocations",
      "type": "list",
      "required": true,
      "description": "The set of UsageAllocations to submit. The sum of all UsageAllocation quantities must equal the UsageQuantity of the MeterUsage request, and each UsageAllocation must have a unique set of tags (include no tags). (dict) --- Usage allocations allow you to split usage into buckets by tags. Each UsageAllocation indicates the usage quantity for a specific set of tags. The total quantity allocated to this bucket of usage. Tags (list) --- The set of tags that define the bucket of usage. For the bucket of items with no tags, this parameter can be left out. (dict) --- Metadata assigned to an allocation. Each tag is made up of a key and a value. One part of a key-value pair that makes up a tag. A key is a label that acts like a category for the specific tag values. A value acts as a descriptor within a tag category (key). The value can be empty or null.",
      "nested_params": [
        {
          "name": "AllocatedUsageQuantity",
          "type": "integer",
          "required": false,
          "description": "The total quantity allocated to this bucket of usage.",
          "nested_params": []
        },
        {
          "name": "Tags",
          "type": "list",
          "required": false,
          "description": "The set of tags that define the bucket of usage. For the bucket of items with no tags, this parameter can be left out.",
          "nested_params": [
            {
              "name": "Key",
              "type": "string",
              "required": false,
              "description": "One part of a key-value pair that makes up a tag. A key is a label that acts like a category for the specific tag values.",
              "nested_params": []
            },
            {
              "name": "Value",
              "type": "string",
              "required": false,
              "description": "One part of a key-value pair that makes up a tag. A value acts as a descriptor within a tag category (key). The value can be empty or null.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "MeteringRecordId",
          "type": "string",
          "description": "Metering record id.",
          "nested_items": []
        }
      ]
    }
  ]
}