{
  "method_name": "resolve_customer",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/meteringmarketplace/client/resolve_customer.html",
  "description": "ResolveCustomer is called by a SaaS application during the registration process. When a buyer visits your website during the registration process, the buyer submits a registration token through their browser. The registration token is resolved through this API to obtain a CustomerIdentifier along with the CustomerAWSAccountId and ProductCode. Permission is required for this operation. Your IAM role or user performing this operation requires a policy to allow the aws-marketplace:ResolveCustomer action. For more information, see Actions, resources, and condition keys for Amazon Web Services Marketplace Metering Service in the Service Authorization Reference. For Amazon Web Services Regions that support ResolveCustomer, see ResolveCustomer Region support.",
  "parameters": [
    {
      "name": "RegistrationToken",
      "type": "string",
      "required": true,
      "description": "When a buyer visits your website during the registration process, the buyer submits a registration token through the browser. The registration token is resolved to obtain a CustomerIdentifier along with the CustomerAWSAccountId and ProductCode.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "CustomerIdentifier",
          "type": "string",
          "description": "The CustomerIdentifier is used to identify an individual customer in your application. Calls to BatchMeterUsage require CustomerIdentifiers for each UsageRecord.",
          "nested_items": []
        },
        {
          "name": "ProductCode",
          "type": "string",
          "description": "The product code is returned to confirm that the buyer is registering for your product. Subsequent BatchMeterUsage calls should be made using this product code.",
          "nested_items": []
        },
        {
          "name": "CustomerAWSAccountId",
          "type": "string",
          "description": "The CustomerAWSAccountId provides the Amazon Web Services account ID associated with the CustomerIdentifier for the individual customer.",
          "nested_items": []
        }
      ]
    }
  ]
}