{
  "method_name": "update_nodegroup_version",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/eks/client/update_nodegroup_version.html",
  "description": "Updates the Kubernetes version or AMI version of an Amazon EKS managed node group. You can update a node group using a launch template only if the node group was originally deployed with a launch template. Additionally, the launch template ID or name must match what was used when the node group was created. You can update the launch template version with necessary changes. If you need to update a custom AMI in a node group that was deployed with a launch template, then update your custom AMI, specify the new ID in a new version of the launch template, and then update the node group to the new version of the launch template. If you update without a launch template, then you can update to the latest available AMI version of a node group's current Kubernetes version by not specifying a Kubernetes version in the request. You can update to the latest AMI version of your cluster's current Kubernetes version by specifying your cluster's Kubernetes version in the request. For information about Linux versions, see Amazon EKS optimized Amazon Linux AMI versions in the Amazon EKS User Guide. For information about Windows versions, see Amazon EKS optimized Windows AMI versions in the Amazon EKS User Guide. You cannot roll back a node group to an earlier Kubernetes version or AMI version. When a node in a managed node group is terminated due to a scaling action or update, every Pod on that node is drained first. Amazon EKS attempts to drain the nodes gracefully and will fail if it is unable to do so. You can force the update if Amazon EKS is unable to drain the nodes as a result of a Pod disruption budget issue.",
  "parameters": [
    {
      "name": "clusterName",
      "type": "string",
      "required": true,
      "description": "The name of your cluster.",
      "nested_params": []
    },
    {
      "name": "nodegroupName",
      "type": "string",
      "required": true,
      "description": "The name of the managed node group to update.",
      "nested_params": []
    },
    {
      "name": "version",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "releaseVersion",
      "type": "string",
      "required": false,
      "description": "The AMI version of the Amazon EKS optimized AMI to use for the update. By default, the latest available AMI version for the node group's Kubernetes version is used. For information about Linux versions, see Amazon EKS optimized Amazon Linux AMI versions in the Amazon EKS User Guide. Amazon EKS managed node groups support the November 2022 and later releases of the Windows AMIs. For information about Windows versions, see Amazon EKS optimized Windows AMI versions in the Amazon EKS User Guide. If you specify launchTemplate, and your launch template uses a custom AMI, then don't specify releaseVersion, or the node group update will fail. For more information about using launch templates with Amazon EKS, see Customizing managed nodes with launch templates in the Amazon EKS User Guide.",
      "nested_params": []
    },
    {
      "name": "launchTemplate",
      "type": "dict",
      "required": false,
      "description": "An object representing a node group's launch template specification. You can only update a node group using a launch template if the node group was originally deployed with a launch template. When updating, you must specify the same launch template ID or name that was used to create the node group. name (string) --- The name of the launch template. You must specify either the launch template name or the launch template ID in the request, but not both. After node group creation, you cannot use a different name. version (string) --- The version number of the launch template to use. If no version is specified, then the template's default version is used. You can use a different version for node group updates. id (string) --- The ID of the launch template. You must specify either the launch template ID or the launch template name in the request, but not both. After node group creation, you cannot use a different ID.",
      "nested_params": [
        {
          "name": "name",
          "type": "string",
          "required": false,
          "description": "The name of the launch template. You must specify either the launch template name or the launch template ID in the request, but not both. After node group creation, you cannot use a different name.",
          "nested_params": []
        },
        {
          "name": "version",
          "type": "string",
          "required": false,
          "description": "The version number of the launch template to use. If no version is specified, then the template's default version is used. You can use a different version for node group updates.",
          "nested_params": []
        },
        {
          "name": "id",
          "type": "string",
          "required": false,
          "description": "The ID of the launch template. You must specify either the launch template ID or the launch template name in the request, but not both. After node group creation, you cannot use a different ID.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "force",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "clientRequestToken",
      "type": "string",
      "required": false,
      "description": "A unique, case-sensitive identifier that you provide to ensure the idempotency of the request. This field is autopopulated if not provided.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "id",
              "type": "string",
              "description": "A UUID that is used to track the update.",
              "nested_items": []
            },
            {
              "name": "status",
              "type": "string",
              "description": "The current status of the update.",
              "nested_items": []
            },
            {
              "name": "type",
              "type": "string",
              "description": "The type of the update.",
              "nested_items": []
            },
            {
              "name": "params",
              "type": "list",
              "description": "A key-value map that contains the parameters associated with the update.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "type",
                      "type": "string",
                      "description": "The keys associated with an update request.",
                      "nested_items": []
                    },
                    {
                      "name": "value",
                      "type": "string",
                      "description": "The value of the keys submitted as part of an update request.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "createdAt",
              "type": "datetime",
              "description": "The Unix epoch timestamp at object creation.",
              "nested_items": []
            },
            {
              "name": "errors",
              "type": "list",
              "description": "Any errors associated with a Failed update.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "errorCode",
                      "type": "string",
                      "description": "A brief description of the error.",
                      "nested_items": [
                        {
                          "name": "SubnetNotFound",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "SecurityGroupNotFound",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "EniLimitReached",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "IpNotAvailable",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "AccessDenied",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "OperationNotPermitted",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "VpcIdNotFound",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "errorMessage",
                      "type": "string",
                      "description": "A more complete description of the error.",
                      "nested_items": []
                    },
                    {
                      "name": "resourceIds",
                      "type": "list",
                      "description": "An optional field that contains the resource IDs associated with the error.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}