{
  "method_name": "update_access_entry",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/eks/client/update_access_entry.html",
  "description": "Updates an access entry.",
  "parameters": [
    {
      "name": "clusterName",
      "type": "string",
      "required": true,
      "description": "The name of your cluster.",
      "nested_params": []
    },
    {
      "name": "principalArn",
      "type": "string",
      "required": true,
      "description": "The ARN of the IAM principal for the AccessEntry.",
      "nested_params": []
    },
    {
      "name": "kubernetesGroups",
      "type": "list",
      "required": false,
      "description": "The value for name that you've specified for kind: Group as a subject in a Kubernetes RoleBinding or ClusterRoleBinding object. Amazon EKS doesn't confirm that the value for name exists in any bindings on your cluster. You can specify one or more names. Kubernetes authorizes the principalArn of the access entry to access any cluster objects that you've specified in a Kubernetes Role or ClusterRole object that is also specified in a binding's roleRef. For more information about creating Kubernetes RoleBinding, ClusterRoleBinding, Role, or ClusterRole objects, see Using RBAC Authorization in the Kubernetes documentation. If you want Amazon EKS to authorize the principalArn (instead of, or in addition to Kubernetes authorizing the principalArn), you can associate one or more access policies to the access entry using AssociateAccessPolicy. If you associate any access policies, the principalARN has all permissions assigned in the associated access policies and all permissions in any Kubernetes Role or ClusterRole objects that the group names are bound to. (string) ---",
      "nested_params": []
    },
    {
      "name": "clientRequestToken",
      "type": "string",
      "required": false,
      "description": "A unique, case-sensitive identifier that you provide to ensure the idempotency of the request. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "username",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "accessEntry",
          "type": "dict",
          "description": "The ARN of the IAM principal for the AccessEntry.",
          "nested_items": [
            {
              "name": "clusterName",
              "type": "string",
              "description": "The name of your cluster.",
              "nested_items": []
            },
            {
              "name": "principalArn",
              "type": "string",
              "description": "The ARN of the IAM principal for the access entry. If you ever delete the IAM principal with this ARN, the access entry isn't automatically deleted. We recommend that you delete the access entry with an ARN for an IAM principal that you delete. If you don't delete the access entry and ever recreate the IAM principal, even if it has the same ARN, the access entry won't work. This is because even though the ARN is the same for the recreated IAM principal, the roleID or userID (you can see this with the Security Token Service GetCallerIdentity API) is different for the recreated IAM principal than it was for the original IAM principal. Even though you don't see the IAM principal's roleID or userID for an access entry, Amazon EKS stores it with the access entry.",
              "nested_items": []
            },
            {
              "name": "kubernetesGroups",
              "type": "list",
              "description": "A name that you've specified in a Kubernetes RoleBinding or ClusterRoleBinding object so that Kubernetes authorizes the principalARN access to cluster objects.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "accessEntryArn",
              "type": "string",
              "description": "The ARN of the access entry.",
              "nested_items": []
            },
            {
              "name": "createdAt",
              "type": "datetime",
              "description": "The Unix epoch timestamp at object creation.",
              "nested_items": []
            },
            {
              "name": "modifiedAt",
              "type": "datetime",
              "description": "The Unix epoch timestamp for the last modification to the object.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "username",
              "type": "string",
              "description": "The name of a user that can authenticate to your cluster.",
              "nested_items": []
            },
            {
              "name": "type",
              "type": "string",
              "description": "The type of the access entry.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}