{
  "method_name": "add_tags",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/emr/client/add_tags.html",
  "description": "Adds tags to an Amazon EMR resource, such as a cluster or an Amazon EMR Studio. Tags make it easier to associate resources in various ways, such as grouping clusters to track your Amazon EMR resource allocation costs. For more information, see Tag Clusters.",
  "parameters": [
    {
      "name": "ResourceId",
      "type": "string",
      "required": true,
      "description": "The Amazon EMR resource identifier to which tags will be added. For example, a cluster identifier or an Amazon EMR Studio ID.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "A list of tags to associate with a resource. Tags are user-defined key-value pairs that consist of a required key string with a maximum of 128 characters, and an optional value string with a maximum of 256 characters. (dict) --- A key-value pair containing user-defined metadata that you can associate with an Amazon EMR resource. Tags make it easier to associate clusters in various ways, such as grouping clusters to track your Amazon EMR resource allocation costs. For more information, see Tag Clusters. Key (string) --- A user-defined key, which is the minimum required information for a valid tag. For more information, see Tag. Value (string) --- A user-defined value, which is optional in a tag. For more information, see Tag Clusters.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "A user-defined key, which is the minimum required information for a valid tag. For more information, see Tag.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "A user-defined value, which is optional in a tag. For more information, see Tag Clusters.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}