{
  "method_name": "get_block_public_access_configuration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/emr/client/get_block_public_access_configuration.html",
  "description": "Returns the Amazon EMR block public access configuration for your Amazon Web Services account in the current Region. For more information see Configure Block Public Access for Amazon EMR in the Amazon EMR Management Guide.",
  "parameters": [],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "BlockPublicAccessConfiguration",
          "type": "dict",
          "description": "A configuration for Amazon EMR block public access. The configuration applies to all clusters created in your account for the current Region. The configuration specifies whether block public access is enabled. If block public access is enabled, security groups associated with the cluster cannot have rules that allow inbound traffic from 0.0.0.0/0 or ::/0 on a port, unless the port is specified as an exception using PermittedPublicSecurityGroupRuleRanges in the BlockPublicAccessConfiguration. By default, Port 22 (SSH) is an exception, and public access is allowed on this port. You can change this by updating the block public access configuration to remove the exception.",
          "nested_items": [
            {
              "name": "BlockPublicSecurityGroupRules",
              "type": "boolean",
              "description": "Indicates whether Amazon EMR block public access is enabled ( true) or disabled ( false). By default, the value is false for accounts that have created Amazon EMR clusters before July 2019. For accounts created after this, the default is true.",
              "nested_items": []
            },
            {
              "name": "PermittedPublicSecurityGroupRuleRanges",
              "type": "list",
              "description": "Specifies ports and port ranges that are permitted to have security group rules that allow inbound traffic from all public sources. For example, if Port 23 (Telnet) is specified for PermittedPublicSecurityGroupRuleRanges, Amazon EMR allows cluster creation if a security group associated with the cluster has a rule that allows inbound traffic on Port 23 from IPv4 0.0.0.0/0 or IPv6 port ::/0 as the source.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "MinRange",
                      "type": "integer",
                      "description": "The smallest port number in a specified range of port numbers.",
                      "nested_items": []
                    },
                    {
                      "name": "MaxRange",
                      "type": "integer",
                      "description": "The smallest port number in a specified range of port numbers.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "BlockPublicAccessConfigurationMetadata",
          "type": "dict",
          "description": "Properties that describe the Amazon Web Services principal that created the BlockPublicAccessConfiguration using the PutBlockPublicAccessConfiguration action as well as the date and time that the configuration was created. Each time a configuration for block public access is updated, Amazon EMR updates this metadata.",
          "nested_items": [
            {
              "name": "CreationDateTime",
              "type": "datetime",
              "description": "The date and time that the configuration was created.",
              "nested_items": []
            },
            {
              "name": "CreatedByArn",
              "type": "string",
              "description": "The Amazon Resource Name that created or last modified the configuration.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}