{
  "method_name": "list_instance_fleets",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/emr/client/list_instance_fleets.html",
  "description": "Lists all available details about the instance fleets in a cluster.",
  "parameters": [
    {
      "name": "ClusterId",
      "type": "string",
      "required": true,
      "description": "The unique identifier of the cluster.",
      "nested_params": []
    },
    {
      "name": "Marker",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "InstanceFleets",
          "type": "list",
          "description": "The list of instance fleets for the cluster and given filters.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Id",
                  "type": "string",
                  "description": "The unique identifier of the instance fleet.",
                  "nested_items": []
                },
                {
                  "name": "Name",
                  "type": "string",
                  "description": "A friendly name for the instance fleet.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "State",
                      "type": "string",
                      "description": "A code representing the instance fleet status.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "PROVISIONING--\u0094The instance fleet is provisioning Amazon EC2 resources and is not yet ready to run jobs.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "BOOTSTRAPPING--\u0094Amazon EC2 instances and other resources have been provisioned and the bootstrap actions specified for the instances are underway.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "RUNNING--\u0094Amazon EC2 instances and other resources are running. They are either executing jobs or waiting to execute jobs.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "RESIZING--\u0094A resize operation is underway. Amazon EC2 instances are either being added or removed.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "SUSPENDED--\u0094A resize operation could not complete. Existing Amazon EC2 instances are running, but instances can't be added or removed.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "TERMINATING--\u0094The instance fleet is terminating Amazon EC2 instances.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "TERMINATED--\u0094The instance fleet is no longer active, and all Amazon EC2 instances have been terminated.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "StateChangeReason",
                      "type": "dict",
                      "description": "Provides status change reason details for the instance fleet.",
                      "nested_items": [
                        {
                          "name": "Code",
                          "type": "string",
                          "description": "A code corresponding to the reason the state change occurred.",
                          "nested_items": []
                        },
                        {
                          "name": "Message",
                          "type": "string",
                          "description": "An explanatory message.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "CreationDateTime",
                          "type": "datetime",
                          "description": "The time and date the instance fleet was created.",
                          "nested_items": []
                        },
                        {
                          "name": "ReadyDateTime",
                          "type": "datetime",
                          "description": "The time and date the instance fleet was ready to run jobs.",
                          "nested_items": []
                        },
                        {
                          "name": "EndDateTime",
                          "type": "datetime",
                          "description": "The time and date the instance fleet terminated.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "InstanceFleetType",
                  "type": "string",
                  "description": "The node type that the instance fleet hosts. Valid values are MASTER, CORE, or TASK.",
                  "nested_items": []
                },
                {
                  "name": "TargetOnDemandCapacity",
                  "type": "integer",
                  "description": "The target capacity of On-Demand units for the instance fleet, which determines how many On-Demand Instances to provision. When the instance fleet launches, Amazon EMR tries to provision On-Demand Instances as specified by  InstanceTypeConfig. Each instance configuration has a specified WeightedCapacity. When an On-Demand Instance is provisioned, the WeightedCapacity units count toward the target capacity. Amazon EMR provisions instances until the target capacity is totally fulfilled, even if this results in an overage. For example, if there are 2 units remaining to fulfill capacity, and Amazon EMR can only provision an instance with a WeightedCapacity of 5 units, the instance is provisioned, and the target capacity is exceeded by 3 units. You can use  InstanceFleet$ProvisionedOnDemandCapacity to determine the Spot capacity units that have been provisioned for the instance fleet.",
                  "nested_items": []
                },
                {
                  "name": "TargetSpotCapacity",
                  "type": "integer",
                  "description": "The target capacity of Spot units for the instance fleet, which determines how many Spot Instances to provision. When the instance fleet launches, Amazon EMR tries to provision Spot Instances as specified by  InstanceTypeConfig. Each instance configuration has a specified WeightedCapacity. When a Spot instance is provisioned, the WeightedCapacity units count toward the target capacity. Amazon EMR provisions instances until the target capacity is totally fulfilled, even if this results in an overage. For example, if there are 2 units remaining to fulfill capacity, and Amazon EMR can only provision an instance with a WeightedCapacity of 5 units, the instance is provisioned, and the target capacity is exceeded by 3 units. You can use  InstanceFleet$ProvisionedSpotCapacity to determine the Spot capacity units that have been provisioned for the instance fleet.",
                  "nested_items": []
                },
                {
                  "name": "ProvisionedOnDemandCapacity",
                  "type": "integer",
                  "description": "The number of On-Demand units that have been provisioned for the instance fleet to fulfill TargetOnDemandCapacity. This provisioned capacity might be less than or greater than TargetOnDemandCapacity.",
                  "nested_items": []
                },
                {
                  "name": "ProvisionedSpotCapacity",
                  "type": "integer",
                  "description": "The number of Spot units that have been provisioned for this instance fleet to fulfill TargetSpotCapacity. This provisioned capacity might be less than or greater than TargetSpotCapacity.",
                  "nested_items": []
                },
                {
                  "name": "InstanceTypeSpecifications",
                  "type": "list",
                  "description": "An array of specifications for the instance types that comprise an instance fleet.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "InstanceType",
                          "type": "string",
                          "description": "The Amazon EC2 instance type, for example m3.xlarge.",
                          "nested_items": []
                        },
                        {
                          "name": "WeightedCapacity",
                          "type": "integer",
                          "description": "The number of units that a provisioned instance of this type provides toward fulfilling the target capacities defined in  InstanceFleetConfig. Capacity values represent performance characteristics such as vCPUs, memory, or I/O. If not specified, the default value is 1.",
                          "nested_items": []
                        },
                        {
                          "name": "BidPrice",
                          "type": "string",
                          "description": "The bid price for each Amazon EC2 Spot Instance type as defined by InstanceType. Expressed in USD.",
                          "nested_items": []
                        },
                        {
                          "name": "BidPriceAsPercentageOfOnDemandPrice",
                          "type": "float",
                          "description": "The bid price, as a percentage of On-Demand price, for each Amazon EC2 Spot Instance as defined by InstanceType. Expressed as a number (for example, 20 specifies 20%).",
                          "nested_items": []
                        },
                        {
                          "name": "Configurations",
                          "type": "list",
                          "description": "A configuration classification that applies when provisioning cluster instances, which can include configurations for applications and software bundled with Amazon EMR.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "dict",
                              "description": "",
                              "nested_items": [
                                {
                                  "name": "Classification",
                                  "type": "string",
                                  "description": "The classification within a configuration.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Configurations",
                                  "type": "list",
                                  "description": "A list of additional configurations to apply within a configuration object.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Properties",
                                  "type": "dict",
                                  "description": "A set of properties specified within a configuration classification.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "string",
                                      "description": "(string) ---",
                                      "nested_items": [
                                        {
                                          "name": "",
                                          "type": "string",
                                          "description": "(string) ---",
                                          "nested_items": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "name": "EbsBlockDevices",
                          "type": "list",
                          "description": "The configuration of Amazon Elastic Block Store (Amazon EBS) attached to each instance as defined by InstanceType.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "dict",
                              "description": "",
                              "nested_items": [
                                {
                                  "name": "VolumeSpecification",
                                  "type": "dict",
                                  "description": "EBS volume specifications such as volume type, IOPS, size (GiB) and throughput (MiB/s) that are requested for the EBS volume attached to an Amazon EC2 instance in the cluster.",
                                  "nested_items": [
                                    {
                                      "name": "VolumeType",
                                      "type": "string",
                                      "description": "The volume type. Volume types supported are gp3, gp2, io1, st1, sc1, and standard.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Iops",
                                      "type": "integer",
                                      "description": "The number of I/O operations per second (IOPS) that the volume supports.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "SizeInGB",
                                      "type": "integer",
                                      "description": "The volume size, in gibibytes (GiB). This can be a number from 1 - 1024. If the volume type is EBS-optimized, the minimum value is 10.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Throughput",
                                      "type": "integer",
                                      "description": "The throughput, in mebibyte per second (MiB/s). This optional parameter can be a number from 125 - 1000 and is valid only for gp3 volumes.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "Device",
                                  "type": "string",
                                  "description": "The device name that is exposed to the instance, such as /dev/sdh.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "name": "EbsOptimized",
                          "type": "boolean",
                          "description": "Evaluates to TRUE when the specified InstanceType is EBS-optimized.",
                          "nested_items": []
                        },
                        {
                          "name": "CustomAmiId",
                          "type": "string",
                          "description": "The custom AMI ID to use for the instance type.",
                          "nested_items": []
                        },
                        {
                          "name": "Priority",
                          "type": "float",
                          "description": "The priority at which Amazon EMR launches the Amazon EC2 instances with this instance type. Priority starts at 0, which is the highest priority. Amazon EMR considers the highest priority first.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "LaunchSpecifications",
                  "type": "dict",
                  "description": "Describes the launch specification for an instance fleet.",
                  "nested_items": [
                    {
                      "name": "SpotSpecification",
                      "type": "dict",
                      "description": "The launch specification for Spot instances in the fleet, which determines the allocation strategy, defined duration, and provisioning timeout behavior.",
                      "nested_items": [
                        {
                          "name": "TimeoutDurationMinutes",
                          "type": "integer",
                          "description": "The Spot provisioning timeout period in minutes. If Spot Instances are not provisioned within this time period, the TimeOutAction is taken. Minimum value is 5 and maximum value is 1440. The timeout applies only during initial provisioning, when the cluster is first created.",
                          "nested_items": []
                        },
                        {
                          "name": "TimeoutAction",
                          "type": "string",
                          "description": "The action to take when TargetSpotCapacity has not been fulfilled when the TimeoutDurationMinutes has expired; that is, when all Spot Instances could not be provisioned within the Spot provisioning timeout. Valid values are TERMINATE_CLUSTER and SWITCH_TO_ON_DEMAND. SWITCH_TO_ON_DEMAND specifies that if no Spot Instances are available, On-Demand Instances should be provisioned to fulfill any remaining Spot capacity.",
                          "nested_items": []
                        },
                        {
                          "name": "BlockDurationMinutes",
                          "type": "integer",
                          "description": "The defined duration for Spot Instances (also known as Spot blocks) in minutes. When specified, the Spot Instance does not terminate before the defined duration expires, and defined duration pricing for Spot Instances applies. Valid values are 60, 120, 180, 240, 300, or 360. The duration period starts as soon as a Spot Instance receives its instance ID. At the end of the duration, Amazon EC2 marks the Spot Instance for termination and provides a Spot Instance termination notice, which gives the instance a two-minute warning before it terminates.",
                          "nested_items": []
                        },
                        {
                          "name": "AllocationStrategy",
                          "type": "string",
                          "description": "Specifies one of the following strategies to launch Spot Instance fleets: capacity-optimized, price-capacity-optimized, lowest-price, or diversified, and capacity-optimized-prioritized. For more information on the provisioning strategies, see Allocation strategies for Spot Instances in the Amazon EC2 User Guide for Linux Instances.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "OnDemandSpecification",
                      "type": "dict",
                      "description": "The launch specification for On-Demand Instances in the instance fleet, which determines the allocation strategy and capacity reservation options.",
                      "nested_items": [
                        {
                          "name": "AllocationStrategy",
                          "type": "string",
                          "description": "Specifies the strategy to use in launching On-Demand instance fleets. Available options are lowest-price and prioritized. lowest-price specifies to launch the instances with the lowest price first, and prioritized specifies that Amazon EMR should launch the instances with the highest priority first. The default is lowest-price.",
                          "nested_items": []
                        },
                        {
                          "name": "CapacityReservationOptions",
                          "type": "dict",
                          "description": "The launch specification for On-Demand instances in the instance fleet, which determines the allocation strategy.",
                          "nested_items": [
                            {
                              "name": "UsageStrategy",
                              "type": "string",
                              "description": "Indicates whether to use unused Capacity Reservations for fulfilling On-Demand capacity.",
                              "nested_items": []
                            },
                            {
                              "name": "CapacityReservationPreference",
                              "type": "string",
                              "description": "Indicates the instance's Capacity Reservation preferences. Possible preferences include:",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "instance type, platform, Availability Zone",
                                  "description": "open - The instance can run in any open Capacity Reservation that has matching attributes (instance type, platform, Availability Zone).",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "none - The instance avoids running in a Capacity Reservation even if one is available. The instance runs as an On-Demand Instance.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "CapacityReservationResourceGroupArn",
                              "type": "string",
                              "description": "The ARN of the Capacity Reservation resource group in which to run the instance.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "ResizeSpecifications",
                  "type": "dict",
                  "description": "The resize specification for the instance fleet.",
                  "nested_items": [
                    {
                      "name": "SpotResizeSpecification",
                      "type": "dict",
                      "description": "The resize specification for Spot Instances in the instance fleet, which contains the allocation strategy and the resize timeout period.",
                      "nested_items": [
                        {
                          "name": "TimeoutDurationMinutes",
                          "type": "integer",
                          "description": "Spot resize timeout in minutes. If Spot Instances are not provisioned within this time, the resize workflow will stop provisioning of Spot instances. Minimum value is 5 minutes and maximum value is 10,080 minutes (7 days). The timeout applies to all resize workflows on the Instance Fleet. The resize could be triggered by Amazon EMR Managed Scaling or by the customer (via Amazon EMR Console, Amazon EMR CLI modify-instance-fleet or Amazon EMR SDK ModifyInstanceFleet API) or by Amazon EMR due to Amazon EC2 Spot Reclamation.",
                          "nested_items": []
                        },
                        {
                          "name": "AllocationStrategy",
                          "type": "string",
                          "description": "Specifies the allocation strategy to use to launch Spot instances during a resize. If you run Amazon EMR releases 6.9.0 or higher, the default is price-capacity-optimized. If you run Amazon EMR releases 6.8.0 or lower, the default is capacity-optimized.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "OnDemandResizeSpecification",
                      "type": "dict",
                      "description": "The resize specification for On-Demand Instances in the instance fleet, which contains the allocation strategy, capacity reservation options, and the resize timeout period.",
                      "nested_items": [
                        {
                          "name": "TimeoutDurationMinutes",
                          "type": "integer",
                          "description": "On-Demand resize timeout in minutes. If On-Demand Instances are not provisioned within this time, the resize workflow stops. The minimum value is 5 minutes, and the maximum value is 10,080 minutes (7 days). The timeout applies to all resize workflows on the Instance Fleet. The resize could be triggered by Amazon EMR Managed Scaling or by the customer (via Amazon EMR Console, Amazon EMR CLI modify-instance-fleet or Amazon EMR SDK ModifyInstanceFleet API) or by Amazon EMR due to Amazon EC2 Spot Reclamation.",
                          "nested_items": []
                        },
                        {
                          "name": "AllocationStrategy",
                          "type": "string",
                          "description": "Specifies the allocation strategy to use to launch On-Demand instances during a resize. The default is lowest-price.",
                          "nested_items": []
                        },
                        {
                          "name": "CapacityReservationOptions",
                          "type": "dict",
                          "description": "Describes the strategy for using unused Capacity Reservations for fulfilling On-Demand capacity.",
                          "nested_items": [
                            {
                              "name": "UsageStrategy",
                              "type": "string",
                              "description": "Indicates whether to use unused Capacity Reservations for fulfilling On-Demand capacity.",
                              "nested_items": []
                            },
                            {
                              "name": "CapacityReservationPreference",
                              "type": "string",
                              "description": "Indicates the instance's Capacity Reservation preferences. Possible preferences include:",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "instance type, platform, Availability Zone",
                                  "description": "open - The instance can run in any open Capacity Reservation that has matching attributes (instance type, platform, Availability Zone).",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "none - The instance avoids running in a Capacity Reservation even if one is available. The instance runs as an On-Demand Instance.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "CapacityReservationResourceGroupArn",
                              "type": "string",
                              "description": "The ARN of the Capacity Reservation resource group in which to run the instance.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "Context",
                  "type": "string",
                  "description": "Reserved.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "Marker",
          "type": "string",
          "description": "The pagination token that indicates the next set of results to retrieve.",
          "nested_items": []
        }
      ]
    }
  ]
}