{
  "method_name": "create_workload_share",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/wellarchitected/client/create_workload_share.html",
  "description": "Create a workload share. The owner of a workload can share it with other Amazon Web Services accounts and users in the same Amazon Web Services Region. Shared access to a workload is not removed until the workload invitation is deleted. If you share a workload with an organization or OU, all accounts in the organization or OU are granted access to the workload. For more information, see Sharing a workload in the Well-Architected Tool User Guide.",
  "parameters": [
    {
      "name": "WorkloadId",
      "type": "string",
      "required": true,
      "description": "The ID assigned to the workload. This ID is unique within an Amazon Web Services Region.",
      "nested_params": []
    },
    {
      "name": "SharedWith",
      "type": "string",
      "required": true,
      "description": "The Amazon Web Services account ID, organization ID, or organizational unit (OU) ID with which the workload, lens, profile, or review template is shared.",
      "nested_params": []
    },
    {
      "name": "PermissionType",
      "type": "string",
      "required": true,
      "description": "Permission granted on a share request.",
      "nested_params": []
    },
    {
      "name": "ClientRequestToken",
      "type": "string",
      "required": true,
      "description": "A unique case-sensitive string used to ensure that this request is idempotent (executes only once). You should not reuse the same token for other requests. If you retry a request with the same client request token and the same parameters after the original request has completed successfully, the result of the original request is returned. This field is autopopulated if not provided.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "WorkloadId",
          "type": "string",
          "description": "The ID assigned to the workload. This ID is unique within an Amazon Web Services Region.",
          "nested_items": []
        },
        {
          "name": "ShareId",
          "type": "string",
          "description": "The ID associated with the share.",
          "nested_items": []
        }
      ]
    }
  ]
}