{
  "method_name": "copy_object",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3/client/copy_object.html",
  "description": "Creates a copy of an object that is already stored in Amazon S3. You can copy individual objects between general purpose buckets, between directory buckets, and between general purpose buckets and directory buckets. Both the Region that you want to copy the object from and the Region that you want to copy the object to must be enabled for your account. For more information about how to enable a Region for your account, see Enable or disable a Region for standalone accounts in the Amazon Web Services Account Management Guide. All CopyObject requests must be authenticated and signed by using IAM credentials (access key ID and secret access key for the IAM identities). All headers with the x-amz- prefix, including x-amz-copy-source, must be signed. For more information, see REST Authentication. Directory buckets - You must use the IAM credentials to authenticate and authorize your access to the CopyObject API operation, instead of using the temporary security credentials through the CreateSession API operation. Amazon Web Services CLI or SDKs handles authentication and authorization on your behalf. You must have read access to the source object and write access to the destination bucket. If the object is encrypted with SSE-KMS, you must also have the kms:GenerateDataKey and kms:Decrypt permissions in IAM identity-based policies and KMS key policies for the KMS key. For example policies, see Example bucket policies for S3 Express One Zone and Amazon Web Services Identity and Access Management (IAM) identity-based policies for S3 Express One Zone in the Amazon S3 User Guide. When the request is an HTTP 1.1 request, the response is chunk encoded. When the request is not an HTTP 1.1 request, the response would not contain the Content-Length. You always need to read the entire response body to check if the copy succeeds. The copy request charge is based on the storage class and Region that you specify for the destination object. The request can also result in a data retrieval charge for the source if the source storage class bills for data retrieval. If the copy source is in a different region, the data transfer is billed to the copy source account. For pricing information, see Amazon S3 pricing. The following operations are related to CopyObject:",
  "parameters": [
    {
      "name": "ACL",
      "type": "string",
      "required": false,
      "description": "The canned access control list (ACL) to apply to the object. When you copy an object, the ACL metadata is not preserved and is set to private by default. Only the owner has full access control. To override the default ACL setting, specify a new ACL when you generate a copy request. For more information, see Using ACLs. If the destination bucket that you're copying objects to uses the bucket owner enforced setting for S3 Object Ownership, ACLs are disabled and no longer affect permissions. Buckets that use this setting only accept PUT requests that don't specify an ACL or PUT requests that specify bucket owner full control ACLs, such as the bucket-owner-full-control canned ACL or an equivalent form of this ACL expressed in the XML format. For more information, see Controlling ownership of objects and disabling ACLs in the Amazon S3 User Guide.",
      "nested_params": []
    },
    {
      "name": "Bucket",
      "type": "string",
      "required": true,
      "description": "The name of the destination bucket. Directory buckets - When you use this operation with a directory bucket, you must use virtual-hosted-style requests in the format Bucket-name.s3express-zone-id.region-code.amazonaws.com. Path-style requests are not supported. Directory bucket names must be unique in the chosen Zone (Availability Zone or Local Zone). Bucket names must follow the format bucket-base-name--zone-id--x-s3 (for example, amzn-s3-demo-bucket--usw2-az1--x-s3). For information about bucket naming restrictions, see Directory bucket naming rules in the Amazon S3 User Guide. Access points - When you use this action with an access point for general purpose buckets, you must provide the alias of the access point in place of the bucket name or specify the access point ARN. When you use this action with an access point for directory buckets, you must provide the access point name in place of the bucket name. When using the access point ARN, you must direct requests to the access point hostname. The access point hostname takes the form AccessPointName-AccountId.s3-accesspoint.*Region*.amazonaws.com. When using this action with an access point through the Amazon Web Services SDKs, you provide the access point ARN in place of the bucket name. For more information about access point ARNs, see Using access points in the Amazon S3 User Guide. S3 on Outposts - When you use this action with S3 on Outposts, you must use the Outpost bucket access point ARN or the access point alias for the destination bucket. You can only copy objects within the same Outpost bucket. It's not supported to copy objects across different Amazon Web Services Outposts, between buckets on the same Outposts, or between Outposts buckets and any other bucket types. For more information about S3 on Outposts, see What is S3 on Outposts? in the S3 on Outposts guide. When you use this action with S3 on Outposts through the REST API, you must direct requests to the S3 on Outposts hostname, in the format AccessPointName-AccountId.outpostID.s3-outposts.Region.amazonaws.com. The hostname isn't required when you use the Amazon Web Services CLI or SDKs.",
      "nested_params": []
    },
    {
      "name": "CacheControl",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ChecksumAlgorithm",
      "type": "string",
      "required": false,
      "description": "Indicates the algorithm that you want Amazon S3 to use to create the checksum for the object. For more information, see Checking object integrity in the Amazon S3 User Guide. When you copy an object, if the source object has a checksum, that checksum value will be copied to the new object by default. If the CopyObject request does not include this x-amz-checksum-algorithm header, the checksum algorithm will be copied from the source object to the destination object (if it's present on the source object). You can optionally specify a different checksum algorithm to use with the x-amz-checksum-algorithm header. Unrecognized or unsupported values will respond with the HTTP status code 400 Bad Request.",
      "nested_params": []
    },
    {
      "name": "ContentDisposition",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ContentEncoding",
      "type": "string",
      "required": false,
      "description": "Specifies what content encodings have been applied to the object and thus what decoding mechanisms must be applied to obtain the media-type referenced by the Content-Type header field.",
      "nested_params": []
    },
    {
      "name": "ContentLanguage",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ContentType",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "CopySource",
      "type": "str or dict",
      "required": true,
      "description": "",
      "nested_params": []
    },
    {
      "name": "CopySourceIfMatch",
      "type": "string",
      "required": false,
      "description": "Copies the object if its entity tag (ETag) matches the specified tag. If both the x-amz-copy-source-if-match and x-amz-copy-source-if-unmodified-since headers are present in the request and evaluate as follows, Amazon S3 returns 200 OK and copies the data: x-amz-copy-source-if-match condition evaluates to true x-amz-copy-source-if-unmodified-since condition evaluates to false.",
      "nested_params": []
    },
    {
      "name": "CopySourceIfModifiedSince",
      "type": "datetime",
      "required": false,
      "description": "Copies the object if it has been modified since the specified time. If both the x-amz-copy-source-if-none-match and x-amz-copy-source-if-modified-since headers are present in the request and evaluate as follows, Amazon S3 returns the 412 Precondition Failed response code: x-amz-copy-source-if-none-match condition evaluates to false x-amz-copy-source-if-modified-since condition evaluates to true.",
      "nested_params": []
    },
    {
      "name": "CopySourceIfNoneMatch",
      "type": "string",
      "required": false,
      "description": "Copies the object if its entity tag (ETag) is different than the specified ETag. If both the x-amz-copy-source-if-none-match and x-amz-copy-source-if-modified-since headers are present in the request and evaluate as follows, Amazon S3 returns the 412 Precondition Failed response code: x-amz-copy-source-if-none-match condition evaluates to false x-amz-copy-source-if-modified-since condition evaluates to true.",
      "nested_params": []
    },
    {
      "name": "CopySourceIfUnmodifiedSince",
      "type": "datetime",
      "required": false,
      "description": "Copies the object if it hasn't been modified since the specified time. If both the x-amz-copy-source-if-match and x-amz-copy-source-if-unmodified-since headers are present in the request and evaluate as follows, Amazon S3 returns 200 OK and copies the data: x-amz-copy-source-if-match condition evaluates to true x-amz-copy-source-if-unmodified-since condition evaluates to false.",
      "nested_params": []
    },
    {
      "name": "Expires",
      "type": "datetime",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "GrantFullControl",
      "type": "string",
      "required": false,
      "description": "Gives the grantee READ, READ_ACP, and WRITE_ACP permissions on the object.",
      "nested_params": []
    },
    {
      "name": "GrantRead",
      "type": "string",
      "required": false,
      "description": "Allows grantee to read the object data and its metadata.",
      "nested_params": []
    },
    {
      "name": "GrantReadACP",
      "type": "string",
      "required": false,
      "description": "Allows grantee to read the object ACL.",
      "nested_params": []
    },
    {
      "name": "GrantWriteACP",
      "type": "string",
      "required": false,
      "description": "Allows grantee to write the ACL for the applicable object.",
      "nested_params": []
    },
    {
      "name": "Key",
      "type": "string",
      "required": true,
      "description": "The key of the destination object.",
      "nested_params": []
    },
    {
      "name": "Metadata",
      "type": "dict",
      "required": false,
      "description": "A map of metadata to store with the object in S3. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "MetadataDirective",
      "type": "string",
      "required": false,
      "description": "Specifies whether the metadata is copied from the source object or replaced with metadata that's provided in the request. When copying an object, you can preserve all metadata (the default) or specify new metadata. If this header isn't specified, COPY is the default behavior. General purpose bucket - For general purpose buckets, when you grant permissions, you can use the s3:x-amz-metadata-directive condition key to enforce certain metadata behavior when objects are uploaded. For more information, see Amazon S3 condition key examples in the Amazon S3 User Guide.",
      "nested_params": []
    },
    {
      "name": "TaggingDirective",
      "type": "string",
      "required": false,
      "description": "Specifies whether the object tag-set is copied from the source object or replaced with the tag-set that's provided in the request. The default value is COPY.",
      "nested_params": []
    },
    {
      "name": "ServerSideEncryption",
      "type": "string",
      "required": false,
      "description": "The server-side encryption algorithm used when storing this object in Amazon S3. Unrecognized or unsupported values won't write a destination object and will receive a 400 Bad Request response. Amazon S3 automatically encrypts all new objects that are copied to an S3 bucket. When copying an object, if you don't specify encryption information in your copy request, the encryption setting of the target object is set to the default encryption configuration of the destination bucket. By default, all buckets have a base level of encryption configuration that uses server-side encryption with Amazon S3 managed keys (SSE-S3). If the destination bucket has a different default encryption configuration, Amazon S3 uses the corresponding encryption key to encrypt the target object copy. With server-side encryption, Amazon S3 encrypts your data as it writes your data to disks in its data centers and decrypts the data when you access it. For more information about server-side encryption, see Using Server-Side Encryption in the Amazon S3 User Guide. For general purpose buckets, there are the following supported options for server-side encryption: server-side encryption with Key Management Service (KMS) keys (SSE-KMS), dual-layer server-side encryption with Amazon Web Services KMS keys (DSSE-KMS), and server-side encryption with customer-provided encryption keys (SSE-C). Amazon S3 uses the corresponding KMS key, or a customer-provided key to encrypt the target object copy. When you perform a CopyObject operation, if you want to use a different type of encryption setting for the target object, you can specify appropriate encryption-related headers to encrypt the target object with an Amazon S3 managed key, a KMS key, or a customer-provided key. If the encryption setting in your request is different from the default encryption configuration of the destination bucket, the encryption setting in your request takes precedence. For directory buckets, there are only two supported options for server-side encryption: server-side encryption with Amazon S3 managed keys (SSE-S3) ( AES256) and server-side encryption with KMS keys (SSE-KMS) ( aws:kms). We recommend that the bucket's default encryption uses the desired encryption configuration and you don't override the bucket default encryption in your CreateSession requests or PUT object requests. Then, new objects are automatically encrypted with the desired encryption settings. For more information, see Protecting data with server-side encryption in the Amazon S3 User Guide. For more information about the encryption overriding behaviors in directory buckets, see Specifying server-side encryption with KMS for new object uploads. To encrypt new object copies to a directory bucket with SSE-KMS, we recommend you specify SSE-KMS as the directory bucket's default encryption configuration with a KMS key (specifically, a customer managed key). The Amazon Web Services managed key ( aws/s3) isn't supported. Your SSE-KMS configuration can only support 1 customer managed key per directory bucket for the lifetime of the bucket. After you specify a customer managed key for SSE-KMS, you can't override the customer managed key for the bucket's SSE-KMS configuration. Then, when you perform a CopyObject operation and want to specify server-side encryption settings for new object copies with SSE-KMS in the encryption-related request headers, you must ensure the encryption key is the same customer managed key that you specified for the directory bucket's default encryption configuration. S3 access points for Amazon FSx - When accessing data stored in Amazon FSx file systems using S3 access points, the only valid server side encryption option is aws:fsx. All Amazon FSx file systems have encryption configured by default and are encrypted at rest. Data is automatically encrypted before being written to the file system, and automatically decrypted as it is read. These processes are handled transparently by Amazon FSx.",
      "nested_params": []
    },
    {
      "name": "StorageClass",
      "type": "string",
      "required": false,
      "description": "If the x-amz-storage-class header is not used, the copied object will be stored in the STANDARD Storage Class by default. The STANDARD storage class provides high durability and high availability. Depending on performance needs, you can specify a different Storage Class. You can use the CopyObject action to change the storage class of an object that is already stored in Amazon S3 by using the x-amz-storage-class header. For more information, see Storage Classes in the Amazon S3 User Guide. Before using an object as a source object for the copy operation, you must restore a copy of it if it meets any of the following conditions: The storage class of the source object is GLACIER or DEEP_ARCHIVE. The storage class of the source object is INTELLIGENT_TIERING and it's S3 Intelligent-Tiering access tier is Archive Access or Deep Archive Access. For more information, see RestoreObject and Copying Objects in the Amazon S3 User Guide.",
      "nested_params": []
    },
    {
      "name": "WebsiteRedirectLocation",
      "type": "string",
      "required": false,
      "description": "If the destination bucket is configured as a website, redirects requests for this object copy to another object in the same bucket or to an external URL. Amazon S3 stores the value of this header in the object metadata. This value is unique to each object and is not copied when using the x-amz-metadata-directive header. Instead, you may opt to provide this header in combination with the x-amz-metadata-directive header.",
      "nested_params": []
    },
    {
      "name": "SSECustomerAlgorithm",
      "type": "string",
      "required": false,
      "description": "Specifies the algorithm to use when encrypting the object (for example, AES256). When you perform a CopyObject operation, if you want to use a different type of encryption setting for the target object, you can specify appropriate encryption-related headers to encrypt the target object with an Amazon S3 managed key, a KMS key, or a customer-provided key. If the encryption setting in your request is different from the default encryption configuration of the destination bucket, the encryption setting in your request takes precedence.",
      "nested_params": []
    },
    {
      "name": "SSECustomerKey",
      "type": "string",
      "required": false,
      "description": "Specifies the customer-provided encryption key for Amazon S3 to use in encrypting data. This value is used to store the object and then it is discarded. Amazon S3 does not store the encryption key. The key must be appropriate for use with the algorithm specified in the x-amz-server-side-encryption-customer-algorithm header.",
      "nested_params": []
    },
    {
      "name": "SSECustomerKeyMD5",
      "type": "string",
      "required": false,
      "description": "Specifies the 128-bit MD5 digest of the encryption key according to RFC 1321. Amazon S3 uses this header for a message integrity check to ensure that the encryption key was transmitted without error.",
      "nested_params": []
    },
    {
      "name": "SSEKMSKeyId",
      "type": "string",
      "required": false,
      "description": "Specifies the KMS key ID (Key ID, Key ARN, or Key Alias) to use for object encryption. All GET and PUT requests for an object protected by KMS will fail if they're not made via SSL or using SigV4. For information about configuring any of the officially supported Amazon Web Services SDKs and Amazon Web Services CLI, see Specifying the Signature Version in Request Authentication in the Amazon S3 User Guide. Directory buckets - To encrypt data using SSE-KMS, it's recommended to specify the x-amz-server-side-encryption header to aws:kms. Then, the x-amz-server-side-encryption-aws-kms-key-id header implicitly uses the bucket's default KMS customer managed key ID. If you want to explicitly set the x-amz-server-side-encryption-aws-kms-key-id header, it must match the bucket's default customer managed key (using key ID or ARN, not alias). Your SSE-KMS configuration can only support 1 customer managed key per directory bucket's lifetime. The Amazon Web Services managed key ( aws/s3) isn't supported. Incorrect key specification results in an HTTP 400 Bad Request error.",
      "nested_params": []
    },
    {
      "name": "SSEKMSEncryptionContext",
      "type": "string",
      "required": false,
      "description": "Specifies the Amazon Web Services KMS Encryption Context as an additional encryption context to use for the destination object encryption. The value of this header is a base64-encoded UTF-8 string holding JSON with the encryption context key-value pairs. General purpose buckets - This value must be explicitly added to specify encryption context for CopyObject requests if you want an additional encryption context for your destination object. The additional encryption context of the source object won't be copied to the destination object. For more information, see Encryption context in the Amazon S3 User Guide. Directory buckets - You can optionally provide an explicit encryption context value. The value must match the default encryption context - the bucket Amazon Resource Name (ARN). An additional encryption context value is not supported.",
      "nested_params": []
    },
    {
      "name": "BucketKeyEnabled",
      "type": "boolean",
      "required": false,
      "description": "Specifies whether Amazon S3 should use an S3 Bucket Key for object encryption with server-side encryption using Key Management Service (KMS) keys (SSE-KMS). If a target object uses SSE-KMS, you can enable an S3 Bucket Key for the object. Setting this header to true causes Amazon S3 to use an S3 Bucket Key for object encryption with SSE-KMS. Specifying this header with a COPY action doesn't affect bucket-level settings for S3 Bucket Key. For more information, see Amazon S3 Bucket Keys in the Amazon S3 User Guide.",
      "nested_params": []
    },
    {
      "name": "CopySourceSSECustomerAlgorithm",
      "type": "string",
      "required": false,
      "description": "Specifies the algorithm to use when decrypting the source object (for example, AES256). If the source object for the copy is stored in Amazon S3 using SSE-C, you must provide the necessary encryption information in your request so that Amazon S3 can decrypt the object for copying.",
      "nested_params": []
    },
    {
      "name": "CopySourceSSECustomerKey",
      "type": "string",
      "required": false,
      "description": "Specifies the customer-provided encryption key for Amazon S3 to use to decrypt the source object. The encryption key provided in this header must be the same one that was used when the source object was created. If the source object for the copy is stored in Amazon S3 using SSE-C, you must provide the necessary encryption information in your request so that Amazon S3 can decrypt the object for copying.",
      "nested_params": []
    },
    {
      "name": "CopySourceSSECustomerKeyMD5",
      "type": "string",
      "required": false,
      "description": "Specifies the 128-bit MD5 digest of the encryption key according to RFC 1321. Amazon S3 uses this header for a message integrity check to ensure that the encryption key was transmitted without error. If the source object for the copy is stored in Amazon S3 using SSE-C, you must provide the necessary encryption information in your request so that Amazon S3 can decrypt the object for copying.",
      "nested_params": []
    },
    {
      "name": "RequestPayer",
      "type": "string",
      "required": false,
      "description": "Confirms that the requester knows that they will be charged for the request. Bucket owners need not specify this parameter in their requests. If either the source or destination S3 bucket has Requester Pays enabled, the requester will pay for corresponding charges to copy the object. For information about downloading objects from Requester Pays buckets, see Downloading Objects in Requester Pays Buckets in the Amazon S3 User Guide.",
      "nested_params": []
    },
    {
      "name": "Tagging",
      "type": "string",
      "required": false,
      "description": "The tag-set for the object copy in the destination bucket. This value must be used in conjunction with the x-amz-tagging-directive if you choose REPLACE for the x-amz-tagging-directive. If you choose COPY for the x-amz-tagging-directive, you don't need to set the x-amz-tagging header, because the tag-set will be copied from the source object directly. The tag-set must be encoded as URL Query parameters. The default value is the empty value.",
      "nested_params": []
    },
    {
      "name": "ObjectLockMode",
      "type": "string",
      "required": false,
      "description": "The Object Lock mode that you want to apply to the object copy.",
      "nested_params": []
    },
    {
      "name": "ObjectLockRetainUntilDate",
      "type": "datetime",
      "required": false,
      "description": "The date and time when you want the Object Lock of the object copy to expire.",
      "nested_params": []
    },
    {
      "name": "ObjectLockLegalHoldStatus",
      "type": "string",
      "required": false,
      "description": "Specifies whether you want to apply a legal hold to the object copy.",
      "nested_params": []
    },
    {
      "name": "ExpectedBucketOwner",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ExpectedSourceBucketOwner",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "CopyObjectResult",
          "type": "dict",
          "description": "Container for all response elements.",
          "nested_items": [
            {
              "name": "ETag",
              "type": "string",
              "description": "Returns the ETag of the new object. The ETag reflects only changes to the contents of an object, not its metadata.",
              "nested_items": []
            },
            {
              "name": "LastModified",
              "type": "datetime",
              "description": "Creation date of the object.",
              "nested_items": []
            },
            {
              "name": "ChecksumType",
              "type": "string",
              "description": "The checksum type that is used to calculate the object's checksum value. For more information, see Checking object integrity in the Amazon S3 User Guide.",
              "nested_items": []
            },
            {
              "name": "ChecksumCRC32",
              "type": "string",
              "description": "The Base64 encoded, 32-bit CRC32 checksum of the object. This checksum is only present if the object was uploaded with the object. For more information, see Checking object integrity in the Amazon S3 User Guide.",
              "nested_items": []
            },
            {
              "name": "ChecksumCRC32C",
              "type": "string",
              "description": "The Base64 encoded, 32-bit CRC32C checksum of the object. This will only be present if the object was uploaded with the object. For more information, see Checking object integrity in the Amazon S3 User Guide.",
              "nested_items": []
            },
            {
              "name": "ChecksumCRC64NVME",
              "type": "string",
              "description": "The Base64 encoded, 64-bit CRC64NVME checksum of the object. This checksum is present if the object being copied was uploaded with the CRC64NVME checksum algorithm, or if the object was uploaded without a checksum (and Amazon S3 added the default checksum, CRC64NVME, to the uploaded object). For more information, see Checking object integrity in the Amazon S3 User Guide.",
              "nested_items": []
            },
            {
              "name": "ChecksumSHA1",
              "type": "string",
              "description": "The Base64 encoded, 160-bit SHA1 digest of the object. This will only be present if the object was uploaded with the object. For more information, see Checking object integrity in the Amazon S3 User Guide.",
              "nested_items": []
            },
            {
              "name": "ChecksumSHA256",
              "type": "string",
              "description": "The Base64 encoded, 256-bit SHA256 digest of the object. This will only be present if the object was uploaded with the object. For more information, see Checking object integrity in the Amazon S3 User Guide.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "Expiration",
          "type": "string",
          "description": "If the object expiration is configured, the response includes this header.",
          "nested_items": []
        },
        {
          "name": "CopySourceVersionId",
          "type": "string",
          "description": "Version ID of the source object that was copied.",
          "nested_items": []
        },
        {
          "name": "VersionId",
          "type": "string",
          "description": "Version ID of the newly created copy.",
          "nested_items": []
        },
        {
          "name": "ServerSideEncryption",
          "type": "string",
          "description": "The server-side encryption algorithm used when you store this object in Amazon S3 or Amazon FSx.",
          "nested_items": []
        },
        {
          "name": "SSECustomerAlgorithm",
          "type": "string",
          "description": "If server-side encryption with a customer-provided encryption key was requested, the response will include this header to confirm the encryption algorithm that's used.",
          "nested_items": []
        },
        {
          "name": "SSECustomerKeyMD5",
          "type": "string",
          "description": "If server-side encryption with a customer-provided encryption key was requested, the response will include this header to provide the round-trip message integrity verification of the customer-provided encryption key.",
          "nested_items": []
        },
        {
          "name": "SSEKMSKeyId",
          "type": "string",
          "description": "If present, indicates the ID of the KMS key that was used for object encryption.",
          "nested_items": []
        },
        {
          "name": "SSEKMSEncryptionContext",
          "type": "string",
          "description": "If present, indicates the Amazon Web Services KMS Encryption Context to use for object encryption. The value of this header is a Base64 encoded UTF-8 string holding JSON with the encryption context key-value pairs.",
          "nested_items": []
        },
        {
          "name": "BucketKeyEnabled",
          "type": "boolean",
          "description": "Indicates whether the copied object uses an S3 Bucket Key for server-side encryption with Key Management Service (KMS) keys (SSE-KMS).",
          "nested_items": []
        },
        {
          "name": "RequestCharged",
          "type": "string",
          "description": "If present, indicates that the requester was successfully charged for the request. For more information, see Using Requester Pays buckets for storage transfers and usage in the Amazon Simple Storage Service user guide.",
          "nested_items": []
        }
      ]
    }
  ]
}