{
  "method_name": "list_bucket_inventory_configurations",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/s3/client/list_bucket_inventory_configurations.html",
  "description": "Returns a list of inventory configurations for the bucket. You can have up to 1,000 analytics configurations per bucket. This action supports list pagination and does not return more than 100 configurations at a time. Always check the IsTruncated element in the response. If there are no more configurations to list, IsTruncated is set to false. If there are more configurations to list, IsTruncated is set to true, and there is a value in NextContinuationToken. You use the NextContinuationToken value to continue the pagination of the list by passing the value in continuation-token in the request to GET the next page. To use this operation, you must have permissions to perform the s3:GetInventoryConfiguration action. The bucket owner has this permission by default. The bucket owner can grant this permission to others. For more information about permissions, see Permissions Related to Bucket Subresource Operations and Managing Access Permissions to Your Amazon S3 Resources. For information about the Amazon S3 inventory feature, see Amazon S3 Inventory. The following operations are related to ListBucketInventoryConfigurations:",
  "parameters": [
    {
      "name": "Bucket",
      "type": "string",
      "required": true,
      "description": "The name of the bucket containing the inventory configurations to retrieve.",
      "nested_params": []
    },
    {
      "name": "ContinuationToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ExpectedBucketOwner",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ContinuationToken",
          "type": "string",
          "description": "If sent in the request, the marker that is used as a starting point for this inventory configuration list response.",
          "nested_items": []
        },
        {
          "name": "InventoryConfigurationList",
          "type": "list",
          "description": "The list of inventory configurations for a bucket.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Destination",
                  "type": "dict",
                  "description": "Contains information about where to publish the inventory results.",
                  "nested_items": [
                    {
                      "name": "S3BucketDestination",
                      "type": "dict",
                      "description": "Contains the bucket name, file format, bucket owner (optional), and prefix (optional) where inventory results are published.",
                      "nested_items": [
                        {
                          "name": "AccountId",
                          "type": "string",
                          "description": "The account ID that owns the destination S3 bucket. If no account ID is provided, the owner is not validated before exporting data.",
                          "nested_items": []
                        },
                        {
                          "name": "Bucket",
                          "type": "string",
                          "description": "The Amazon Resource Name (ARN) of the bucket where inventory results will be published.",
                          "nested_items": []
                        },
                        {
                          "name": "Format",
                          "type": "string",
                          "description": "Specifies the output format of the inventory results.",
                          "nested_items": []
                        },
                        {
                          "name": "Prefix",
                          "type": "string",
                          "description": "The prefix that is prepended to all inventory results.",
                          "nested_items": []
                        },
                        {
                          "name": "Encryption",
                          "type": "dict",
                          "description": "Contains the type of server-side encryption used to encrypt the inventory results.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "dict",
                              "description": "",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "dict",
                              "description": "",
                              "nested_items": [
                                {
                                  "name": "KeyId",
                                  "type": "string",
                                  "description": "Specifies the ID of the Key Management Service (KMS) symmetric encryption customer managed key to use for encrypting inventory reports.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "IsEnabled",
                  "type": "boolean",
                  "description": "Specifies whether the inventory is enabled or disabled. If set to True, an inventory list is generated. If set to False, no inventory list is generated.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Prefix",
                      "type": "string",
                      "description": "The prefix that an object must have to be included in the inventory results.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Id",
                  "type": "string",
                  "description": "The ID used to identify the inventory configuration.",
                  "nested_items": []
                },
                {
                  "name": "IncludedObjectVersions",
                  "type": "string",
                  "description": "Object versions to include in the inventory list. If set to All, the list includes all the object versions, which adds the version-related fields VersionId, IsLatest, and DeleteMarker to the list. If set to Current, the list does not contain these version-related fields.",
                  "nested_items": []
                },
                {
                  "name": "OptionalFields",
                  "type": "list",
                  "description": "Contains the optional fields that are included in the inventory results.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Frequency",
                      "type": "string",
                      "description": "Specifies how frequently inventory results are produced.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "IsTruncated",
          "type": "boolean",
          "description": "Tells whether the returned list of inventory configurations is complete. A value of true indicates that the list is not complete and the NextContinuationToken is provided for a subsequent request.",
          "nested_items": []
        },
        {
          "name": "NextContinuationToken",
          "type": "string",
          "description": "The marker used to continue this inventory configuration listing. Use the NextContinuationToken from this response to continue the listing in a subsequent request. The continuation token is an opaque value that Amazon S3 understands.",
          "nested_items": []
        }
      ]
    }
  ]
}