{
  "method_name": "lookup_events",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudtrail/client/lookup_events.html",
  "description": "Looks up management events or CloudTrail Insights events that are captured by CloudTrail. You can look up events that occurred in a Region within the last 90 days. Lookup supports the following attributes for management events: Lookup supports the following attributes for Insights events: All attributes are optional. The default number of results returned is 50, with a maximum of 50 possible. The response includes a token that you can use to get the next page of results.",
  "parameters": [
    {
      "name": "LookupAttributes",
      "type": "list",
      "required": true,
      "description": "Contains a list of lookup attributes. Currently the list can contain only one item. (dict) --- Specifies an attribute and value that filter the events returned. Specifies an attribute on which to filter the events returned. Specifies a value for the specified AttributeKey. The maximum length for the AttributeValue is 2000 characters. The following characters (' _', --\u0098 `` ', ' ``,', --\u0098 \\\\n') count as two characters towards the 2000 character limit.",
      "nested_params": [
        {
          "name": "AttributeKey",
          "type": "string",
          "required": false,
          "description": "Specifies an attribute on which to filter the events returned.",
          "nested_params": []
        },
        {
          "name": "AttributeValue",
          "type": "string",
          "required": false,
          "description": "Specifies a value for the specified AttributeKey. The maximum length for the AttributeValue is 2000 characters. The following characters (' _', --\u0098 `` ', ' ``,', --\u0098 \\\\n') count as two characters towards the 2000 character limit.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "StartTime",
      "type": "datetime",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "EndTime",
      "type": "datetime",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "EventCategory",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Events",
          "type": "list",
          "description": "A list of events returned based on the lookup attributes specified and the CloudTrail event. The events list is sorted by time. The most recent event is listed first.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "EventId",
                  "type": "string",
                  "description": "The CloudTrail ID of the event returned.",
                  "nested_items": []
                },
                {
                  "name": "EventName",
                  "type": "string",
                  "description": "The name of the event returned.",
                  "nested_items": []
                },
                {
                  "name": "ReadOnly",
                  "type": "string",
                  "description": "Information about whether the event is a write event or a read event.",
                  "nested_items": []
                },
                {
                  "name": "AccessKeyId",
                  "type": "string",
                  "description": "The Amazon Web Services access key ID that was used to sign the request. If the request was made with temporary security credentials, this is the access key ID of the temporary credentials.",
                  "nested_items": []
                },
                {
                  "name": "EventTime",
                  "type": "datetime",
                  "description": "The date and time of the event returned.",
                  "nested_items": []
                },
                {
                  "name": "EventSource",
                  "type": "string",
                  "description": "The Amazon Web Services service to which the request was made.",
                  "nested_items": []
                },
                {
                  "name": "Username",
                  "type": "string",
                  "description": "A user name or role name of the requester that called the API in the event returned.",
                  "nested_items": []
                },
                {
                  "name": "Resources",
                  "type": "list",
                  "description": "A list of resources referenced by the event returned.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "ResourceType",
                          "type": "string",
                          "description": "The type of a resource referenced by the event returned. When the resource type cannot be determined, null is returned. Some examples of resource types are: Instance for EC2, Trail for CloudTrail, DBInstance for Amazon RDS, and AccessKey for IAM. To learn more about how to look up and filter events by the resource types supported for a service, see Filtering CloudTrail Events.",
                          "nested_items": []
                        },
                        {
                          "name": "ResourceName",
                          "type": "string",
                          "description": "The name of the resource referenced by the event returned. These are user-created names whose values will depend on the environment. For example, the resource name might be 'auto-scaling-test-group' for an Auto Scaling Group or 'i-1234567' for an EC2 Instance.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "CloudTrailEvent",
                  "type": "string",
                  "description": "A JSON string that contains a representation of the event returned.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The token to use to get the next page of results after a previous API call. If the token does not appear, there are no more results to return. The token must be passed in with the same parameters as the previous call. For example, if the original call specified an AttributeKey of --\u0098Username' with a value of --\u0098root', the call with NextToken should include those same parameters.",
          "nested_items": []
        }
      ]
    }
  ]
}