{
  "method_name": "put_resource_policy",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudtrail/client/put_resource_policy.html",
  "description": "Attaches a resource-based permission policy to a CloudTrail event data store, dashboard, or channel. For more information about resource-based policies, see CloudTrail resource-based policy examples in the CloudTrail User Guide.",
  "parameters": [
    {
      "name": "ResourceArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the CloudTrail event data store, dashboard, or channel attached to the resource-based policy. Example event data store ARN format: arn:aws:cloudtrail:us-east-2:123456789012:eventdatastore/EXAMPLE-f852-4e8f-8bd1-bcf6cEXAMPLE Example dashboard ARN format: arn:aws:cloudtrail:us-east-1:123456789012:dashboard/exampleDash Example channel ARN format: arn:aws:cloudtrail:us-east-2:123456789012:channel/01234567890",
      "nested_params": []
    },
    {
      "name": "ResourcePolicy",
      "type": "string",
      "required": true,
      "description": "A JSON-formatted string for an Amazon Web Services resource-based policy. For example resource-based policies, see CloudTrail resource-based policy examples in the CloudTrail User Guide.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ResourceArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the CloudTrail event data store, dashboard, or channel attached to the resource-based policy.",
          "nested_items": []
        },
        {
          "name": "ResourcePolicy",
          "type": "string",
          "description": "The JSON-formatted string of the Amazon Web Services resource-based policy attached to the CloudTrail event data store, dashboard, or channel.",
          "nested_items": []
        },
        {
          "name": "DelegatedAdminResourcePolicy",
          "type": "string",
          "description": "The default resource-based policy that is automatically generated for the delegated administrator of an Organizations organization. This policy will be evaluated in tandem with any policy you submit for the resource. For more information about this policy, see Default resource policy for delegated administrators.",
          "nested_items": []
        }
      ]
    }
  ]
}