{
  "method_name": "create_starter_mapping_template",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/b2bi/client/create_starter_mapping_template.html",
  "description": "Amazon Web Services B2B Data Interchange uses a mapping template in JSONata or XSLT format to transform a customer input file into a JSON or XML file that can be converted to EDI. If you provide a sample EDI file with the same structure as the EDI files that you wish to generate, then the service can generate a mapping template. The starter template contains placeholder values which you can replace with JSONata or XSLT expressions to take data from your input file and insert it into the JSON or XML file that is used to generate the EDI. If you do not provide a sample EDI file, then the service can generate a mapping template based on the EDI settings in the templateDetails parameter. Currently, we only support generating a template that can generate the input to produce an Outbound X12 EDI file.",
  "parameters": [
    {
      "name": "outputSampleLocation",
      "type": "dict",
      "required": false,
      "description": "Specify the location of the sample EDI file that is used to generate the mapping template. bucketName (string) --- Specifies the name of the Amazon S3 bucket. key (string) --- Specifies the Amazon S3 key for the file location.",
      "nested_params": [
        {
          "name": "bucketName",
          "type": "string",
          "required": false,
          "description": "Specifies the name of the Amazon S3 bucket.",
          "nested_params": []
        },
        {
          "name": "key",
          "type": "string",
          "required": false,
          "description": "Specifies the Amazon S3 key for the file location.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "mappingType",
      "type": "string",
      "required": true,
      "description": "Specify the format for the mapping template: either JSONATA or XSLT.",
      "nested_params": []
    },
    {
      "name": "templateDetails",
      "type": "dict",
      "required": true,
      "description": "Describes the details needed for generating the template. Specify the X12 transaction set and version for which the template is used: currently, we only support X12. x12 (dict) --- A structure that contains the X12 transaction set and version. The X12 structure is used when the system transforms an EDI (electronic data interchange) file. transactionSet (string) --- Returns an enumerated type where each value identifies an X12 transaction set. Transaction sets are maintained by the X12 Accredited Standards Committee. version (string) --- Returns the version to use for the specified X12 transaction set.",
      "nested_params": [
        {
          "name": "x12",
          "type": "dict",
          "required": false,
          "description": "A structure that contains the X12 transaction set and version. The X12 structure is used when the system transforms an EDI (electronic data interchange) file.",
          "nested_params": [
            {
              "name": "transactionSet",
              "type": "string",
              "required": false,
              "description": "Returns an enumerated type where each value identifies an X12 transaction set. Transaction sets are maintained by the X12 Accredited Standards Committee.",
              "nested_params": []
            },
            {
              "name": "version",
              "type": "string",
              "required": false,
              "description": "Returns the version to use for the specified X12 transaction set.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "mappingTemplate",
          "type": "string",
          "description": "Returns a string that represents the mapping template.",
          "nested_items": []
        }
      ]
    }
  ]
}