{
  "method_name": "apply_pending_maintenance_action",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/dms/client/apply_pending_maintenance_action.html",
  "description": "Applies a pending maintenance action to a resource (for example, to a replication instance).",
  "parameters": [
    {
      "name": "ReplicationInstanceArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the DMS resource that the pending maintenance action applies to.",
      "nested_params": []
    },
    {
      "name": "ApplyAction",
      "type": "string",
      "required": true,
      "description": "The pending maintenance action to apply to this resource. Valid values: os-upgrade, system-update, db-upgrade, os-patch.",
      "nested_params": []
    },
    {
      "name": "OptInType",
      "type": "string",
      "required": true,
      "description": "A value that specifies the type of opt-in request, or undoes an opt-in request. You can't undo an opt-in request of type immediate. Valid values: immediate - Apply the maintenance action immediately. next-maintenance - Apply the maintenance action during the next maintenance window for the resource. undo-opt-in - Cancel any existing next-maintenance opt-in requests.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ResourcePendingMaintenanceActions",
          "type": "dict",
          "description": "The DMS resource that the pending maintenance action will be applied to.",
          "nested_items": [
            {
              "name": "ResourceIdentifier",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the DMS resource that the pending maintenance action applies to. For information about creating an ARN, see Constructing an Amazon Resource Name (ARN) for DMS in the DMS documentation.",
              "nested_items": []
            },
            {
              "name": "PendingMaintenanceActionDetails",
              "type": "list",
              "description": "Detailed information about the pending maintenance action.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Action",
                      "type": "string",
                      "description": "The type of pending maintenance action that is available for the resource.",
                      "nested_items": []
                    },
                    {
                      "name": "AutoAppliedAfterDate",
                      "type": "datetime",
                      "description": "The date of the maintenance window when the action is to be applied. The maintenance action is applied to the resource during its first maintenance window after this date. If this date is specified, any next-maintenance opt-in requests are ignored.",
                      "nested_items": []
                    },
                    {
                      "name": "ForcedApplyDate",
                      "type": "datetime",
                      "description": "The date when the maintenance action will be automatically applied. The maintenance action is applied to the resource on this date regardless of the maintenance window for the resource. If this date is specified, any immediate opt-in requests are ignored.",
                      "nested_items": []
                    },
                    {
                      "name": "OptInStatus",
                      "type": "string",
                      "description": "The type of opt-in request that has been received for the resource.",
                      "nested_items": []
                    },
                    {
                      "name": "CurrentApplyDate",
                      "type": "datetime",
                      "description": "The effective date when the pending maintenance action will be applied to the resource. This date takes into account opt-in requests received from the ApplyPendingMaintenanceAction API operation, and also the AutoAppliedAfterDate and ForcedApplyDate parameter values. This value is blank if an opt-in request has not been received and nothing has been specified for AutoAppliedAfterDate or ForcedApplyDate.",
                      "nested_items": []
                    },
                    {
                      "name": "Description",
                      "type": "string",
                      "description": "A description providing more detail about the maintenance action.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}