{
  "method_name": "list_key_phrases_detection_jobs",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/comprehend/client/list_key_phrases_detection_jobs.html",
  "description": "Get a list of key phrase detection jobs that you have submitted.",
  "parameters": [
    {
      "name": "Filter",
      "type": "dict",
      "required": false,
      "description": "Filters the jobs that are returned. You can filter jobs on their name, status, or the date and time that they were submitted. You can only set one filter at a time. JobName (string) --- Filters on the name of the job. JobStatus (string) --- Filters the list of jobs based on job status. Returns only jobs with the specified status. SubmitTimeBefore (datetime) --- Filters the list of jobs based on the time that the job was submitted for processing. Returns only jobs submitted before the specified time. Jobs are returned in ascending order, oldest to newest. SubmitTimeAfter (datetime) --- Filters the list of jobs based on the time that the job was submitted for processing. Returns only jobs submitted after the specified time. Jobs are returned in descending order, newest to oldest.",
      "nested_params": [
        {
          "name": "JobName",
          "type": "string",
          "required": false,
          "description": "Filters on the name of the job.",
          "nested_params": []
        },
        {
          "name": "JobStatus",
          "type": "string",
          "required": false,
          "description": "Filters the list of jobs based on job status. Returns only jobs with the specified status.",
          "nested_params": []
        },
        {
          "name": "SubmitTimeBefore",
          "type": "datetime",
          "required": false,
          "description": "Filters the list of jobs based on the time that the job was submitted for processing. Returns only jobs submitted before the specified time. Jobs are returned in ascending order, oldest to newest.",
          "nested_params": []
        },
        {
          "name": "SubmitTimeAfter",
          "type": "datetime",
          "required": false,
          "description": "Filters the list of jobs based on the time that the job was submitted for processing. Returns only jobs submitted after the specified time. Jobs are returned in descending order, newest to oldest.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "KeyPhrasesDetectionJobPropertiesList",
          "type": "list",
          "description": "A list containing the properties of each job that is returned.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "JobId",
                  "type": "string",
                  "description": "The identifier assigned to the key phrases detection job.",
                  "nested_items": []
                },
                {
                  "name": "JobArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the key phrases detection job. It is a unique, fully qualified identifier for the job. It includes the Amazon Web Services account, Amazon Web Services Region, and the job ID. The format of the ARN is as follows:",
                  "nested_items": []
                },
                {
                  "name": "JobName",
                  "type": "string",
                  "description": "The name that you assigned the key phrases detection job.",
                  "nested_items": []
                },
                {
                  "name": "JobStatus",
                  "type": "string",
                  "description": "The current status of the key phrases detection job. If the status is FAILED, the Message field shows the reason for the failure.",
                  "nested_items": []
                },
                {
                  "name": "Message",
                  "type": "string",
                  "description": "A description of the status of a job.",
                  "nested_items": []
                },
                {
                  "name": "SubmitTime",
                  "type": "datetime",
                  "description": "The time that the key phrases detection job was submitted for processing.",
                  "nested_items": []
                },
                {
                  "name": "EndTime",
                  "type": "datetime",
                  "description": "The time that the key phrases detection job completed.",
                  "nested_items": []
                },
                {
                  "name": "InputDataConfig",
                  "type": "dict",
                  "description": "The input data configuration that you supplied when you created the key phrases detection job.",
                  "nested_items": [
                    {
                      "name": "S3Uri",
                      "type": "string",
                      "description": "The Amazon S3 URI for the input data. The URI must be in same Region as the API endpoint that you are calling. The URI can point to a single input file or it can provide the prefix for a collection of data files.",
                      "nested_items": []
                    },
                    {
                      "name": "InputFormat",
                      "type": "string",
                      "description": "Specifies how the text in an input file should be processed:",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "ONE_DOC_PER_FILE - Each file is considered a separate document. Use this option when you are processing large documents, such as newspaper articles or scientific papers.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "ONE_DOC_PER_LINE - Each line in a file is considered a separate document. Use this option when you are processing many short documents, such as text messages.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "DocumentReaderConfig",
                      "type": "dict",
                      "description": "Provides configuration parameters to override the default actions for extracting text from PDF documents and image files.",
                      "nested_items": [
                        {
                          "name": "DocumentReadAction",
                          "type": "string",
                          "description": "This field defines the Amazon Textract API operation that Amazon Comprehend uses to extract text from PDF files and image files. Enter one of the following values:",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "",
                              "description": "TEXTRACT_DETECT_DOCUMENT_TEXT - The Amazon Comprehend service uses the DetectDocumentText API operation.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "TEXTRACT_ANALYZE_DOCUMENT - The Amazon Comprehend service uses the AnalyzeDocument API operation.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "DocumentReadMode",
                          "type": "string",
                          "description": "Determines the text extraction actions for PDF files. Enter one of the following values:",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "",
                              "description": "SERVICE_DEFAULT - use the Amazon Comprehend service defaults for PDF files.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "FORCE_DOCUMENT_READ_ACTION - Amazon Comprehend uses the Textract API specified by DocumentReadAction for all PDF files, including digital PDF files.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "FeatureTypes",
                          "type": "list",
                          "description": "Specifies the type of Amazon Textract features to apply. If you chose TEXTRACT_ANALYZE_DOCUMENT as the read action, you must specify one or both of the following values:",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "",
                              "description": "TABLES - Returns additional information about any tables that are detected in the input document.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "FORMS - Returns additional information about any forms that are detected in the input document.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "OutputDataConfig",
                  "type": "dict",
                  "description": "The output data configuration that you supplied when you created the key phrases detection job.",
                  "nested_items": [
                    {
                      "name": "S3Uri",
                      "type": "string",
                      "description": "When you use the OutputDataConfig object with asynchronous operations, you specify the Amazon S3 location where you want to write the output data. The URI must be in the same Region as the API endpoint that you are calling. The location is used as the prefix for the actual location of the output file.",
                      "nested_items": []
                    },
                    {
                      "name": "KmsKeyId",
                      "type": "string",
                      "description": "ID for the Amazon Web Services Key Management Service (KMS) key that Amazon Comprehend uses to encrypt the output results from an analysis job. Specify the Key Id of a symmetric key, because you cannot use an asymmetric key for uploading data to S3.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "KMS Key ID: \"1234abcd-12ab-34cd-56ef-1234567890ab\"",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "ARN",
                          "description": "Amazon Resource Name (ARN) of a KMS Key: \"arn:aws:kms:us-west-2:111122223333:key/1234abcd-12ab-34cd-56ef-1234567890ab\"",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "KMS Key Alias: \"alias/ExampleAlias\"",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "ARN of a KMS Key Alias: \"arn:aws:kms:us-west-2:111122223333:alias/ExampleAlias\"",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "LanguageCode",
                  "type": "string",
                  "description": "The language code of the input documents.",
                  "nested_items": []
                },
                {
                  "name": "DataAccessRoleArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the IAM role that grants Amazon Comprehend read access to your input data.",
                  "nested_items": []
                },
                {
                  "name": "VolumeKmsKeyId",
                  "type": "string",
                  "description": "ID for the KMS key that Amazon Comprehend uses to encrypt data on the storage volume attached to the ML compute instance(s) that process the analysis job. The VolumeKmsKeyId can be either of the following formats:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "KMS Key ID: \"1234abcd-12ab-34cd-56ef-1234567890ab\"",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "ARN",
                      "description": "Amazon Resource Name (ARN) of a KMS Key: \"arn:aws:kms:us-west-2:111122223333:key/1234abcd-12ab-34cd-56ef-1234567890ab\"",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "VpcConfig",
                  "type": "dict",
                  "description": "Configuration parameters for a private Virtual Private Cloud (VPC) containing the resources you are using for your key phrases detection job. For more information, see Amazon VPC.",
                  "nested_items": [
                    {
                      "name": "SecurityGroupIds",
                      "type": "list",
                      "description": "The ID number for a security group on an instance of your private VPC. Security groups on your VPC function serve as a virtual firewall to control inbound and outbound traffic and provides security for the resources that you'll be accessing on the VPC. This ID number is preceded by 'sg-', for instance: 'sg-03b388029b0a285ea'. For more information, see Security Groups for your VPC.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "Subnets",
                      "type": "list",
                      "description": "The ID for each subnet being used in your private VPC. This subnet is a subset of the a range of IPv4 addresses used by the VPC and is specific to a given availability zone in the VPC's Region. This ID number is preceded by 'subnet-', for instance: 'subnet-04ccf456919e69055'. For more information, see VPCs and Subnets.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "Identifies the next page of results to return.",
          "nested_items": []
        }
      ]
    }
  ]
}