{
  "method_name": "create_origin_access_control",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudfront/client/create_origin_access_control.html",
  "description": "Creates a new origin access control in CloudFront. After you create an origin access control, you can add it to an origin in a CloudFront distribution so that CloudFront sends authenticated (signed) requests to the origin. This makes it possible to block public access to the origin, allowing viewers (users) to access the origin's content only through CloudFront. For more information about using a CloudFront origin access control, see Restricting access to an Amazon Web Services origin in the Amazon CloudFront Developer Guide.",
  "parameters": [],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "OriginAccessControl",
          "type": "dict",
          "description": "Contains an origin access control.",
          "nested_items": [
            {
              "name": "Id",
              "type": "string",
              "description": "The unique identifier of the origin access control.",
              "nested_items": []
            },
            {
              "name": "OriginAccessControlConfig",
              "type": "dict",
              "description": "The origin access control.",
              "nested_items": [
                {
                  "name": "Name",
                  "type": "string",
                  "description": "A name to identify the origin access control. You can specify up to 64 characters.",
                  "nested_items": []
                },
                {
                  "name": "Description",
                  "type": "string",
                  "description": "A description of the origin access control.",
                  "nested_items": []
                },
                {
                  "name": "SigningProtocol",
                  "type": "string",
                  "description": "The signing protocol of the origin access control, which determines how CloudFront signs (authenticates) requests. The only valid value is sigv4.",
                  "nested_items": []
                },
                {
                  "name": "SigningBehavior",
                  "type": "string",
                  "description": "Specifies which requests CloudFront signs (adds authentication information to). Specify always for the most common use case. For more information, see origin access control advanced settings in the Amazon CloudFront Developer Guide.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "always --- CloudFront signs all origin requests, overwriting the Authorization header from the viewer request if one exists.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "never --- CloudFront doesn't sign any origin requests. This value turns off origin access control for all origins in all distributions that use this origin access control.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "no-override --- If the viewer request doesn't contain the Authorization header, then CloudFront signs the origin request. If the viewer request contains the Authorization header, then CloudFront doesn't sign the origin request and instead passes along the Authorization header from the viewer request. WARNING: To pass along the Authorization header from the viewer request, you must add the Authorization header to a cache policy for all cache behaviors that use origins associated with this origin access control.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "OriginAccessControlOriginType",
                  "type": "string",
                  "description": "The type of origin that this origin access control is for.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "Location",
          "type": "string",
          "description": "The URL of the origin access control.",
          "nested_items": []
        },
        {
          "name": "ETag",
          "type": "string",
          "description": "The version identifier for the current version of the origin access control.",
          "nested_items": []
        }
      ]
    }
  ]
}