{
  "method_name": "create_access_preview",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/accessanalyzer/client/create_access_preview.html",
  "description": "Creates an access preview that allows you to preview IAM Access Analyzer findings for your resource before deploying resource permissions.",
  "parameters": [
    {
      "name": "analyzerArn",
      "type": "string",
      "required": true,
      "description": "The ARN of the account analyzer used to generate the access preview. You can only create an access preview for analyzers with an Account type and Active status.",
      "nested_params": []
    },
    {
      "name": "configurations",
      "type": "dict",
      "required": true,
      "description": "Access control configuration for your resource that is used to generate the access preview. The access preview includes findings for external access allowed to the resource with the proposed access control configuration. The configuration must contain exactly one element. (string) --- (dict) --- Access control configuration structures for your resource. You specify the configuration as a type-value pair. You can specify only one type of access control configuration. ebsSnapshot (dict) --- The access control configuration is for an Amazon EBS volume snapshot. userIds (list) --- The IDs of the Amazon Web Services accounts that have access to the Amazon EBS volume snapshot. If the configuration is for an existing Amazon EBS volume snapshot and you do not specify the userIds, then the access preview uses the existing shared userIds for the snapshot. If the access preview is for a new resource and you do not specify the userIds, then the access preview considers the snapshot without any userIds. To propose deletion of existing shared accountIds, you can specify an empty list for userIds. (string) --- groups (list) --- The groups that have access to the Amazon EBS volume snapshot. If the value all is specified, then the Amazon EBS volume snapshot is public. If the configuration is for an existing Amazon EBS volume snapshot and you do not specify the groups, then the access preview uses the existing shared groups for the snapshot. If the access preview is for a new resource and you do not specify the groups, then the access preview considers the snapshot without any groups. To propose deletion of existing shared groups, you can specify an empty list for groups. (string) --- kmsKeyId (string) --- The KMS key identifier for an encrypted Amazon EBS volume snapshot. The KMS key identifier is the key ARN, key ID, alias ARN, or alias name for the KMS key. If the configuration is for an existing Amazon EBS volume snapshot and you do not specify the kmsKeyId, or you specify an empty string, then the access preview uses the existing kmsKeyId of the snapshot. If the access preview is for a new resource and you do not specify the kmsKeyId, the access preview considers the snapshot as unencrypted. ecrRepository (dict) --- The access control configuration is for an Amazon ECR repository. repositoryPolicy (string) --- The JSON repository policy text to apply to the Amazon ECR repository. For more information, see Private repository policy examples in the Amazon ECR User Guide. iamRole (dict) --- The access control configuration is for an IAM role. trustPolicy (string) --- The proposed trust policy for the IAM role. efsFileSystem (dict) --- The access control configuration is for an Amazon EFS file system. fileSystemPolicy (string) --- The JSON policy definition to apply to the Amazon EFS file system. For more information on the elements that make up a file system policy, see Amazon EFS Resource-based policies. kmsKey (dict) --- The access control configuration is for a KMS key. keyPolicies (dict) --- Resource policy configuration for the KMS key. The only valid value for the name of the key policy is default. For more information, see Default key policy. (string) --- (string) --- grants (list) --- A list of proposed grant configurations for the KMS key. If the proposed grant configuration is for an existing key, the access preview uses the proposed list of grant configurations in place of the existing grants. Otherwise, the access preview uses the existing grants for the key. (dict) --- A proposed grant configuration for a KMS key. For more information, see CreateGrant. A list of operations that the grant permits. (string) --- The principal that is given permission to perform the operations that the grant permits. retiringPrincipal (string) --- The principal that is given permission to retire the grant by using RetireGrant operation. constraints (dict) --- Use this structure to propose allowing cryptographic operations in the grant only when the operation request includes the specified encryption context. encryptionContextEquals (dict) --- A list of key-value pairs that must match the encryption context in the cryptographic operation request. The grant allows the operation only when the encryption context in the request is the same as the encryption context specified in this constraint. (string) --- (string) --- encryptionContextSubset (dict) --- A list of key-value pairs that must be included in the encryption context of the cryptographic operation request. The grant allows the cryptographic operation only when the encryption context in the request includes the key-value pairs specified in this constraint, although it can include additional key-value pairs. (string) --- (string) --- The Amazon Web Services account under which the grant was issued. The account is used to propose KMS grants issued by accounts other than the owner of the key. rdsDbClusterSnapshot (dict) --- The access control configuration is for an Amazon RDS DB cluster snapshot. attributes (dict) --- The names and values of manual DB cluster snapshot attributes. Manual DB cluster snapshot attributes are used to authorize other Amazon Web Services accounts to restore a manual DB cluster snapshot. The only valid value for AttributeName for the attribute map is restore (string) --- (dict) --- The values for a manual Amazon RDS DB cluster snapshot attribute. accountIds (list) --- The Amazon Web Services account IDs that have access to the manual Amazon RDS DB cluster snapshot. If the value all is specified, then the Amazon RDS DB cluster snapshot is public and can be copied or restored by all Amazon Web Services accounts. If the configuration is for an existing Amazon RDS DB cluster snapshot and you do not specify the accountIds in RdsDbClusterSnapshotAttributeValue, then the access preview uses the existing shared accountIds for the snapshot. If the access preview is for a new resource and you do not specify the specify the accountIds in RdsDbClusterSnapshotAttributeValue, then the access preview considers the snapshot without any attributes. To propose deletion of existing shared accountIds, you can specify an empty list for accountIds in the RdsDbClusterSnapshotAttributeValue. (string) --- kmsKeyId (string) --- The KMS key identifier for an encrypted Amazon RDS DB cluster snapshot. If the configuration is for an existing Amazon RDS DB cluster snapshot and you do not specify the kmsKeyId, or you specify an empty string, then the access preview uses the existing kmsKeyId of the snapshot. If the access preview is for a new resource and you do not specify the specify the kmsKeyId, then the access preview considers the snapshot as unencrypted. rdsDbSnapshot (dict) --- The access control configuration is for an Amazon RDS DB snapshot. attributes (dict) --- The names and values of manual DB snapshot attributes. Manual DB snapshot attributes are used to authorize other Amazon Web Services accounts to restore a manual DB snapshot. The only valid value for attributeName for the attribute map is restore. (string) --- (dict) --- The name and values of a manual Amazon RDS DB snapshot attribute. accountIds (list) --- The Amazon Web Services account IDs that have access to the manual Amazon RDS DB snapshot. If the value all is specified, then the Amazon RDS DB snapshot is public and can be copied or restored by all Amazon Web Services accounts. If the configuration is for an existing Amazon RDS DB snapshot and you do not specify the accountIds in RdsDbSnapshotAttributeValue, then the access preview uses the existing shared accountIds for the snapshot. If the access preview is for a new resource and you do not specify the specify the accountIds in RdsDbSnapshotAttributeValue, then the access preview considers the snapshot without any attributes. To propose deletion of an existing shared accountIds, you can specify an empty list for accountIds in the RdsDbSnapshotAttributeValue. (string) --- kmsKeyId (string) --- The KMS key identifier for an encrypted Amazon RDS DB snapshot. If the configuration is for an existing Amazon RDS DB snapshot and you do not specify the kmsKeyId, or you specify an empty string, then the access preview uses the existing kmsKeyId of the snapshot. secretsManagerSecret (dict) --- The access control configuration is for a Secrets Manager secret. kmsKeyId (string) --- The proposed ARN, key ID, or alias of the KMS key. secretPolicy (string) --- The proposed resource policy defining who can access or manage the secret. s3Bucket (dict) --- The access control configuration is for an Amazon S3 bucket. bucketPolicy (string) --- The proposed bucket policy for the Amazon S3 bucket. bucketAclGrants (list) --- The proposed list of ACL grants for the Amazon S3 bucket. You can propose up to 100 ACL grants per bucket. If the proposed grant configuration is for an existing bucket, the access preview uses the proposed list of grant configurations in place of the existing grants. Otherwise, the access preview uses the existing grants for the bucket. (dict) --- A proposed access control list grant configuration for an Amazon S3 bucket. For more information, see How to Specify an ACL. The permissions being granted. The grantee to whom you're assigning access rights. id (string) --- The value specified is the canonical user ID of an Amazon Web Services account. uri (string) --- Used for granting permissions to a predefined group. bucketPublicAccessBlock (dict) --- The proposed block public access configuration for the Amazon S3 bucket. Specifies whether Amazon S3 should ignore public ACLs for this bucket and objects in this bucket. Specifies whether Amazon S3 should restrict public bucket policies for this bucket. accessPoints (dict) --- The configuration of Amazon S3 access points or multi-region access points for the bucket. You can propose up to 10 new access points per bucket. (string) --- (dict) --- The configuration for an Amazon S3 access point or multi-region access point for the bucket. You can propose up to 10 access points or multi-region access points per bucket. If the proposed Amazon S3 access point configuration is for an existing bucket, the access preview uses the proposed access point configuration in place of the existing access points. To propose an access point without a policy, you can provide an empty string as the access point policy. For more information, see Creating access points. For more information about access point policy limits, see Access points restrictions and limitations. accessPointPolicy (string) --- The access point or multi-region access point policy. publicAccessBlock (dict) --- The proposed S3PublicAccessBlock configuration to apply to this Amazon S3 access point or multi-region access point. networkOrigin (dict) --- The proposed Internet and VpcConfiguration to apply to this Amazon S3 access point. VpcConfiguration does not apply to multi-region access points. If the access preview is for a new resource and neither is specified, the access preview uses Internet for the network origin. If the access preview is for an existing resource and neither is specified, the access preview uses the existing network origin. vpcConfiguration (dict) --- The proposed virtual private cloud (VPC) configuration for the Amazon S3 access point. VPC configuration does not apply to multi-region access points. For more information, see VpcConfiguration. If this field is specified, this access point will only allow connections from the specified VPC ID. internetConfiguration (dict) --- The configuration for the Amazon S3 access point or multi-region access point with an Internet origin. snsTopic (dict) --- The access control configuration is for an Amazon SNS topic topicPolicy (string) --- The JSON policy text that defines who can access an Amazon SNS topic. For more information, see Example cases for Amazon SNS access control in the Amazon SNS Developer Guide. sqsQueue (dict) --- The access control configuration is for an Amazon SQS queue. queuePolicy (string) --- The proposed resource policy for the Amazon SQS queue. s3ExpressDirectoryBucket (dict) --- The access control configuration is for an Amazon S3 directory bucket. bucketPolicy (string) --- The proposed bucket policy for the Amazon S3 directory bucket. accessPoints (dict) --- The proposed access points for the Amazon S3 directory bucket. (string) --- (dict) --- Proposed configuration for an access point attached to an Amazon S3 directory bucket. You can propose up to 10 access points per bucket. If the proposed access point configuration is for an existing Amazon S3 directory bucket, the access preview uses the proposed access point configuration in place of the existing access points. For more information about access points for Amazon S3 directory buckets, see Managing access to directory buckets with access points in the Amazon Simple Storage Service User Guide. accessPointPolicy (string) --- The proposed access point policy for an Amazon S3 directory bucket access point. networkOrigin (dict) --- The proposed InternetConfiguration or VpcConfiguration to apply to the Amazon S3 access point. You can make the access point accessible from the internet, or you can specify that all requests made through that access point must originate from a specific virtual private cloud (VPC). You can specify only one type of network configuration. dynamodbStream (dict) --- The access control configuration is for a DynamoDB stream. streamPolicy (string) --- The proposed resource policy defining who can access or manage the DynamoDB stream. dynamodbTable (dict) --- The access control configuration is for a DynamoDB table or index. tablePolicy (string) --- The proposed resource policy defining who can access or manage the DynamoDB table.",
      "nested_params": [
        {
          "name": "ebsSnapshot",
          "type": "dict",
          "required": false,
          "description": "The access control configuration is for an Amazon EBS volume snapshot.",
          "nested_params": [
            {
              "name": "userIds",
              "type": "list",
              "required": false,
              "description": "The IDs of the Amazon Web Services accounts that have access to the Amazon EBS volume snapshot.",
              "nested_params": []
            },
            {
              "name": "groups",
              "type": "list",
              "required": false,
              "description": "The groups that have access to the Amazon EBS volume snapshot. If the value all is specified, then the Amazon EBS volume snapshot is public.",
              "nested_params": []
            },
            {
              "name": "kmsKeyId",
              "type": "string",
              "required": false,
              "description": "The KMS key identifier for an encrypted Amazon EBS volume snapshot. The KMS key identifier is the key ARN, key ID, alias ARN, or alias name for the KMS key.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ecrRepository",
          "type": "dict",
          "required": false,
          "description": "The access control configuration is for an Amazon ECR repository.",
          "nested_params": [
            {
              "name": "repositoryPolicy",
              "type": "string",
              "required": false,
              "description": "The JSON repository policy text to apply to the Amazon ECR repository. For more information, see Private repository policy examples in the Amazon ECR User Guide.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "iamRole",
          "type": "dict",
          "required": false,
          "description": "The access control configuration is for an IAM role.",
          "nested_params": [
            {
              "name": "trustPolicy",
              "type": "string",
              "required": false,
              "description": "The proposed trust policy for the IAM role.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "efsFileSystem",
          "type": "dict",
          "required": false,
          "description": "The access control configuration is for an Amazon EFS file system.",
          "nested_params": [
            {
              "name": "fileSystemPolicy",
              "type": "string",
              "required": false,
              "description": "The JSON policy definition to apply to the Amazon EFS file system. For more information on the elements that make up a file system policy, see Amazon EFS Resource-based policies.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "kmsKey",
          "type": "dict",
          "required": false,
          "description": "The access control configuration is for a KMS key.",
          "nested_params": [
            {
              "name": "keyPolicies",
              "type": "dict",
              "required": false,
              "description": "Resource policy configuration for the KMS key. The only valid value for the name of the key policy is default. For more information, see Default key policy.",
              "nested_params": []
            },
            {
              "name": "grants",
              "type": "list",
              "required": false,
              "description": "A list of proposed grant configurations for the KMS key. If the proposed grant configuration is for an existing key, the access preview uses the proposed list of grant configurations in place of the existing grants. Otherwise, the access preview uses the existing grants for the key.",
              "nested_params": [
                {
                  "name": "operations",
                  "type": "list",
                  "required": false,
                  "description": "A list of operations that the grant permits.",
                  "nested_params": []
                },
                {
                  "name": "granteePrincipal",
                  "type": "string",
                  "required": false,
                  "description": "The principal that is given permission to perform the operations that the grant permits.",
                  "nested_params": []
                },
                {
                  "name": "retiringPrincipal",
                  "type": "string",
                  "required": false,
                  "description": "The principal that is given permission to retire the grant by using RetireGrant operation.",
                  "nested_params": []
                },
                {
                  "name": "constraints",
                  "type": "dict",
                  "required": false,
                  "description": "Use this structure to propose allowing cryptographic operations in the grant only when the operation request includes the specified encryption context.",
                  "nested_params": [
                    {
                      "name": "encryptionContextEquals",
                      "type": "dict",
                      "required": false,
                      "description": "A list of key-value pairs that must match the encryption context in the cryptographic operation request. The grant allows the operation only when the encryption context in the request is the same as the encryption context specified in this constraint.",
                      "nested_params": []
                    },
                    {
                      "name": "encryptionContextSubset",
                      "type": "dict",
                      "required": false,
                      "description": "A list of key-value pairs that must be included in the encryption context of the cryptographic operation request. The grant allows the cryptographic operation only when the encryption context in the request includes the key-value pairs specified in this constraint, although it can include additional key-value pairs.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "issuingAccount",
                  "type": "string",
                  "required": false,
                  "description": "The Amazon Web Services account under which the grant was issued. The account is used to propose KMS grants issued by accounts other than the owner of the key.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "rdsDbClusterSnapshot",
          "type": "dict",
          "required": false,
          "description": "The access control configuration is for an Amazon RDS DB cluster snapshot.",
          "nested_params": [
            {
              "name": "attributes",
              "type": "dict",
              "required": false,
              "description": "The names and values of manual DB cluster snapshot attributes. Manual DB cluster snapshot attributes are used to authorize other Amazon Web Services accounts to restore a manual DB cluster snapshot. The only valid value for AttributeName for the attribute map is restore.",
              "nested_params": [
                {
                  "name": "accountIds",
                  "type": "list",
                  "required": false,
                  "description": "The Amazon Web Services account IDs that have access to the manual Amazon RDS DB cluster snapshot. If the value all is specified, then the Amazon RDS DB cluster snapshot is public and can be copied or restored by all Amazon Web Services accounts.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "kmsKeyId",
              "type": "string",
              "required": false,
              "description": "The KMS key identifier for an encrypted Amazon RDS DB cluster snapshot. The KMS key identifier is the key ARN, key ID, alias ARN, or alias name for the KMS key.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "rdsDbSnapshot",
          "type": "dict",
          "required": false,
          "description": "The access control configuration is for an Amazon RDS DB snapshot.",
          "nested_params": [
            {
              "name": "attributes",
              "type": "dict",
              "required": false,
              "description": "The names and values of manual DB snapshot attributes. Manual DB snapshot attributes are used to authorize other Amazon Web Services accounts to restore a manual DB snapshot. The only valid value for attributeName for the attribute map is restore.",
              "nested_params": [
                {
                  "name": "accountIds",
                  "type": "list",
                  "required": false,
                  "description": "The Amazon Web Services account IDs that have access to the manual Amazon RDS DB snapshot. If the value all is specified, then the Amazon RDS DB snapshot is public and can be copied or restored by all Amazon Web Services accounts.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "kmsKeyId",
              "type": "string",
              "required": false,
              "description": "The KMS key identifier for an encrypted Amazon RDS DB snapshot. The KMS key identifier is the key ARN, key ID, alias ARN, or alias name for the KMS key.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "secretsManagerSecret",
          "type": "dict",
          "required": false,
          "description": "The access control configuration is for a Secrets Manager secret.",
          "nested_params": [
            {
              "name": "kmsKeyId",
              "type": "string",
              "required": false,
              "description": "The proposed ARN, key ID, or alias of the KMS key.",
              "nested_params": []
            },
            {
              "name": "secretPolicy",
              "type": "string",
              "required": false,
              "description": "The proposed resource policy defining who can access or manage the secret.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "s3Bucket",
          "type": "dict",
          "required": false,
          "description": "The access control configuration is for an Amazon S3 bucket.",
          "nested_params": [
            {
              "name": "bucketPolicy",
              "type": "string",
              "required": false,
              "description": "The proposed bucket policy for the Amazon S3 bucket.",
              "nested_params": []
            },
            {
              "name": "bucketAclGrants",
              "type": "list",
              "required": false,
              "description": "The proposed list of ACL grants for the Amazon S3 bucket. You can propose up to 100 ACL grants per bucket. If the proposed grant configuration is for an existing bucket, the access preview uses the proposed list of grant configurations in place of the existing grants. Otherwise, the access preview uses the existing grants for the bucket.",
              "nested_params": [
                {
                  "name": "permission",
                  "type": "string",
                  "required": false,
                  "description": "The permissions being granted.",
                  "nested_params": []
                },
                {
                  "name": "grantee",
                  "type": "dict",
                  "required": false,
                  "description": "The grantee to whom you're assigning access rights.",
                  "nested_params": [
                    {
                      "name": "id",
                      "type": "string",
                      "required": false,
                      "description": "The value specified is the canonical user ID of an Amazon Web Services account.",
                      "nested_params": []
                    },
                    {
                      "name": "uri",
                      "type": "string",
                      "required": false,
                      "description": "Used for granting permissions to a predefined group.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "bucketPublicAccessBlock",
              "type": "dict",
              "required": false,
              "description": "The proposed block public access configuration for the Amazon S3 bucket.",
              "nested_params": [
                {
                  "name": "ignorePublicAcls",
                  "type": "boolean",
                  "required": false,
                  "description": "Specifies whether Amazon S3 should ignore public ACLs for this bucket and objects in this bucket.",
                  "nested_params": []
                },
                {
                  "name": "restrictPublicBuckets",
                  "type": "boolean",
                  "required": false,
                  "description": "Specifies whether Amazon S3 should restrict public bucket policies for this bucket.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "accessPoints",
              "type": "dict",
              "required": false,
              "description": "The configuration of Amazon S3 access points or multi-region access points for the bucket. You can propose up to 10 new access points per bucket.",
              "nested_params": [
                {
                  "name": "accessPointPolicy",
                  "type": "string",
                  "required": false,
                  "description": "The access point or multi-region access point policy.",
                  "nested_params": []
                },
                {
                  "name": "publicAccessBlock",
                  "type": "dict",
                  "required": false,
                  "description": "The proposed S3PublicAccessBlock configuration to apply to this Amazon S3 access point or multi-region access point.",
                  "nested_params": [
                    {
                      "name": "ignorePublicAcls",
                      "type": "boolean",
                      "required": false,
                      "description": "Specifies whether Amazon S3 should ignore public ACLs for this bucket and objects in this bucket.",
                      "nested_params": []
                    },
                    {
                      "name": "restrictPublicBuckets",
                      "type": "boolean",
                      "required": false,
                      "description": "Specifies whether Amazon S3 should restrict public bucket policies for this bucket.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "networkOrigin",
                  "type": "dict",
                  "required": false,
                  "description": "The proposed Internet and VpcConfiguration to apply to this Amazon S3 access point. VpcConfiguration does not apply to multi-region access points. If the access preview is for a new resource and neither is specified, the access preview uses Internet for the network origin. If the access preview is for an existing resource and neither is specified, the access preview uses the existing network origin.",
                  "nested_params": [
                    {
                      "name": "vpcConfiguration",
                      "type": "dict",
                      "required": false,
                      "description": "The proposed virtual private cloud (VPC) configuration for the Amazon S3 access point. VPC configuration does not apply to multi-region access points. For more information, see VpcConfiguration.",
                      "nested_params": [
                        {
                          "name": "vpcId",
                          "type": "string",
                          "required": false,
                          "description": "If this field is specified, this access point will only allow connections from the specified VPC ID.",
                          "nested_params": []
                        }
                      ]
                    },
                    {
                      "name": "internetConfiguration",
                      "type": "dict",
                      "required": false,
                      "description": "The configuration for the Amazon S3 access point or multi-region access point with an Internet origin.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "snsTopic",
          "type": "dict",
          "required": false,
          "description": "The access control configuration is for an Amazon SNS topic.",
          "nested_params": [
            {
              "name": "topicPolicy",
              "type": "string",
              "required": false,
              "description": "The JSON policy text that defines who can access an Amazon SNS topic. For more information, see Example cases for Amazon SNS access control in the Amazon SNS Developer Guide.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "sqsQueue",
          "type": "dict",
          "required": false,
          "description": "The access control configuration is for an Amazon SQS queue.",
          "nested_params": [
            {
              "name": "queuePolicy",
              "type": "string",
              "required": false,
              "description": "The proposed resource policy for the Amazon SQS queue.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "s3ExpressDirectoryBucket",
          "type": "dict",
          "required": false,
          "description": "The access control configuration is for an Amazon S3 directory bucket.",
          "nested_params": [
            {
              "name": "bucketPolicy",
              "type": "string",
              "required": false,
              "description": "The proposed bucket policy for the Amazon S3 directory bucket.",
              "nested_params": []
            },
            {
              "name": "accessPoints",
              "type": "dict",
              "required": false,
              "description": "The proposed access points for the Amazon S3 directory bucket.",
              "nested_params": [
                {
                  "name": "accessPointPolicy",
                  "type": "string",
                  "required": false,
                  "description": "The proposed access point policy for an Amazon S3 directory bucket access point.",
                  "nested_params": []
                },
                {
                  "name": "networkOrigin",
                  "type": "dict",
                  "required": false,
                  "description": "The proposed InternetConfiguration or VpcConfiguration to apply to the Amazon S3 access point. You can make the access point accessible from the internet, or you can specify that all requests made through that access point must originate from a specific virtual private cloud (VPC). You can specify only one type of network configuration. For more information, see Creating access points.",
                  "nested_params": [
                    {
                      "name": "vpcConfiguration",
                      "type": "dict",
                      "required": false,
                      "description": "The proposed virtual private cloud (VPC) configuration for the Amazon S3 access point. VPC configuration does not apply to multi-region access points. For more information, see VpcConfiguration.",
                      "nested_params": [
                        {
                          "name": "vpcId",
                          "type": "string",
                          "required": false,
                          "description": "If this field is specified, this access point will only allow connections from the specified VPC ID.",
                          "nested_params": []
                        }
                      ]
                    },
                    {
                      "name": "internetConfiguration",
                      "type": "dict",
                      "required": false,
                      "description": "The configuration for the Amazon S3 access point or multi-region access point with an Internet origin.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "dynamodbStream",
          "type": "dict",
          "required": false,
          "description": "The access control configuration is for a DynamoDB stream.",
          "nested_params": [
            {
              "name": "streamPolicy",
              "type": "string",
              "required": false,
              "description": "The proposed resource policy defining who can access or manage the DynamoDB stream.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "dynamodbTable",
          "type": "dict",
          "required": false,
          "description": "The access control configuration is for a DynamoDB table or index.",
          "nested_params": [
            {
              "name": "tablePolicy",
              "type": "string",
              "required": false,
              "description": "The proposed resource policy defining who can access or manage the DynamoDB table.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "clientToken",
      "type": "string",
      "required": false,
      "description": "A client token. This field is autopopulated if not provided.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "id",
          "type": "string",
          "description": "The unique ID for the access preview.",
          "nested_items": []
        }
      ]
    }
  ]
}