{
  "method_name": "describe_affected_accounts_for_organization",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/health/client/describe_affected_accounts_for_organization.html",
  "description": "Returns a list of accounts in the organization from Organizations that are affected by the provided event. For more information about the different types of Health events, see Event. Before you can call this operation, you must first enable Health to work with Organizations. To do this, call the EnableHealthServiceAccessForOrganization operation from your organization's management account.",
  "parameters": [
    {
      "name": "eventArn",
      "type": "string",
      "required": true,
      "description": "The unique identifier for the event. The event ARN has the arn:aws:health:event-region::event/SERVICE/EVENT_TYPE_CODE/EVENT_TYPE_PLUS_ID format. For example, an event ARN might look like the following: arn:aws:health:us-east-1::event/EC2/EC2_INSTANCE_RETIREMENT_SCHEDULED/EC2_INSTANCE_RETIREMENT_SCHEDULED_ABC123-DEF456",
      "nested_params": []
    },
    {
      "name": "nextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "maxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "affectedAccounts",
          "type": "list",
          "description": "A JSON set of elements of the affected accounts.",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": []
            }
          ]
        },
        {
          "name": "eventScopeCode",
          "type": "string",
          "description": "This parameter specifies if the Health event is a public Amazon Web Services service event or an account-specific event.",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "If the eventScopeCode value is PUBLIC, then the affectedAccounts value is always empty.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "If the eventScopeCode value is ACCOUNT_SPECIFIC, then the affectedAccounts value lists the affected Amazon Web Services accounts in your organization. For example, if an event affects a service such as Amazon Elastic Compute Cloud and you have Amazon Web Services accounts that use that service, those account IDs appear in the response.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "If the eventScopeCode value is NONE, then the eventArn that you specified in the request is invalid or doesn't exist.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "nextToken",
          "type": "string",
          "description": "If the results of a search are large, only a portion of the results are returned, and a nextToken pagination token is returned in the response. To retrieve the next batch of results, reissue the search request and include the returned token. When all results have been returned, the response does not contain a pagination token value.",
          "nested_items": []
        }
      ]
    }
  ]
}