{
  "method_name": "create_user",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/connect/client/create_user.html",
  "description": "Creates a user account for the specified Amazon Connect instance. For information about how to create users using the Amazon Connect admin website, see Add Users in the Amazon Connect Administrator Guide.",
  "parameters": [
    {
      "name": "Username",
      "type": "string",
      "required": true,
      "description": "The user name for the account. For instances not using SAML for identity management, the user name can include up to 20 characters. If you are using SAML for identity management, the user name can include up to 64 characters from [a-zA-Z0-9_-.@]+. Username can include @ only if used in an email format. For example: Correct: testuser Correct: testuser@example.com Incorrect: testuser@example.",
      "nested_params": []
    },
    {
      "name": "Password",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "IdentityInfo",
      "type": "dict",
      "required": false,
      "description": "The information about the identity of the user. FirstName (string) --- The first name. This is required if you are using Amazon Connect or SAML for identity management. Inputs must be in Unicode Normalization Form C (NFC). Text containing characters in a non-NFC form (for example, decomposed characters or combining marks) are not accepted. LastName (string) --- The last name. Email (string) --- The email address. If you are using SAML for identity management and include this parameter, an error is returned. SecondaryEmail (string) --- The user's secondary email address. If you provide a secondary email, the user receives email notifications - other than password reset notifications - to this email address instead of to their primary email address. Pattern: (?=^.{0,265}$)[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\\.[a-zA-Z]{2,63} Mobile (string) --- The user's mobile number.",
      "nested_params": [
        {
          "name": "FirstName",
          "type": "string",
          "required": false,
          "description": "The first name. This is required if you are using Amazon Connect or SAML for identity management. Inputs must be in Unicode Normalization Form C (NFC). Text containing characters in a non-NFC form (for example, decomposed characters or combining marks) are not accepted.",
          "nested_params": []
        },
        {
          "name": "LastName",
          "type": "string",
          "required": false,
          "description": "The last name. This is required if you are using Amazon Connect or SAML for identity management. Inputs must be in Unicode Normalization Form C (NFC). Text containing characters in a non-NFC form (for example, decomposed characters or combining marks) are not accepted.",
          "nested_params": []
        },
        {
          "name": "Email",
          "type": "string",
          "required": false,
          "description": "The email address. If you are using SAML for identity management and include this parameter, an error is returned.",
          "nested_params": []
        },
        {
          "name": "SecondaryEmail",
          "type": "string",
          "required": false,
          "description": "The user's secondary email address. If you provide a secondary email, the user receives email notifications - other than password reset notifications - to this email address instead of to their primary email address. Pattern: (?=^.{0,265}$)[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\\.[a-zA-Z]{2,63}",
          "nested_params": []
        },
        {
          "name": "Mobile",
          "type": "string",
          "required": false,
          "description": "The user's mobile number.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "PhoneConfig",
      "type": "dict",
      "required": true,
      "description": "The phone settings for the user. The phone type. AutoAccept (boolean) --- The Auto accept setting. AfterContactWorkTimeLimit (integer) --- The After Call Work (ACW) timeout setting, in seconds. This parameter has a minimum value of 0 and a maximum value of 2,000,000 seconds (24 days). Enter 0 if you don't want to allocate a specific amount of ACW time. It essentially means an indefinite amount of time. When the conversation ends, ACW starts; the agent must choose Close contact to end ACW. DeskPhoneNumber (string) --- The phone number for the user's desk phone.",
      "nested_params": [
        {
          "name": "PhoneType",
          "type": "string",
          "required": false,
          "description": "The phone type.",
          "nested_params": []
        },
        {
          "name": "AutoAccept",
          "type": "boolean",
          "required": false,
          "description": "The Auto accept setting.",
          "nested_params": []
        },
        {
          "name": "AfterContactWorkTimeLimit",
          "type": "integer",
          "required": false,
          "description": "The After Call Work (ACW) timeout setting, in seconds. This parameter has a minimum value of 0 and a maximum value of 2,000,000 seconds (24 days). Enter 0 if you don't want to allocate a specific amount of ACW time. It essentially means an indefinite amount of time. When the conversation ends, ACW starts; the agent must choose Close contact to end ACW.",
          "nested_params": []
        },
        {
          "name": "DeskPhoneNumber",
          "type": "string",
          "required": false,
          "description": "The phone number for the user's desk phone.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "DirectoryUserId",
      "type": "string",
      "required": false,
      "description": "The identifier of the user account in the directory used for identity management. If Amazon Connect cannot access the directory, you can specify this identifier to authenticate users. If you include the identifier, we assume that Amazon Connect cannot access the directory. Otherwise, the identity information is used to authenticate users from your directory. This parameter is required if you are using an existing directory for identity management in Amazon Connect when Amazon Connect cannot access your directory to authenticate users. If you are using SAML for identity management and include this parameter, an error is returned.",
      "nested_params": []
    },
    {
      "name": "SecurityProfileIds",
      "type": "list",
      "required": true,
      "description": "The identifier of the security profile for the user. (string) ---",
      "nested_params": []
    },
    {
      "name": "RoutingProfileId",
      "type": "string",
      "required": true,
      "description": "The identifier of the routing profile for the user.",
      "nested_params": []
    },
    {
      "name": "HierarchyGroupId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "InstanceId",
      "type": "string",
      "required": true,
      "description": "The identifier of the Amazon Connect instance. You can find the instance ID in the Amazon Resource Name (ARN) of the instance.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "dict",
      "required": false,
      "description": "The tags used to organize, track, or control access for this resource. For example, { 'Tags': {'key1':'value1', 'key2':'value2'} }. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "UserId",
          "type": "string",
          "description": "The identifier of the user account.",
          "nested_items": []
        },
        {
          "name": "UserArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the user account.",
          "nested_items": []
        }
      ]
    }
  ]
}