{
  "method_name": "import_phone_number",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/connect/client/import_phone_number.html",
  "description": "Imports a claimed phone number from an external service, such as Amazon Web Services End User Messaging, into an Amazon Connect instance. You can call this API only in the same Amazon Web Services Region where the Amazon Connect instance was created. If you plan to claim or import numbers and then release numbers frequently, contact us for a service quota exception. Otherwise, it is possible you will be blocked from claiming and releasing any more numbers until up to 180 days past the oldest number released has expired. By default you can claim or import and then release up to 200% of your maximum number of active phone numbers. If you claim or import and then release phone numbers using the UI or API during a rolling 180 day cycle that exceeds 200% of your phone number service level quota, you will be blocked from claiming or importing any more numbers until 180 days past the oldest number released has expired. For example, if you already have 99 claimed or imported numbers and a service level quota of 99 phone numbers, and in any 180 day period you release 99, claim 99, and then release 99, you will have exceeded the 200% limit. At that point you are blocked from claiming any more numbers until you open an Amazon Web ServicesSupport ticket.",
  "parameters": [
    {
      "name": "InstanceId",
      "type": "string",
      "required": true,
      "description": "The identifier of the Amazon Connect instance. You can find the instance ID in the Amazon Resource Name (ARN) of the instance.",
      "nested_params": []
    },
    {
      "name": "SourcePhoneNumberArn",
      "type": "string",
      "required": true,
      "description": "The claimed phone number ARN being imported from the external service, such as Amazon Web Services End User Messaging. If it is from Amazon Web Services End User Messaging, it looks like the ARN of the phone number to import from Amazon Web Services End User Messaging.",
      "nested_params": []
    },
    {
      "name": "PhoneNumberDescription",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "dict",
      "required": false,
      "description": "The tags used to organize, track, or control access for this resource. For example, { 'Tags': {'key1':'value1', 'key2':'value2'} }. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": false,
      "description": "A unique, case-sensitive identifier that you provide to ensure the idempotency of the request. If not provided, the Amazon Web Services SDK populates this field. For more information about idempotency, see Making retries safe with idempotent APIs. This field is autopopulated if not provided.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "PhoneNumberId",
          "type": "string",
          "description": "A unique identifier for the phone number.",
          "nested_items": []
        },
        {
          "name": "PhoneNumberArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the phone number.",
          "nested_items": []
        }
      ]
    }
  ]
}