{
  "method_name": "replicate_instance",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/connect/client/replicate_instance.html",
  "description": "Replicates an Amazon Connect instance in the specified Amazon Web Services Region and copies configuration information for Amazon Connect resources across Amazon Web Services Regions. For more information about replicating an Amazon Connect instance, see Create a replica of your existing Amazon Connect instance in the Amazon Connect Administrator Guide.",
  "parameters": [
    {
      "name": "InstanceId",
      "type": "string",
      "required": true,
      "description": "The identifier of the Amazon Connect instance. You can find the instance ID in the Amazon Resource Name (ARN) of the instance. You can provide the InstanceId, or the entire ARN.",
      "nested_params": []
    },
    {
      "name": "ReplicaRegion",
      "type": "string",
      "required": true,
      "description": "The Amazon Web Services Region where to replicate the Amazon Connect instance.",
      "nested_params": []
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": false,
      "description": "A unique, case-sensitive identifier that you provide to ensure the idempotency of the request. If not provided, the Amazon Web Services SDK populates this field. For more information about idempotency, see Making retries safe with idempotent APIs. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "ReplicaAlias",
      "type": "string",
      "required": true,
      "description": "The alias for the replicated instance. The ReplicaAlias must be unique.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Id",
          "type": "string",
          "description": "The identifier of the replicated instance. You can find the instanceId in the ARN of the instance. The replicated instance has the same identifier as the instance it was replicated from.",
          "nested_items": []
        },
        {
          "name": "Arn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the replicated instance.",
          "nested_items": []
        }
      ]
    }
  ]
}