{
  "method_name": "send_chat_integration_event",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/connect/client/send_chat_integration_event.html",
  "description": "Processes chat integration events from Amazon Web Services or external integrations to Amazon Connect. A chat integration event includes: When a chat integration event is sent with chat identifiers that do not map to an active chat contact, a new chat contact is also created before handling chat action. Access to this API is currently restricted to Amazon Web Services End User Messaging for supporting SMS integration.",
  "parameters": [
    {
      "name": "SourceId",
      "type": "string",
      "required": true,
      "description": "External identifier of chat customer participant, used in part to uniquely identify a chat. For SMS, this is the E164 phone number of the chat customer participant.",
      "nested_params": []
    },
    {
      "name": "DestinationId",
      "type": "string",
      "required": true,
      "description": "Chat system identifier, used in part to uniquely identify chat. This is associated with the Amazon Connect instance and flow to be used to start chats. For Server Migration Service, this is the phone number destination of inbound Server Migration Service messages represented by an Amazon Web Services End User Messaging phone number ARN.",
      "nested_params": []
    },
    {
      "name": "Subtype",
      "type": "string",
      "required": false,
      "description": "Classification of a channel. This is used in part to uniquely identify chat. Valid value: [\"connect:sms\", connect:\"WhatsApp\"]",
      "nested_params": []
    },
    {
      "name": "Event",
      "type": "dict",
      "required": true,
      "description": "Chat integration event payload Type of chat integration event. ContentType (string) --- Type of content. This is required when Type is MESSAGE or EVENT. For allowed message content types, see the ContentType parameter in the SendMessage topic in the Amazon Connect Participant Service API Reference. For allowed event content types, see the ContentType parameter in the SendEvent topic in the Amazon Connect Participant Service API Reference. Content (string) --- Content of the message or event. This is required when Type is MESSAGE and for certain ContentTypes when Type is EVENT. For allowed message content, see the Content parameter in the SendMessage topic in the Amazon Connect Participant Service API Reference. For allowed event content, see the Content parameter in the SendEvent topic in the Amazon Connect Participant Service API Reference.",
      "nested_params": [
        {
          "name": "Type",
          "type": "string",
          "required": false,
          "description": "Type of chat integration event.",
          "nested_params": []
        },
        {
          "name": "ContentType",
          "type": "string",
          "required": false,
          "description": "Type of content. This is required when Type is MESSAGE or EVENT.",
          "nested_params": []
        },
        {
          "name": "Content",
          "type": "string",
          "required": false,
          "description": "Content of the message or event. This is required when Type is MESSAGE and for certain ContentTypes when Type is EVENT.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "NewSessionDetails",
      "type": "dict",
      "required": true,
      "description": "Contact properties to apply when starting a new chat. If the integration event is handled with an existing chat, this is ignored. SupportedMessagingContentTypes (list) --- The supported chat message content types. Supported types are text/plain, text/markdown, application/json, application/vnd.amazonaws.connect.message.interactive, and application/vnd.amazonaws.connect.message.interactive.response. Content types must always contain text/plain. You can then put any other supported type in the list. For example, all the following lists are valid because they contain text/plain: [text/plain, text/markdown, application/json], [text/markdown, text/plain], [text/plain, application/json, application/vnd.amazonaws.connect.message.interactive.response]. (string) --- ParticipantDetails (dict) --- The customer's details. Display name of the participant. Attributes (dict) --- A custom key-value pair using an attribute map. The attributes are standard Amazon Connect attributes. They can be accessed in flows just like any other contact attributes. There can be up to 32,768 UTF-8 bytes across all key-value pairs per contact. Attribute keys can include only alphanumeric, dash, and underscore characters. (string) --- (string) --- StreamingConfiguration (dict) --- The streaming configuration, such as the Amazon SNS streaming endpoint. The Amazon Resource Name (ARN) of the standard Amazon SNS topic. The Amazon Resource Name (ARN) of the streaming endpoint that is used to publish real-time message streaming for chat conversations.",
      "nested_params": [
        {
          "name": "SupportedMessagingContentTypes",
          "type": "list",
          "required": false,
          "description": "The supported chat message content types. Supported types are text/plain, text/markdown, application/json, application/vnd.amazonaws.connect.message.interactive, and application/vnd.amazonaws.connect.message.interactive.response. Content types must always contain text/plain. You can then put any other supported type in the list. For example, all the following lists are valid because they contain text/plain: [text/plain, text/markdown, application/json], [text/markdown, text/plain], [text/plain, application/json, application/vnd.amazonaws.connect.message.interactive.response].",
          "nested_params": []
        },
        {
          "name": "ParticipantDetails",
          "type": "dict",
          "required": false,
          "description": "The customer's details.",
          "nested_params": [
            {
              "name": "DisplayName",
              "type": "string",
              "required": false,
              "description": "Display name of the participant.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Attributes",
          "type": "dict",
          "required": false,
          "description": "A custom key-value pair using an attribute map. The attributes are standard Amazon Connect attributes. They can be accessed in flows just like any other contact attributes. There can be up to 32,768 UTF-8 bytes across all key-value pairs per contact. Attribute keys can include only alphanumeric, dash, and underscore characters.",
          "nested_params": []
        },
        {
          "name": "StreamingConfiguration",
          "type": "dict",
          "required": false,
          "description": "The streaming configuration, such as the Amazon SNS streaming endpoint.",
          "nested_params": [
            {
              "name": "StreamingEndpointArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of the standard Amazon SNS topic. The Amazon Resource Name (ARN) of the streaming endpoint that is used to publish real-time message streaming for chat conversations.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "InitialContactId",
          "type": "string",
          "description": "Identifier of chat contact used to handle integration event. This may be null if the integration event is not valid without an already existing chat contact.",
          "nested_items": []
        },
        {
          "name": "NewChatCreated",
          "type": "boolean",
          "description": "Whether handling the integration event resulted in creating a new chat or acting on existing chat.",
          "nested_items": []
        }
      ]
    }
  ]
}