{
  "method_name": "start_contact_streaming",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/connect/client/start_contact_streaming.html",
  "description": "Initiates real-time message streaming for a new chat contact. For more information about message streaming, see Enable real-time chat message streaming in the Amazon Connect Administrator Guide. For more information about chat, see the following topics in the Amazon Connect Administrator Guide:",
  "parameters": [
    {
      "name": "InstanceId",
      "type": "string",
      "required": true,
      "description": "The identifier of the Amazon Connect instance. You can find the instance ID in the Amazon Resource Name (ARN) of the instance.",
      "nested_params": []
    },
    {
      "name": "ContactId",
      "type": "string",
      "required": true,
      "description": "The identifier of the contact. This is the identifier of the contact associated with the first interaction with the contact center.",
      "nested_params": []
    },
    {
      "name": "ChatStreamingConfiguration",
      "type": "dict",
      "required": true,
      "description": "The streaming configuration, such as the Amazon SNS streaming endpoint. The Amazon Resource Name (ARN) of the standard Amazon SNS topic. The Amazon Resource Name (ARN) of the streaming endpoint that is used to publish real-time message streaming for chat conversations.",
      "nested_params": [
        {
          "name": "StreamingEndpointArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the standard Amazon SNS topic. The Amazon Resource Name (ARN) of the streaming endpoint that is used to publish real-time message streaming for chat conversations.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": true,
      "description": "A unique, case-sensitive identifier that you provide to ensure the idempotency of the request. If not provided, the Amazon Web Services SDK populates this field. For more information about idempotency, see Making retries safe with idempotent APIs. This field is autopopulated if not provided.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "StreamingId",
          "type": "string",
          "description": "The identifier of the streaming configuration enabled.",
          "nested_items": []
        }
      ]
    }
  ]
}