{
  "method_name": "update_participant_role_config",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/connect/client/update_participant_role_config.html",
  "description": "Updates timeouts for when human chat participants are to be considered idle, and when agents are automatically disconnected from a chat due to idleness. You can set four timers: For more information about how chat timeouts work, see Set up chat timeouts for human participants.",
  "parameters": [
    {
      "name": "InstanceId",
      "type": "string",
      "required": true,
      "description": "The identifier of the Amazon Connect instance. You can find the instance ID in the Amazon Resource Name (ARN) of the instance.",
      "nested_params": []
    },
    {
      "name": "ContactId",
      "type": "string",
      "required": true,
      "description": "The identifier of the contact in this instance of Amazon Connect.",
      "nested_params": []
    },
    {
      "name": "ChannelConfiguration",
      "type": "dict",
      "required": true,
      "description": "The Amazon Connect channel you want to configure. Chat (dict) --- Configuration information for the chat participant role. A list of participant timers. You can specify any unique combination of role and timer type. Duplicate entries error out the request with a 400. (dict) --- Configuration information for the timer. After the timer configuration is set, it persists for the duration of the chat. It persists across new contacts in the chain, for example, transfer contacts. For more information about how chat timeouts work, see Set up chat timeouts for human participants. The role of the participant in the chat conversation. The type of timer. IDLE indicates the timer applies for considering a human chat participant as idle. DISCONNECT_NONCUSTOMER indicates the timer applies to automatically disconnecting a chat participant due to idleness. The value of the timer. Either the timer action (Unset to delete the timer), or the duration of the timer in minutes. Only one value can be set. ParticipantTimerAction (string) --- The timer action. Currently only one value is allowed: Unset. It deletes a timer. ParticipantTimerDurationInMinutes (integer) --- The duration of a timer, in minutes.",
      "nested_params": [
        {
          "name": "Chat",
          "type": "dict",
          "required": false,
          "description": "Configuration information for the chat participant role.",
          "nested_params": [
            {
              "name": "ParticipantTimerConfigList",
              "type": "list",
              "required": false,
              "description": "A list of participant timers. You can specify any unique combination of role and timer type. Duplicate entries error out the request with a 400.",
              "nested_params": [
                {
                  "name": "ParticipantRole",
                  "type": "string",
                  "required": false,
                  "description": "The role of the participant in the chat conversation.",
                  "nested_params": []
                },
                {
                  "name": "TimerType",
                  "type": "string",
                  "required": false,
                  "description": "The type of timer. IDLE indicates the timer applies for considering a human chat participant as idle. DISCONNECT_NONCUSTOMER indicates the timer applies to automatically disconnecting a chat participant due to idleness.",
                  "nested_params": []
                },
                {
                  "name": "TimerValue",
                  "type": "dict",
                  "required": false,
                  "description": "The value of the timer. Either the timer action (Unset to delete the timer), or the duration of the timer in minutes. Only one value can be set.",
                  "nested_params": [
                    {
                      "name": "ParticipantTimerAction",
                      "type": "string",
                      "required": false,
                      "description": "The timer action. Currently only one value is allowed: Unset. It deletes a timer.",
                      "nested_params": []
                    },
                    {
                      "name": "ParticipantTimerDurationInMinutes",
                      "type": "integer",
                      "required": false,
                      "description": "The duration of a timer, in minutes.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}