{
  "method_name": "update_routing_profile_concurrency",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/connect/client/update_routing_profile_concurrency.html",
  "description": "Updates the channels that agents can handle in the Contact Control Panel (CCP) for a routing profile.",
  "parameters": [
    {
      "name": "InstanceId",
      "type": "string",
      "required": true,
      "description": "The identifier of the Amazon Connect instance. You can find the instance ID in the Amazon Resource Name (ARN) of the instance.",
      "nested_params": []
    },
    {
      "name": "RoutingProfileId",
      "type": "string",
      "required": true,
      "description": "The identifier of the routing profile.",
      "nested_params": []
    },
    {
      "name": "MediaConcurrencies",
      "type": "list",
      "required": true,
      "description": "The channels that agents can handle in the Contact Control Panel (CCP). (dict) --- Contains information about which channels are supported, and how many contacts an agent can have on a channel simultaneously. The number of contacts an agent can have on a channel simultaneously. Valid Range for VOICE: Minimum value of 1. Maximum value of 1. Valid Range for CHAT: Minimum value of 1. Maximum value of 10. Valid Range for TASK: Minimum value of 1. CrossChannelBehavior (dict) --- Defines the cross-channel routing behavior for each channel that is enabled for this Routing Profile. For example, this allows you to offer an agent a different contact from another channel when they are currently working with a contact from a Voice channel. Specifies the other channels that can be routed to an agent handling their current channel.",
      "nested_params": [
        {
          "name": "Channel",
          "type": "string",
          "required": false,
          "description": "The channels that agents can handle in the Contact Control Panel (CCP).",
          "nested_params": []
        },
        {
          "name": "Concurrency",
          "type": "integer",
          "required": false,
          "description": "The number of contacts an agent can have on a channel simultaneously. Valid Range for VOICE: Minimum value of 1. Maximum value of 1. Valid Range for CHAT: Minimum value of 1. Maximum value of 10. Valid Range for TASK: Minimum value of 1. Maximum value of 10.",
          "nested_params": []
        },
        {
          "name": "CrossChannelBehavior",
          "type": "dict",
          "required": false,
          "description": "Defines the cross-channel routing behavior for each channel that is enabled for this Routing Profile. For example, this allows you to offer an agent a different contact from another channel when they are currently working with a contact from a Voice channel.",
          "nested_params": [
            {
              "name": "BehaviorType",
              "type": "string",
              "required": false,
              "description": "Specifies the other channels that can be routed to an agent handling their current channel.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}