{
  "method_name": "update_routing_profile_queues",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/connect/client/update_routing_profile_queues.html",
  "description": "Updates the properties associated with a set of queues for a routing profile.",
  "parameters": [
    {
      "name": "InstanceId",
      "type": "string",
      "required": true,
      "description": "The identifier of the Amazon Connect instance. You can find the instance ID in the Amazon Resource Name (ARN) of the instance.",
      "nested_params": []
    },
    {
      "name": "RoutingProfileId",
      "type": "string",
      "required": true,
      "description": "The identifier of the routing profile.",
      "nested_params": []
    },
    {
      "name": "QueueConfigs",
      "type": "list",
      "required": true,
      "description": "The queues to be updated for this routing profile. Queues must first be associated to the routing profile. You can do this using AssociateRoutingProfileQueues. (dict) --- Contains information about the queue and channel for which priority and delay can be set. Contains information about a queue resource. The identifier for the queue. The channels agents can handle in the Contact Control Panel (CCP) for this routing profile. The order in which contacts are to be handled for the queue. For more information, see Queues: priority and delay. The delay, in seconds, a contact should be in the queue before they are routed to an available agent. For more information, see Queues: priority and delay in the Amazon Connect Administrator Guide.",
      "nested_params": [
        {
          "name": "QueueReference",
          "type": "dict",
          "required": false,
          "description": "Contains information about a queue resource.",
          "nested_params": [
            {
              "name": "QueueId",
              "type": "string",
              "required": false,
              "description": "The identifier for the queue.",
              "nested_params": []
            },
            {
              "name": "Channel",
              "type": "string",
              "required": false,
              "description": "The channels agents can handle in the Contact Control Panel (CCP) for this routing profile.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Priority",
          "type": "integer",
          "required": false,
          "description": "The order in which contacts are to be handled for the queue. For more information, see Queues: priority and delay.",
          "nested_params": []
        },
        {
          "name": "Delay",
          "type": "integer",
          "required": false,
          "description": "The delay, in seconds, a contact should be in the queue before they are routed to an available agent. For more information, see Queues: priority and delay in the Amazon Connect Administrator Guide.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}