{
  "method_name": "create_job_queue",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/batch/client/create_job_queue.html",
  "description": "Creates an Batch job queue. When you create a job queue, you associate one or more compute environments to the queue and assign an order of preference for the compute environments. You also set a priority to the job queue that determines the order that the Batch scheduler places jobs onto its associated compute environments. For example, if a compute environment is associated with more than one job queue, the job queue with a higher priority is given preference for scheduling jobs to that compute environment.",
  "parameters": [
    {
      "name": "jobQueueName",
      "type": "string",
      "required": true,
      "description": "The name of the job queue. It can be up to 128 letters long. It can contain uppercase and lowercase letters, numbers, hyphens (-), and underscores (_).",
      "nested_params": []
    },
    {
      "name": "state",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "schedulingPolicyArn",
      "type": "string",
      "required": false,
      "description": "The Amazon Resource Name (ARN) of the fair-share scheduling policy. Job queues that don't have a fair-share scheduling policy are scheduled in a first-in, first-out (FIFO) model. After a job queue has a fair-share scheduling policy, it can be replaced but can't be removed. The format is ``aws:Partition:batch:Region:Account:scheduling-policy/Name ``. An example is aws:aws:batch:us-west-2:123456789012:scheduling-policy/MySchedulingPolicy. A job queue without a fair-share scheduling policy is scheduled as a FIFO job queue and can't have a fair-share scheduling policy added. Jobs queues with a fair-share scheduling policy can have a maximum of 500 active share identifiers. When the limit has been reached, submissions of any jobs that add a new share identifier fail.",
      "nested_params": []
    },
    {
      "name": "priority",
      "type": "integer",
      "required": true,
      "description": "The priority of the job queue. Job queues with a higher priority (or a higher integer value for the priority parameter) are evaluated first when associated with the same compute environment. Priority is determined in descending order. For example, a job queue with a priority value of 10 is given scheduling preference over a job queue with a priority value of 1. All of the compute environments must be either EC2 ( EC2 or SPOT) or Fargate ( FARGATE or FARGATE_SPOT); EC2 and Fargate compute environments can't be mixed.",
      "nested_params": []
    },
    {
      "name": "computeEnvironmentOrder",
      "type": "list",
      "required": true,
      "description": "The set of compute environments mapped to a job queue and their order relative to each other. The job scheduler uses this parameter to determine which compute environment runs a specific job. Compute environments must be in the VALID state before you can associate them with a job queue. You can associate up to three compute environments with a job queue. All of the compute environments must be either EC2 ( EC2 or SPOT) or Fargate ( FARGATE or FARGATE_SPOT); EC2 and Fargate compute environments can't be mixed. (dict) --- The order that compute environments are tried in for job placement within a queue. Compute environments are tried in ascending order. For example, if two compute environments are associated with a job queue, the compute environment with a lower order integer value is tried for job placement first. All of the compute environments must be either EC2 ( EC2 or SPOT) or Fargate ( FARGATE or FARGATE_SPOT); Amazon EC2 and Fargate compute environments can't be mixed. The order of the compute environment. The Amazon Resource Name (ARN) of the compute environment.",
      "nested_params": [
        {
          "name": "order",
          "type": "integer",
          "required": false,
          "description": "The order of the compute environment. Compute environments are tried in ascending order. For example, if two compute environments are associated with a job queue, the compute environment with a lower order integer value is tried for job placement first.",
          "nested_params": []
        },
        {
          "name": "computeEnvironment",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the compute environment.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "tags",
      "type": "dict",
      "required": false,
      "description": "The tags that you apply to the job queue to help you categorize and organize your resources. Each tag consists of a key and an optional value. For more information, see Tagging your Batch resources in Batch User Guide. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "jobStateTimeLimitActions",
      "type": "list",
      "required": true,
      "description": "The set of actions that Batch performs on jobs that remain at the head of the job queue in the specified state longer than specified times. Batch will perform each action after maxTimeSeconds has passed. (Note: The minimum value for maxTimeSeconds is 600 (10 minutes) and its maximum value is 86,400 (24 hours).) (dict) --- Specifies an action that Batch will take after the job has remained at the head of the queue in the specified state for longer than the specified time. The reason to log for the action being taken. The state of the job needed to trigger the action. The only supported value is RUNNABLE. The approximate amount of time, in seconds, that must pass with the job in the specified state before the action is taken. The minimum value is 600 (10 minutes) and the maximum value is 86,400 (24 hours). The action to take when a job is at the head of the job queue in the specified state for the specified period of time. The only supported value is CANCEL, which will cancel the job.",
      "nested_params": [
        {
          "name": "reason",
          "type": "string",
          "required": false,
          "description": "The reason to log for the action being taken.",
          "nested_params": []
        },
        {
          "name": "state",
          "type": "string",
          "required": false,
          "description": "The state of the job needed to trigger the action. The only supported value is RUNNABLE.",
          "nested_params": []
        },
        {
          "name": "maxTimeSeconds",
          "type": "integer",
          "required": false,
          "description": "The approximate amount of time, in seconds, that must pass with the job in the specified state before the action is taken. The minimum value is 600 (10 minutes) and the maximum value is 86,400 (24 hours).",
          "nested_params": []
        },
        {
          "name": "action",
          "type": "string",
          "required": false,
          "description": "The action to take when a job is at the head of the job queue in the specified state for the specified period of time. The only supported value is CANCEL, which will cancel the job.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "jobQueueName",
          "type": "string",
          "description": "The name of the job queue.",
          "nested_items": []
        },
        {
          "name": "jobQueueArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the job queue.",
          "nested_items": []
        }
      ]
    }
  ]
}