{
  "method_name": "update_job_queue",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/batch/client/update_job_queue.html",
  "description": "Updates a job queue.",
  "parameters": [
    {
      "name": "jobQueue",
      "type": "string",
      "required": true,
      "description": "The name or the Amazon Resource Name (ARN) of the job queue.",
      "nested_params": []
    },
    {
      "name": "state",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "schedulingPolicyArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "priority",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "computeEnvironmentOrder",
      "type": "list",
      "required": true,
      "description": "Details the set of compute environments mapped to a job queue and their order relative to each other. This is one of the parameters used by the job scheduler to determine which compute environment runs a given job. Compute environments must be in the VALID state before you can associate them with a job queue. All of the compute environments must be either EC2 ( EC2 or SPOT) or Fargate ( FARGATE or FARGATE_SPOT). EC2 and Fargate compute environments can't be mixed. (dict) --- The order that compute environments are tried in for job placement within a queue. Compute environments are tried in ascending order. For example, if two compute environments are associated with a job queue, the compute environment with a lower order integer value is tried for job placement first. All of the compute environments must be either EC2 ( EC2 or SPOT) or Fargate ( FARGATE or FARGATE_SPOT); Amazon EC2 and Fargate compute environments can't be mixed. The order of the compute environment. The Amazon Resource Name (ARN) of the compute environment.",
      "nested_params": [
        {
          "name": "order",
          "type": "integer",
          "required": false,
          "description": "The order of the compute environment. Compute environments are tried in ascending order. For example, if two compute environments are associated with a job queue, the compute environment with a lower order integer value is tried for job placement first.",
          "nested_params": []
        },
        {
          "name": "computeEnvironment",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the compute environment.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "jobStateTimeLimitActions",
      "type": "list",
      "required": true,
      "description": "The set of actions that Batch perform on jobs that remain at the head of the job queue in the specified state longer than specified times. Batch will perform each action after maxTimeSeconds has passed. (Note: The minimum value for maxTimeSeconds is 600 (10 minutes) and its maximum value is 86,400 (24 hours).) (dict) --- Specifies an action that Batch will take after the job has remained at the head of the queue in the specified state for longer than the specified time. The reason to log for the action being taken. The state of the job needed to trigger the action. The only supported value is RUNNABLE. The approximate amount of time, in seconds, that must pass with the job in the specified state before the action is taken. The minimum value is 600 (10 minutes) and the maximum value is 86,400 (24 hours). The action to take when a job is at the head of the job queue in the specified state for the specified period of time. The only supported value is CANCEL, which will cancel the job.",
      "nested_params": [
        {
          "name": "reason",
          "type": "string",
          "required": false,
          "description": "The reason to log for the action being taken.",
          "nested_params": []
        },
        {
          "name": "state",
          "type": "string",
          "required": false,
          "description": "The state of the job needed to trigger the action. The only supported value is RUNNABLE.",
          "nested_params": []
        },
        {
          "name": "maxTimeSeconds",
          "type": "integer",
          "required": false,
          "description": "The approximate amount of time, in seconds, that must pass with the job in the specified state before the action is taken. The minimum value is 600 (10 minutes) and the maximum value is 86,400 (24 hours).",
          "nested_params": []
        },
        {
          "name": "action",
          "type": "string",
          "required": false,
          "description": "The action to take when a job is at the head of the job queue in the specified state for the specified period of time. The only supported value is CANCEL, which will cancel the job.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "jobQueueName",
          "type": "string",
          "description": "The name of the job queue.",
          "nested_items": []
        },
        {
          "name": "jobQueueArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the job queue.",
          "nested_items": []
        }
      ]
    }
  ]
}