{
  "method_name": "update_permission_group",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/finspace-data/client/update_permission_group.html",
  "description": "Modifies the details of a permission group. You cannot modify a permissionGroupID.",
  "parameters": [
    {
      "name": "permissionGroupId",
      "type": "string",
      "required": true,
      "description": "The unique identifier for the permission group to update.",
      "nested_params": []
    },
    {
      "name": "name",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "applicationPermissions",
      "type": "list",
      "required": false,
      "description": "The permissions that are granted to a specific group for accessing the FinSpace application. CreateDataset --- Group members can create new datasets. ManageClusters --- Group members can manage Apache Spark clusters from FinSpace notebooks. ManageUsersAndGroups --- Group members can manage users and permission groups. This is a privileged permission that allows users to grant themselves or others access to any functionality in the application. It should only be granted to trusted users. ManageAttributeSets --- Group members can manage attribute sets. ViewAuditData --- Group members can view audit data. AccessNotebooks --- Group members will have access to FinSpace notebooks. GetTemporaryCredentials --- Group members can get temporary API credentials. (string) ---",
      "nested_params": []
    },
    {
      "name": "clientToken",
      "type": "string",
      "required": false,
      "description": "A token that ensures idempotency. This token expires in 10 minutes. This field is autopopulated if not provided.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "permissionGroupId",
          "type": "string",
          "description": "The unique identifier for the updated permission group.",
          "nested_items": []
        }
      ]
    }
  ]
}