{
  "method_name": "create_auto_scaling_configuration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/apprunner/client/create_auto_scaling_configuration.html",
  "description": "Create an App Runner automatic scaling configuration resource. App Runner requires this resource when you create or update App Runner services and you require non-default auto scaling settings. You can share an auto scaling configuration across multiple services. Create multiple revisions of a configuration by calling this action multiple times using the same AutoScalingConfigurationName. The call returns incremental AutoScalingConfigurationRevision values. When you create a service and configure an auto scaling configuration resource, the service uses the latest active revision of the auto scaling configuration by default. You can optionally configure the service to use a specific revision. Configure a higher MinSize to increase the spread of your App Runner service over more Availability Zones in the Amazon Web Services Region. The tradeoff is a higher minimal cost. Configure a lower MaxSize to control your cost. The tradeoff is lower responsiveness during peak demand.",
  "parameters": [
    {
      "name": "AutoScalingConfigurationName",
      "type": "string",
      "required": true,
      "description": "A name for the auto scaling configuration. When you use it for the first time in an Amazon Web Services Region, App Runner creates revision number 1 of this name. When you use the same name in subsequent calls, App Runner creates incremental revisions of the configuration.",
      "nested_params": []
    },
    {
      "name": "MaxConcurrency",
      "type": "integer",
      "required": false,
      "description": "The maximum number of concurrent requests that you want an instance to process. If the number of concurrent requests exceeds this limit, App Runner scales up your service. Default: 100",
      "nested_params": []
    },
    {
      "name": "MinSize",
      "type": "integer",
      "required": false,
      "description": "The minimum number of instances that App Runner provisions for your service. The service always has at least MinSize provisioned instances. Some of them actively serve traffic. The rest of them (provisioned and inactive instances) are a cost-effective compute capacity reserve and are ready to be quickly activated. You pay for memory usage of all the provisioned instances. You pay for CPU usage of only the active subset. App Runner temporarily doubles the number of provisioned instances during deployments, to maintain the same capacity for both old and new code. Default: 1",
      "nested_params": []
    },
    {
      "name": "MaxSize",
      "type": "integer",
      "required": false,
      "description": "The maximum number of instances that your service scales up to. At most MaxSize instances actively serve traffic for your service. Default: 25",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": false,
      "description": "A list of metadata items that you can associate with your auto scaling configuration resource. A tag is a key-value pair. (dict) --- Describes a tag that is applied to an App Runner resource. A tag is a metadata item consisting of a key-value pair. Key (string) --- The key of the tag. Value (string) --- The value of the tag.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key of the tag.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value of the tag.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "AutoScalingConfiguration",
          "type": "dict",
          "description": "A description of the App Runner auto scaling configuration that's created by this request.",
          "nested_items": [
            {
              "name": "AutoScalingConfigurationArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of this auto scaling configuration.",
              "nested_items": []
            },
            {
              "name": "AutoScalingConfigurationName",
              "type": "string",
              "description": "The customer-provided auto scaling configuration name. It can be used in multiple revisions of a configuration.",
              "nested_items": []
            },
            {
              "name": "AutoScalingConfigurationRevision",
              "type": "integer",
              "description": "The revision of this auto scaling configuration. It's unique among all the active configurations ( \"Status\": \"ACTIVE\") that share the same AutoScalingConfigurationName.",
              "nested_items": []
            },
            {
              "name": "Latest",
              "type": "boolean",
              "description": "It's set to true for the configuration with the highest Revision among all configurations that share the same AutoScalingConfigurationName. It's set to false otherwise.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The current state of the auto scaling configuration. If the status of a configuration revision is INACTIVE, it was deleted and can't be used. Inactive configuration revisions are permanently removed some time after they are deleted.",
              "nested_items": []
            },
            {
              "name": "MaxConcurrency",
              "type": "integer",
              "description": "The maximum number of concurrent requests that an instance processes. If the number of concurrent requests exceeds this limit, App Runner scales the service up.",
              "nested_items": []
            },
            {
              "name": "MinSize",
              "type": "integer",
              "description": "The minimum number of instances that App Runner provisions for a service. The service always has at least MinSize provisioned instances. Some of them actively serve traffic. The rest of them (provisioned and inactive instances) are a cost-effective compute capacity reserve and are ready to be quickly activated. You pay for memory usage of all the provisioned instances. You pay for CPU usage of only the active subset.",
              "nested_items": []
            },
            {
              "name": "MaxSize",
              "type": "integer",
              "description": "The maximum number of instances that a service scales up to. At most MaxSize instances actively serve traffic for your service.",
              "nested_items": []
            },
            {
              "name": "CreatedAt",
              "type": "datetime",
              "description": "The time when the auto scaling configuration was created. It's in Unix time stamp format.",
              "nested_items": []
            },
            {
              "name": "DeletedAt",
              "type": "datetime",
              "description": "The time when the auto scaling configuration was deleted. It's in Unix time stamp format.",
              "nested_items": []
            },
            {
              "name": "HasAssociatedService",
              "type": "boolean",
              "description": "Indicates if this auto scaling configuration has an App Runner service associated with it. A value of true indicates one or more services are associated. A value of false indicates no services are associated.",
              "nested_items": []
            },
            {
              "name": "IsDefault",
              "type": "boolean",
              "description": "Indicates if this auto scaling configuration should be used as the default for a new App Runner service that does not have an auto scaling configuration ARN specified during creation. Each account can have only one default AutoScalingConfiguration per region. The default AutoScalingConfiguration can be any revision under the same AutoScalingConfigurationName.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}