{
  "method_name": "get_origin_request_policy_config",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudfront/client/get_origin_request_policy_config.html",
  "description": "Gets an origin request policy configuration. To get an origin request policy configuration, you must provide the policy's identifier. If the origin request policy is attached to a distribution's cache behavior, you can get the policy's identifier using ListDistributions or GetDistribution. If the origin request policy is not attached to a cache behavior, you can get the identifier using ListOriginRequestPolicies.",
  "parameters": [
    {
      "name": "Id",
      "type": "string",
      "required": true,
      "description": "The unique identifier for the origin request policy. If the origin request policy is attached to a distribution's cache behavior, you can get the policy's identifier using ListDistributions or GetDistribution. If the origin request policy is not attached to a cache behavior, you can get the identifier using ListOriginRequestPolicies.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "OriginRequestPolicyConfig",
          "type": "dict",
          "description": "The origin request policy configuration.",
          "nested_items": [
            {
              "name": "Comment",
              "type": "string",
              "description": "A comment to describe the origin request policy. The comment cannot be longer than 128 characters.",
              "nested_items": []
            },
            {
              "name": "Name",
              "type": "string",
              "description": "A unique name to identify the origin request policy.",
              "nested_items": []
            },
            {
              "name": "HeadersConfig",
              "type": "dict",
              "description": "The HTTP headers to include in origin requests. These can include headers from viewer requests and additional headers added by CloudFront.",
              "nested_items": [
                {
                  "name": "HeaderBehavior",
                  "type": "string",
                  "description": "Determines whether any HTTP headers are included in requests that CloudFront sends to the origin. Valid values are:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "none --- No HTTP headers in viewer requests are included in requests that CloudFront sends to the origin. Even when this field is set to none, any headers that are listed in a CachePolicy are included in origin requests.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "whitelist --- Only the HTTP headers that are listed in the Headers type are included in requests that CloudFront sends to the origin.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "allViewer --- All HTTP headers in viewer requests are included in requests that CloudFront sends to the origin.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "allViewerAndWhitelistCloudFront --- All HTTP headers in viewer requests and the additional CloudFront headers that are listed in the Headers type are included in requests that CloudFront sends to the origin. The additional headers are added by CloudFront.",
                      "nested_items": []
                    },
                    {
                      "name": "except",
                      "type": "",
                      "description": "",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Quantity",
                      "type": "integer",
                      "description": "The number of header names in the Items list.",
                      "nested_items": []
                    },
                    {
                      "name": "Items",
                      "type": "list",
                      "description": "A list of HTTP header names.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "CookiesConfig",
              "type": "dict",
              "description": "The cookies from viewer requests to include in origin requests.",
              "nested_items": [
                {
                  "name": "CookieBehavior",
                  "type": "string",
                  "description": "Determines whether cookies in viewer requests are included in requests that CloudFront sends to the origin. Valid values are:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "none --- No cookies in viewer requests are included in requests that CloudFront sends to the origin. Even when this field is set to none, any cookies that are listed in a CachePolicy are included in origin requests.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "whitelist --- Only the cookies in viewer requests that are listed in the CookieNames type are included in requests that CloudFront sends to the origin.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "all --- All cookies in viewer requests are included in requests that CloudFront sends to the origin.",
                      "nested_items": []
                    },
                    {
                      "name": "except",
                      "type": "",
                      "description": "",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Quantity",
                      "type": "integer",
                      "description": "The number of cookie names in the Items list.",
                      "nested_items": []
                    },
                    {
                      "name": "Items",
                      "type": "list",
                      "description": "A list of cookie names.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "QueryStringsConfig",
              "type": "dict",
              "description": "The URL query strings from viewer requests to include in origin requests.",
              "nested_items": [
                {
                  "name": "QueryStringBehavior",
                  "type": "string",
                  "description": "Determines whether any URL query strings in viewer requests are included in requests that CloudFront sends to the origin. Valid values are:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "none --- No query strings in viewer requests are included in requests that CloudFront sends to the origin. Even when this field is set to none, any query strings that are listed in a CachePolicy are included in origin requests.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "whitelist --- Only the query strings in viewer requests that are listed in the QueryStringNames type are included in requests that CloudFront sends to the origin.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "all --- All query strings in viewer requests are included in requests that CloudFront sends to the origin.",
                      "nested_items": []
                    },
                    {
                      "name": "except",
                      "type": "",
                      "description": "",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "QueryStrings",
                  "type": "dict",
                  "description": "Contains the specific query strings in viewer requests that either are or are not included in requests that CloudFront sends to the origin. The behavior depends on whether the QueryStringBehavior field in the OriginRequestPolicyQueryStringsConfig type is set to whitelist (the listed query strings are included) or allExcept (the listed query strings are not included, but all other query strings are).",
                  "nested_items": [
                    {
                      "name": "Quantity",
                      "type": "integer",
                      "description": "The number of query string names in the Items list.",
                      "nested_items": []
                    },
                    {
                      "name": "Items",
                      "type": "list",
                      "description": "A list of query string names.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "ETag",
          "type": "string",
          "description": "The current version of the origin request policy.",
          "nested_items": []
        }
      ]
    }
  ]
}