{
  "method_name": "list_cache_policies",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudfront/client/list_cache_policies.html",
  "description": "Gets a list of cache policies. You can optionally apply a filter to return only the managed policies created by Amazon Web Services, or only the custom policies created in your Amazon Web Services account. You can optionally specify the maximum number of items to receive in the response. If the total number of items in the list exceeds the maximum that you specify, or the default maximum, the response is paginated. To get the next page of items, send a subsequent request that specifies the NextMarker value from the current response as the Marker value in the subsequent request.",
  "parameters": [
    {
      "name": "Type",
      "type": "string",
      "required": false,
      "description": "A filter to return only the specified kinds of cache policies. Valid values are: managed --- Returns only the managed policies created by Amazon Web Services. custom --- Returns only the custom policies created in your Amazon Web Services account.",
      "nested_params": []
    },
    {
      "name": "Marker",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxItems",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "CachePolicyList",
          "type": "dict",
          "description": "A list of cache policies.",
          "nested_items": [
            {
              "name": "NextMarker",
              "type": "string",
              "description": "If there are more items in the list than are in this response, this element is present. It contains the value that you should use in the Marker field of a subsequent request to continue listing cache policies where you left off.",
              "nested_items": []
            },
            {
              "name": "MaxItems",
              "type": "integer",
              "description": "The maximum number of cache policies requested.",
              "nested_items": []
            },
            {
              "name": "Quantity",
              "type": "integer",
              "description": "The total number of cache policies returned in the response.",
              "nested_items": []
            },
            {
              "name": "Items",
              "type": "list",
              "description": "Contains the cache policies in the list.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Type",
                      "type": "string",
                      "description": "The type of cache policy, either managed (created by Amazon Web Services) or custom (created in this Amazon Web Services account).",
                      "nested_items": []
                    },
                    {
                      "name": "CachePolicy",
                      "type": "dict",
                      "description": "The cache policy.",
                      "nested_items": [
                        {
                          "name": "Id",
                          "type": "string",
                          "description": "The unique identifier for the cache policy.",
                          "nested_items": []
                        },
                        {
                          "name": "LastModifiedTime",
                          "type": "datetime",
                          "description": "The date and time when the cache policy was last modified.",
                          "nested_items": []
                        },
                        {
                          "name": "CachePolicyConfig",
                          "type": "dict",
                          "description": "The cache policy configuration.",
                          "nested_items": [
                            {
                              "name": "Comment",
                              "type": "string",
                              "description": "A comment to describe the cache policy. The comment cannot be longer than 128 characters.",
                              "nested_items": []
                            },
                            {
                              "name": "Name",
                              "type": "string",
                              "description": "A unique name to identify the cache policy.",
                              "nested_items": []
                            },
                            {
                              "name": "DefaultTTL",
                              "type": "integer",
                              "description": "The default amount of time, in seconds, that you want objects to stay in the CloudFront cache before CloudFront sends another request to the origin to see if the object has been updated. CloudFront uses this value as the object's time to live (TTL) only when the origin does not send Cache-Control or Expires headers with the object. For more information, see Managing How Long Content Stays in an Edge Cache (Expiration) in the Amazon CloudFront Developer Guide.",
                              "nested_items": []
                            },
                            {
                              "name": "MaxTTL",
                              "type": "integer",
                              "description": "The maximum amount of time, in seconds, that objects stay in the CloudFront cache before CloudFront sends another request to the origin to see if the object has been updated. CloudFront uses this value only when the origin sends Cache-Control or Expires headers with the object. For more information, see Managing How Long Content Stays in an Edge Cache (Expiration) in the Amazon CloudFront Developer Guide.",
                              "nested_items": []
                            },
                            {
                              "name": "MinTTL",
                              "type": "integer",
                              "description": "The minimum amount of time, in seconds, that you want objects to stay in the CloudFront cache before CloudFront sends another request to the origin to see if the object has been updated. For more information, see Managing How Long Content Stays in an Edge Cache (Expiration) in the Amazon CloudFront Developer Guide.",
                              "nested_items": []
                            },
                            {
                              "name": "ParametersInCacheKeyAndForwardedToOrigin",
                              "type": "dict",
                              "description": "The HTTP headers, cookies, and URL query strings to include in the cache key. The values included in the cache key are also included in requests that CloudFront sends to the origin.",
                              "nested_items": [
                                {
                                  "name": "EnableAcceptEncodingGzip",
                                  "type": "boolean",
                                  "description": "A flag that can affect whether the Accept-Encoding HTTP header is included in the cache key and included in requests that CloudFront sends to the origin.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "Normalizes the value of the viewer's Accept-Encoding header.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "Includes the normalized header in the cache key.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "Includes the normalized header in the request to the origin, if a request is necessary.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "EnableAcceptEncodingBrotli",
                                  "type": "boolean",
                                  "description": "A flag that can affect whether the Accept-Encoding HTTP header is included in the cache key and included in requests that CloudFront sends to the origin.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "Normalizes the value of the viewer's Accept-Encoding header.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "Includes the normalized header in the cache key.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "Includes the normalized header in the request to the origin, if a request is necessary.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "HeadersConfig",
                                  "type": "dict",
                                  "description": "An object that determines whether any HTTP headers (and if so, which headers) are included in the cache key and in requests that CloudFront sends to the origin.",
                                  "nested_items": [
                                    {
                                      "name": "HeaderBehavior",
                                      "type": "string",
                                      "description": "Determines whether any HTTP headers are included in the cache key and in requests that CloudFront sends to the origin. Valid values are:",
                                      "nested_items": [
                                        {
                                          "name": "",
                                          "type": "",
                                          "description": "none --- No HTTP headers are included in the cache key or in requests that CloudFront sends to the origin. Even when this field is set to none, any headers that are listed in an OriginRequestPolicy are included in origin requests.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "",
                                          "type": "",
                                          "description": "whitelist --- Only the HTTP headers that are listed in the Headers type are included in the cache key and in requests that CloudFront sends to the origin.",
                                          "nested_items": []
                                        }
                                      ]
                                    },
                                    {
                                      "name": "",
                                      "type": "dict",
                                      "description": "",
                                      "nested_items": [
                                        {
                                          "name": "Quantity",
                                          "type": "integer",
                                          "description": "The number of header names in the Items list.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "Items",
                                          "type": "list",
                                          "description": "A list of HTTP header names.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "string",
                                              "description": "(string) ---",
                                              "nested_items": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "name": "CookiesConfig",
                                  "type": "dict",
                                  "description": "An object that determines whether any cookies in viewer requests (and if so, which cookies) are included in the cache key and in requests that CloudFront sends to the origin.",
                                  "nested_items": [
                                    {
                                      "name": "CookieBehavior",
                                      "type": "string",
                                      "description": "Determines whether any cookies in viewer requests are included in the cache key and in requests that CloudFront sends to the origin. Valid values are:",
                                      "nested_items": [
                                        {
                                          "name": "",
                                          "type": "",
                                          "description": "none --- No cookies in viewer requests are included in the cache key or in requests that CloudFront sends to the origin. Even when this field is set to none, any cookies that are listed in an OriginRequestPolicy are included in origin requests.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "",
                                          "type": "",
                                          "description": "whitelist --- Only the cookies in viewer requests that are listed in the CookieNames type are included in the cache key and in requests that CloudFront sends to the origin.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "except",
                                          "type": "",
                                          "description": "",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "",
                                          "type": "",
                                          "description": "all --- All cookies in viewer requests are included in the cache key and in requests that CloudFront sends to the origin.",
                                          "nested_items": []
                                        }
                                      ]
                                    },
                                    {
                                      "name": "",
                                      "type": "dict",
                                      "description": "",
                                      "nested_items": [
                                        {
                                          "name": "Quantity",
                                          "type": "integer",
                                          "description": "The number of cookie names in the Items list.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "Items",
                                          "type": "list",
                                          "description": "A list of cookie names.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "string",
                                              "description": "(string) ---",
                                              "nested_items": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "name": "QueryStringsConfig",
                                  "type": "dict",
                                  "description": "An object that determines whether any URL query strings in viewer requests (and if so, which query strings) are included in the cache key and in requests that CloudFront sends to the origin.",
                                  "nested_items": [
                                    {
                                      "name": "QueryStringBehavior",
                                      "type": "string",
                                      "description": "Determines whether any URL query strings in viewer requests are included in the cache key and in requests that CloudFront sends to the origin. Valid values are:",
                                      "nested_items": [
                                        {
                                          "name": "",
                                          "type": "",
                                          "description": "none --- No query strings in viewer requests are included in the cache key or in requests that CloudFront sends to the origin. Even when this field is set to none, any query strings that are listed in an OriginRequestPolicy are included in origin requests.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "",
                                          "type": "",
                                          "description": "whitelist --- Only the query strings in viewer requests that are listed in the QueryStringNames type are included in the cache key and in requests that CloudFront sends to the origin.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "except",
                                          "type": "",
                                          "description": "",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "",
                                          "type": "",
                                          "description": "all --- All query strings in viewer requests are included in the cache key and in requests that CloudFront sends to the origin.",
                                          "nested_items": []
                                        }
                                      ]
                                    },
                                    {
                                      "name": "QueryStrings",
                                      "type": "dict",
                                      "description": "Contains the specific query strings in viewer requests that either are or are not included in the cache key and in requests that CloudFront sends to the origin. The behavior depends on whether the QueryStringBehavior field in the CachePolicyQueryStringsConfig type is set to whitelist (the listed query strings are included) or allExcept (the listed query strings are not included, but all other query strings are).",
                                      "nested_items": [
                                        {
                                          "name": "Quantity",
                                          "type": "integer",
                                          "description": "The number of query string names in the Items list.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "Items",
                                          "type": "list",
                                          "description": "A list of query string names.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "string",
                                              "description": "(string) ---",
                                              "nested_items": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}