{
  "method_name": "update_origin_request_policy",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudfront/client/update_origin_request_policy.html",
  "description": "Updates an origin request policy configuration. When you update an origin request policy configuration, all the fields are updated with the values provided in the request. You cannot update some fields independent of others. To update an origin request policy configuration:",
  "parameters": [
    {
      "name": "OriginRequestPolicyConfig",
      "type": "dict",
      "required": true,
      "description": "An origin request policy configuration. Comment (string) --- A comment to describe the origin request policy. The comment cannot be longer than 128 characters. A unique name to identify the origin request policy. The HTTP headers to include in origin requests. These can include headers from viewer requests and additional headers added by CloudFront. Determines whether any HTTP headers are included in requests that CloudFront sends to the origin. Valid values are: none --- No HTTP headers in viewer requests are included in requests that CloudFront sends to the origin. Even when this field is set to none, any headers that are listed in a CachePolicy are included in origin requests. whitelist --- Only the HTTP headers that are listed in the Headers type are included in requests that CloudFront sends to the origin. allViewer --- All HTTP headers in viewer requests are included in requests that CloudFront sends to the origin. allViewerAndWhitelistCloudFront --- All HTTP headers in viewer requests and the additional CloudFront headers that are listed in the Headers type are included in requests that CloudFront sends to the origin. The additional headers are added by CloudFront. allExcept --- All HTTP headers in viewer requests are included in requests that CloudFront sends to the origin, except for those listed in the Headers type, which are not included. Headers (dict) --- Contains a list of HTTP header names. The number of header names in the Items list. Items (list) --- A list of HTTP header names. (string) --- The cookies from viewer requests to include in origin requests. Determines whether cookies in viewer requests are included in requests that CloudFront sends to the origin. Valid values are: none --- No cookies in viewer requests are included in requests that CloudFront sends to the origin. Even when this field is set to none, any cookies that are listed in a CachePolicy are included in origin requests. whitelist --- Only the cookies in viewer requests that are listed in the CookieNames type are included in requests that CloudFront sends to the origin. all --- All cookies in viewer requests are included in requests that CloudFront sends to the origin. allExcept --- All cookies in viewer requests are included in requests that CloudFront sends to the origin, except for those listed in the CookieNames type, which are not included. Cookies (dict) --- Contains a list of cookie names. The number of cookie names in the Items list. Items (list) --- A list of cookie names. (string) --- The URL query strings from viewer requests to include in origin requests. Determines whether any URL query strings in viewer requests are included in requests that CloudFront sends to the origin. Valid values are: none --- No query strings in viewer requests are included in requests that CloudFront sends to the origin. Even when this field is set to none, any query strings that are listed in a CachePolicy are included in origin requests. whitelist --- Only the query strings in viewer requests that are listed in the QueryStringNames type are included in requests that CloudFront sends to the origin. all --- All query strings in viewer requests are included in requests that CloudFront sends to the origin. allExcept --- All query strings in viewer requests are included in requests that CloudFront sends to the origin, except for those listed in the QueryStringNames type, which are not included. QueryStrings (dict) --- Contains the specific query strings in viewer requests that either are or are not included in requests that CloudFront sends to the origin. The behavior depends on whether the QueryStringBehavior field in the OriginRequestPolicyQueryStringsConfig type is set to whitelist (the listed query strings are included) or allExcept (the listed query strings are not included, but all other query strings are). The number of query string names in the Items list. Items (list) --- A list of query string names. (string) ---",
      "nested_params": [
        {
          "name": "Comment",
          "type": "string",
          "required": false,
          "description": "A comment to describe the origin request policy. The comment cannot be longer than 128 characters.",
          "nested_params": []
        },
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "A unique name to identify the origin request policy.",
          "nested_params": []
        },
        {
          "name": "HeadersConfig",
          "type": "dict",
          "required": false,
          "description": "The HTTP headers to include in origin requests. These can include headers from viewer requests and additional headers added by CloudFront.",
          "nested_params": [
            {
              "name": "HeaderBehavior",
              "type": "string",
              "required": false,
              "description": "Determines whether any HTTP headers are included in requests that CloudFront sends to the origin. Valid values are:",
              "nested_params": [
                {
                  "name": "except",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Headers",
              "type": "dict",
              "required": false,
              "description": "Contains a list of HTTP header names.",
              "nested_params": [
                {
                  "name": "Quantity",
                  "type": "integer",
                  "required": false,
                  "description": "The number of header names in the Items list.",
                  "nested_params": []
                },
                {
                  "name": "Items",
                  "type": "list",
                  "required": false,
                  "description": "A list of HTTP header names.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "CookiesConfig",
          "type": "dict",
          "required": false,
          "description": "The cookies from viewer requests to include in origin requests.",
          "nested_params": [
            {
              "name": "CookieBehavior",
              "type": "string",
              "required": false,
              "description": "Determines whether cookies in viewer requests are included in requests that CloudFront sends to the origin. Valid values are:",
              "nested_params": [
                {
                  "name": "except",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Cookies",
              "type": "dict",
              "required": false,
              "description": "Contains a list of cookie names.",
              "nested_params": [
                {
                  "name": "Quantity",
                  "type": "integer",
                  "required": false,
                  "description": "The number of cookie names in the Items list.",
                  "nested_params": []
                },
                {
                  "name": "Items",
                  "type": "list",
                  "required": false,
                  "description": "A list of cookie names.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "QueryStringsConfig",
          "type": "dict",
          "required": false,
          "description": "The URL query strings from viewer requests to include in origin requests.",
          "nested_params": [
            {
              "name": "QueryStringBehavior",
              "type": "string",
              "required": false,
              "description": "Determines whether any URL query strings in viewer requests are included in requests that CloudFront sends to the origin. Valid values are:",
              "nested_params": [
                {
                  "name": "except",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "QueryStrings",
              "type": "dict",
              "required": false,
              "description": "",
              "nested_params": [
                {
                  "name": "Quantity",
                  "type": "integer",
                  "required": false,
                  "description": "The number of query string names in the Items list.",
                  "nested_params": []
                },
                {
                  "name": "Items",
                  "type": "list",
                  "required": false,
                  "description": "A list of query string names.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Id",
      "type": "string",
      "required": true,
      "description": "The unique identifier for the origin request policy that you are updating. The identifier is returned in a cache behavior's OriginRequestPolicyId field in the response to GetDistributionConfig.",
      "nested_params": []
    },
    {
      "name": "IfMatch",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "OriginRequestPolicy",
          "type": "dict",
          "description": "An origin request policy.",
          "nested_items": [
            {
              "name": "Id",
              "type": "string",
              "description": "The unique identifier for the origin request policy.",
              "nested_items": []
            },
            {
              "name": "LastModifiedTime",
              "type": "datetime",
              "description": "The date and time when the origin request policy was last modified.",
              "nested_items": []
            },
            {
              "name": "OriginRequestPolicyConfig",
              "type": "dict",
              "description": "The origin request policy configuration.",
              "nested_items": [
                {
                  "name": "Comment",
                  "type": "string",
                  "description": "A comment to describe the origin request policy. The comment cannot be longer than 128 characters.",
                  "nested_items": []
                },
                {
                  "name": "Name",
                  "type": "string",
                  "description": "A unique name to identify the origin request policy.",
                  "nested_items": []
                },
                {
                  "name": "HeadersConfig",
                  "type": "dict",
                  "description": "The HTTP headers to include in origin requests. These can include headers from viewer requests and additional headers added by CloudFront.",
                  "nested_items": [
                    {
                      "name": "HeaderBehavior",
                      "type": "string",
                      "description": "Determines whether any HTTP headers are included in requests that CloudFront sends to the origin. Valid values are:",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "none --- No HTTP headers in viewer requests are included in requests that CloudFront sends to the origin. Even when this field is set to none, any headers that are listed in a CachePolicy are included in origin requests.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "whitelist --- Only the HTTP headers that are listed in the Headers type are included in requests that CloudFront sends to the origin.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "allViewer --- All HTTP headers in viewer requests are included in requests that CloudFront sends to the origin.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "allViewerAndWhitelistCloudFront --- All HTTP headers in viewer requests and the additional CloudFront headers that are listed in the Headers type are included in requests that CloudFront sends to the origin. The additional headers are added by CloudFront.",
                          "nested_items": []
                        },
                        {
                          "name": "except",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Quantity",
                          "type": "integer",
                          "description": "The number of header names in the Items list.",
                          "nested_items": []
                        },
                        {
                          "name": "Items",
                          "type": "list",
                          "description": "A list of HTTP header names.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "CookiesConfig",
                  "type": "dict",
                  "description": "The cookies from viewer requests to include in origin requests.",
                  "nested_items": [
                    {
                      "name": "CookieBehavior",
                      "type": "string",
                      "description": "Determines whether cookies in viewer requests are included in requests that CloudFront sends to the origin. Valid values are:",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "none --- No cookies in viewer requests are included in requests that CloudFront sends to the origin. Even when this field is set to none, any cookies that are listed in a CachePolicy are included in origin requests.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "whitelist --- Only the cookies in viewer requests that are listed in the CookieNames type are included in requests that CloudFront sends to the origin.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "all --- All cookies in viewer requests are included in requests that CloudFront sends to the origin.",
                          "nested_items": []
                        },
                        {
                          "name": "except",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Quantity",
                          "type": "integer",
                          "description": "The number of cookie names in the Items list.",
                          "nested_items": []
                        },
                        {
                          "name": "Items",
                          "type": "list",
                          "description": "A list of cookie names.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "QueryStringsConfig",
                  "type": "dict",
                  "description": "The URL query strings from viewer requests to include in origin requests.",
                  "nested_items": [
                    {
                      "name": "QueryStringBehavior",
                      "type": "string",
                      "description": "Determines whether any URL query strings in viewer requests are included in requests that CloudFront sends to the origin. Valid values are:",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "none --- No query strings in viewer requests are included in requests that CloudFront sends to the origin. Even when this field is set to none, any query strings that are listed in a CachePolicy are included in origin requests.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "whitelist --- Only the query strings in viewer requests that are listed in the QueryStringNames type are included in requests that CloudFront sends to the origin.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "all --- All query strings in viewer requests are included in requests that CloudFront sends to the origin.",
                          "nested_items": []
                        },
                        {
                          "name": "except",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "QueryStrings",
                      "type": "dict",
                      "description": "Contains the specific query strings in viewer requests that either are or are not included in requests that CloudFront sends to the origin. The behavior depends on whether the QueryStringBehavior field in the OriginRequestPolicyQueryStringsConfig type is set to whitelist (the listed query strings are included) or allExcept (the listed query strings are not included, but all other query strings are).",
                      "nested_items": [
                        {
                          "name": "Quantity",
                          "type": "integer",
                          "description": "The number of query string names in the Items list.",
                          "nested_items": []
                        },
                        {
                          "name": "Items",
                          "type": "list",
                          "description": "A list of query string names.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "ETag",
          "type": "string",
          "description": "The current version of the origin request policy.",
          "nested_items": []
        }
      ]
    }
  ]
}