{
  "method_name": "update_realtime_log_config",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudfront/client/update_realtime_log_config.html",
  "description": "Updates a real-time log configuration. When you update a real-time log configuration, all the parameters are updated with the values provided in the request. You cannot update some parameters independent of others. To update a real-time log configuration: You cannot update a real-time log configuration's Name or ARN.",
  "parameters": [
    {
      "name": "EndPoints",
      "type": "list",
      "required": true,
      "description": "Contains information about the Amazon Kinesis data stream where you are sending real-time log data. (dict) --- Contains information about the Amazon Kinesis data stream where you're sending real-time log data in a real-time log configuration. The type of data stream where you are sending real-time log data. The only valid value is Kinesis. KinesisStreamConfig (dict) --- Contains information about the Amazon Kinesis data stream where you are sending real-time log data in a real-time log configuration. The Amazon Resource Name (ARN) of an Identity and Access Management (IAM) role that CloudFront can use to send real-time log data to your Kinesis data stream. For more information the IAM role, see Real-time log configuration IAM role in the Amazon CloudFront Developer Guide. The Amazon Resource Name (ARN) of the Kinesis data stream where you are sending real-time log data.",
      "nested_params": [
        {
          "name": "StreamType",
          "type": "string",
          "required": false,
          "description": "The type of data stream where you are sending real-time log data. The only valid value is Kinesis.",
          "nested_params": []
        },
        {
          "name": "KinesisStreamConfig",
          "type": "dict",
          "required": false,
          "description": "Contains information about the Amazon Kinesis data stream where you are sending real-time log data in a real-time log configuration.",
          "nested_params": [
            {
              "name": "RoleARN",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of an Identity and Access Management (IAM) role that CloudFront can use to send real-time log data to your Kinesis data stream. For more information the IAM role, see Real-time log configuration IAM role in the Amazon CloudFront Developer Guide.",
              "nested_params": []
            },
            {
              "name": "StreamARN",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of the Kinesis data stream where you are sending real-time log data.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "Fields",
      "type": "list",
      "required": false,
      "description": "A list of fields to include in each real-time log record. For more information about fields, see Real-time log configuration fields in the Amazon CloudFront Developer Guide. (string) ---",
      "nested_params": []
    },
    {
      "name": "Name",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ARN",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "SamplingRate",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "RealtimeLogConfig",
          "type": "dict",
          "description": "A real-time log configuration.",
          "nested_items": [
            {
              "name": "ARN",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of this real-time log configuration.",
              "nested_items": []
            },
            {
              "name": "Name",
              "type": "string",
              "description": "The unique name of this real-time log configuration.",
              "nested_items": []
            },
            {
              "name": "SamplingRate",
              "type": "integer",
              "description": "The sampling rate for this real-time log configuration. The sampling rate determines the percentage of viewer requests that are represented in the real-time log data. The sampling rate is an integer between 1 and 100, inclusive.",
              "nested_items": []
            },
            {
              "name": "EndPoints",
              "type": "list",
              "description": "Contains information about the Amazon Kinesis data stream where you are sending real-time log data for this real-time log configuration.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "StreamType",
                      "type": "string",
                      "description": "The type of data stream where you are sending real-time log data. The only valid value is Kinesis.",
                      "nested_items": []
                    },
                    {
                      "name": "KinesisStreamConfig",
                      "type": "dict",
                      "description": "Contains information about the Amazon Kinesis data stream where you are sending real-time log data in a real-time log configuration.",
                      "nested_items": [
                        {
                          "name": "RoleARN",
                          "type": "string",
                          "description": "The Amazon Resource Name (ARN) of an Identity and Access Management (IAM) role that CloudFront can use to send real-time log data to your Kinesis data stream.",
                          "nested_items": []
                        },
                        {
                          "name": "StreamARN",
                          "type": "string",
                          "description": "The Amazon Resource Name (ARN) of the Kinesis data stream where you are sending real-time log data.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "Fields",
              "type": "list",
              "description": "A list of fields that are included in each real-time log record. In an API response, the fields are provided in the same order in which they are sent to the Amazon Kinesis data stream.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}