{
  "method_name": "update_distribution",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudfront/client/update_distribution.html",
  "description": "Updates the configuration for a CloudFront distribution. The update process includes getting the current distribution configuration, updating it to make your changes, and then submitting an UpdateDistribution request to make the updates.",
  "parameters": [
    {
      "name": "DistributionConfig",
      "type": "dict",
      "required": true,
      "description": "The distribution's configuration information. A unique value (for example, a date-time stamp) that ensures that the request can't be replayed. If the value of CallerReference is new (regardless of the content of the DistributionConfig object), CloudFront creates a new distribution. If CallerReference is a value that you already sent in a previous request to create a distribution, CloudFront returns a DistributionAlreadyExists error. Aliases (dict) --- A complex type that contains information about CNAMEs (alternate domain names), if any, for this distribution. The number of CNAME aliases, if any, that you want to associate with this distribution. Items (list) --- A complex type that contains the CNAME aliases, if any, that you want to associate with this distribution. (string) --- DefaultRootObject (string) --- When a viewer requests the root URL for your distribution, the default root object is the object that you want CloudFront to request from your origin. For example, if your root URL is https://www.example.com, you can specify CloudFront to return the index.html file as the default root object. You can specify a default root object so that viewers see a specific file or object, instead of another object in your distribution (for example, https://www.example.com/product-description.html). A default root object avoids exposing the contents of your distribution. You can specify the object name or a path to the object name (for example, index.html or exampleFolderName/index.html). Your string can't begin with a forward slash ( /). Only specify the object name or the path to the object. If you don't want to specify a default root object when you create a distribution, include an empty DefaultRootObject element. To delete the default root object from an existing distribution, update the distribution configuration and include an empty DefaultRootObject element. To replace the default root object, update the distribution configuration and specify the new object. For more information about the default root object, see Specify a default root object in the Amazon CloudFront Developer Guide. A complex type that contains information about origins for this distribution. The number of origins for this distribution. A list of origins. (dict) --- An origin. An origin is the location where content is stored, and from which CloudFront gets content to serve to viewers. To specify an origin: Use S3OriginConfig to specify an Amazon S3 bucket that is not configured with static website hosting. Use VpcOriginConfig to specify a VPC origin. Use CustomOriginConfig to specify all other kinds of origins, including: An Amazon S3 bucket that is configured with static website hosting An Elastic Load Balancing load balancer An Elemental MediaPackage endpoint An Elemental MediaStore container Any other HTTP server, running on an Amazon EC2 instance or any other kind of host For the current maximum number of origins that you can specify per distribution, see General Quotas on Web Distributions in the Amazon CloudFront Developer Guide (quotas were formerly referred to as limits). A unique identifier for the origin. This value must be unique within the distribution. Use this value to specify the TargetOriginId in a CacheBehavior or DefaultCacheBehavior. The domain name for the origin. For more information, see Origin Domain Name in the Amazon CloudFront Developer Guide. OriginPath (string) --- An optional path that CloudFront appends to the origin domain name when CloudFront requests content from the origin. For more information, see Origin Path in the Amazon CloudFront Developer Guide. CustomHeaders (dict) --- A list of HTTP header names and values that CloudFront adds to the requests that it sends to the origin. For more information, see Adding Custom Headers to Origin Requests in the Amazon CloudFront Developer Guide. The number of custom headers, if any, for this distribution. Items (list) --- Optional: A list that contains one OriginCustomHeader element for each custom header that you want CloudFront to forward to the origin. If Quantity is 0, omit Items. (dict) --- A complex type that contains HeaderName and HeaderValue elements, if any, for this distribution. The name of a header that you want CloudFront to send to your origin. The value for the header that you specified in the HeaderName field. S3OriginConfig (dict) --- Use this type to specify an origin that is an Amazon S3 bucket that is not configured with static website hosting. To specify any other type of origin, including an Amazon S3 bucket that is configured with static website hosting, use the CustomOriginConfig type instead. The CloudFront origin access identity to associate with the origin. Use an origin access identity to configure the origin so that viewers can only access objects in an Amazon S3 bucket through CloudFront. The format of the value is: origin-access-identity/cloudfront/ID-of-origin-access-identity The ID-of-origin-access-identity is the value that CloudFront returned in the ID element when you created the origin access identity. If you want viewers to be able to access objects using either the CloudFront URL or the Amazon S3 URL, specify an empty OriginAccessIdentity element. To delete the origin access identity from an existing distribution, update the distribution configuration and include an empty OriginAccessIdentity element. To replace the origin access identity, update the distribution configuration and specify the new origin access identity. For more information about the origin access identity, see Serving Private Content through CloudFront in the Amazon CloudFront Developer Guide. CustomOriginConfig (dict) --- Use this type to specify an origin that is not an Amazon S3 bucket, with one exception. If the Amazon S3 bucket is configured with static website hosting, use this type. If the Amazon S3 bucket is not configured with static website hosting, use the S3OriginConfig type instead. The HTTP port that CloudFront uses to connect to the origin. Specify the HTTP port that the origin listens on. The HTTPS port that CloudFront uses to connect to the origin. Specify the HTTPS port that the origin listens on. Specifies the protocol (HTTP or HTTPS) that CloudFront uses to connect to the origin. Valid values are: http-only --- CloudFront always uses HTTP to connect to the origin. match-viewer --- CloudFront connects to the origin using the same protocol that the viewer used to connect to CloudFront. https-only --- CloudFront always uses HTTPS to connect to the origin. OriginSslProtocols (dict) --- Specifies the minimum SSL/TLS protocol that CloudFront uses when connecting to your origin over HTTPS. Valid values include SSLv3, TLSv1, TLSv1.1, and TLSv1.2. For more information, see Minimum Origin SSL Protocol in the Amazon CloudFront Developer Guide. The number of SSL/TLS protocols that you want to allow CloudFront to use when establishing an HTTPS connection with this origin. A list that contains allowed SSL/TLS protocols for this distribution. (string) --- OriginReadTimeout (integer) --- Specifies how long, in seconds, CloudFront waits for a response from the origin. This is also known as the origin response timeout. The minimum timeout is 1 second, the maximum is 60 seconds, and the default (if you don't specify otherwise) is 30 seconds. For more information, see Response timeout (custom origins only) in the Amazon CloudFront Developer Guide. OriginKeepaliveTimeout (integer) --- Specifies how long, in seconds, CloudFront persists its connection to the origin. The minimum timeout is 1 second, the maximum is 60 seconds, and the default (if you don't specify otherwise) is 5 seconds. For more information, see Keep-alive timeout (custom origins only) in the Amazon CloudFront Developer Guide. VpcOriginConfig (dict) --- The VPC origin configuration. The VPC origin ID. OriginReadTimeout (integer) --- Specifies how long, in seconds, CloudFront waits for a response from the origin. ConnectionAttempts (integer) --- The number of times that CloudFront attempts to connect to the origin. The minimum number is 1, the maximum is 3, and the default (if you don't specify otherwise) is 3. For a custom origin (including an Amazon S3 bucket that's configured with static website hosting), this value also specifies the number of times that CloudFront attempts to get a response from the origin, in the case of an Origin Response Timeout. For more information, see Origin Connection Attempts in the Amazon CloudFront Developer Guide. ConnectionTimeout (integer) --- The number of seconds that CloudFront waits when trying to establish a connection to the origin. The minimum timeout is 1 second, the maximum is 10 seconds, and the default (if you don't specify otherwise) is 10 seconds. For more information, see Origin Connection Timeout in the Amazon CloudFront Developer Guide. OriginShield (dict) --- CloudFront Origin Shield. Using Origin Shield can help reduce the load on your origin. For more information, see Using Origin Shield in the Amazon CloudFront Developer Guide. A flag that specifies whether Origin Shield is enabled. When it's enabled, CloudFront routes all requests through Origin Shield, which can help protect your origin. When it's disabled, CloudFront might send requests directly to your origin from multiple edge locations or regional edge caches. OriginShieldRegion (string) --- The Amazon Web Services Region for Origin Shield. Specify the Amazon Web Services Region that has the lowest latency to your origin. To specify a region, use the region code, not the region name. For example, specify the US East (Ohio) region as us-east-2. When you enable CloudFront Origin Shield, you must specify the Amazon Web Services Region for Origin Shield. For the list of Amazon Web Services Regions that you can specify, and for help choosing the best Region for your origin, see Choosing the Amazon Web Services Region for Origin Shield in the Amazon CloudFront Developer Guide. OriginAccessControlId (string) --- The unique identifier of an origin access control for this origin. For more information, see Restricting access to an Amazon S3 origin in the Amazon CloudFront Developer Guide. OriginGroups (dict) --- A complex type that contains information about origin groups for this distribution. The number of origin groups. Items (list) --- The items (origin groups) in a distribution. (dict) --- An origin group includes two origins (a primary origin and a secondary origin to failover to) and a failover criteria that you specify. You create an origin group to support origin failover in CloudFront. When you create or update a distribution, you can specify the origin group instead of a single origin, and CloudFront will failover from the primary origin to the secondary origin under the failover conditions that you've chosen. Optionally, you can choose selection criteria for your origin group to specify how your origins are selected when your distribution routes viewer requests. The origin group's ID. A complex type that contains information about the failover criteria for an origin group. The status codes that, when returned from the primary origin, will trigger CloudFront to failover to the second origin. The number of status codes. The items (status codes) for an origin group. (integer) --- A complex type that contains information about the origins in an origin group. The number of origins in an origin group. Items (origins) in an origin group. (dict) --- An origin in an origin group. The ID for an origin in an origin group. SelectionCriteria (string) --- The selection criteria for the origin group. For more information, see Create an origin group in the Amazon CloudFront Developer Guide. A complex type that describes the default cache behavior if you don't specify a CacheBehavior element or if files don't match any of the values of PathPattern in CacheBehavior elements. You must create exactly one default cache behavior. The value of ID for the origin that you want CloudFront to route requests to when they use the default cache behavior. TrustedSigners (dict) --- A list of Amazon Web Services account IDs whose public keys CloudFront can use to validate signed URLs or signed cookies. When a cache behavior contains trusted signers, CloudFront requires signed URLs or signed cookies for all requests that match the cache behavior. The URLs or cookies must be signed with the private key of a CloudFront key pair in a trusted signer's Amazon Web Services account. The signed URL or cookie contains information about which public key CloudFront should use to verify the signature. For more information, see Serving private content in the Amazon CloudFront Developer Guide. This field is true if any of the Amazon Web Services accounts in the list are configured as trusted signers. If not, this field is false. The number of Amazon Web Services accounts in the list. Items (list) --- A list of Amazon Web Services account identifiers. (string) --- TrustedKeyGroups (dict) --- A list of key groups that CloudFront can use to validate signed URLs or signed cookies. When a cache behavior contains trusted key groups, CloudFront requires signed URLs or signed cookies for all requests that match the cache behavior. The URLs or cookies must be signed with a private key whose corresponding public key is in the key group. This field is true if any of the key groups in the list have public keys that CloudFront can use to verify the signatures of signed URLs and signed cookies. The number of key groups in the list. Items (list) --- A list of key groups identifiers. (string) --- The protocol that viewers can use to access the files in the origin specified by TargetOriginId when a request matches the path pattern in PathPattern. You can specify the following options: allow-all: Viewers can use HTTP or HTTPS. redirect-to-https: If a viewer submits an HTTP request, CloudFront returns an HTTP status code of 301 (Moved Permanently) to the viewer along with the HTTPS URL. The viewer then resubmits the request using the new URL. https-only: If a viewer sends an HTTP request, CloudFront returns an HTTP status code of 403 (Forbidden). For more information about requiring the HTTPS protocol, see Requiring HTTPS Between Viewers and CloudFront in the Amazon CloudFront Developer Guide. AllowedMethods (dict) --- A complex type that controls which HTTP methods CloudFront processes and forwards to your Amazon S3 bucket or your custom origin. There are three choices: CloudFront forwards only GET and HEAD requests. CloudFront forwards only GET, HEAD, and OPTIONS requests. CloudFront forwards GET, HEAD, OPTIONS, PUT, PATCH, POST, and DELETE requests. If you pick the third choice, you may need to restrict access to your Amazon S3 bucket or to your custom origin so users can't perform operations that you don't want them to. For example, you might not want users to have permissions to delete objects from your origin. The number of HTTP methods that you want CloudFront to forward to your origin. Valid values are 2 (for GET and HEAD requests), 3 (for GET, HEAD, and OPTIONS requests) and 7 (for GET, HEAD, OPTIONS, PUT, PATCH, POST, and DELETE requests). A complex type that contains the HTTP methods that you want CloudFront to process and forward to your origin. (string) --- CachedMethods (dict) --- A complex type that controls whether CloudFront caches the response to requests using the specified HTTP methods. There are two choices: CloudFront caches responses to GET and HEAD requests. CloudFront caches responses to GET, HEAD, and OPTIONS requests. If you pick the second choice for your Amazon S3 Origin, you may need to forward Access-Control-Request-Method, Access-Control-Request-Headers, and Origin headers for the responses to be cached correctly. The number of HTTP methods for which you want CloudFront to cache responses. Valid values are 2 (for caching responses to GET and HEAD requests) and 3 (for caching responses to GET, HEAD, and OPTIONS requests). A complex type that contains the HTTP methods that you want CloudFront to cache responses to. Valid values for CachedMethods include GET, HEAD, and OPTIONS, depending on which caching option you choose. For more information, see the preceding section. (string) --- SmoothStreaming (boolean) --- Indicates whether you want to distribute media files in the Microsoft Smooth Streaming format using the origin that is associated with this cache behavior. If so, specify true; if not, specify false. If you specify true for SmoothStreaming, you can still distribute other content using this cache behavior if the content matches the value of PathPattern. Compress (boolean) --- Whether you want CloudFront to automatically compress certain files for this cache behavior. For more information, see Serving Compressed Files in the Amazon CloudFront Developer Guide. LambdaFunctionAssociations (dict) --- A complex type that contains zero or more Lambda@Edge function associations for a cache behavior. The number of Lambda@Edge function associations for this cache behavior. Items (list) --- Optional: A complex type that contains LambdaFunctionAssociation items for this cache behavior. If Quantity is 0, you can omit Items. (dict) --- A complex type that contains a Lambda@Edge function association. The ARN of the Lambda@Edge function. You must specify the ARN of a function version; you can't specify an alias or $LATEST. Specifies the event type that triggers a Lambda@Edge function invocation. You can specify the following values: viewer-request: The function executes when CloudFront receives a request from a viewer and before it checks to see whether the requested object is in the edge cache. origin-request: The function executes only when CloudFront sends a request to your origin. When the requested object is in the edge cache, the function doesn't execute. origin-response: The function executes after CloudFront receives a response from the origin and before it caches the object in the response. viewer-response: The function executes before CloudFront returns the requested object to the viewer. The function executes regardless of whether the object was already in the edge cache. If the origin returns an HTTP status code other than HTTP 200 (OK), the function doesn't execute. IncludeBody (boolean) --- A flag that allows a Lambda@Edge function to have read access to the body content. For more information, see Accessing the Request Body by Choosing the Include Body Option in the Amazon CloudFront Developer Guide. FunctionAssociations (dict) --- A list of CloudFront functions that are associated with this cache behavior. Your functions must be published to the LIVE stage to associate them with a cache behavior. The number of CloudFront functions in the list. Items (list) --- The CloudFront functions that are associated with a cache behavior in a CloudFront distribution. (dict) --- A CloudFront function that is associated with a cache behavior in a CloudFront distribution. The Amazon Resource Name (ARN) of the function. The event type of the function, either viewer-request or viewer-response. You cannot use origin-facing event types ( origin-request and origin-response) with a CloudFront function. FieldLevelEncryptionId (string) --- The value of ID for the field-level encryption configuration that you want CloudFront to use for encrypting specific fields of data for the default cache behavior. RealtimeLogConfigArn (string) --- The Amazon Resource Name (ARN) of the real-time log configuration that is attached to this cache behavior. For more information, see Real-time logs in the Amazon CloudFront Developer Guide. CachePolicyId (string) --- The unique identifier of the cache policy that is attached to the default cache behavior. For more information, see Creating cache policies or Using the managed cache policies in the Amazon CloudFront Developer Guide. A DefaultCacheBehavior must include either a CachePolicyId or ForwardedValues. We recommend that you use a CachePolicyId. OriginRequestPolicyId (string) --- The unique identifier of the origin request policy that is attached to the default cache behavior. For more information, see Creating origin request policies or Using the managed origin request policies in the Amazon CloudFront Developer Guide. ResponseHeadersPolicyId (string) --- The identifier for a response headers policy. GrpcConfig (dict) --- The gRPC configuration for your cache behavior. Enables your CloudFront distribution to receive gRPC requests and to proxy them directly to your origins. ForwardedValues (dict) --- This field is deprecated. We recommend that you use a cache policy or an origin request policy instead of this field. For more information, see Working with policies in the Amazon CloudFront Developer Guide. If you want to include values in the cache key, use a cache policy. If you want to send values to the origin but not include them in the cache key, use an origin request policy. A complex type that specifies how CloudFront handles query strings, cookies, and HTTP headers. This field is deprecated. If you want to include query strings in the cache key, use a cache policy. For more information, see Creating cache policies in the Amazon CloudFront Developer Guide. If you want to send query strings to the origin but not include them in the cache key, use an origin request policy. For more information, see Creating origin request policies in the Amazon CloudFront Developer Guide. Indicates whether you want CloudFront to forward query strings to the origin that is associated with this cache behavior and cache based on the query string parameters. CloudFront behavior depends on the value of QueryString and on the values that you specify for QueryStringCacheKeys, if any: If you specify true for QueryString and you don't specify any values for QueryStringCacheKeys, CloudFront forwards all query string parameters to the origin and caches based on all query string parameters. Depending on how many query string parameters and values you have, this can adversely affect performance because CloudFront must forward more requests to the origin. If you specify true for QueryString and you specify one or more values for QueryStringCacheKeys, CloudFront forwards all query string parameters to the origin, but it only caches based on the query string parameters that you specify. If you specify false for QueryString, CloudFront doesn't forward any query string parameters to the origin, and doesn't cache based on query string parameters. For more information, see Configuring CloudFront to Cache Based on Query String Parameters in the Amazon CloudFront Developer Guide. If you want to include cookies in the cache key, use a cache policy. If you want to send cookies to the origin but not include them in the cache key, use an origin request policy. A complex type that specifies whether you want CloudFront to forward cookies to the origin and, if so, which ones. For more information about forwarding cookies to the origin, see How CloudFront Forwards, Caches, and Logs Cookies in the Amazon CloudFront Developer Guide. If you want to send cookies to the origin but not include them in the cache key, use origin request policy. Specifies which cookies to forward to the origin for this cache behavior: all, none, or the list of cookies specified in the WhitelistedNames complex type. Amazon S3 doesn't process cookies. When the cache behavior is forwarding requests to an Amazon S3 origin, specify none for the Forward element. WhitelistedNames (dict) --- This field is deprecated. Required if you specify whitelist for the value of Forward. A complex type that specifies how many different cookies you want CloudFront to forward to the origin for this cache behavior and, if you want to forward selected cookies, the names of those cookies. If you specify all or none for the value of Forward, omit WhitelistedNames. If you change the value of Forward from whitelist to all or none and you don't delete the WhitelistedNames element and its child elements, CloudFront deletes them automatically. For the current limit on the number of cookie names that you can whitelist for each cache behavior, see CloudFront Limits in the Amazon Web Services General Reference. The number of cookie names in the Items list. Items (list) --- A list of cookie names. (string) --- Headers (dict) --- This field is deprecated. If you want to include headers in the cache key, use a cache policy. If you want to send headers to the origin but not include them in the cache key, use an origin request policy. A complex type that specifies the Headers, if any, that you want CloudFront to forward to the origin for this cache behavior (whitelisted headers). For the headers that you specify, CloudFront also caches separate versions of a specified object that is based on the header values in viewer requests. For more information, see Caching Content Based on Request Headers in the Amazon CloudFront Developer Guide. The number of header names in the Items list. Items (list) --- A list of HTTP header names. (string) --- QueryStringCacheKeys (dict) --- This field is deprecated. A complex type that contains information about the query string parameters that you want CloudFront to use for caching for this cache behavior. The number of whitelisted query string parameters for a cache behavior. Items (list) --- A list that contains the query string parameters that you want CloudFront to use as a basis for caching for a cache behavior. (string) --- MinTTL (integer) --- This field is deprecated. We recommend that you use the MinTTL field in a cache policy instead of this field. The minimum amount of time that you want objects to stay in CloudFront caches before CloudFront forwards another request to your origin to determine whether the object has been updated. For more information, see Managing How Long Content Stays in an Edge Cache (Expiration) in the Amazon CloudFront Developer Guide. You must specify 0 for MinTTL if you configure CloudFront to forward all headers to your origin (under Headers, if you specify 1 for Quantity and * for Name). DefaultTTL (integer) --- This field is deprecated. We recommend that you use the DefaultTTL field in a cache policy instead of this field. The default amount of time that you want objects to stay in CloudFront caches before CloudFront forwards another request to your origin to determine whether the object has been updated. The value that you specify applies only when your origin does not add HTTP headers such as Cache-Control max-age, Cache-Control s-maxage, and Expires to objects. MaxTTL (integer) --- This field is deprecated. We recommend that you use the MaxTTL field in a cache policy instead of this field. The maximum amount of time that you want objects to stay in CloudFront caches before CloudFront forwards another request to your origin to determine whether the object has been updated. The value that you specify applies only when your origin adds HTTP headers such as Cache-Control max-age, Cache-Control s-maxage, and Expires to objects. CacheBehaviors (dict) --- A complex type that contains zero or more CacheBehavior elements. The number of cache behaviors for this distribution. Items (list) --- Optional: A complex type that contains cache behaviors for this distribution. (dict) --- A complex type that describes how CloudFront processes requests. You must create at least as many cache behaviors (including the default cache behavior) as you have origins if you want CloudFront to serve objects from all of the origins. Each cache behavior specifies the one origin from which you want CloudFront to get objects. If you have two origins and only the default cache behavior, the default cache behavior will cause CloudFront to get objects from one of the origins, but the other origin is never used. For the current quota (formerly known as limit) on the number of cache behaviors that you can add to a distribution, see Quotas in the Amazon CloudFront Developer Guide. If you don't want to specify any cache behaviors, include only an empty CacheBehaviors element. Don't specify an empty individual CacheBehavior element, because this is invalid. For more information, see CacheBehaviors. To delete all cache behaviors in an existing distribution, update the distribution configuration and include only an empty CacheBehaviors element. To add, change, or remove one or more cache behaviors, update the distribution configuration and specify all of the cache behaviors that you want to include in the updated distribution. For more information about cache behaviors, see Cache Behavior Settings in the Amazon CloudFront Developer Guide. The pattern (for example, images/*.jpg) that specifies which requests to apply the behavior to. When CloudFront receives a viewer request, the requested path is compared with path patterns in the order in which cache behaviors are listed in the distribution. The path pattern for the default cache behavior is * and cannot be changed. If the request for an object does not match the path pattern for any cache behaviors, CloudFront applies the behavior in the default cache behavior. For more information, see Path Pattern in the Amazon CloudFront Developer Guide. The value of ID for the origin that you want CloudFront to route requests to when they match this cache behavior. The URLs or cookies must be signed with the private key of a CloudFront key pair in the trusted signer's Amazon Web Services account. CloudFront functions must be published to the LIVE stage to associate them with a cache behavior. FieldLevelEncryptionId (string) --- The value of ID for the field-level encryption configuration that you want CloudFront to use for encrypting specific fields of data for this cache behavior. CachePolicyId (string) --- The unique identifier of the cache policy that is attached to this cache behavior. A CacheBehavior must include either a CachePolicyId or ForwardedValues. OriginRequestPolicyId (string) --- The unique identifier of the origin request policy that is attached to this cache behavior. CustomErrorResponses (dict) --- A complex type that controls the following: Whether CloudFront replaces HTTP status codes in the 4xx and 5xx range with custom error messages before returning the response to the viewer. How long CloudFront caches HTTP status codes in the 4xx and 5xx range. For more information about custom error pages, see Customizing Error Responses in the Amazon CloudFront Developer Guide. The number of HTTP status codes for which you want to specify a custom error page and/or a caching duration. Items (list) --- A complex type that contains a CustomErrorResponse element for each HTTP status code for which you want to specify a custom error page and/or a caching duration. (dict) --- A complex type that controls: Whether CloudFront replaces HTTP status codes in the 4xx and 5xx range with custom error messages before returning the response to the viewer. The HTTP status code for which you want to specify a custom error page and/or a caching duration. ResponsePagePath (string) --- The path to the custom error page that you want CloudFront to return to a viewer when your origin returns the HTTP status code specified by ErrorCode, for example, /4xx-errors/403-forbidden.html. If you want to store your objects and your custom error pages in different locations, your distribution must include a cache behavior for which the following is true: The value of PathPattern matches the path to your custom error messages. For example, suppose you saved custom error pages for 4xx errors in an Amazon S3 bucket in a directory named /4xx-errors. Your distribution must include a cache behavior for which the path pattern routes requests for your custom error pages to that location, for example, /4xx-errors/*. The value of TargetOriginId specifies the value of the ID element for the origin that contains your custom error pages. If you specify a value for ResponsePagePath, you must also specify a value for ResponseCode. We recommend that you store custom error pages in an Amazon S3 bucket. If you store custom error pages on an HTTP server and the server starts to return 5xx errors, CloudFront can't get the files that you want to return to viewers because the origin server is unavailable. ResponseCode (string) --- The HTTP status code that you want CloudFront to return to the viewer along with the custom error page. There are a variety of reasons that you might want CloudFront to return a status code different from the status code that your origin returned to CloudFront, for example: Some Internet devices (some firewalls and corporate proxies, for example) intercept HTTP 4xx and 5xx and prevent the response from being returned to the viewer. If you substitute 200, the response typically won't be intercepted. If you don't care about distinguishing among different client errors or server errors, you can specify 400 or 500 as the ResponseCode for all 4xx or 5xx errors. You might want to return a 200 status code (OK) and static website so your customers don't know that your website is down. If you specify a value for ResponseCode, you must also specify a value for ResponsePagePath. ErrorCachingMinTTL (integer) --- The minimum amount of time, in seconds, that you want CloudFront to cache the HTTP status code specified in ErrorCode. When this time period has elapsed, CloudFront queries your origin to see whether the problem that caused the error has been resolved and the requested object is now available. For more information, see Customizing Error Responses in the Amazon CloudFront Developer Guide. A comment to describe the distribution. The comment cannot be longer than 128 characters. Logging (dict) --- A complex type that controls whether access logs are written for the distribution. For more information about logging, see Access Logs in the Amazon CloudFront Developer Guide. Enabled (boolean) --- Specifies whether you want CloudFront to save access logs to an Amazon S3 bucket. If you don't want to enable logging when you create a distribution or if you want to disable logging for an existing distribution, specify false for Enabled, and specify empty Bucket and Prefix elements. If you specify false for Enabled but you specify values for Bucket and prefix, the values are automatically deleted. IncludeCookies (boolean) --- Specifies whether you want CloudFront to include cookies in access logs, specify true for IncludeCookies. If you choose to include cookies in logs, CloudFront logs all cookies regardless of how you configure the cache behaviors for this distribution. If you don't want to include cookies when you create a distribution or if you want to disable include cookies for an existing distribution, specify false for IncludeCookies. Bucket (string) --- The Amazon S3 bucket to store the access logs in, for example, amzn-s3-demo-bucket.s3.amazonaws.com. Prefix (string) --- An optional string that you want CloudFront to prefix to the access log filenames for this distribution, for example, myprefix/. If you want to enable logging, but you don't want to specify a prefix, you still must include an empty Prefix element in the Logging element. PriceClass (string) --- The price class that corresponds with the maximum price that you want to pay for CloudFront service. If you specify PriceClass_All, CloudFront responds to requests for your objects from all CloudFront edge locations. If you specify a price class other than PriceClass_All, CloudFront serves your objects from the CloudFront edge location that has the lowest latency among the edge locations in your price class. Viewers who are in or near regions that are excluded from your specified price class may encounter slower performance. For more information about price classes, see Choosing the Price Class for a CloudFront Distribution in the Amazon CloudFront Developer Guide. For information about CloudFront pricing, including how price classes (such as Price Class 100) map to CloudFront regions, see Amazon CloudFront Pricing. From this field, you can enable or disable the selected distribution. ViewerCertificate (dict) --- A complex type that determines the distribution's SSL/TLS configuration for communicating with viewers. CloudFrontDefaultCertificate (boolean) --- If the distribution uses the CloudFront domain name such as d111111abcdef8.cloudfront.net, set this field to true. If the distribution uses Aliases (alternate domain names or CNAMEs), set this field to false and specify values for the following fields: ACMCertificateArn or IAMCertificateId (specify a value for one, not both) MinimumProtocolVersion SSLSupportMethod IAMCertificateId (string) --- If the distribution uses Aliases (alternate domain names or CNAMEs) and the SSL/TLS certificate is stored in Identity and Access Management (IAM), provide the ID of the IAM certificate. If you specify an IAM certificate ID, you must also specify values for MinimumProtocolVersion and SSLSupportMethod. ACMCertificateArn (string) --- If the distribution uses Aliases (alternate domain names or CNAMEs) and the SSL/TLS certificate is stored in Certificate Manager (ACM), provide the Amazon Resource Name (ARN) of the ACM certificate. CloudFront only supports ACM certificates in the US East (N. Virginia) Region ( us-east-1). If you specify an ACM certificate ARN, you must also specify values for MinimumProtocolVersion and SSLSupportMethod. SSLSupportMethod (string) --- If the distribution uses Aliases (alternate domain names or CNAMEs), specify which viewers the distribution accepts HTTPS connections from. sni-only --- The distribution accepts HTTPS connections from only viewers that support server name indication (SNI). This is recommended. Most browsers and clients support SNI. vip --- The distribution accepts HTTPS connections from all viewers including those that don't support SNI. This is not recommended, and results in additional monthly charges from CloudFront. static-ip - Do not specify this value unless your distribution has been enabled for this feature by the CloudFront team. If you have a use case that requires static IP addresses for a distribution, contact CloudFront through the Amazon Web Services Support Center. If the distribution uses the CloudFront domain name such as d111111abcdef8.cloudfront.net, don't set a value for this field. MinimumProtocolVersion (string) --- If the distribution uses Aliases (alternate domain names or CNAMEs), specify the security policy that you want CloudFront to use for HTTPS connections with viewers. The security policy determines two settings: The minimum SSL/TLS protocol that CloudFront can use to communicate with viewers. The ciphers that CloudFront can use to encrypt the content that it returns to viewers. For more information, see Security Policy and Supported Protocols and Ciphers Between Viewers and CloudFront in the Amazon CloudFront Developer Guide. When you're using SNI only (you set SSLSupportMethod to sni-only), you must specify TLSv1 or higher. If the distribution uses the CloudFront domain name such as d111111abcdef8.cloudfront.net (you set CloudFrontDefaultCertificate to true), CloudFront automatically sets the security policy to TLSv1 regardless of the value that you set here. Certificate (string) --- This field is deprecated. Use one of the following fields instead: ACMCertificateArn IAMCertificateId CloudFrontDefaultCertificate CertificateSource (string) --- This field is deprecated. Use one of the following fields instead: ACMCertificateArn IAMCertificateId CloudFrontDefaultCertificate Restrictions (dict) --- A complex type that identifies ways in which you want to restrict distribution of your content. A complex type that controls the countries in which your content is distributed. CloudFront determines the location of your users using MaxMind GeoIP databases. The method that you want to use to restrict distribution of your content by country: none: No geo restriction is enabled, meaning access to content is not restricted by client geo location. blacklist: The Location elements specify the countries in which you don't want CloudFront to distribute your content. whitelist: The Location elements specify the countries in which you want CloudFront to distribute your content. When geo restriction is enabled, this is the number of countries in your whitelist or blacklist. Otherwise, when it is not enabled, Quantity is 0, and you can omit Items. Items (list) --- A complex type that contains a Location element for each country in which you want CloudFront either to distribute your content ( whitelist) or not distribute your content ( blacklist). The Location element is a two-letter, uppercase country code for a country that you want to include in your blacklist or whitelist. Include one Location element for each country. CloudFront and MaxMind both use ISO 3166 country codes. For the current list of countries and the corresponding codes, see ISO 3166-1-alpha-2 code on the International Organization for Standardization website. You can also refer to the country list on the CloudFront console, which includes both country names and codes. (string) --- WebACLId (string) --- A unique identifier that specifies the WAF web ACL, if any, to associate with this distribution. To specify a web ACL created using the latest version of WAF, use the ACL ARN, for example arn:aws:wafv2:us-east-1:123456789012:global/webacl/ExampleWebACL/a1b2c3d4-5678-90ab-cdef-EXAMPLE11111. To specify a web ACL created using WAF Classic, use the ACL ID, for example a1b2c3d4-5678-90ab-cdef-EXAMPLE11111. WAF is a web application firewall that lets you monitor the HTTP and HTTPS requests that are forwarded to CloudFront, and lets you control access to your content. Based on conditions that you specify, such as the IP addresses that requests originate from or the values of query strings, CloudFront responds to requests either with the requested content or with an HTTP 403 status code (Forbidden). You can also configure CloudFront to return a custom error page when a request is blocked. For more information about WAF, see the WAF Developer Guide. HttpVersion (string) --- (Optional) Specify the HTTP version(s) that you want viewers to use to communicate with CloudFront. The default value for new web distributions is http2. Viewers that don't support HTTP/2 automatically use an earlier HTTP version. For viewers and CloudFront to use HTTP/2, viewers must support TLSv1.2 or later, and must support Server Name Indication (SNI). For viewers and CloudFront to use HTTP/3, viewers must support TLSv1.3 and Server Name Indication (SNI). CloudFront supports HTTP/3 connection migration to allow the viewer to switch networks without losing connection. For more information about connection migration, see Connection Migration at RFC 9000. For more information about supported TLSv1.3 ciphers, see Supported protocols and ciphers between viewers and CloudFront. IsIPV6Enabled (boolean) --- If you want CloudFront to respond to IPv6 DNS requests with an IPv6 address for your distribution, specify true. If you specify false, CloudFront responds to IPv6 DNS requests with the DNS response code NOERROR and with no IP addresses. This allows viewers to submit a second request, for an IPv4 address for your distribution. In general, you should enable IPv6 if you have users on IPv6 networks who want to access your content. However, if you're using signed URLs or signed cookies to restrict access to your content, and if you're using a custom policy that includes the IpAddress parameter to restrict the IP addresses that can access your content, don't enable IPv6. If you want to restrict access to some content by IP address and not restrict access to other content (or restrict access but not by IP address), you can create two distributions. For more information, see Creating a Signed URL Using a Custom Policy in the Amazon CloudFront Developer Guide. If you're using an Route 53 Amazon Web Services Integration alias resource record set to route traffic to your CloudFront distribution, you need to create a second alias resource record set when both of the following are true: You enable IPv6 for the distribution You're using alternate domain names in the URLs for your objects For more information, see Routing Traffic to an Amazon CloudFront Web Distribution by Using Your Domain Name in the Route 53 Amazon Web Services Integration Developer Guide. If you created a CNAME resource record set, either with Route 53 Amazon Web Services Integration or with another DNS service, you don't need to make any changes. A CNAME record will route traffic to your distribution regardless of the IP address format of the viewer request. ContinuousDeploymentPolicyId (string) --- The identifier of a continuous deployment policy. For more information, see CreateContinuousDeploymentPolicy. Staging (boolean) --- A Boolean that indicates whether this is a staging distribution. When this value is true, this is a staging distribution. When this value is false, this is not a staging distribution. AnycastIpListId (string) --- ID of the Anycast static IP list that is associated with the distribution. TenantConfig (dict) --- A distribution tenant configuration. ParameterDefinitions (list) --- The parameters that you specify for a distribution tenant. (dict) --- A list of parameter values to add to the resource. A parameter is specified as a key-value pair. A valid parameter value must exist for any parameter that is marked as required in the multi-tenant distribution. The name of the parameter. The value that you assigned to the parameter. StringSchema (dict) --- An object that contains information about the string schema. Comment (string) --- A comment to describe the parameter. DefaultValue (string) --- The default value of the parameter. Whether the defined parameter is required. ConnectionMode (string) --- The connection mode to filter distributions by.",
      "nested_params": [
        {
          "name": "CallerReference",
          "type": "string",
          "required": false,
          "description": "A unique value (for example, a date-time stamp) that ensures that the request can't be replayed. If the value of CallerReference is new (regardless of the content of the DistributionConfig object), CloudFront creates a new distribution. If CallerReference is a value that you already sent in a previous request to create a distribution, CloudFront returns a DistributionAlreadyExists error.",
          "nested_params": []
        },
        {
          "name": "Aliases",
          "type": "dict",
          "required": false,
          "description": "A complex type that contains information about CNAMEs (alternate domain names), if any, for this distribution.",
          "nested_params": [
            {
              "name": "Quantity",
              "type": "integer",
              "required": false,
              "description": "The number of CNAME aliases, if any, that you want to associate with this distribution.",
              "nested_params": []
            },
            {
              "name": "Items",
              "type": "list",
              "required": false,
              "description": "A complex type that contains the CNAME aliases, if any, that you want to associate with this distribution.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "DefaultRootObject",
          "type": "string",
          "required": false,
          "description": "When a viewer requests the root URL for your distribution, the default root object is the object that you want CloudFront to request from your origin. For example, if your root URL is https://www.example.com, you can specify CloudFront to return the index.html file as the default root object. You can specify a default root object so that viewers see a specific file or object, instead of another object in your distribution (for example, https://www.example.com/product-description.html). A default root object avoids exposing the contents of your distribution. You can specify the object name or a path to the object name (for example, index.html or exampleFolderName/index.html). Your string can't begin with a forward slash ( /). Only specify the object name or the path to the object. If you don't want to specify a default root object when you create a distribution, include an empty DefaultRootObject element. To delete the default root object from an existing distribution, update the distribution configuration and include an empty DefaultRootObject element. To replace the default root object, update the distribution configuration and specify the new object. For more information about the default root object, see Specify a default root object in the Amazon CloudFront Developer Guide.",
          "nested_params": []
        },
        {
          "name": "Origins",
          "type": "dict",
          "required": false,
          "description": "A complex type that contains information about origins for this distribution.",
          "nested_params": [
            {
              "name": "Quantity",
              "type": "integer",
              "required": false,
              "description": "The number of origins for this distribution.",
              "nested_params": []
            },
            {
              "name": "Items",
              "type": "list",
              "required": false,
              "description": "A list of origins.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "OriginGroups",
          "type": "dict",
          "required": false,
          "description": "A complex type that contains information about origin groups for this distribution.",
          "nested_params": [
            {
              "name": "Quantity",
              "type": "integer",
              "required": false,
              "description": "The number of origin groups.",
              "nested_params": []
            },
            {
              "name": "Items",
              "type": "list",
              "required": false,
              "description": "The items (origin groups) in a distribution.",
              "nested_params": [
                {
                  "name": "Id",
                  "type": "string",
                  "required": false,
                  "description": "The origin group's ID.",
                  "nested_params": []
                },
                {
                  "name": "FailoverCriteria",
                  "type": "dict",
                  "required": false,
                  "description": "A complex type that contains information about the failover criteria for an origin group.",
                  "nested_params": [
                    {
                      "name": "StatusCodes",
                      "type": "dict",
                      "required": false,
                      "description": "The status codes that, when returned from the primary origin, will trigger CloudFront to failover to the second origin.",
                      "nested_params": [
                        {
                          "name": "Quantity",
                          "type": "integer",
                          "required": false,
                          "description": "The number of status codes.",
                          "nested_params": []
                        },
                        {
                          "name": "Items",
                          "type": "list",
                          "required": false,
                          "description": "The items (status codes) for an origin group.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "Members",
                  "type": "dict",
                  "required": false,
                  "description": "A complex type that contains information about the origins in an origin group.",
                  "nested_params": [
                    {
                      "name": "Quantity",
                      "type": "integer",
                      "required": false,
                      "description": "The number of origins in an origin group.",
                      "nested_params": []
                    },
                    {
                      "name": "Items",
                      "type": "list",
                      "required": false,
                      "description": "in an origin group.",
                      "nested_params": [
                        {
                          "name": "OriginId",
                          "type": "string",
                          "required": false,
                          "description": "The ID for an origin in an origin group.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "SelectionCriteria",
                  "type": "string",
                  "required": false,
                  "description": "The selection criteria for the origin group. For more information, see Create an origin group in the Amazon CloudFront Developer Guide.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "DefaultCacheBehavior",
          "type": "dict",
          "required": false,
          "description": "A complex type that describes the default cache behavior if you don't specify a CacheBehavior element or if files don't match any of the values of PathPattern in CacheBehavior elements. You must create exactly one default cache behavior.",
          "nested_params": [
            {
              "name": "TargetOriginId",
              "type": "string",
              "required": false,
              "description": "The value of ID for the origin that you want CloudFront to route requests to when they use the default cache behavior.",
              "nested_params": []
            },
            {
              "name": "TrustedSigners",
              "type": "dict",
              "required": false,
              "description": "A list of Amazon Web Services account IDs whose public keys CloudFront can use to validate signed URLs or signed cookies. When a cache behavior contains trusted signers, CloudFront requires signed URLs or signed cookies for all requests that match the cache behavior. The URLs or cookies must be signed with the private key of a CloudFront key pair in a trusted signer's Amazon Web Services account. The signed URL or cookie contains information about which public key CloudFront should use to verify the signature. For more information, see Serving private content in the Amazon CloudFront Developer Guide.",
              "nested_params": [
                {
                  "name": "Enabled",
                  "type": "boolean",
                  "required": false,
                  "description": "This field is true if any of the Amazon Web Services accounts in the list are configured as trusted signers. If not, this field is false.",
                  "nested_params": []
                },
                {
                  "name": "Quantity",
                  "type": "integer",
                  "required": false,
                  "description": "The number of Amazon Web Services accounts in the list.",
                  "nested_params": []
                },
                {
                  "name": "Items",
                  "type": "list",
                  "required": false,
                  "description": "A list of Amazon Web Services account identifiers.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "TrustedKeyGroups",
              "type": "dict",
              "required": false,
              "description": "A list of key groups that CloudFront can use to validate signed URLs or signed cookies. When a cache behavior contains trusted key groups, CloudFront requires signed URLs or signed cookies for all requests that match the cache behavior. The URLs or cookies must be signed with a private key whose corresponding public key is in the key group. The signed URL or cookie contains information about which public key CloudFront should use to verify the signature. For more information, see Serving private content in the Amazon CloudFront Developer Guide.",
              "nested_params": [
                {
                  "name": "Enabled",
                  "type": "boolean",
                  "required": false,
                  "description": "This field is true if any of the key groups in the list have public keys that CloudFront can use to verify the signatures of signed URLs and signed cookies. If not, this field is false.",
                  "nested_params": []
                },
                {
                  "name": "Quantity",
                  "type": "integer",
                  "required": false,
                  "description": "The number of key groups in the list.",
                  "nested_params": []
                },
                {
                  "name": "Items",
                  "type": "list",
                  "required": false,
                  "description": "A list of key groups identifiers.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ViewerProtocolPolicy",
              "type": "string",
              "required": false,
              "description": "The protocol that viewers can use to access the files in the origin specified by TargetOriginId when a request matches the path pattern in PathPattern. You can specify the following options:",
              "nested_params": []
            },
            {
              "name": "AllowedMethods",
              "type": "dict",
              "required": false,
              "description": "A complex type that controls which HTTP methods CloudFront processes and forwards to your Amazon S3 bucket or your custom origin. There are three choices:",
              "nested_params": []
            },
            {
              "name": "SmoothStreaming",
              "type": "boolean",
              "required": false,
              "description": "Indicates whether you want to distribute media files in the Microsoft Smooth Streaming format using the origin that is associated with this cache behavior. If so, specify true; if not, specify false. If you specify true for SmoothStreaming, you can still distribute other content using this cache behavior if the content matches the value of PathPattern.",
              "nested_params": []
            },
            {
              "name": "Compress",
              "type": "boolean",
              "required": false,
              "description": "Whether you want CloudFront to automatically compress certain files for this cache behavior. If so, specify true; if not, specify false. For more information, see Serving Compressed Files in the Amazon CloudFront Developer Guide.",
              "nested_params": []
            },
            {
              "name": "LambdaFunctionAssociations",
              "type": "dict",
              "required": false,
              "description": "A complex type that contains zero or more Lambda@Edge function associations for a cache behavior.",
              "nested_params": [
                {
                  "name": "Quantity",
                  "type": "integer",
                  "required": false,
                  "description": "The number of Lambda@Edge function associations for this cache behavior.",
                  "nested_params": []
                },
                {
                  "name": "Items",
                  "type": "list",
                  "required": false,
                  "description": "",
                  "nested_params": [
                    {
                      "name": "LambdaFunctionARN",
                      "type": "string",
                      "required": false,
                      "description": "The ARN of the Lambda@Edge function. You must specify the ARN of a function version; you can't specify an alias or $LATEST.",
                      "nested_params": []
                    },
                    {
                      "name": "EventType",
                      "type": "string",
                      "required": false,
                      "description": "Specifies the event type that triggers a Lambda@Edge function invocation. You can specify the following values:",
                      "nested_params": []
                    },
                    {
                      "name": "IncludeBody",
                      "type": "boolean",
                      "required": false,
                      "description": "A flag that allows a Lambda@Edge function to have read access to the body content. For more information, see Accessing the Request Body by Choosing the Include Body Option in the Amazon CloudFront Developer Guide.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "FunctionAssociations",
              "type": "dict",
              "required": false,
              "description": "A list of CloudFront functions that are associated with this cache behavior. Your functions must be published to the LIVE stage to associate them with a cache behavior.",
              "nested_params": [
                {
                  "name": "Quantity",
                  "type": "integer",
                  "required": false,
                  "description": "The number of CloudFront functions in the list.",
                  "nested_params": []
                },
                {
                  "name": "Items",
                  "type": "list",
                  "required": false,
                  "description": "The CloudFront functions that are associated with a cache behavior in a CloudFront distribution. Your functions must be published to the LIVE stage to associate them with a cache behavior.",
                  "nested_params": [
                    {
                      "name": "FunctionARN",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Resource Name (ARN) of the function.",
                      "nested_params": []
                    },
                    {
                      "name": "EventType",
                      "type": "string",
                      "required": false,
                      "description": "The event type of the function, either viewer-request or viewer-response. You cannot use origin-facing event types ( origin-request and origin-response) with a CloudFront function.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "FieldLevelEncryptionId",
              "type": "string",
              "required": false,
              "description": "The value of ID for the field-level encryption configuration that you want CloudFront to use for encrypting specific fields of data for the default cache behavior.",
              "nested_params": []
            },
            {
              "name": "RealtimeLogConfigArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of the real-time log configuration that is attached to this cache behavior. For more information, see Real-time logs in the Amazon CloudFront Developer Guide.",
              "nested_params": []
            },
            {
              "name": "CachePolicyId",
              "type": "string",
              "required": false,
              "description": "The unique identifier of the cache policy that is attached to the default cache behavior. For more information, see Creating cache policies or Using the managed cache policies in the Amazon CloudFront Developer Guide. A DefaultCacheBehavior must include either a CachePolicyId or ForwardedValues. We recommend that you use a CachePolicyId.",
              "nested_params": []
            },
            {
              "name": "OriginRequestPolicyId",
              "type": "string",
              "required": false,
              "description": "The unique identifier of the origin request policy that is attached to the default cache behavior. For more information, see Creating origin request policies or Using the managed origin request policies in the Amazon CloudFront Developer Guide.",
              "nested_params": []
            },
            {
              "name": "ResponseHeadersPolicyId",
              "type": "string",
              "required": false,
              "description": "The identifier for a response headers policy.",
              "nested_params": []
            },
            {
              "name": "GrpcConfig",
              "type": "dict",
              "required": false,
              "description": "The gRPC configuration for your cache behavior.",
              "nested_params": [
                {
                  "name": "Enabled",
                  "type": "boolean",
                  "required": false,
                  "description": "Enables your CloudFront distribution to receive gRPC requests and to proxy them directly to your origins.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ForwardedValues",
              "type": "dict",
              "required": false,
              "description": "This field is deprecated. We recommend that you use a cache policy or an origin request policy instead of this field. For more information, see Working with policies in the Amazon CloudFront Developer Guide. If you want to include values in the cache key, use a cache policy. For more information, see Creating cache policies or Using the managed cache policies in the Amazon CloudFront Developer Guide. If you want to send values to the origin but not include them in the cache key, use an origin request policy. For more information, see Creating origin request policies or Using the managed origin request policies in the Amazon CloudFront Developer Guide. A DefaultCacheBehavior must include either a CachePolicyId or ForwardedValues. We recommend that you use a CachePolicyId. A complex type that specifies how CloudFront handles query strings, cookies, and HTTP headers.",
              "nested_params": [
                {
                  "name": "QueryString",
                  "type": "boolean",
                  "required": false,
                  "description": "This field is deprecated. We recommend that you use a cache policy or an origin request policy instead of this field. If you want to include query strings in the cache key, use a cache policy. For more information, see Creating cache policies in the Amazon CloudFront Developer Guide. If you want to send query strings to the origin but not include them in the cache key, use an origin request policy. For more information, see Creating origin request policies in the Amazon CloudFront Developer Guide. Indicates whether you want CloudFront to forward query strings to the origin that is associated with this cache behavior and cache based on the query string parameters. CloudFront behavior depends on the value of QueryString and on the values that you specify for QueryStringCacheKeys, if any: If you specify true for QueryString and you don't specify any values for QueryStringCacheKeys, CloudFront forwards all query string parameters to the origin and caches based on all query string parameters. Depending on how many query string parameters and values you have, this can adversely affect performance because CloudFront must forward more requests to the origin. If you specify true for QueryString and you specify one or more values for QueryStringCacheKeys, CloudFront forwards all query string parameters to the origin, but it only caches based on the query string parameters that you specify. If you specify false for QueryString, CloudFront doesn't forward any query string parameters to the origin, and doesn't cache based on query string parameters. For more information, see Configuring CloudFront to Cache Based on Query String Parameters in the Amazon CloudFront Developer Guide.",
                  "nested_params": []
                },
                {
                  "name": "Cookies",
                  "type": "dict",
                  "required": false,
                  "description": "This field is deprecated. We recommend that you use a cache policy or an origin request policy instead of this field. If you want to include cookies in the cache key, use a cache policy. For more information, see Creating cache policies in the Amazon CloudFront Developer Guide. If you want to send cookies to the origin but not include them in the cache key, use an origin request policy. For more information, see Creating origin request policies in the Amazon CloudFront Developer Guide. A complex type that specifies whether you want CloudFront to forward cookies to the origin and, if so, which ones. For more information about forwarding cookies to the origin, see How CloudFront Forwards, Caches, and Logs Cookies in the Amazon CloudFront Developer Guide.",
                  "nested_params": [
                    {
                      "name": "Forward",
                      "type": "string",
                      "required": false,
                      "description": "This field is deprecated. We recommend that you use a cache policy or an origin request policy instead of this field. If you want to include cookies in the cache key, use a cache policy. For more information, see Creating cache policies in the Amazon CloudFront Developer Guide. If you want to send cookies to the origin but not include them in the cache key, use origin request policy. For more information, see Creating origin request policies in the Amazon CloudFront Developer Guide. Specifies which cookies to forward to the origin for this cache behavior: all, none, or the list of cookies specified in the WhitelistedNames complex type. Amazon S3 doesn't process cookies. When the cache behavior is forwarding requests to an Amazon S3 origin, specify none for the Forward element.",
                      "nested_params": []
                    },
                    {
                      "name": "WhitelistedNames",
                      "type": "dict",
                      "required": false,
                      "description": "This field is deprecated. We recommend that you use a cache policy or an origin request policy instead of this field. If you want to include cookies in the cache key, use a cache policy. For more information, see Creating cache policies in the Amazon CloudFront Developer Guide. If you want to send cookies to the origin but not include them in the cache key, use an origin request policy. For more information, see Creating origin request policies in the Amazon CloudFront Developer Guide. Required if you specify whitelist for the value of Forward. A complex type that specifies how many different cookies you want CloudFront to forward to the origin for this cache behavior and, if you want to forward selected cookies, the names of those cookies. If you specify all or none for the value of Forward, omit WhitelistedNames. If you change the value of Forward from whitelist to all or none and you don't delete the WhitelistedNames element and its child elements, CloudFront deletes them automatically. For the current limit on the number of cookie names that you can whitelist for each cache behavior, see CloudFront Limits in the Amazon Web Services General Reference.",
                      "nested_params": [
                        {
                          "name": "Quantity",
                          "type": "integer",
                          "required": false,
                          "description": "The number of cookie names in the Items list.",
                          "nested_params": []
                        },
                        {
                          "name": "Items",
                          "type": "list",
                          "required": false,
                          "description": "A list of cookie names.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "Headers",
                  "type": "dict",
                  "required": false,
                  "description": "This field is deprecated. We recommend that you use a cache policy or an origin request policy instead of this field. If you want to include headers in the cache key, use a cache policy. For more information, see Creating cache policies in the Amazon CloudFront Developer Guide. If you want to send headers to the origin but not include them in the cache key, use an origin request policy. For more information, see Creating origin request policies in the Amazon CloudFront Developer Guide. A complex type that specifies the Headers, if any, that you want CloudFront to forward to the origin for this cache behavior (whitelisted headers). For the headers that you specify, CloudFront also caches separate versions of a specified object that is based on the header values in viewer requests. For more information, see Caching Content Based on Request Headers in the Amazon CloudFront Developer Guide.",
                  "nested_params": [
                    {
                      "name": "Quantity",
                      "type": "integer",
                      "required": false,
                      "description": "The number of header names in the Items list.",
                      "nested_params": []
                    },
                    {
                      "name": "Items",
                      "type": "list",
                      "required": false,
                      "description": "A list of HTTP header names.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "QueryStringCacheKeys",
                  "type": "dict",
                  "required": false,
                  "description": "This field is deprecated. We recommend that you use a cache policy or an origin request policy instead of this field. If you want to include query strings in the cache key, use a cache policy. For more information, see Creating cache policies in the Amazon CloudFront Developer Guide. If you want to send query strings to the origin but not include them in the cache key, use an origin request policy. For more information, see Creating origin request policies in the Amazon CloudFront Developer Guide. A complex type that contains information about the query string parameters that you want CloudFront to use for caching for this cache behavior.",
                  "nested_params": [
                    {
                      "name": "Quantity",
                      "type": "integer",
                      "required": false,
                      "description": "The number of whitelisted query string parameters for a cache behavior.",
                      "nested_params": []
                    },
                    {
                      "name": "Items",
                      "type": "list",
                      "required": false,
                      "description": "A list that contains the query string parameters that you want CloudFront to use as a basis for caching for a cache behavior. If Quantity is 0, you can omit Items.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "MinTTL",
              "type": "integer",
              "required": false,
              "description": "This field is deprecated. We recommend that you use the MinTTL field in a cache policy instead of this field. For more information, see Creating cache policies or Using the managed cache policies in the Amazon CloudFront Developer Guide. The minimum amount of time that you want objects to stay in CloudFront caches before CloudFront forwards another request to your origin to determine whether the object has been updated. For more information, see Managing How Long Content Stays in an Edge Cache (Expiration) in the Amazon CloudFront Developer Guide. You must specify 0 for MinTTL if you configure CloudFront to forward all headers to your origin (under Headers, if you specify 1 for Quantity and * for Name).",
              "nested_params": []
            },
            {
              "name": "DefaultTTL",
              "type": "integer",
              "required": false,
              "description": "This field is deprecated. We recommend that you use the DefaultTTL field in a cache policy instead of this field. For more information, see Creating cache policies or Using the managed cache policies in the Amazon CloudFront Developer Guide. The default amount of time that you want objects to stay in CloudFront caches before CloudFront forwards another request to your origin to determine whether the object has been updated. The value that you specify applies only when your origin does not add HTTP headers such as Cache-Control max-age, Cache-Control s-maxage, and Expires to objects. For more information, see Managing How Long Content Stays in an Edge Cache (Expiration) in the Amazon CloudFront Developer Guide.",
              "nested_params": []
            },
            {
              "name": "MaxTTL",
              "type": "integer",
              "required": false,
              "description": "This field is deprecated. We recommend that you use the MaxTTL field in a cache policy instead of this field. For more information, see Creating cache policies or Using the managed cache policies in the Amazon CloudFront Developer Guide. The maximum amount of time that you want objects to stay in CloudFront caches before CloudFront forwards another request to your origin to determine whether the object has been updated. The value that you specify applies only when your origin adds HTTP headers such as Cache-Control max-age, Cache-Control s-maxage, and Expires to objects. For more information, see Managing How Long Content Stays in an Edge Cache (Expiration) in the Amazon CloudFront Developer Guide.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "CacheBehaviors",
          "type": "dict",
          "required": false,
          "description": "A complex type that contains zero or more CacheBehavior elements.",
          "nested_params": [
            {
              "name": "Quantity",
              "type": "integer",
              "required": false,
              "description": "The number of cache behaviors for this distribution.",
              "nested_params": []
            },
            {
              "name": "Items",
              "type": "list",
              "required": false,
              "description": "Optional: A complex type that contains cache behaviors for this distribution. If Quantity is 0, you can omit Items.",
              "nested_params": [
                {
                  "name": "PathPattern",
                  "type": "string",
                  "required": false,
                  "description": "The pattern (for example, images/*.jpg) that specifies which requests to apply the behavior to. When CloudFront receives a viewer request, the requested path is compared with path patterns in the order in which cache behaviors are listed in the distribution. The path pattern for the default cache behavior is * and cannot be changed. If the request for an object does not match the path pattern for any cache behaviors, CloudFront applies the behavior in the default cache behavior. For more information, see Path Pattern in the Amazon CloudFront Developer Guide.",
                  "nested_params": []
                },
                {
                  "name": "TargetOriginId",
                  "type": "string",
                  "required": false,
                  "description": "The value of ID for the origin that you want CloudFront to route requests to when they match this cache behavior.",
                  "nested_params": []
                },
                {
                  "name": "TrustedSigners",
                  "type": "dict",
                  "required": false,
                  "description": "A list of Amazon Web Services account IDs whose public keys CloudFront can use to validate signed URLs or signed cookies. When a cache behavior contains trusted signers, CloudFront requires signed URLs or signed cookies for all requests that match the cache behavior. The URLs or cookies must be signed with the private key of a CloudFront key pair in the trusted signer's Amazon Web Services account. The signed URL or cookie contains information about which public key CloudFront should use to verify the signature. For more information, see Serving private content in the Amazon CloudFront Developer Guide.",
                  "nested_params": [
                    {
                      "name": "Enabled",
                      "type": "boolean",
                      "required": false,
                      "description": "This field is true if any of the Amazon Web Services accounts in the list are configured as trusted signers. If not, this field is false.",
                      "nested_params": []
                    },
                    {
                      "name": "Quantity",
                      "type": "integer",
                      "required": false,
                      "description": "The number of Amazon Web Services accounts in the list.",
                      "nested_params": []
                    },
                    {
                      "name": "Items",
                      "type": "list",
                      "required": false,
                      "description": "A list of Amazon Web Services account identifiers.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "TrustedKeyGroups",
                  "type": "dict",
                  "required": false,
                  "description": "A list of key groups that CloudFront can use to validate signed URLs or signed cookies. When a cache behavior contains trusted key groups, CloudFront requires signed URLs or signed cookies for all requests that match the cache behavior. The URLs or cookies must be signed with a private key whose corresponding public key is in the key group. The signed URL or cookie contains information about which public key CloudFront should use to verify the signature. For more information, see Serving private content in the Amazon CloudFront Developer Guide.",
                  "nested_params": [
                    {
                      "name": "Enabled",
                      "type": "boolean",
                      "required": false,
                      "description": "This field is true if any of the key groups in the list have public keys that CloudFront can use to verify the signatures of signed URLs and signed cookies. If not, this field is false.",
                      "nested_params": []
                    },
                    {
                      "name": "Quantity",
                      "type": "integer",
                      "required": false,
                      "description": "The number of key groups in the list.",
                      "nested_params": []
                    },
                    {
                      "name": "Items",
                      "type": "list",
                      "required": false,
                      "description": "A list of key groups identifiers.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "ViewerProtocolPolicy",
                  "type": "string",
                  "required": false,
                  "description": "The protocol that viewers can use to access the files in the origin specified by TargetOriginId when a request matches the path pattern in PathPattern. You can specify the following options:",
                  "nested_params": []
                },
                {
                  "name": "AllowedMethods",
                  "type": "dict",
                  "required": false,
                  "description": "A complex type that controls which HTTP methods CloudFront processes and forwards to your Amazon S3 bucket or your custom origin. There are three choices:",
                  "nested_params": []
                },
                {
                  "name": "SmoothStreaming",
                  "type": "boolean",
                  "required": false,
                  "description": "Indicates whether you want to distribute media files in the Microsoft Smooth Streaming format using the origin that is associated with this cache behavior. If so, specify true; if not, specify false. If you specify true for SmoothStreaming, you can still distribute other content using this cache behavior if the content matches the value of PathPattern.",
                  "nested_params": []
                },
                {
                  "name": "Compress",
                  "type": "boolean",
                  "required": false,
                  "description": "Whether you want CloudFront to automatically compress certain files for this cache behavior. If so, specify true; if not, specify false. For more information, see Serving Compressed Files in the Amazon CloudFront Developer Guide.",
                  "nested_params": []
                },
                {
                  "name": "LambdaFunctionAssociations",
                  "type": "dict",
                  "required": false,
                  "description": "A complex type that contains zero or more Lambda@Edge function associations for a cache behavior.",
                  "nested_params": [
                    {
                      "name": "Quantity",
                      "type": "integer",
                      "required": false,
                      "description": "The number of Lambda@Edge function associations for this cache behavior.",
                      "nested_params": []
                    },
                    {
                      "name": "Items",
                      "type": "list",
                      "required": false,
                      "description": "",
                      "nested_params": [
                        {
                          "name": "LambdaFunctionARN",
                          "type": "string",
                          "required": false,
                          "description": "The ARN of the Lambda@Edge function. You must specify the ARN of a function version; you can't specify an alias or $LATEST.",
                          "nested_params": []
                        },
                        {
                          "name": "EventType",
                          "type": "string",
                          "required": false,
                          "description": "Specifies the event type that triggers a Lambda@Edge function invocation. You can specify the following values:",
                          "nested_params": []
                        },
                        {
                          "name": "IncludeBody",
                          "type": "boolean",
                          "required": false,
                          "description": "A flag that allows a Lambda@Edge function to have read access to the body content. For more information, see Accessing the Request Body by Choosing the Include Body Option in the Amazon CloudFront Developer Guide.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "FunctionAssociations",
                  "type": "dict",
                  "required": false,
                  "description": "A list of CloudFront functions that are associated with this cache behavior. CloudFront functions must be published to the LIVE stage to associate them with a cache behavior.",
                  "nested_params": [
                    {
                      "name": "Quantity",
                      "type": "integer",
                      "required": false,
                      "description": "The number of CloudFront functions in the list.",
                      "nested_params": []
                    },
                    {
                      "name": "Items",
                      "type": "list",
                      "required": false,
                      "description": "The CloudFront functions that are associated with a cache behavior in a CloudFront distribution. Your functions must be published to the LIVE stage to associate them with a cache behavior.",
                      "nested_params": [
                        {
                          "name": "FunctionARN",
                          "type": "string",
                          "required": false,
                          "description": "The Amazon Resource Name (ARN) of the function.",
                          "nested_params": []
                        },
                        {
                          "name": "EventType",
                          "type": "string",
                          "required": false,
                          "description": "The event type of the function, either viewer-request or viewer-response. You cannot use origin-facing event types ( origin-request and origin-response) with a CloudFront function.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "FieldLevelEncryptionId",
                  "type": "string",
                  "required": false,
                  "description": "The value of ID for the field-level encryption configuration that you want CloudFront to use for encrypting specific fields of data for this cache behavior.",
                  "nested_params": []
                },
                {
                  "name": "RealtimeLogConfigArn",
                  "type": "string",
                  "required": false,
                  "description": "The Amazon Resource Name (ARN) of the real-time log configuration that is attached to this cache behavior. For more information, see Real-time logs in the Amazon CloudFront Developer Guide.",
                  "nested_params": []
                },
                {
                  "name": "CachePolicyId",
                  "type": "string",
                  "required": false,
                  "description": "The unique identifier of the cache policy that is attached to this cache behavior. For more information, see Creating cache policies or Using the managed cache policies in the Amazon CloudFront Developer Guide. A CacheBehavior must include either a CachePolicyId or ForwardedValues. We recommend that you use a CachePolicyId.",
                  "nested_params": []
                },
                {
                  "name": "OriginRequestPolicyId",
                  "type": "string",
                  "required": false,
                  "description": "The unique identifier of the origin request policy that is attached to this cache behavior. For more information, see Creating origin request policies or Using the managed origin request policies in the Amazon CloudFront Developer Guide.",
                  "nested_params": []
                },
                {
                  "name": "ResponseHeadersPolicyId",
                  "type": "string",
                  "required": false,
                  "description": "The identifier for a response headers policy.",
                  "nested_params": []
                },
                {
                  "name": "GrpcConfig",
                  "type": "dict",
                  "required": false,
                  "description": "The gRPC configuration for your cache behavior.",
                  "nested_params": [
                    {
                      "name": "Enabled",
                      "type": "boolean",
                      "required": false,
                      "description": "Enables your CloudFront distribution to receive gRPC requests and to proxy them directly to your origins.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "ForwardedValues",
                  "type": "dict",
                  "required": false,
                  "description": "This field is deprecated. We recommend that you use a cache policy or an origin request policy instead of this field. For more information, see Working with policies in the Amazon CloudFront Developer Guide. If you want to include values in the cache key, use a cache policy. For more information, see Creating cache policies or Using the managed cache policies in the Amazon CloudFront Developer Guide. If you want to send values to the origin but not include them in the cache key, use an origin request policy. For more information, see Creating origin request policies or Using the managed origin request policies in the Amazon CloudFront Developer Guide. A CacheBehavior must include either a CachePolicyId or ForwardedValues. We recommend that you use a CachePolicyId. A complex type that specifies how CloudFront handles query strings, cookies, and HTTP headers.",
                  "nested_params": [
                    {
                      "name": "QueryString",
                      "type": "boolean",
                      "required": false,
                      "description": "This field is deprecated. We recommend that you use a cache policy or an origin request policy instead of this field. If you want to include query strings in the cache key, use a cache policy. For more information, see Creating cache policies in the Amazon CloudFront Developer Guide. If you want to send query strings to the origin but not include them in the cache key, use an origin request policy. For more information, see Creating origin request policies in the Amazon CloudFront Developer Guide. Indicates whether you want CloudFront to forward query strings to the origin that is associated with this cache behavior and cache based on the query string parameters. CloudFront behavior depends on the value of QueryString and on the values that you specify for QueryStringCacheKeys, if any: If you specify true for QueryString and you don't specify any values for QueryStringCacheKeys, CloudFront forwards all query string parameters to the origin and caches based on all query string parameters. Depending on how many query string parameters and values you have, this can adversely affect performance because CloudFront must forward more requests to the origin. If you specify true for QueryString and you specify one or more values for QueryStringCacheKeys, CloudFront forwards all query string parameters to the origin, but it only caches based on the query string parameters that you specify. If you specify false for QueryString, CloudFront doesn't forward any query string parameters to the origin, and doesn't cache based on query string parameters. For more information, see Configuring CloudFront to Cache Based on Query String Parameters in the Amazon CloudFront Developer Guide.",
                      "nested_params": []
                    },
                    {
                      "name": "Cookies",
                      "type": "dict",
                      "required": false,
                      "description": "This field is deprecated. We recommend that you use a cache policy or an origin request policy instead of this field. If you want to include cookies in the cache key, use a cache policy. For more information, see Creating cache policies in the Amazon CloudFront Developer Guide. If you want to send cookies to the origin but not include them in the cache key, use an origin request policy. For more information, see Creating origin request policies in the Amazon CloudFront Developer Guide. A complex type that specifies whether you want CloudFront to forward cookies to the origin and, if so, which ones. For more information about forwarding cookies to the origin, see How CloudFront Forwards, Caches, and Logs Cookies in the Amazon CloudFront Developer Guide.",
                      "nested_params": [
                        {
                          "name": "Forward",
                          "type": "string",
                          "required": false,
                          "description": "This field is deprecated. We recommend that you use a cache policy or an origin request policy instead of this field. If you want to include cookies in the cache key, use a cache policy. For more information, see Creating cache policies in the Amazon CloudFront Developer Guide. If you want to send cookies to the origin but not include them in the cache key, use origin request policy. For more information, see Creating origin request policies in the Amazon CloudFront Developer Guide. Specifies which cookies to forward to the origin for this cache behavior: all, none, or the list of cookies specified in the WhitelistedNames complex type. Amazon S3 doesn't process cookies. When the cache behavior is forwarding requests to an Amazon S3 origin, specify none for the Forward element.",
                          "nested_params": []
                        },
                        {
                          "name": "WhitelistedNames",
                          "type": "dict",
                          "required": false,
                          "description": "This field is deprecated. We recommend that you use a cache policy or an origin request policy instead of this field. If you want to include cookies in the cache key, use a cache policy. For more information, see Creating cache policies in the Amazon CloudFront Developer Guide. If you want to send cookies to the origin but not include them in the cache key, use an origin request policy. For more information, see Creating origin request policies in the Amazon CloudFront Developer Guide. Required if you specify whitelist for the value of Forward. A complex type that specifies how many different cookies you want CloudFront to forward to the origin for this cache behavior and, if you want to forward selected cookies, the names of those cookies. If you specify all or none for the value of Forward, omit WhitelistedNames. If you change the value of Forward from whitelist to all or none and you don't delete the WhitelistedNames element and its child elements, CloudFront deletes them automatically. For the current limit on the number of cookie names that you can whitelist for each cache behavior, see CloudFront Limits in the Amazon Web Services General Reference.",
                          "nested_params": [
                            {
                              "name": "Quantity",
                              "type": "integer",
                              "required": false,
                              "description": "The number of cookie names in the Items list.",
                              "nested_params": []
                            },
                            {
                              "name": "Items",
                              "type": "list",
                              "required": false,
                              "description": "A list of cookie names.",
                              "nested_params": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "Headers",
                      "type": "dict",
                      "required": false,
                      "description": "This field is deprecated. We recommend that you use a cache policy or an origin request policy instead of this field. If you want to include headers in the cache key, use a cache policy. For more information, see Creating cache policies in the Amazon CloudFront Developer Guide. If you want to send headers to the origin but not include them in the cache key, use an origin request policy. For more information, see Creating origin request policies in the Amazon CloudFront Developer Guide. A complex type that specifies the Headers, if any, that you want CloudFront to forward to the origin for this cache behavior (whitelisted headers). For the headers that you specify, CloudFront also caches separate versions of a specified object that is based on the header values in viewer requests. For more information, see Caching Content Based on Request Headers in the Amazon CloudFront Developer Guide.",
                      "nested_params": [
                        {
                          "name": "Quantity",
                          "type": "integer",
                          "required": false,
                          "description": "The number of header names in the Items list.",
                          "nested_params": []
                        },
                        {
                          "name": "Items",
                          "type": "list",
                          "required": false,
                          "description": "A list of HTTP header names.",
                          "nested_params": []
                        }
                      ]
                    },
                    {
                      "name": "QueryStringCacheKeys",
                      "type": "dict",
                      "required": false,
                      "description": "This field is deprecated. We recommend that you use a cache policy or an origin request policy instead of this field. If you want to include query strings in the cache key, use a cache policy. For more information, see Creating cache policies in the Amazon CloudFront Developer Guide. If you want to send query strings to the origin but not include them in the cache key, use an origin request policy. For more information, see Creating origin request policies in the Amazon CloudFront Developer Guide. A complex type that contains information about the query string parameters that you want CloudFront to use for caching for this cache behavior.",
                      "nested_params": [
                        {
                          "name": "Quantity",
                          "type": "integer",
                          "required": false,
                          "description": "The number of whitelisted query string parameters for a cache behavior.",
                          "nested_params": []
                        },
                        {
                          "name": "Items",
                          "type": "list",
                          "required": false,
                          "description": "A list that contains the query string parameters that you want CloudFront to use as a basis for caching for a cache behavior. If Quantity is 0, you can omit Items.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "MinTTL",
                  "type": "integer",
                  "required": false,
                  "description": "This field is deprecated. We recommend that you use the MinTTL field in a cache policy instead of this field. For more information, see Creating cache policies or Using the managed cache policies in the Amazon CloudFront Developer Guide. The minimum amount of time that you want objects to stay in CloudFront caches before CloudFront forwards another request to your origin to determine whether the object has been updated. For more information, see Managing How Long Content Stays in an Edge Cache (Expiration) in the Amazon CloudFront Developer Guide. You must specify 0 for MinTTL if you configure CloudFront to forward all headers to your origin (under Headers, if you specify 1 for Quantity and * for Name).",
                  "nested_params": []
                },
                {
                  "name": "DefaultTTL",
                  "type": "integer",
                  "required": false,
                  "description": "This field is deprecated. We recommend that you use the DefaultTTL field in a cache policy instead of this field. For more information, see Creating cache policies or Using the managed cache policies in the Amazon CloudFront Developer Guide. The default amount of time that you want objects to stay in CloudFront caches before CloudFront forwards another request to your origin to determine whether the object has been updated. The value that you specify applies only when your origin does not add HTTP headers such as Cache-Control max-age, Cache-Control s-maxage, and Expires to objects. For more information, see Managing How Long Content Stays in an Edge Cache (Expiration) in the Amazon CloudFront Developer Guide.",
                  "nested_params": []
                },
                {
                  "name": "MaxTTL",
                  "type": "integer",
                  "required": false,
                  "description": "This field is deprecated. We recommend that you use the MaxTTL field in a cache policy instead of this field. For more information, see Creating cache policies or Using the managed cache policies in the Amazon CloudFront Developer Guide. The maximum amount of time that you want objects to stay in CloudFront caches before CloudFront forwards another request to your origin to determine whether the object has been updated. The value that you specify applies only when your origin adds HTTP headers such as Cache-Control max-age, Cache-Control s-maxage, and Expires to objects. For more information, see Managing How Long Content Stays in an Edge Cache (Expiration) in the Amazon CloudFront Developer Guide.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "CustomErrorResponses",
          "type": "dict",
          "required": false,
          "description": "A complex type that controls the following:",
          "nested_params": []
        },
        {
          "name": "Comment",
          "type": "string",
          "required": false,
          "description": "A comment to describe the distribution. The comment cannot be longer than 128 characters.",
          "nested_params": []
        },
        {
          "name": "Logging",
          "type": "dict",
          "required": false,
          "description": "A complex type that controls whether access logs are written for the distribution. For more information about logging, see Access Logs in the Amazon CloudFront Developer Guide.",
          "nested_params": [
            {
              "name": "Enabled",
              "type": "boolean",
              "required": false,
              "description": "Specifies whether you want CloudFront to save access logs to an Amazon S3 bucket. If you don't want to enable logging when you create a distribution or if you want to disable logging for an existing distribution, specify false for Enabled, and specify empty Bucket and Prefix elements. If you specify false for Enabled but you specify values for Bucket and prefix, the values are automatically deleted.",
              "nested_params": []
            },
            {
              "name": "IncludeCookies",
              "type": "boolean",
              "required": false,
              "description": "Specifies whether you want CloudFront to include cookies in access logs, specify true for IncludeCookies. If you choose to include cookies in logs, CloudFront logs all cookies regardless of how you configure the cache behaviors for this distribution. If you don't want to include cookies when you create a distribution or if you want to disable include cookies for an existing distribution, specify false for IncludeCookies.",
              "nested_params": []
            },
            {
              "name": "Bucket",
              "type": "string",
              "required": false,
              "description": "The Amazon S3 bucket to store the access logs in, for example, amzn-s3-demo-bucket.s3.amazonaws.com.",
              "nested_params": []
            },
            {
              "name": "Prefix",
              "type": "string",
              "required": false,
              "description": "An optional string that you want CloudFront to prefix to the access log filenames for this distribution, for example, myprefix/. If you want to enable logging, but you don't want to specify a prefix, you still must include an empty Prefix element in the Logging element.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "PriceClass",
          "type": "string",
          "required": false,
          "description": "The price class that corresponds with the maximum price that you want to pay for CloudFront service. If you specify PriceClass_All, CloudFront responds to requests for your objects from all CloudFront edge locations. If you specify a price class other than PriceClass_All, CloudFront serves your objects from the CloudFront edge location that has the lowest latency among the edge locations in your price class. Viewers who are in or near regions that are excluded from your specified price class may encounter slower performance. For more information about price classes, see Choosing the Price Class for a CloudFront Distribution in the Amazon CloudFront Developer Guide. For information about CloudFront pricing, including how price classes (such as Price Class 100) map to CloudFront regions, see Amazon CloudFront Pricing.",
          "nested_params": []
        },
        {
          "name": "Enabled",
          "type": "boolean",
          "required": false,
          "description": "From this field, you can enable or disable the selected distribution.",
          "nested_params": []
        },
        {
          "name": "ViewerCertificate",
          "type": "dict",
          "required": false,
          "description": "A complex type that determines the distribution's SSL/TLS configuration for communicating with viewers.",
          "nested_params": [
            {
              "name": "CloudFrontDefaultCertificate",
              "type": "boolean",
              "required": false,
              "description": "If the distribution uses the CloudFront domain name such as d111111abcdef8.cloudfront.net, set this field to true. If the distribution uses Aliases (alternate domain names or CNAMEs), set this field to false and specify values for the following fields:",
              "nested_params": []
            },
            {
              "name": "IAMCertificateId",
              "type": "string",
              "required": false,
              "description": "If the distribution uses Aliases (alternate domain names or CNAMEs) and the SSL/TLS certificate is stored in Identity and Access Management (IAM), provide the ID of the IAM certificate. If you specify an IAM certificate ID, you must also specify values for MinimumProtocolVersion and SSLSupportMethod.",
              "nested_params": []
            },
            {
              "name": "ACMCertificateArn",
              "type": "string",
              "required": false,
              "description": "If the distribution uses Aliases (alternate domain names or CNAMEs) and the SSL/TLS certificate is stored in Certificate Manager (ACM), provide the Amazon Resource Name (ARN) of the ACM certificate. CloudFront only supports ACM certificates in the US East (N. Virginia) Region ( us-east-1). If you specify an ACM certificate ARN, you must also specify values for MinimumProtocolVersion and SSLSupportMethod.",
              "nested_params": []
            },
            {
              "name": "SSLSupportMethod",
              "type": "string",
              "required": false,
              "description": "If the distribution uses Aliases (alternate domain names or CNAMEs), specify which viewers the distribution accepts HTTPS connections from.",
              "nested_params": []
            },
            {
              "name": "MinimumProtocolVersion",
              "type": "string",
              "required": false,
              "description": "If the distribution uses Aliases (alternate domain names or CNAMEs), specify the security policy that you want CloudFront to use for HTTPS connections with viewers. The security policy determines two settings:",
              "nested_params": []
            },
            {
              "name": "Certificate",
              "type": "string",
              "required": false,
              "description": "This field is deprecated. Use one of the following fields instead:",
              "nested_params": []
            },
            {
              "name": "CertificateSource",
              "type": "string",
              "required": false,
              "description": "This field is deprecated. Use one of the following fields instead:",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Restrictions",
          "type": "dict",
          "required": false,
          "description": "A complex type that identifies ways in which you want to restrict distribution of your content.",
          "nested_params": [
            {
              "name": "GeoRestriction",
              "type": "dict",
              "required": false,
              "description": "A complex type that controls the countries in which your content is distributed. CloudFront determines the location of your users using MaxMind GeoIP databases.",
              "nested_params": [
                {
                  "name": "RestrictionType",
                  "type": "string",
                  "required": false,
                  "description": "The method that you want to use to restrict distribution of your content by country:",
                  "nested_params": []
                },
                {
                  "name": "Quantity",
                  "type": "integer",
                  "required": false,
                  "description": "When geo restriction is enabled, this is the number of countries in your whitelist or blacklist. Otherwise, when it is not enabled, Quantity is 0, and you can omit Items.",
                  "nested_params": []
                },
                {
                  "name": "Items",
                  "type": "list",
                  "required": false,
                  "description": "A complex type that contains a Location element for each country in which you want CloudFront either to distribute your content ( whitelist) or not distribute your content ( blacklist). The Location element is a two-letter, uppercase country code for a country that you want to include in your blacklist or whitelist. Include one Location element for each country. CloudFront and MaxMind both use ISO 3166 country codes. For the current list of countries and the corresponding codes, see ISO 3166-1-alpha-2 code on the International Organization for Standardization website. You can also refer to the country list on the CloudFront console, which includes both country names and codes.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "WebACLId",
          "type": "string",
          "required": false,
          "description": "A unique identifier that specifies the WAF web ACL, if any, to associate with this distribution. To specify a web ACL created using the latest version of WAF, use the ACL ARN, for example arn:aws:wafv2:us-east-1:123456789012:global/webacl/ExampleWebACL/a1b2c3d4-5678-90ab-cdef-EXAMPLE11111. To specify a web ACL created using WAF Classic, use the ACL ID, for example a1b2c3d4-5678-90ab-cdef-EXAMPLE11111. WAF is a web application firewall that lets you monitor the HTTP and HTTPS requests that are forwarded to CloudFront, and lets you control access to your content. Based on conditions that you specify, such as the IP addresses that requests originate from or the values of query strings, CloudFront responds to requests either with the requested content or with an HTTP 403 status code (Forbidden). You can also configure CloudFront to return a custom error page when a request is blocked. For more information about WAF, see the WAF Developer Guide.",
          "nested_params": []
        },
        {
          "name": "HttpVersion",
          "type": "string",
          "required": false,
          "description": "(Optional) Specify the HTTP version(s) that you want viewers to use to communicate with CloudFront. The default value for new web distributions is http2. Viewers that don't support HTTP/2 automatically use an earlier HTTP version. For viewers and CloudFront to use HTTP/2, viewers must support TLSv1.2 or later, and must support Server Name Indication (SNI). For viewers and CloudFront to use HTTP/3, viewers must support TLSv1.3 and Server Name Indication (SNI). CloudFront supports HTTP/3 connection migration to allow the viewer to switch networks without losing connection. For more information about connection migration, see Connection Migration at RFC 9000. For more information about supported TLSv1.3 ciphers, see Supported protocols and ciphers between viewers and CloudFront.",
          "nested_params": []
        },
        {
          "name": "IsIPV6Enabled",
          "type": "boolean",
          "required": false,
          "description": "If you want CloudFront to respond to IPv6 DNS requests with an IPv6 address for your distribution, specify true. If you specify false, CloudFront responds to IPv6 DNS requests with the DNS response code NOERROR and with no IP addresses. This allows viewers to submit a second request, for an IPv4 address for your distribution. In general, you should enable IPv6 if you have users on IPv6 networks who want to access your content. However, if you're using signed URLs or signed cookies to restrict access to your content, and if you're using a custom policy that includes the IpAddress parameter to restrict the IP addresses that can access your content, don't enable IPv6. If you want to restrict access to some content by IP address and not restrict access to other content (or restrict access but not by IP address), you can create two distributions. For more information, see Creating a Signed URL Using a Custom Policy in the Amazon CloudFront Developer Guide. If you're using an Route 53 Amazon Web Services Integration alias resource record set to route traffic to your CloudFront distribution, you need to create a second alias resource record set when both of the following are true:",
          "nested_params": []
        },
        {
          "name": "ContinuousDeploymentPolicyId",
          "type": "string",
          "required": false,
          "description": "The identifier of a continuous deployment policy. For more information, see CreateContinuousDeploymentPolicy.",
          "nested_params": []
        },
        {
          "name": "Staging",
          "type": "boolean",
          "required": false,
          "description": "A Boolean that indicates whether this is a staging distribution. When this value is true, this is a staging distribution. When this value is false, this is not a staging distribution.",
          "nested_params": []
        },
        {
          "name": "AnycastIpListId",
          "type": "string",
          "required": false,
          "description": "ID of the Anycast static IP list that is associated with the distribution.",
          "nested_params": []
        },
        {
          "name": "TenantConfig",
          "type": "dict",
          "required": false,
          "description": "A distribution tenant configuration.",
          "nested_params": [
            {
              "name": "ParameterDefinitions",
              "type": "list",
              "required": false,
              "description": "The parameters that you specify for a distribution tenant.",
              "nested_params": [
                {
                  "name": "Name",
                  "type": "string",
                  "required": false,
                  "description": "The name of the parameter.",
                  "nested_params": []
                },
                {
                  "name": "Definition",
                  "type": "dict",
                  "required": false,
                  "description": "The value that you assigned to the parameter.",
                  "nested_params": [
                    {
                      "name": "StringSchema",
                      "type": "dict",
                      "required": false,
                      "description": "An object that contains information about the string schema.",
                      "nested_params": [
                        {
                          "name": "Comment",
                          "type": "string",
                          "required": false,
                          "description": "A comment to describe the parameter.",
                          "nested_params": []
                        },
                        {
                          "name": "DefaultValue",
                          "type": "string",
                          "required": false,
                          "description": "The default value of the parameter.",
                          "nested_params": []
                        },
                        {
                          "name": "Required",
                          "type": "boolean",
                          "required": false,
                          "description": "Whether the defined parameter is required.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "ConnectionMode",
          "type": "string",
          "required": false,
          "description": "The connection mode to filter distributions by.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Id",
      "type": "string",
      "required": true,
      "description": "The distribution's id.",
      "nested_params": []
    },
    {
      "name": "IfMatch",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Distribution",
          "type": "dict",
          "description": "The distribution's information.",
          "nested_items": [
            {
              "name": "Id",
              "type": "string",
              "description": "The distribution's identifier. For example: E1U5RQF7T870K0.",
              "nested_items": []
            },
            {
              "name": "ARN",
              "type": "string",
              "description": "The distribution's Amazon Resource Name (ARN).",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The distribution's status. When the status is Deployed, the distribution's information is fully propagated to all CloudFront edge locations.",
              "nested_items": []
            },
            {
              "name": "LastModifiedTime",
              "type": "datetime",
              "description": "The date and time when the distribution was last modified.",
              "nested_items": []
            },
            {
              "name": "InProgressInvalidationBatches",
              "type": "integer",
              "description": "The number of invalidation batches currently in progress.",
              "nested_items": []
            },
            {
              "name": "DomainName",
              "type": "string",
              "description": "The distribution's CloudFront domain name. For example: d111111abcdef8.cloudfront.net.",
              "nested_items": []
            },
            {
              "name": "ActiveTrustedSigners",
              "type": "dict",
              "description": "This field contains a list of Amazon Web Services account IDs and the active CloudFront key pairs in each account that CloudFront can use to verify the signatures of signed URLs or signed cookies.",
              "nested_items": [
                {
                  "name": "Enabled",
                  "type": "boolean",
                  "description": "This field is true if any of the Amazon Web Services accounts in the list are configured as trusted signers. If not, this field is false.",
                  "nested_items": []
                },
                {
                  "name": "Quantity",
                  "type": "integer",
                  "description": "The number of Amazon Web Services accounts in the list.",
                  "nested_items": []
                },
                {
                  "name": "Items",
                  "type": "list",
                  "description": "A list of Amazon Web Services accounts and the identifiers of active CloudFront key pairs in each account that CloudFront can use to verify the signatures of signed URLs and signed cookies.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "AwsAccountNumber",
                          "type": "string",
                          "description": "An Amazon Web Services account number that contains active CloudFront key pairs that CloudFront can use to verify the signatures of signed URLs and signed cookies. If the Amazon Web Services account that owns the key pairs is the same account that owns the CloudFront distribution, the value of this field is self.",
                          "nested_items": []
                        },
                        {
                          "name": "KeyPairIds",
                          "type": "dict",
                          "description": "A list of CloudFront key pair identifiers.",
                          "nested_items": [
                            {
                              "name": "Quantity",
                              "type": "integer",
                              "description": "The number of key pair identifiers in the list.",
                              "nested_items": []
                            },
                            {
                              "name": "Items",
                              "type": "list",
                              "description": "A list of CloudFront key pair identifiers.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "string",
                                  "description": "(string) ---",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "ActiveTrustedKeyGroups",
              "type": "dict",
              "description": "This field contains a list of key groups and the public keys in each key group that CloudFront can use to verify the signatures of signed URLs or signed cookies.",
              "nested_items": [
                {
                  "name": "Enabled",
                  "type": "boolean",
                  "description": "This field is true if any of the key groups have public keys that CloudFront can use to verify the signatures of signed URLs and signed cookies. If not, this field is false.",
                  "nested_items": []
                },
                {
                  "name": "Quantity",
                  "type": "integer",
                  "description": "The number of key groups in the list.",
                  "nested_items": []
                },
                {
                  "name": "Items",
                  "type": "list",
                  "description": "A list of key groups, including the identifiers of the public keys in each key group that CloudFront can use to verify the signatures of signed URLs and signed cookies.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "KeyGroupId",
                          "type": "string",
                          "description": "The identifier of the key group that contains the public keys.",
                          "nested_items": []
                        },
                        {
                          "name": "KeyPairIds",
                          "type": "dict",
                          "description": "A list of CloudFront key pair identifiers.",
                          "nested_items": [
                            {
                              "name": "Quantity",
                              "type": "integer",
                              "description": "The number of key pair identifiers in the list.",
                              "nested_items": []
                            },
                            {
                              "name": "Items",
                              "type": "list",
                              "description": "A list of CloudFront key pair identifiers.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "string",
                                  "description": "(string) ---",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "DistributionConfig",
              "type": "dict",
              "description": "The distribution's configuration.",
              "nested_items": [
                {
                  "name": "CallerReference",
                  "type": "string",
                  "description": "A unique value (for example, a date-time stamp) that ensures that the request can't be replayed.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Quantity",
                      "type": "integer",
                      "description": "The number of CNAME aliases, if any, that you want to associate with this distribution.",
                      "nested_items": []
                    },
                    {
                      "name": "Items",
                      "type": "list",
                      "description": "A complex type that contains the CNAME aliases, if any, that you want to associate with this distribution.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "DefaultRootObject",
                  "type": "string",
                  "description": "When a viewer requests the root URL for your distribution, the default root object is the object that you want CloudFront to request from your origin. For example, if your root URL is https://www.example.com, you can specify CloudFront to return the index.html file as the default root object. You can specify a default root object so that viewers see a specific file or object, instead of another object in your distribution (for example, https://www.example.com/product-description.html). A default root object avoids exposing the contents of your distribution.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Quantity",
                      "type": "integer",
                      "description": "The number of origins for this distribution.",
                      "nested_items": []
                    },
                    {
                      "name": "Items",
                      "type": "list",
                      "description": "A list of origins.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "",
                              "description": "Use S3OriginConfig to specify an Amazon S3 bucket that is not configured with static website hosting.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "Use VpcOriginConfig to specify a VPC origin.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "Use CustomOriginConfig to specify all other kinds of origins, including:",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "An Amazon S3 bucket that is configured with static website hosting.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "An Elastic Load Balancing load balancer.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "An Elemental MediaPackage endpoint.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "An Elemental MediaStore container.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "Any other HTTP server, running on an Amazon EC2 instance or any other kind of host.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "OriginGroups",
                  "type": "dict",
                  "description": "A complex type that contains information about origin groups for this distribution.",
                  "nested_items": [
                    {
                      "name": "Quantity",
                      "type": "integer",
                      "description": "The number of origin groups.",
                      "nested_items": []
                    },
                    {
                      "name": "Items",
                      "type": "list",
                      "description": "The items (origin groups) in a distribution.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "Id",
                              "type": "string",
                              "description": "The origin group's ID.",
                              "nested_items": []
                            },
                            {
                              "name": "FailoverCriteria",
                              "type": "dict",
                              "description": "A complex type that contains information about the failover criteria for an origin group.",
                              "nested_items": [
                                {
                                  "name": "StatusCodes",
                                  "type": "dict",
                                  "description": "The status codes that, when returned from the primary origin, will trigger CloudFront to failover to the second origin.",
                                  "nested_items": [
                                    {
                                      "name": "Quantity",
                                      "type": "integer",
                                      "description": "The number of status codes.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Items",
                                      "type": "list",
                                      "description": "The items (status codes) for an origin group.",
                                      "nested_items": [
                                        {
                                          "name": "",
                                          "type": "integer",
                                          "description": "(integer) ---",
                                          "nested_items": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "",
                              "type": "dict",
                              "description": "",
                              "nested_items": [
                                {
                                  "name": "Quantity",
                                  "type": "integer",
                                  "description": "The number of origins in an origin group.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Items",
                                  "type": "list",
                                  "description": "in an origin group.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "dict",
                                      "description": "",
                                      "nested_items": [
                                        {
                                          "name": "OriginId",
                                          "type": "string",
                                          "description": "The ID for an origin in an origin group.",
                                          "nested_items": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "SelectionCriteria",
                              "type": "string",
                              "description": "The selection criteria for the origin group. For more information, see Create an origin group in the Amazon CloudFront Developer Guide.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "DefaultCacheBehavior",
                  "type": "dict",
                  "description": "A complex type that describes the default cache behavior if you don't specify a CacheBehavior element or if files don't match any of the values of PathPattern in CacheBehavior elements. You must create exactly one default cache behavior.",
                  "nested_items": [
                    {
                      "name": "TargetOriginId",
                      "type": "string",
                      "description": "The value of ID for the origin that you want CloudFront to route requests to when they use the default cache behavior.",
                      "nested_items": []
                    },
                    {
                      "name": "TrustedSigners",
                      "type": "dict",
                      "description": "A list of Amazon Web Services account IDs whose public keys CloudFront can use to validate signed URLs or signed cookies.",
                      "nested_items": [
                        {
                          "name": "Enabled",
                          "type": "boolean",
                          "description": "This field is true if any of the Amazon Web Services accounts in the list are configured as trusted signers. If not, this field is false.",
                          "nested_items": []
                        },
                        {
                          "name": "Quantity",
                          "type": "integer",
                          "description": "The number of Amazon Web Services accounts in the list.",
                          "nested_items": []
                        },
                        {
                          "name": "Items",
                          "type": "list",
                          "description": "A list of Amazon Web Services account identifiers.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "TrustedKeyGroups",
                      "type": "dict",
                      "description": "A list of key groups that CloudFront can use to validate signed URLs or signed cookies.",
                      "nested_items": [
                        {
                          "name": "Enabled",
                          "type": "boolean",
                          "description": "This field is true if any of the key groups in the list have public keys that CloudFront can use to verify the signatures of signed URLs and signed cookies. If not, this field is false.",
                          "nested_items": []
                        },
                        {
                          "name": "Quantity",
                          "type": "integer",
                          "description": "The number of key groups in the list.",
                          "nested_items": []
                        },
                        {
                          "name": "Items",
                          "type": "list",
                          "description": "A list of key groups identifiers.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "ViewerProtocolPolicy",
                      "type": "string",
                      "description": "The protocol that viewers can use to access the files in the origin specified by TargetOriginId when a request matches the path pattern in PathPattern. You can specify the following options:",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "allow-all: Viewers can use HTTP or HTTPS.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "Moved Permanently",
                          "description": "redirect-to-https: If a viewer submits an HTTP request, CloudFront returns an HTTP status code of 301 (Moved Permanently) to the viewer along with the HTTPS URL. The viewer then resubmits the request using the new URL.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "Forbidden",
                          "description": "https-only: If a viewer sends an HTTP request, CloudFront returns an HTTP status code of 403 (Forbidden).",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "AllowedMethods",
                      "type": "dict",
                      "description": "A complex type that controls which HTTP methods CloudFront processes and forwards to your Amazon S3 bucket or your custom origin. There are three choices:",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "CloudFront forwards only GET and HEAD requests.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "CloudFront forwards only GET, HEAD, and OPTIONS requests.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "CloudFront forwards GET, HEAD, OPTIONS, PUT, PATCH, POST, and DELETE requests.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "SmoothStreaming",
                      "type": "boolean",
                      "description": "Indicates whether you want to distribute media files in the Microsoft Smooth Streaming format using the origin that is associated with this cache behavior. If so, specify true; if not, specify false. If you specify true for SmoothStreaming, you can still distribute other content using this cache behavior if the content matches the value of PathPattern.",
                      "nested_items": []
                    },
                    {
                      "name": "Compress",
                      "type": "boolean",
                      "description": "Whether you want CloudFront to automatically compress certain files for this cache behavior. If so, specify true; if not, specify false. For more information, see Serving Compressed Files in the Amazon CloudFront Developer Guide.",
                      "nested_items": []
                    },
                    {
                      "name": "LambdaFunctionAssociations",
                      "type": "dict",
                      "description": "A complex type that contains zero or more Lambda@Edge function associations for a cache behavior.",
                      "nested_items": [
                        {
                          "name": "Quantity",
                          "type": "integer",
                          "description": "The number of Lambda@Edge function associations for this cache behavior.",
                          "nested_items": []
                        },
                        {
                          "name": "Items",
                          "type": "list",
                          "description": "Optional: A complex type that contains LambdaFunctionAssociation items for this cache behavior. If Quantity is 0, you can omit Items.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "dict",
                              "description": "",
                              "nested_items": [
                                {
                                  "name": "LambdaFunctionARN",
                                  "type": "string",
                                  "description": "The ARN of the Lambda@Edge function. You must specify the ARN of a function version; you can't specify an alias or $LATEST.",
                                  "nested_items": []
                                },
                                {
                                  "name": "EventType",
                                  "type": "string",
                                  "description": "Specifies the event type that triggers a Lambda@Edge function invocation. You can specify the following values:",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "viewer-request: The function executes when CloudFront receives a request from a viewer and before it checks to see whether the requested object is in the edge cache.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "origin-request: The function executes only when CloudFront sends a request to your origin. When the requested object is in the edge cache, the function doesn't execute.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "origin-response: The function executes after CloudFront receives a response from the origin and before it caches the object in the response. When the requested object is in the edge cache, the function doesn't execute.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "OK",
                                      "description": "viewer-response: The function executes before CloudFront returns the requested object to the viewer. The function executes regardless of whether the object was already in the edge cache. If the origin returns an HTTP status code other than HTTP 200 (OK), the function doesn't execute.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "IncludeBody",
                                  "type": "boolean",
                                  "description": "A flag that allows a Lambda@Edge function to have read access to the body content. For more information, see Accessing the Request Body by Choosing the Include Body Option in the Amazon CloudFront Developer Guide.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "FunctionAssociations",
                      "type": "dict",
                      "description": "A list of CloudFront functions that are associated with this cache behavior. Your functions must be published to the LIVE stage to associate them with a cache behavior.",
                      "nested_items": [
                        {
                          "name": "Quantity",
                          "type": "integer",
                          "description": "The number of CloudFront functions in the list.",
                          "nested_items": []
                        },
                        {
                          "name": "Items",
                          "type": "list",
                          "description": "The CloudFront functions that are associated with a cache behavior in a CloudFront distribution. Your functions must be published to the LIVE stage to associate them with a cache behavior.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "dict",
                              "description": "",
                              "nested_items": [
                                {
                                  "name": "FunctionARN",
                                  "type": "string",
                                  "description": "The Amazon Resource Name (ARN) of the function.",
                                  "nested_items": []
                                },
                                {
                                  "name": "EventType",
                                  "type": "string",
                                  "description": "The event type of the function, either viewer-request or viewer-response. You cannot use origin-facing event types ( origin-request and origin-response) with a CloudFront function.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "FieldLevelEncryptionId",
                      "type": "string",
                      "description": "The value of ID for the field-level encryption configuration that you want CloudFront to use for encrypting specific fields of data for the default cache behavior.",
                      "nested_items": []
                    },
                    {
                      "name": "RealtimeLogConfigArn",
                      "type": "string",
                      "description": "The Amazon Resource Name (ARN) of the real-time log configuration that is attached to this cache behavior. For more information, see Real-time logs in the Amazon CloudFront Developer Guide.",
                      "nested_items": []
                    },
                    {
                      "name": "CachePolicyId",
                      "type": "string",
                      "description": "The unique identifier of the cache policy that is attached to the default cache behavior. For more information, see Creating cache policies or Using the managed cache policies in the Amazon CloudFront Developer Guide.",
                      "nested_items": []
                    },
                    {
                      "name": "OriginRequestPolicyId",
                      "type": "string",
                      "description": "The unique identifier of the origin request policy that is attached to the default cache behavior. For more information, see Creating origin request policies or Using the managed origin request policies in the Amazon CloudFront Developer Guide.",
                      "nested_items": []
                    },
                    {
                      "name": "ResponseHeadersPolicyId",
                      "type": "string",
                      "description": "The identifier for a response headers policy.",
                      "nested_items": []
                    },
                    {
                      "name": "GrpcConfig",
                      "type": "dict",
                      "description": "The gRPC configuration for your cache behavior.",
                      "nested_items": [
                        {
                          "name": "Enabled",
                          "type": "boolean",
                          "description": "Enables your CloudFront distribution to receive gRPC requests and to proxy them directly to your origins.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "ForwardedValues",
                      "type": "dict",
                      "description": "This field is deprecated. We recommend that you use a cache policy or an origin request policy instead of this field. For more information, see Working with policies in the Amazon CloudFront Developer Guide.",
                      "nested_items": [
                        {
                          "name": "QueryString",
                          "type": "boolean",
                          "description": "This field is deprecated. We recommend that you use a cache policy or an origin request policy instead of this field.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "Forward",
                              "type": "string",
                              "description": "This field is deprecated. We recommend that you use a cache policy or an origin request policy instead of this field.",
                              "nested_items": []
                            },
                            {
                              "name": "WhitelistedNames",
                              "type": "dict",
                              "description": "This field is deprecated. We recommend that you use a cache policy or an origin request policy instead of this field.",
                              "nested_items": [
                                {
                                  "name": "Quantity",
                                  "type": "integer",
                                  "description": "The number of cookie names in the Items list.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Items",
                                  "type": "list",
                                  "description": "A list of cookie names.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "string",
                                      "description": "(string) ---",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "Quantity",
                              "type": "integer",
                              "description": "The number of header names in the Items list.",
                              "nested_items": []
                            },
                            {
                              "name": "Items",
                              "type": "list",
                              "description": "A list of HTTP header names.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "string",
                                  "description": "(string) ---",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "name": "QueryStringCacheKeys",
                          "type": "dict",
                          "description": "This field is deprecated. We recommend that you use a cache policy or an origin request policy instead of this field.",
                          "nested_items": [
                            {
                              "name": "Quantity",
                              "type": "integer",
                              "description": "The number of whitelisted query string parameters for a cache behavior.",
                              "nested_items": []
                            },
                            {
                              "name": "Items",
                              "type": "list",
                              "description": "A list that contains the query string parameters that you want CloudFront to use as a basis for caching for a cache behavior. If Quantity is 0, you can omit Items.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "string",
                                  "description": "(string) ---",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "MinTTL",
                      "type": "integer",
                      "description": "This field is deprecated. We recommend that you use the MinTTL field in a cache policy instead of this field. For more information, see Creating cache policies or Using the managed cache policies in the Amazon CloudFront Developer Guide.",
                      "nested_items": []
                    },
                    {
                      "name": "DefaultTTL",
                      "type": "integer",
                      "description": "This field is deprecated. We recommend that you use the DefaultTTL field in a cache policy instead of this field. For more information, see Creating cache policies or Using the managed cache policies in the Amazon CloudFront Developer Guide.",
                      "nested_items": []
                    },
                    {
                      "name": "MaxTTL",
                      "type": "integer",
                      "description": "This field is deprecated. We recommend that you use the MaxTTL field in a cache policy instead of this field. For more information, see Creating cache policies or Using the managed cache policies in the Amazon CloudFront Developer Guide.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "CacheBehaviors",
                  "type": "dict",
                  "description": "A complex type that contains zero or more CacheBehavior elements.",
                  "nested_items": [
                    {
                      "name": "Quantity",
                      "type": "integer",
                      "description": "The number of cache behaviors for this distribution.",
                      "nested_items": []
                    },
                    {
                      "name": "Items",
                      "type": "list",
                      "description": "Optional: A complex type that contains cache behaviors for this distribution. If Quantity is 0, you can omit Items.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "PathPattern",
                              "type": "string",
                              "description": "The pattern (for example, images/*.jpg) that specifies which requests to apply the behavior to. When CloudFront receives a viewer request, the requested path is compared with path patterns in the order in which cache behaviors are listed in the distribution.",
                              "nested_items": []
                            },
                            {
                              "name": "TargetOriginId",
                              "type": "string",
                              "description": "The value of ID for the origin that you want CloudFront to route requests to when they match this cache behavior.",
                              "nested_items": []
                            },
                            {
                              "name": "TrustedSigners",
                              "type": "dict",
                              "description": "A list of Amazon Web Services account IDs whose public keys CloudFront can use to validate signed URLs or signed cookies.",
                              "nested_items": [
                                {
                                  "name": "Enabled",
                                  "type": "boolean",
                                  "description": "This field is true if any of the Amazon Web Services accounts in the list are configured as trusted signers. If not, this field is false.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Quantity",
                                  "type": "integer",
                                  "description": "The number of Amazon Web Services accounts in the list.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Items",
                                  "type": "list",
                                  "description": "A list of Amazon Web Services account identifiers.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "string",
                                      "description": "(string) ---",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "TrustedKeyGroups",
                              "type": "dict",
                              "description": "A list of key groups that CloudFront can use to validate signed URLs or signed cookies.",
                              "nested_items": [
                                {
                                  "name": "Enabled",
                                  "type": "boolean",
                                  "description": "This field is true if any of the key groups in the list have public keys that CloudFront can use to verify the signatures of signed URLs and signed cookies. If not, this field is false.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Quantity",
                                  "type": "integer",
                                  "description": "The number of key groups in the list.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Items",
                                  "type": "list",
                                  "description": "A list of key groups identifiers.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "string",
                                      "description": "(string) ---",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "ViewerProtocolPolicy",
                              "type": "string",
                              "description": "The protocol that viewers can use to access the files in the origin specified by TargetOriginId when a request matches the path pattern in PathPattern. You can specify the following options:",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "allow-all: Viewers can use HTTP or HTTPS.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "Moved Permanently",
                                  "description": "redirect-to-https: If a viewer submits an HTTP request, CloudFront returns an HTTP status code of 301 (Moved Permanently) to the viewer along with the HTTPS URL. The viewer then resubmits the request using the new URL.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "Forbidden",
                                  "description": "https-only: If a viewer sends an HTTP request, CloudFront returns an HTTP status code of 403 (Forbidden).",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "AllowedMethods",
                              "type": "dict",
                              "description": "A complex type that controls which HTTP methods CloudFront processes and forwards to your Amazon S3 bucket or your custom origin. There are three choices:",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "CloudFront forwards only GET and HEAD requests.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "CloudFront forwards only GET, HEAD, and OPTIONS requests.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "CloudFront forwards GET, HEAD, OPTIONS, PUT, PATCH, POST, and DELETE requests.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "SmoothStreaming",
                              "type": "boolean",
                              "description": "Indicates whether you want to distribute media files in the Microsoft Smooth Streaming format using the origin that is associated with this cache behavior. If so, specify true; if not, specify false. If you specify true for SmoothStreaming, you can still distribute other content using this cache behavior if the content matches the value of PathPattern.",
                              "nested_items": []
                            },
                            {
                              "name": "Compress",
                              "type": "boolean",
                              "description": "Whether you want CloudFront to automatically compress certain files for this cache behavior. If so, specify true; if not, specify false. For more information, see Serving Compressed Files in the Amazon CloudFront Developer Guide.",
                              "nested_items": []
                            },
                            {
                              "name": "LambdaFunctionAssociations",
                              "type": "dict",
                              "description": "A complex type that contains zero or more Lambda@Edge function associations for a cache behavior.",
                              "nested_items": [
                                {
                                  "name": "Quantity",
                                  "type": "integer",
                                  "description": "The number of Lambda@Edge function associations for this cache behavior.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Items",
                                  "type": "list",
                                  "description": "Optional: A complex type that contains LambdaFunctionAssociation items for this cache behavior. If Quantity is 0, you can omit Items.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "dict",
                                      "description": "",
                                      "nested_items": [
                                        {
                                          "name": "LambdaFunctionARN",
                                          "type": "string",
                                          "description": "The ARN of the Lambda@Edge function. You must specify the ARN of a function version; you can't specify an alias or $LATEST.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "EventType",
                                          "type": "string",
                                          "description": "Specifies the event type that triggers a Lambda@Edge function invocation. You can specify the following values:",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "viewer-request: The function executes when CloudFront receives a request from a viewer and before it checks to see whether the requested object is in the edge cache.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "origin-request: The function executes only when CloudFront sends a request to your origin. When the requested object is in the edge cache, the function doesn't execute.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "origin-response: The function executes after CloudFront receives a response from the origin and before it caches the object in the response. When the requested object is in the edge cache, the function doesn't execute.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "OK",
                                              "description": "viewer-response: The function executes before CloudFront returns the requested object to the viewer. The function executes regardless of whether the object was already in the edge cache. If the origin returns an HTTP status code other than HTTP 200 (OK), the function doesn't execute.",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "IncludeBody",
                                          "type": "boolean",
                                          "description": "A flag that allows a Lambda@Edge function to have read access to the body content. For more information, see Accessing the Request Body by Choosing the Include Body Option in the Amazon CloudFront Developer Guide.",
                                          "nested_items": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "FunctionAssociations",
                              "type": "dict",
                              "description": "A list of CloudFront functions that are associated with this cache behavior. CloudFront functions must be published to the LIVE stage to associate them with a cache behavior.",
                              "nested_items": [
                                {
                                  "name": "Quantity",
                                  "type": "integer",
                                  "description": "The number of CloudFront functions in the list.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Items",
                                  "type": "list",
                                  "description": "The CloudFront functions that are associated with a cache behavior in a CloudFront distribution. Your functions must be published to the LIVE stage to associate them with a cache behavior.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "dict",
                                      "description": "",
                                      "nested_items": [
                                        {
                                          "name": "FunctionARN",
                                          "type": "string",
                                          "description": "The Amazon Resource Name (ARN) of the function.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "EventType",
                                          "type": "string",
                                          "description": "The event type of the function, either viewer-request or viewer-response. You cannot use origin-facing event types ( origin-request and origin-response) with a CloudFront function.",
                                          "nested_items": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "FieldLevelEncryptionId",
                              "type": "string",
                              "description": "The value of ID for the field-level encryption configuration that you want CloudFront to use for encrypting specific fields of data for this cache behavior.",
                              "nested_items": []
                            },
                            {
                              "name": "RealtimeLogConfigArn",
                              "type": "string",
                              "description": "The Amazon Resource Name (ARN) of the real-time log configuration that is attached to this cache behavior. For more information, see Real-time logs in the Amazon CloudFront Developer Guide.",
                              "nested_items": []
                            },
                            {
                              "name": "CachePolicyId",
                              "type": "string",
                              "description": "The unique identifier of the cache policy that is attached to this cache behavior. For more information, see Creating cache policies or Using the managed cache policies in the Amazon CloudFront Developer Guide.",
                              "nested_items": []
                            },
                            {
                              "name": "OriginRequestPolicyId",
                              "type": "string",
                              "description": "The unique identifier of the origin request policy that is attached to this cache behavior. For more information, see Creating origin request policies or Using the managed origin request policies in the Amazon CloudFront Developer Guide.",
                              "nested_items": []
                            },
                            {
                              "name": "ResponseHeadersPolicyId",
                              "type": "string",
                              "description": "The identifier for a response headers policy.",
                              "nested_items": []
                            },
                            {
                              "name": "GrpcConfig",
                              "type": "dict",
                              "description": "The gRPC configuration for your cache behavior.",
                              "nested_items": [
                                {
                                  "name": "Enabled",
                                  "type": "boolean",
                                  "description": "Enables your CloudFront distribution to receive gRPC requests and to proxy them directly to your origins.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "ForwardedValues",
                              "type": "dict",
                              "description": "This field is deprecated. We recommend that you use a cache policy or an origin request policy instead of this field. For more information, see Working with policies in the Amazon CloudFront Developer Guide.",
                              "nested_items": [
                                {
                                  "name": "QueryString",
                                  "type": "boolean",
                                  "description": "This field is deprecated. We recommend that you use a cache policy or an origin request policy instead of this field.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "Forward",
                                      "type": "string",
                                      "description": "This field is deprecated. We recommend that you use a cache policy or an origin request policy instead of this field.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "WhitelistedNames",
                                      "type": "dict",
                                      "description": "This field is deprecated. We recommend that you use a cache policy or an origin request policy instead of this field.",
                                      "nested_items": [
                                        {
                                          "name": "Quantity",
                                          "type": "integer",
                                          "description": "The number of cookie names in the Items list.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "Items",
                                          "type": "list",
                                          "description": "A list of cookie names.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "string",
                                              "description": "(string) ---",
                                              "nested_items": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "Quantity",
                                      "type": "integer",
                                      "description": "The number of header names in the Items list.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Items",
                                      "type": "list",
                                      "description": "A list of HTTP header names.",
                                      "nested_items": [
                                        {
                                          "name": "",
                                          "type": "string",
                                          "description": "(string) ---",
                                          "nested_items": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "name": "QueryStringCacheKeys",
                                  "type": "dict",
                                  "description": "This field is deprecated. We recommend that you use a cache policy or an origin request policy instead of this field.",
                                  "nested_items": [
                                    {
                                      "name": "Quantity",
                                      "type": "integer",
                                      "description": "The number of whitelisted query string parameters for a cache behavior.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Items",
                                      "type": "list",
                                      "description": "A list that contains the query string parameters that you want CloudFront to use as a basis for caching for a cache behavior. If Quantity is 0, you can omit Items.",
                                      "nested_items": [
                                        {
                                          "name": "",
                                          "type": "string",
                                          "description": "(string) ---",
                                          "nested_items": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "MinTTL",
                              "type": "integer",
                              "description": "This field is deprecated. We recommend that you use the MinTTL field in a cache policy instead of this field. For more information, see Creating cache policies or Using the managed cache policies in the Amazon CloudFront Developer Guide.",
                              "nested_items": []
                            },
                            {
                              "name": "DefaultTTL",
                              "type": "integer",
                              "description": "This field is deprecated. We recommend that you use the DefaultTTL field in a cache policy instead of this field. For more information, see Creating cache policies or Using the managed cache policies in the Amazon CloudFront Developer Guide.",
                              "nested_items": []
                            },
                            {
                              "name": "MaxTTL",
                              "type": "integer",
                              "description": "This field is deprecated. We recommend that you use the MaxTTL field in a cache policy instead of this field. For more information, see Creating cache policies or Using the managed cache policies in the Amazon CloudFront Developer Guide.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "CustomErrorResponses",
                  "type": "dict",
                  "description": "A complex type that controls the following:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "Whether CloudFront replaces HTTP status codes in the 4xx and 5xx range with custom error messages before returning the response to the viewer.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "How long CloudFront caches HTTP status codes in the 4xx and 5xx range.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Comment",
                  "type": "string",
                  "description": "A comment to describe the distribution. The comment cannot be longer than 128 characters.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Enabled",
                      "type": "boolean",
                      "description": "Specifies whether you want CloudFront to save access logs to an Amazon S3 bucket. If you don't want to enable logging when you create a distribution or if you want to disable logging for an existing distribution, specify false for Enabled, and specify empty Bucket and Prefix elements. If you specify false for Enabled but you specify values for Bucket and prefix, the values are automatically deleted.",
                      "nested_items": []
                    },
                    {
                      "name": "IncludeCookies",
                      "type": "boolean",
                      "description": "Specifies whether you want CloudFront to include cookies in access logs, specify true for IncludeCookies. If you choose to include cookies in logs, CloudFront logs all cookies regardless of how you configure the cache behaviors for this distribution. If you don't want to include cookies when you create a distribution or if you want to disable include cookies for an existing distribution, specify false for IncludeCookies.",
                      "nested_items": []
                    },
                    {
                      "name": "Bucket",
                      "type": "string",
                      "description": "The Amazon S3 bucket to store the access logs in, for example, amzn-s3-demo-bucket.s3.amazonaws.com.",
                      "nested_items": []
                    },
                    {
                      "name": "Prefix",
                      "type": "string",
                      "description": "An optional string that you want CloudFront to prefix to the access log filenames for this distribution, for example, myprefix/. If you want to enable logging, but you don't want to specify a prefix, you still must include an empty Prefix element in the Logging element.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "PriceClass",
                  "type": "string",
                  "description": "The price class that corresponds with the maximum price that you want to pay for CloudFront service. If you specify PriceClass_All, CloudFront responds to requests for your objects from all CloudFront edge locations.",
                  "nested_items": []
                },
                {
                  "name": "Enabled",
                  "type": "boolean",
                  "description": "From this field, you can enable or disable the selected distribution.",
                  "nested_items": []
                },
                {
                  "name": "ViewerCertificate",
                  "type": "dict",
                  "description": "A complex type that determines the distribution's SSL/TLS configuration for communicating with viewers.",
                  "nested_items": [
                    {
                      "name": "CloudFrontDefaultCertificate",
                      "type": "boolean",
                      "description": "If the distribution uses the CloudFront domain name such as d111111abcdef8.cloudfront.net, set this field to true.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "specify a value for one, not both",
                          "description": "ACMCertificateArn or IAMCertificateId (specify a value for one, not both)",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "MinimumProtocolVersion.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "SSLSupportMethod.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "IAMCertificateId",
                      "type": "string",
                      "description": "If the distribution uses Aliases (alternate domain names or CNAMEs) and the SSL/TLS certificate is stored in Identity and Access Management (IAM), provide the ID of the IAM certificate.",
                      "nested_items": []
                    },
                    {
                      "name": "ACMCertificateArn",
                      "type": "string",
                      "description": "If the distribution uses Aliases (alternate domain names or CNAMEs) and the SSL/TLS certificate is stored in Certificate Manager (ACM), provide the Amazon Resource Name (ARN) of the ACM certificate. CloudFront only supports ACM certificates in the US East (N. Virginia) Region ( us-east-1).",
                      "nested_items": []
                    },
                    {
                      "name": "SSLSupportMethod",
                      "type": "string",
                      "description": "If the distribution uses Aliases (alternate domain names or CNAMEs), specify which viewers the distribution accepts HTTPS connections from.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "SNI",
                          "description": "sni-only --- The distribution accepts HTTPS connections from only viewers that support server name indication (SNI). This is recommended. Most browsers and clients support SNI.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "vip --- The distribution accepts HTTPS connections from all viewers including those that don't support SNI. This is not recommended, and results in additional monthly charges from CloudFront.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "static-ip - Do not specify this value unless your distribution has been enabled for this feature by the CloudFront team. If you have a use case that requires static IP addresses for a distribution, contact CloudFront through the Amazon Web Services Support Center.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "MinimumProtocolVersion",
                      "type": "string",
                      "description": "If the distribution uses Aliases (alternate domain names or CNAMEs), specify the security policy that you want CloudFront to use for HTTPS connections with viewers. The security policy determines two settings:",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "The minimum SSL/TLS protocol that CloudFront can use to communicate with viewers.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "The ciphers that CloudFront can use to encrypt the content that it returns to viewers.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "Certificate",
                      "type": "string",
                      "description": "This field is deprecated. Use one of the following fields instead:",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "ACMCertificateArn.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "IAMCertificateId.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "CloudFrontDefaultCertificate.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "CertificateSource",
                      "type": "string",
                      "description": "This field is deprecated. Use one of the following fields instead:",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "ACMCertificateArn.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "IAMCertificateId.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "CloudFrontDefaultCertificate.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "Restrictions",
                  "type": "dict",
                  "description": "A complex type that identifies ways in which you want to restrict distribution of your content.",
                  "nested_items": [
                    {
                      "name": "GeoRestriction",
                      "type": "dict",
                      "description": "A complex type that controls the countries in which your content is distributed. CloudFront determines the location of your users using MaxMind GeoIP databases.",
                      "nested_items": [
                        {
                          "name": "RestrictionType",
                          "type": "string",
                          "description": "The method that you want to use to restrict distribution of your content by country:",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "",
                              "description": "none: No geo restriction is enabled, meaning access to content is not restricted by client geo location.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "blacklist: The Location elements specify the countries in which you don't want CloudFront to distribute your content.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "whitelist: The Location elements specify the countries in which you want CloudFront to distribute your content.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "Quantity",
                          "type": "integer",
                          "description": "When geo restriction is enabled, this is the number of countries in your whitelist or blacklist. Otherwise, when it is not enabled, Quantity is 0, and you can omit Items.",
                          "nested_items": []
                        },
                        {
                          "name": "Items",
                          "type": "list",
                          "description": "A complex type that contains a Location element for each country in which you want CloudFront either to distribute your content ( whitelist) or not distribute your content ( blacklist).",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "WebACLId",
                  "type": "string",
                  "description": "A unique identifier that specifies the WAF web ACL, if any, to associate with this distribution. To specify a web ACL created using the latest version of WAF, use the ACL ARN, for example arn:aws:wafv2:us-east-1:123456789012:global/webacl/ExampleWebACL/a1b2c3d4-5678-90ab-cdef-EXAMPLE11111. To specify a web ACL created using WAF Classic, use the ACL ID, for example a1b2c3d4-5678-90ab-cdef-EXAMPLE11111.",
                  "nested_items": []
                },
                {
                  "name": "HttpVersion",
                  "type": "string",
                  "description": "(Optional) Specify the HTTP version(s) that you want viewers to use to communicate with CloudFront. The default value for new web distributions is http2. Viewers that don't support HTTP/2 automatically use an earlier HTTP version.",
                  "nested_items": []
                },
                {
                  "name": "IsIPV6Enabled",
                  "type": "boolean",
                  "description": "If you want CloudFront to respond to IPv6 DNS requests with an IPv6 address for your distribution, specify true. If you specify false, CloudFront responds to IPv6 DNS requests with the DNS response code NOERROR and with no IP addresses. This allows viewers to submit a second request, for an IPv4 address for your distribution.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "You enable IPv6 for the distribution.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "You're using alternate domain names in the URLs for your objects.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "ContinuousDeploymentPolicyId",
                  "type": "string",
                  "description": "The identifier of a continuous deployment policy. For more information, see CreateContinuousDeploymentPolicy.",
                  "nested_items": []
                },
                {
                  "name": "Staging",
                  "type": "boolean",
                  "description": "A Boolean that indicates whether this is a staging distribution. When this value is true, this is a staging distribution. When this value is false, this is not a staging distribution.",
                  "nested_items": []
                },
                {
                  "name": "AnycastIpListId",
                  "type": "string",
                  "description": "ID of the Anycast static IP list that is associated with the distribution.",
                  "nested_items": []
                },
                {
                  "name": "TenantConfig",
                  "type": "dict",
                  "description": "A distribution tenant configuration.",
                  "nested_items": [
                    {
                      "name": "ParameterDefinitions",
                      "type": "list",
                      "description": "The parameters that you specify for a distribution tenant.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "Name",
                              "type": "string",
                              "description": "The name of the parameter.",
                              "nested_items": []
                            },
                            {
                              "name": "Definition",
                              "type": "dict",
                              "description": "The value that you assigned to the parameter.",
                              "nested_items": [
                                {
                                  "name": "StringSchema",
                                  "type": "dict",
                                  "description": "An object that contains information about the string schema.",
                                  "nested_items": [
                                    {
                                      "name": "Comment",
                                      "type": "string",
                                      "description": "A comment to describe the parameter.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "DefaultValue",
                                      "type": "string",
                                      "description": "The default value of the parameter.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Required",
                                      "type": "boolean",
                                      "description": "Whether the defined parameter is required.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "ConnectionMode",
                  "type": "string",
                  "description": "The connection mode to filter distributions by.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "AliasICPRecordals",
              "type": "list",
              "description": "Amazon Web Services services in China customers must file for an Internet Content Provider (ICP) recordal if they want to serve content publicly on an alternate domain name, also known as a CNAME, that they've added to CloudFront. AliasICPRecordal provides the ICP recordal status for CNAMEs associated with distributions.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "CNAME",
                      "type": "string",
                      "description": "A domain name associated with a distribution.",
                      "nested_items": []
                    },
                    {
                      "name": "ICPRecordalStatus",
                      "type": "string",
                      "description": "The Internet Content Provider (ICP) recordal status for a CNAME. The ICPRecordalStatus is set to APPROVED for all CNAMEs (aliases) in Amazon Web Services Regions outside of China.",
                      "nested_items": [
                        {
                          "name": "APPROVED",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "SUSPENDED",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "PENDING",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "ETag",
          "type": "string",
          "description": "The current version of the configuration. For example: E2QWRUHAPOMQZL.",
          "nested_items": []
        }
      ]
    }
  ]
}