{
  "method_name": "get_action_recommendations",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/personalize-runtime/client/get_action_recommendations.html",
  "description": "Returns a list of recommended actions in sorted in descending order by prediction score. Use the GetActionRecommendations API if you have a custom campaign that deploys a solution version trained with a PERSONALIZED_ACTIONS recipe. For more information about PERSONALIZED_ACTIONS recipes, see PERSONALIZED_ACTIONS recipes. For more information about getting action recommendations, see Getting action recommendations.",
  "parameters": [
    {
      "name": "campaignArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "userId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "numResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "filterArn",
      "type": "string",
      "required": false,
      "description": "The ARN of the filter to apply to the returned recommendations. For more information, see Filtering Recommendations. When using this parameter, be sure the filter resource is ACTIVE.",
      "nested_params": []
    },
    {
      "name": "filterValues",
      "type": "dict",
      "required": false,
      "description": "The values to use when filtering recommendations. For each placeholder parameter in your filter expression, provide the parameter name (in matching case) as a key and the filter value(s) as the corresponding value. Separate multiple values for one parameter with a comma. For filter expressions that use an INCLUDE element to include actions, you must provide values for all parameters that are defined in the expression. For filters with expressions that use an EXCLUDE element to exclude actions, you can omit the filter-values. In this case, Amazon Personalize doesn't use that portion of the expression to filter recommendations. For more information, see Filtering recommendations and user segments. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "actionList",
          "type": "list",
          "description": "A list of action recommendations sorted in descending order by prediction score. There can be a maximum of 100 actions in the list. For information about action scores, see How action recommendation scoring works.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "actionId",
                  "type": "string",
                  "description": "The ID of the recommended action.",
                  "nested_items": []
                },
                {
                  "name": "score",
                  "type": "float",
                  "description": "The score of the recommended action. For information about action scores, see How action recommendation scoring works.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "recommendationId",
          "type": "string",
          "description": "The ID of the recommendation.",
          "nested_items": []
        }
      ]
    }
  ]
}