{
  "method_name": "associate_permission",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/qbusiness/client/associate_permission.html",
  "description": "Adds or updates a permission policy for a Amazon Q Business application, allowing cross-account access for an ISV. This operation creates a new policy statement for the specified Amazon Q Business application. The policy statement defines the IAM actions that the ISV is allowed to perform on the Amazon Q Business application's resources.",
  "parameters": [
    {
      "name": "applicationId",
      "type": "string",
      "required": true,
      "description": "The unique identifier of the Amazon Q Business application.",
      "nested_params": []
    },
    {
      "name": "statementId",
      "type": "string",
      "required": true,
      "description": "A unique identifier for the policy statement.",
      "nested_params": []
    },
    {
      "name": "actions",
      "type": "list",
      "required": true,
      "description": "The list of Amazon Q Business actions that the ISV is allowed to perform. (string) ---",
      "nested_params": []
    },
    {
      "name": "conditions",
      "type": "list",
      "required": true,
      "description": "The conditions that restrict when the permission is effective. These conditions can be used to limit the permission based on specific attributes of the request. (dict) --- Defines a condition that restricts when a permission is effective. Conditions allow you to control access based on specific attributes of the request. The operator to use for the condition evaluation. This determines how the condition values are compared. The key for the condition. This identifies the attribute that the condition applies to. The values to compare against using the specified condition operator. (string) ---",
      "nested_params": [
        {
          "name": "conditionOperator",
          "type": "string",
          "required": false,
          "description": "The operator to use for the condition evaluation. This determines how the condition values are compared.",
          "nested_params": []
        },
        {
          "name": "conditionKey",
          "type": "string",
          "required": false,
          "description": "The key for the condition. This identifies the attribute that the condition applies to.",
          "nested_params": []
        },
        {
          "name": "conditionValues",
          "type": "list",
          "required": false,
          "description": "The values to compare against using the specified condition operator.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "principal",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name of the IAM role for the ISV that is being granted permission.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "statement",
          "type": "string",
          "description": "The JSON representation of the added permission statement.",
          "nested_items": []
        }
      ]
    }
  ]
}