{
  "method_name": "create_web_experience",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/qbusiness/client/create_web_experience.html",
  "description": "Creates an Amazon Q Business web experience.",
  "parameters": [
    {
      "name": "applicationId",
      "type": "string",
      "required": true,
      "description": "The identifier of the Amazon Q Business web experience.",
      "nested_params": []
    },
    {
      "name": "title",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "subtitle",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "welcomeMessage",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "samplePromptsControlMode",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "origins",
      "type": "list",
      "required": false,
      "description": "Sets the website domain origins that are allowed to embed the Amazon Q Business web experience. The domain origin refers to the base URL for accessing a website including the protocol ( http/https), the domain name, and the port number (if specified). (string) ---",
      "nested_params": []
    },
    {
      "name": "roleArn",
      "type": "string",
      "required": false,
      "description": "The Amazon Resource Name (ARN) of the service role attached to your web experience.",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "list",
      "required": true,
      "description": "A list of key-value pairs that identify or categorize your Amazon Q Business web experience. You can also use tags to help control access to the web experience. Tag keys and values can consist of Unicode letters, digits, white space, and any of the following symbols: _ . : / = + - @. (dict) --- A list of key/value pairs that identify an index, FAQ, or data source. The key for the tag. Keys are not case sensitive and must be unique for the Amazon Q Business application or data source. The value associated with the tag. The value may be an empty string but it can't be null.",
      "nested_params": [
        {
          "name": "key",
          "type": "string",
          "required": false,
          "description": "The key for the tag. Keys are not case sensitive and must be unique for the Amazon Q Business application or data source.",
          "nested_params": []
        },
        {
          "name": "value",
          "type": "string",
          "required": false,
          "description": "The value associated with the tag. The value may be an empty string but it can't be null.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "clientToken",
      "type": "string",
      "required": false,
      "description": "A token you provide to identify a request to create an Amazon Q Business web experience. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "identityProviderConfiguration",
      "type": "dict",
      "required": true,
      "description": "Information about the identity provider (IdP) used to authenticate end users of an Amazon Q Business web experience. samlConfiguration (dict) --- Information about the SAML 2.0-compliant identity provider (IdP) used to authenticate end users of an Amazon Q Business web experience. The URL where Amazon Q Business end users will be redirected for authentication. openIDConnectConfiguration (dict) --- Information about the OIDC-compliant identity provider (IdP) used to authenticate end users of an Amazon Q Business web experience. The Amazon Resource Name (ARN) of a Secrets Manager secret containing the OIDC client secret. An IAM role with permissions to access KMS to decrypt the Secrets Manager secret containing your OIDC client secret.",
      "nested_params": [
        {
          "name": "samlConfiguration",
          "type": "dict",
          "required": false,
          "description": "Information about the SAML 2.0-compliant identity provider (IdP) used to authenticate end users of an Amazon Q Business web experience.",
          "nested_params": [
            {
              "name": "authenticationUrl",
              "type": "string",
              "required": false,
              "description": "The URL where Amazon Q Business end users will be redirected for authentication.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "openIDConnectConfiguration",
          "type": "dict",
          "required": false,
          "description": "Information about the OIDC-compliant identity provider (IdP) used to authenticate end users of an Amazon Q Business web experience.",
          "nested_params": [
            {
              "name": "secretsArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of a Secrets Manager secret containing the OIDC client secret.",
              "nested_params": []
            },
            {
              "name": "secretsRole",
              "type": "string",
              "required": false,
              "description": "An IAM role with permissions to access KMS to decrypt the Secrets Manager secret containing your OIDC client secret.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "browserExtensionConfiguration",
      "type": "dict",
      "required": true,
      "description": "The browser extension configuration for an Amazon Q Business web experience. Specify the browser extensions allowed for your Amazon Q web experience. CHROME --\u0094 Enables the extension for Chromium-based browsers (Google Chrome, Microsoft Edge, Opera, etc.). FIREFOX --\u0094 Enables the extension for Mozilla Firefox. CHROME and FIREFOX --\u0094 Enable the extension for Chromium-based browsers and Mozilla Firefox. (string) ---",
      "nested_params": [
        {
          "name": "enabledBrowserExtensions",
          "type": "list",
          "required": false,
          "description": "Specify the browser extensions allowed for your Amazon Q web experience.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "customizationConfiguration",
      "type": "dict",
      "required": false,
      "description": "Sets the custom logo, favicon, font, and color used in the Amazon Q web experience. customCSSUrl (string) --- Provides the URL where the custom CSS file is hosted for an Amazon Q web experience. logoUrl (string) --- Provides the URL where the custom logo file is hosted for an Amazon Q web experience. fontUrl (string) --- Provides the URL where the custom font file is hosted for an Amazon Q web experience. faviconUrl (string) --- Provides the URL where the custom favicon file is hosted for an Amazon Q web experience.",
      "nested_params": [
        {
          "name": "customCSSUrl",
          "type": "string",
          "required": false,
          "description": "Provides the URL where the custom CSS file is hosted for an Amazon Q web experience.",
          "nested_params": []
        },
        {
          "name": "logoUrl",
          "type": "string",
          "required": false,
          "description": "Provides the URL where the custom logo file is hosted for an Amazon Q web experience.",
          "nested_params": []
        },
        {
          "name": "fontUrl",
          "type": "string",
          "required": false,
          "description": "Provides the URL where the custom font file is hosted for an Amazon Q web experience.",
          "nested_params": []
        },
        {
          "name": "faviconUrl",
          "type": "string",
          "required": false,
          "description": "Provides the URL where the custom favicon file is hosted for an Amazon Q web experience.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "webExperienceId",
          "type": "string",
          "description": "The identifier of the Amazon Q Business web experience.",
          "nested_items": []
        },
        {
          "name": "webExperienceArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of an Amazon Q Business web experience.",
          "nested_items": []
        }
      ]
    }
  ]
}