{
  "method_name": "create_plugin",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/qbusiness/client/create_plugin.html",
  "description": "Creates an Amazon Q Business plugin.",
  "parameters": [
    {
      "name": "applicationId",
      "type": "string",
      "required": true,
      "description": "The identifier of the application that will contain the plugin.",
      "nested_params": []
    },
    {
      "name": "displayName",
      "type": "string",
      "required": true,
      "description": "A the name for your plugin.",
      "nested_params": []
    },
    {
      "name": "type",
      "type": "string",
      "required": true,
      "description": "The type of plugin you want to create.",
      "nested_params": []
    },
    {
      "name": "authConfiguration",
      "type": "dict",
      "required": true,
      "description": "Authentication configuration information for an Amazon Q Business plugin. basicAuthConfiguration (dict) --- Information about the basic authentication credentials used to configure a plugin. The ARN of the Secrets Manager secret that stores the basic authentication credentials used for plugin configuration.. The ARN of an IAM role used by Amazon Q Business to access the basic authentication credentials stored in a Secrets Manager secret. oAuth2ClientCredentialConfiguration (dict) --- Information about the OAuth 2.0 authentication credential/token used to configure a plugin. The ARN of the Secrets Manager secret that stores the OAuth 2.0 credentials/token used for plugin configuration. The ARN of an IAM role used by Amazon Q Business to access the OAuth 2.0 authentication credentials stored in a Secrets Manager secret. authorizationUrl (string) --- The redirect URL required by the OAuth 2.0 protocol for Amazon Q Business to authenticate a plugin user through a third party authentication server. tokenUrl (string) --- The URL required by the OAuth 2.0 protocol to exchange an end user authorization code for an access token. noAuthConfiguration (dict) --- Information about invoking a custom plugin without any authentication. idcAuthConfiguration (dict) --- Information about the IAM Identity Center Application used to configure authentication for a plugin. The Amazon Resource Name (ARN) of the IAM Identity Center Application used to configure authentication. The Amazon Resource Name (ARN) of the IAM role with permissions to perform actions on Amazon Web Services services on your behalf.",
      "nested_params": [
        {
          "name": "basicAuthConfiguration",
          "type": "dict",
          "required": false,
          "description": "Information about the basic authentication credentials used to configure a plugin.",
          "nested_params": [
            {
              "name": "secretArn",
              "type": "string",
              "required": false,
              "description": "The ARN of the Secrets Manager secret that stores the basic authentication credentials used for plugin configuration..",
              "nested_params": []
            },
            {
              "name": "roleArn",
              "type": "string",
              "required": false,
              "description": "The ARN of an IAM role used by Amazon Q Business to access the basic authentication credentials stored in a Secrets Manager secret.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "oAuth2ClientCredentialConfiguration",
          "type": "dict",
          "required": false,
          "description": "Information about the OAuth 2.0 authentication credential/token used to configure a plugin.",
          "nested_params": [
            {
              "name": "secretArn",
              "type": "string",
              "required": false,
              "description": "The ARN of the Secrets Manager secret that stores the OAuth 2.0 credentials/token used for plugin configuration.",
              "nested_params": []
            },
            {
              "name": "roleArn",
              "type": "string",
              "required": false,
              "description": "The ARN of an IAM role used by Amazon Q Business to access the OAuth 2.0 authentication credentials stored in a Secrets Manager secret.",
              "nested_params": []
            },
            {
              "name": "authorizationUrl",
              "type": "string",
              "required": false,
              "description": "The redirect URL required by the OAuth 2.0 protocol for Amazon Q Business to authenticate a plugin user through a third party authentication server.",
              "nested_params": []
            },
            {
              "name": "tokenUrl",
              "type": "string",
              "required": false,
              "description": "The URL required by the OAuth 2.0 protocol to exchange an end user authorization code for an access token.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "noAuthConfiguration",
          "type": "dict",
          "required": false,
          "description": "Information about invoking a custom plugin without any authentication.",
          "nested_params": []
        },
        {
          "name": "idcAuthConfiguration",
          "type": "dict",
          "required": false,
          "description": "Information about the IAM Identity Center Application used to configure authentication for a plugin.",
          "nested_params": [
            {
              "name": "idcApplicationArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of the IAM Identity Center Application used to configure authentication.",
              "nested_params": []
            },
            {
              "name": "roleArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of the IAM role with permissions to perform actions on Amazon Web Services services on your behalf.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "serverUrl",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "customPluginConfiguration",
      "type": "dict",
      "required": true,
      "description": "Contains configuration for a custom plugin. A description for your custom plugin configuration. The type of OpenAPI schema to use. apiSchema (dict) --- Contains either details about the S3 object containing the OpenAPI schema for the action group or the JSON or YAML-formatted payload defining the schema. payload (string) --- The JSON or YAML-formatted payload defining the OpenAPI schema for a custom plugin. s3 (dict) --- Contains details about the S3 object containing the OpenAPI schema for a custom plugin. The schema could be in either JSON or YAML format. The name of the S3 bucket that contains the file. The name of the file.",
      "nested_params": [
        {
          "name": "description",
          "type": "string",
          "required": false,
          "description": "A description for your custom plugin configuration.",
          "nested_params": []
        },
        {
          "name": "apiSchemaType",
          "type": "string",
          "required": false,
          "description": "The type of OpenAPI schema to use.",
          "nested_params": []
        },
        {
          "name": "apiSchema",
          "type": "dict",
          "required": false,
          "description": "Contains either details about the S3 object containing the OpenAPI schema for the action group or the JSON or YAML-formatted payload defining the schema.",
          "nested_params": [
            {
              "name": "payload",
              "type": "string",
              "required": false,
              "description": "The JSON or YAML-formatted payload defining the OpenAPI schema for a custom plugin.",
              "nested_params": []
            },
            {
              "name": "s3",
              "type": "dict",
              "required": false,
              "description": "Contains details about the S3 object containing the OpenAPI schema for a custom plugin. The schema could be in either JSON or YAML format.",
              "nested_params": [
                {
                  "name": "bucket",
                  "type": "string",
                  "required": false,
                  "description": "The name of the S3 bucket that contains the file.",
                  "nested_params": []
                },
                {
                  "name": "key",
                  "type": "string",
                  "required": false,
                  "description": "The name of the file.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "tags",
      "type": "list",
      "required": true,
      "description": "A list of key-value pairs that identify or categorize the data source connector. You can also use tags to help control access to the data source connector. Tag keys and values can consist of Unicode letters, digits, white space, and any of the following symbols: _ . : / = + - @. (dict) --- A list of key/value pairs that identify an index, FAQ, or data source. The key for the tag. Keys are not case sensitive and must be unique for the Amazon Q Business application or data source. The value associated with the tag. The value may be an empty string but it can't be null.",
      "nested_params": [
        {
          "name": "key",
          "type": "string",
          "required": false,
          "description": "The key for the tag. Keys are not case sensitive and must be unique for the Amazon Q Business application or data source.",
          "nested_params": []
        },
        {
          "name": "value",
          "type": "string",
          "required": false,
          "description": "The value associated with the tag. The value may be an empty string but it can't be null.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "clientToken",
      "type": "string",
      "required": false,
      "description": "A token that you provide to identify the request to create your Amazon Q Business plugin. This field is autopopulated if not provided.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "pluginId",
          "type": "string",
          "description": "The identifier of the plugin created.",
          "nested_items": []
        },
        {
          "name": "pluginArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of a plugin.",
          "nested_items": []
        },
        {
          "name": "buildStatus",
          "type": "string",
          "description": "The current status of a plugin. A plugin is modified asynchronously.",
          "nested_items": []
        }
      ]
    }
  ]
}