{
  "method_name": "delete_group",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/qbusiness/client/delete_group.html",
  "description": "Deletes a group so that all users and sub groups that belong to the group can no longer access documents only available to that group. For example, after deleting the group 'Summer Interns', all interns who belonged to that group no longer see intern-only documents in their chat results. If you want to delete, update, or replace users or sub groups of a group, you need to use the PutGroup operation. For example, if a user in the group 'Engineering' leaves the engineering team and another user takes their place, you provide an updated list of users or sub groups that belong to the 'Engineering' group when calling PutGroup.",
  "parameters": [
    {
      "name": "applicationId",
      "type": "string",
      "required": true,
      "description": "The identifier of the application in which the group mapping belongs.",
      "nested_params": []
    },
    {
      "name": "indexId",
      "type": "string",
      "required": true,
      "description": "The identifier of the index you want to delete the group from.",
      "nested_params": []
    },
    {
      "name": "groupName",
      "type": "string",
      "required": true,
      "description": "The name of the group you want to delete.",
      "nested_params": []
    },
    {
      "name": "dataSourceId",
      "type": "string",
      "required": false,
      "description": "The identifier of the data source linked to the group A group can be tied to multiple data sources. You can delete a group from accessing documents in a certain data source. For example, the groups 'Research', 'Engineering', and 'Sales and Marketing' are all tied to the company's documents stored in the data sources Confluence and Salesforce. You want to delete 'Research' and 'Engineering' groups from Salesforce, so that these groups cannot access customer-related documents stored in Salesforce. Only 'Sales and Marketing' should access documents in the Salesforce data source.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}