{
  "method_name": "update_data_source",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/qbusiness/client/update_data_source.html",
  "description": "Updates an existing Amazon Q Business data source connector.",
  "parameters": [
    {
      "name": "applicationId",
      "type": "string",
      "required": true,
      "description": "The identifier of the Amazon Q Business application the data source is attached to.",
      "nested_params": []
    },
    {
      "name": "indexId",
      "type": "string",
      "required": true,
      "description": "The identifier of the index attached to the data source connector.",
      "nested_params": []
    },
    {
      "name": "dataSourceId",
      "type": "string",
      "required": true,
      "description": "The identifier of the data source connector.",
      "nested_params": []
    },
    {
      "name": "displayName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "configuration",
      "type": "document",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "vpcConfiguration",
      "type": "dict",
      "required": true,
      "description": "Provides configuration information needed to connect to an Amazon VPC (Virtual Private Cloud). A list of identifiers for subnets within your Amazon VPC. The subnets should be able to connect to each other in the VPC, and they should have outgoing access to the Internet through a NAT device. (string) --- A list of identifiers of security groups within your Amazon VPC. The security groups should enable Amazon Q Business to connect to the data source. (string) ---",
      "nested_params": [
        {
          "name": "subnetIds",
          "type": "list",
          "required": false,
          "description": "A list of identifiers for subnets within your Amazon VPC. The subnets should be able to connect to each other in the VPC, and they should have outgoing access to the Internet through a NAT device.",
          "nested_params": []
        },
        {
          "name": "securityGroupIds",
          "type": "list",
          "required": false,
          "description": "A list of identifiers of security groups within your Amazon VPC. The security groups should enable Amazon Q Business to connect to the data source.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "syncSchedule",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "roleArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "documentEnrichmentConfiguration",
      "type": "dict",
      "required": true,
      "description": "Provides the configuration information for altering document metadata and content during the document ingestion process. For more information, see Custom document enrichment. inlineConfigurations (list) --- Configuration information to alter document attributes or metadata fields and content when ingesting documents into Amazon Q Business. (dict) --- Provides the configuration information for applying basic logic to alter document metadata and content when ingesting documents into Amazon Q Business. To apply advanced logic, to go beyond what you can do with basic logic, see HookConfiguration. condition (dict) --- The condition used for the target document attribute or metadata field when ingesting documents into Amazon Q Business. You use this with DocumentAttributeTarget to apply the condition. For example, you can create the --\u0098Department' target field and have it prefill department names associated with the documents based on information in the --\u0098Source_URI' field. Set the condition that if the --\u0098Source_URI' field contains --\u0098financial' in its URI value, then prefill the target field --\u0098Department' with the target value --\u0098Finance' for the document. Amazon Q Business can't create a target field if it has not already been created as an index field. After you create your index field, you can create a document metadata field using DocumentAttributeTarget. Amazon Q Business then will map your newly created metadata field to your index field. The identifier of the document attribute used for the condition. For example, --\u0098Source_URI' could be an identifier for the attribute or metadata field that contains source URIs associated with the documents. Amazon Q Business currently doesn't support _document_body as an attribute key used for the condition. Amazon Q Business currently does not support _document_body as an attribute key used for the condition. value (dict) --- The value of a document attribute. You can only provide one value for a document attribute. stringValue (string) --- A string. stringListValue (list) --- A list of strings. (string) --- longValue (integer) --- A long integer value. dateValue (datetime) --- A date expressed as an ISO 8601 string. It's important for the time zone to be included in the ISO 8601 date-time format. For example, 2012-03-25T12:30:10+01:00 is the ISO 8601 date-time format for March 25th 2012 at 12:30PM (plus 10 seconds) in Central European Time. target (dict) --- The target document attribute or metadata field you want to alter when ingesting documents into Amazon Q Business. For example, you can delete all customer identification numbers associated with the documents, stored in the document metadata field called --\u0098Customer_ID' by setting the target key as --\u0098Customer_ID' and the deletion flag to TRUE. This removes all customer ID values in the field --\u0098Customer_ID'. This would scrub personally identifiable information from each document's metadata. Amazon Q Business will then map your newly created document attribute to your index field. You can also use this with DocumentAttributeCondition. The identifier of the target document attribute or metadata field. For example, --\u0098Department' could be an identifier for the target attribute or metadata field that includes the department names associated with the documents. attributeValueOperator (string) --- TRUE to delete the existing target value for your specified target attribute key. You cannot create a target value and set this to TRUE. documentContentOperator (string) --- TRUE to delete content if the condition used for the target attribute is met. preExtractionHookConfiguration (dict) --- Provides the configuration information for invoking a Lambda function in Lambda to alter document metadata and content when ingesting documents into Amazon Q Business. You can configure your Lambda function using the PreExtractionHookConfiguration parameter if you want to apply advanced alterations on the original or raw documents. If you want to apply advanced alterations on the Amazon Q Business structured documents, you must configure your Lambda function using PostExtractionHookConfiguration. You can only invoke one Lambda function. However, this function can invoke other functions it requires. invocationCondition (dict) --- The condition used for when a Lambda function should be invoked. For example, you can specify a condition that if there are empty date-time values, then Amazon Q Business should invoke a function that inserts the current date-time. lambdaArn (string) --- The Amazon Resource Name (ARN) of the Lambda function during ingestion. For more information, see Using Lambda functions for Amazon Q Business document enrichment. s3BucketName (string) --- Stores the original, raw documents or the structured, parsed documents before and after altering them. For more information, see Data contracts for Lambda functions. roleArn (string) --- The Amazon Resource Name (ARN) of a role with permission to run PreExtractionHookConfiguration and PostExtractionHookConfiguration for altering document metadata and content during the document ingestion process. postExtractionHookConfiguration (dict) --- Provides the configuration information for invoking a Lambda function in Lambda to alter document metadata and content when ingesting documents into Amazon Q Business. roleArn (string) --- The Amazon Resource Name (ARN) of a role with permission to run PreExtractionHookConfiguration and PostExtractionHookConfiguration for altering document metadata and content during the document ingestion process.",
      "nested_params": [
        {
          "name": "inlineConfigurations",
          "type": "list",
          "required": false,
          "description": "Configuration information to alter document attributes or metadata fields and content when ingesting documents into Amazon Q Business.",
          "nested_params": [
            {
              "name": "condition",
              "type": "dict",
              "required": false,
              "description": "The condition used for the target document attribute or metadata field when ingesting documents into Amazon Q Business. You use this with DocumentAttributeTarget to apply the condition. For example, you can create the --\u0098Department' target field and have it prefill department names associated with the documents based on information in the --\u0098Source_URI' field. Set the condition that if the --\u0098Source_URI' field contains --\u0098financial' in its URI value, then prefill the target field --\u0098Department' with the target value --\u0098Finance' for the document. Amazon Q Business can't create a target field if it has not already been created as an index field. After you create your index field, you can create a document metadata field using DocumentAttributeTarget. Amazon Q Business then will map your newly created metadata field to your index field.",
              "nested_params": [
                {
                  "name": "key",
                  "type": "string",
                  "required": false,
                  "description": "The identifier of the document attribute used for the condition. For example, --\u0098Source_URI' could be an identifier for the attribute or metadata field that contains source URIs associated with the documents. Amazon Q Business currently doesn't support _document_body as an attribute key used for the condition.",
                  "nested_params": []
                },
                {
                  "name": "operator",
                  "type": "string",
                  "required": false,
                  "description": "The identifier of the document attribute used for the condition. For example, --\u0098Source_URI' could be an identifier for the attribute or metadata field that contains source URIs associated with the documents. Amazon Q Business currently does not support _document_body as an attribute key used for the condition.",
                  "nested_params": []
                },
                {
                  "name": "value",
                  "type": "dict",
                  "required": false,
                  "description": "The value of a document attribute. You can only provide one value for a document attribute.",
                  "nested_params": [
                    {
                      "name": "stringValue",
                      "type": "string",
                      "required": false,
                      "description": "A string.",
                      "nested_params": []
                    },
                    {
                      "name": "stringListValue",
                      "type": "list",
                      "required": false,
                      "description": "A list of strings.",
                      "nested_params": []
                    },
                    {
                      "name": "longValue",
                      "type": "integer",
                      "required": false,
                      "description": "A long integer value.",
                      "nested_params": []
                    },
                    {
                      "name": "dateValue",
                      "type": "datetime",
                      "required": false,
                      "description": "A date expressed as an ISO 8601 string. It's important for the time zone to be included in the ISO 8601 date-time format. For example, 2012-03-25T12:30:10+01:00 is the ISO 8601 date-time format for March 25th 2012 at 12:30PM (plus 10 seconds) in Central European Time.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "target",
              "type": "dict",
              "required": false,
              "description": "The target document attribute or metadata field you want to alter when ingesting documents into Amazon Q Business. For example, you can delete all customer identification numbers associated with the documents, stored in the document metadata field called --\u0098Customer_ID' by setting the target key as --\u0098Customer_ID' and the deletion flag to TRUE. This removes all customer ID values in the field --\u0098Customer_ID'. This would scrub personally identifiable information from each document's metadata. Amazon Q Business can't create a target field if it has not already been created as an index field. After you create your index field, you can create a document metadata field using DocumentAttributeTarget. Amazon Q Business will then map your newly created document attribute to your index field. You can also use this with DocumentAttributeCondition.",
              "nested_params": [
                {
                  "name": "key",
                  "type": "string",
                  "required": false,
                  "description": "The identifier of the target document attribute or metadata field. For example, --\u0098Department' could be an identifier for the target attribute or metadata field that includes the department names associated with the documents.",
                  "nested_params": []
                },
                {
                  "name": "value",
                  "type": "dict",
                  "required": false,
                  "description": "The value of a document attribute. You can only provide one value for a document attribute.",
                  "nested_params": [
                    {
                      "name": "stringValue",
                      "type": "string",
                      "required": false,
                      "description": "A string.",
                      "nested_params": []
                    },
                    {
                      "name": "stringListValue",
                      "type": "list",
                      "required": false,
                      "description": "A list of strings.",
                      "nested_params": []
                    },
                    {
                      "name": "longValue",
                      "type": "integer",
                      "required": false,
                      "description": "A long integer value.",
                      "nested_params": []
                    },
                    {
                      "name": "dateValue",
                      "type": "datetime",
                      "required": false,
                      "description": "A date expressed as an ISO 8601 string. It's important for the time zone to be included in the ISO 8601 date-time format. For example, 2012-03-25T12:30:10+01:00 is the ISO 8601 date-time format for March 25th 2012 at 12:30PM (plus 10 seconds) in Central European Time.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "attributeValueOperator",
                  "type": "string",
                  "required": false,
                  "description": "TRUE to delete the existing target value for your specified target attribute key. You cannot create a target value and set this to TRUE.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "documentContentOperator",
              "type": "string",
              "required": false,
              "description": "TRUE to delete content if the condition used for the target attribute is met.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "preExtractionHookConfiguration",
          "type": "dict",
          "required": false,
          "description": "Provides the configuration information for invoking a Lambda function in Lambda to alter document metadata and content when ingesting documents into Amazon Q Business. You can configure your Lambda function using the PreExtractionHookConfiguration parameter if you want to apply advanced alterations on the original or raw documents. If you want to apply advanced alterations on the Amazon Q Business structured documents, you must configure your Lambda function using PostExtractionHookConfiguration. You can only invoke one Lambda function. However, this function can invoke other functions it requires. For more information, see Custom document enrichment.",
          "nested_params": [
            {
              "name": "invocationCondition",
              "type": "dict",
              "required": false,
              "description": "The condition used for when a Lambda function should be invoked. For example, you can specify a condition that if there are empty date-time values, then Amazon Q Business should invoke a function that inserts the current date-time.",
              "nested_params": [
                {
                  "name": "key",
                  "type": "string",
                  "required": false,
                  "description": "The identifier of the document attribute used for the condition. For example, --\u0098Source_URI' could be an identifier for the attribute or metadata field that contains source URIs associated with the documents. Amazon Q Business currently doesn't support _document_body as an attribute key used for the condition.",
                  "nested_params": []
                },
                {
                  "name": "operator",
                  "type": "string",
                  "required": false,
                  "description": "The identifier of the document attribute used for the condition. For example, --\u0098Source_URI' could be an identifier for the attribute or metadata field that contains source URIs associated with the documents. Amazon Q Business currently does not support _document_body as an attribute key used for the condition.",
                  "nested_params": []
                },
                {
                  "name": "value",
                  "type": "dict",
                  "required": false,
                  "description": "The value of a document attribute. You can only provide one value for a document attribute.",
                  "nested_params": [
                    {
                      "name": "stringValue",
                      "type": "string",
                      "required": false,
                      "description": "A string.",
                      "nested_params": []
                    },
                    {
                      "name": "stringListValue",
                      "type": "list",
                      "required": false,
                      "description": "A list of strings.",
                      "nested_params": []
                    },
                    {
                      "name": "longValue",
                      "type": "integer",
                      "required": false,
                      "description": "A long integer value.",
                      "nested_params": []
                    },
                    {
                      "name": "dateValue",
                      "type": "datetime",
                      "required": false,
                      "description": "A date expressed as an ISO 8601 string. It's important for the time zone to be included in the ISO 8601 date-time format. For example, 2012-03-25T12:30:10+01:00 is the ISO 8601 date-time format for March 25th 2012 at 12:30PM (plus 10 seconds) in Central European Time.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "lambdaArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of the Lambda function during ingestion. For more information, see Using Lambda functions for Amazon Q Business document enrichment.",
              "nested_params": []
            },
            {
              "name": "s3BucketName",
              "type": "string",
              "required": false,
              "description": "Stores the original, raw documents or the structured, parsed documents before and after altering them. For more information, see Data contracts for Lambda functions.",
              "nested_params": []
            },
            {
              "name": "roleArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of a role with permission to run PreExtractionHookConfiguration and PostExtractionHookConfiguration for altering document metadata and content during the document ingestion process.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "postExtractionHookConfiguration",
          "type": "dict",
          "required": false,
          "description": "Provides the configuration information for invoking a Lambda function in Lambda to alter document metadata and content when ingesting documents into Amazon Q Business. You can configure your Lambda function using the PreExtractionHookConfiguration parameter if you want to apply advanced alterations on the original or raw documents. If you want to apply advanced alterations on the Amazon Q Business structured documents, you must configure your Lambda function using PostExtractionHookConfiguration. You can only invoke one Lambda function. However, this function can invoke other functions it requires. For more information, see Custom document enrichment.",
          "nested_params": [
            {
              "name": "invocationCondition",
              "type": "dict",
              "required": false,
              "description": "The condition used for when a Lambda function should be invoked. For example, you can specify a condition that if there are empty date-time values, then Amazon Q Business should invoke a function that inserts the current date-time.",
              "nested_params": [
                {
                  "name": "key",
                  "type": "string",
                  "required": false,
                  "description": "The identifier of the document attribute used for the condition. For example, --\u0098Source_URI' could be an identifier for the attribute or metadata field that contains source URIs associated with the documents. Amazon Q Business currently doesn't support _document_body as an attribute key used for the condition.",
                  "nested_params": []
                },
                {
                  "name": "operator",
                  "type": "string",
                  "required": false,
                  "description": "The identifier of the document attribute used for the condition. For example, --\u0098Source_URI' could be an identifier for the attribute or metadata field that contains source URIs associated with the documents. Amazon Q Business currently does not support _document_body as an attribute key used for the condition.",
                  "nested_params": []
                },
                {
                  "name": "value",
                  "type": "dict",
                  "required": false,
                  "description": "The value of a document attribute. You can only provide one value for a document attribute.",
                  "nested_params": [
                    {
                      "name": "stringValue",
                      "type": "string",
                      "required": false,
                      "description": "A string.",
                      "nested_params": []
                    },
                    {
                      "name": "stringListValue",
                      "type": "list",
                      "required": false,
                      "description": "A list of strings.",
                      "nested_params": []
                    },
                    {
                      "name": "longValue",
                      "type": "integer",
                      "required": false,
                      "description": "A long integer value.",
                      "nested_params": []
                    },
                    {
                      "name": "dateValue",
                      "type": "datetime",
                      "required": false,
                      "description": "A date expressed as an ISO 8601 string. It's important for the time zone to be included in the ISO 8601 date-time format. For example, 2012-03-25T12:30:10+01:00 is the ISO 8601 date-time format for March 25th 2012 at 12:30PM (plus 10 seconds) in Central European Time.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "lambdaArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of the Lambda function during ingestion. For more information, see Using Lambda functions for Amazon Q Business document enrichment.",
              "nested_params": []
            },
            {
              "name": "s3BucketName",
              "type": "string",
              "required": false,
              "description": "Stores the original, raw documents or the structured, parsed documents before and after altering them. For more information, see Data contracts for Lambda functions.",
              "nested_params": []
            },
            {
              "name": "roleArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of a role with permission to run PreExtractionHookConfiguration and PostExtractionHookConfiguration for altering document metadata and content during the document ingestion process.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "mediaExtractionConfiguration",
      "type": "dict",
      "required": true,
      "description": "The configuration for extracting information from media in documents for your data source. imageExtractionConfiguration (dict) --- The configuration for extracting semantic meaning from images in documents. For more information, see Extracting semantic meaning from images and visuals. Specify whether to extract semantic meaning from images and visuals from documents. audioExtractionConfiguration (dict) --- Configuration settings for extracting and processing audio content from media files. The status of audio extraction (ENABLED or DISABLED) for processing audio content from files. videoExtractionConfiguration (dict) --- Configuration settings for extracting and processing video content from media files. The status of video extraction (ENABLED or DISABLED) for processing video content from files.",
      "nested_params": [
        {
          "name": "imageExtractionConfiguration",
          "type": "dict",
          "required": false,
          "description": "The configuration for extracting semantic meaning from images in documents. For more information, see Extracting semantic meaning from images and visuals.",
          "nested_params": [
            {
              "name": "imageExtractionStatus",
              "type": "string",
              "required": false,
              "description": "Specify whether to extract semantic meaning from images and visuals from documents.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "audioExtractionConfiguration",
          "type": "dict",
          "required": false,
          "description": "Configuration settings for extracting and processing audio content from media files.",
          "nested_params": [
            {
              "name": "audioExtractionStatus",
              "type": "string",
              "required": false,
              "description": "The status of audio extraction (ENABLED or DISABLED) for processing audio content from files.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "videoExtractionConfiguration",
          "type": "dict",
          "required": false,
          "description": "Configuration settings for extracting and processing video content from media files.",
          "nested_params": [
            {
              "name": "videoExtractionStatus",
              "type": "string",
              "required": false,
              "description": "The status of video extraction (ENABLED or DISABLED) for processing video content from files.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}