{
  "method_name": "add_permission",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sqs/client/add_permission.html",
  "description": "Adds a permission to a queue for a specific principal. This allows sharing access to the queue. When you create a queue, you have full control access rights for the queue. Only you, the owner of the queue, can grant or deny permissions to the queue. For more information about these permissions, see Allow Developers to Write Messages to a Shared Queue in the Amazon SQS Developer Guide.",
  "parameters": [
    {
      "name": "QueueUrl",
      "type": "string",
      "required": true,
      "description": "The URL of the Amazon SQS queue to which permissions are added. Queue URLs and names are case-sensitive.",
      "nested_params": []
    },
    {
      "name": "Label",
      "type": "string",
      "required": true,
      "description": "The unique identification of the permission you're setting (for example, AliceSendMessage). Maximum 80 characters. Allowed characters include alphanumeric characters, hyphens ( -), and underscores ( _).",
      "nested_params": []
    },
    {
      "name": "AWSAccountIds",
      "type": "list",
      "required": true,
      "description": "The Amazon Web Services account numbers of the principals who are to receive permission. For information about locating the Amazon Web Services account identification, see Your Amazon Web Services Identifiers in the Amazon SQS Developer Guide. (string) ---",
      "nested_params": []
    },
    {
      "name": "Actions",
      "type": "list",
      "required": true,
      "description": "The action the client wants to allow for the specified principal. Valid values: the name of any action or *. For more information about these actions, see Overview of Managing Access Permissions to Your Amazon Simple Queue Service Resource in the Amazon SQS Developer Guide. Specifying SendMessage, DeleteMessage, or ChangeMessageVisibility for ActionName.n also grants permissions for the corresponding batch versions of those actions: SendMessageBatch, DeleteMessageBatch, and ChangeMessageVisibilityBatch. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}