{
  "method_name": "create_timeline_event",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ssm-incidents/client/create_timeline_event.html",
  "description": "Creates a custom timeline event on the incident details page of an incident record. Incident Manager automatically creates timeline events that mark key moments during an incident. You can create custom timeline events to mark important events that Incident Manager can detect automatically.",
  "parameters": [
    {
      "name": "clientToken",
      "type": "string",
      "required": false,
      "description": "A token that ensures that a client calls the action only once with the specified details. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "eventData",
      "type": "string",
      "required": true,
      "description": "A short description of the event.",
      "nested_params": []
    },
    {
      "name": "eventReferences",
      "type": "list",
      "required": false,
      "description": "Adds one or more references to the TimelineEvent. A reference is an Amazon Web Services resource involved or associated with the incident. To specify a reference, enter its Amazon Resource Name (ARN). You can also specify a related item associated with a resource. For example, to specify an Amazon DynamoDB (DynamoDB) table as a resource, use the table's ARN. You can also specify an Amazon CloudWatch metric associated with the DynamoDB table as a related item. (dict) --- An item referenced in a TimelineEvent that is involved in or somehow associated with an incident. You can specify an Amazon Resource Name (ARN) for an Amazon Web Services resource or a RelatedItem ID. relatedItemId (string) --- The ID of a RelatedItem referenced in a TimelineEvent. resource (string) --- The Amazon Resource Name (ARN) of an Amazon Web Services resource referenced in a TimelineEvent.",
      "nested_params": [
        {
          "name": "relatedItemId",
          "type": "string",
          "required": false,
          "description": "The ID of a RelatedItem referenced in a TimelineEvent.",
          "nested_params": []
        },
        {
          "name": "resource",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of an Amazon Web Services resource referenced in a TimelineEvent.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "eventTime",
      "type": "datetime",
      "required": true,
      "description": "The timestamp for when the event occurred.",
      "nested_params": []
    },
    {
      "name": "eventType",
      "type": "string",
      "required": true,
      "description": "The type of event. You can create timeline events of type Custom Event and Note. To make a Note-type event appear on the Incident notes panel in the console, specify eventType as Note``and enter the Amazon Resource Name (ARN) of the incident as the value for ``eventReference.",
      "nested_params": []
    },
    {
      "name": "incidentRecordArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the incident record that the action adds the incident to.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "eventId",
          "type": "string",
          "description": "The ID of the event for easy reference later.",
          "nested_items": []
        },
        {
          "name": "incidentRecordArn",
          "type": "string",
          "description": "The ARN of the incident record that you added the event to.",
          "nested_items": []
        }
      ]
    }
  ]
}