{
  "method_name": "put_repository_triggers",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/codecommit/client/put_repository_triggers.html",
  "description": "Replaces all triggers for a repository. Used to create or delete triggers.",
  "parameters": [
    {
      "name": "repositoryName",
      "type": "string",
      "required": true,
      "description": "The name of the repository where you want to create or update the trigger.",
      "nested_params": []
    },
    {
      "name": "triggers",
      "type": "list",
      "required": true,
      "description": "The JSON block of configuration information for each trigger. (dict) --- Information about a trigger for a repository. The name of the trigger. The ARN of the resource that is the target for a trigger (for example, the ARN of a topic in Amazon SNS). customData (string) --- Any custom data associated with the trigger to be included in the information sent to the target of the trigger. branches (list) --- The branches to be included in the trigger configuration. If you specify an empty array, the trigger applies to all branches. (string) --- The repository events that cause the trigger to run actions in another service, such as sending a notification through Amazon SNS. (string) ---",
      "nested_params": [
        {
          "name": "name",
          "type": "string",
          "required": false,
          "description": "The name of the trigger.",
          "nested_params": []
        },
        {
          "name": "destinationArn",
          "type": "string",
          "required": false,
          "description": "The ARN of the resource that is the target for a trigger (for example, the ARN of a topic in Amazon SNS).",
          "nested_params": []
        },
        {
          "name": "customData",
          "type": "string",
          "required": false,
          "description": "Any custom data associated with the trigger to be included in the information sent to the target of the trigger.",
          "nested_params": []
        },
        {
          "name": "branches",
          "type": "list",
          "required": false,
          "description": "The branches to be included in the trigger configuration. If you specify an empty array, the trigger applies to all branches.",
          "nested_params": []
        },
        {
          "name": "events",
          "type": "list",
          "required": false,
          "description": "The repository events that cause the trigger to run actions in another service, such as sending a notification through Amazon SNS.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "configurationId",
          "type": "string",
          "description": "The system-generated unique ID for the create or update operation.",
          "nested_items": []
        }
      ]
    }
  ]
}