{
  "method_name": "modify_workspace_access_properties",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/workspaces/client/modify_workspace_access_properties.html",
  "description": "Specifies which devices and operating systems users can use to access their WorkSpaces. For more information, see Control Device Access.",
  "parameters": [
    {
      "name": "ResourceId",
      "type": "string",
      "required": true,
      "description": "The identifier of the directory.",
      "nested_params": []
    },
    {
      "name": "WorkspaceAccessProperties",
      "type": "dict",
      "required": true,
      "description": "The device types and operating systems to enable or disable for access. DeviceTypeWindows (string) --- Indicates whether users can use Windows clients to access their WorkSpaces. DeviceTypeOsx (string) --- Indicates whether users can use macOS clients to access their WorkSpaces. DeviceTypeWeb (string) --- Indicates whether users can access their WorkSpaces through a web browser. DeviceTypeIos (string) --- Indicates whether users can use iOS devices to access their WorkSpaces. DeviceTypeAndroid (string) --- Indicates whether users can use Android and Android-compatible Chrome OS devices to access their WorkSpaces. DeviceTypeChromeOs (string) --- Indicates whether users can use Chromebooks to access their WorkSpaces. DeviceTypeZeroClient (string) --- Indicates whether users can use zero client devices to access their WorkSpaces. DeviceTypeLinux (string) --- Indicates whether users can use Linux clients to access their WorkSpaces. DeviceTypeWorkSpacesThinClient (string) --- Indicates whether users can access their WorkSpaces through a WorkSpaces Thin Client. AccessEndpointConfig (dict) --- Specifies the configuration for accessing the WorkSpace. Indicates a list of access endpoints associated with this directory. (dict) --- Describes the access type and endpoint for a WorkSpace. AccessEndpointType (string) --- Indicates the type of access endpoint. VpcEndpointId (string) --- Indicates the VPC endpoint to use for access. InternetFallbackProtocols (list) --- Indicates a list of protocols that fallback to using the public Internet when streaming over a VPC endpoint is not available. (string) ---",
      "nested_params": [
        {
          "name": "DeviceTypeWindows",
          "type": "string",
          "required": false,
          "description": "Indicates whether users can use Windows clients to access their WorkSpaces.",
          "nested_params": []
        },
        {
          "name": "DeviceTypeOsx",
          "type": "string",
          "required": false,
          "description": "Indicates whether users can use macOS clients to access their WorkSpaces.",
          "nested_params": []
        },
        {
          "name": "DeviceTypeWeb",
          "type": "string",
          "required": false,
          "description": "Indicates whether users can access their WorkSpaces through a web browser.",
          "nested_params": []
        },
        {
          "name": "DeviceTypeIos",
          "type": "string",
          "required": false,
          "description": "Indicates whether users can use iOS devices to access their WorkSpaces.",
          "nested_params": []
        },
        {
          "name": "DeviceTypeAndroid",
          "type": "string",
          "required": false,
          "description": "Indicates whether users can use Android and Android-compatible Chrome OS devices to access their WorkSpaces.",
          "nested_params": []
        },
        {
          "name": "DeviceTypeChromeOs",
          "type": "string",
          "required": false,
          "description": "Indicates whether users can use Chromebooks to access their WorkSpaces.",
          "nested_params": []
        },
        {
          "name": "DeviceTypeZeroClient",
          "type": "string",
          "required": false,
          "description": "Indicates whether users can use zero client devices to access their WorkSpaces.",
          "nested_params": []
        },
        {
          "name": "DeviceTypeLinux",
          "type": "string",
          "required": false,
          "description": "Indicates whether users can use Linux clients to access their WorkSpaces.",
          "nested_params": []
        },
        {
          "name": "DeviceTypeWorkSpacesThinClient",
          "type": "string",
          "required": false,
          "description": "Indicates whether users can access their WorkSpaces through a WorkSpaces Thin Client.",
          "nested_params": []
        },
        {
          "name": "AccessEndpointConfig",
          "type": "dict",
          "required": false,
          "description": "Specifies the configuration for accessing the WorkSpace.",
          "nested_params": [
            {
              "name": "AccessEndpoints",
              "type": "list",
              "required": false,
              "description": "Indicates a list of access endpoints associated with this directory.",
              "nested_params": [
                {
                  "name": "AccessEndpointType",
                  "type": "string",
                  "required": false,
                  "description": "Indicates the type of access endpoint.",
                  "nested_params": []
                },
                {
                  "name": "VpcEndpointId",
                  "type": "string",
                  "required": false,
                  "description": "Indicates the VPC endpoint to use for access.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "InternetFallbackProtocols",
              "type": "list",
              "required": false,
              "description": "Indicates a list of protocols that fallback to using the public Internet when streaming over a VPC endpoint is not available.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}