{
  "method_name": "update_connection_alias_permission",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/workspaces/client/update_connection_alias_permission.html",
  "description": "Shares or unshares a connection alias with one account by specifying whether that account has permission to associate the connection alias with a directory. If the association permission is granted, the connection alias is shared with that account. If the association permission is revoked, the connection alias is unshared with the account. For more information, see Cross-Region Redirection for Amazon WorkSpaces.",
  "parameters": [
    {
      "name": "AliasId",
      "type": "string",
      "required": true,
      "description": "The identifier of the connection alias that you want to update permissions for.",
      "nested_params": []
    },
    {
      "name": "ConnectionAliasPermission",
      "type": "dict",
      "required": true,
      "description": "Indicates whether to share or unshare the connection alias with the specified Amazon Web Services account. The identifier of the Amazon Web Services account that the connection alias is shared with. Indicates whether the specified Amazon Web Services account is allowed to associate the connection alias with a directory.",
      "nested_params": [
        {
          "name": "SharedAccountId",
          "type": "string",
          "required": false,
          "description": "The identifier of the Amazon Web Services account that the connection alias is shared with.",
          "nested_params": []
        },
        {
          "name": "AllowAssociation",
          "type": "boolean",
          "required": false,
          "description": "Indicates whether the specified Amazon Web Services account is allowed to associate the connection alias with a directory.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}