{
  "method_name": "create_device_pool",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/devicefarm/client/create_device_pool.html",
  "description": "Creates a device pool.",
  "parameters": [
    {
      "name": "projectArn",
      "type": "string",
      "required": true,
      "description": "The ARN of the project for the device pool.",
      "nested_params": []
    },
    {
      "name": "name",
      "type": "string",
      "required": true,
      "description": "The device pool's name.",
      "nested_params": []
    },
    {
      "name": "description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "rules",
      "type": "list",
      "required": true,
      "description": "The device pool's rules. (dict) --- Represents a condition for a device pool. attribute (string) --- The rule's stringified attribute. For example, specify the value as \"\\\"abc\\\"\". The supported operators for each attribute are provided in the following list. APPIUM_VERSION The Appium version for the test. Supported operators: CONTAINS ARN The Amazon Resource Name (ARN) of the device (for example, arn:aws:devicefarm:us-west-2::device:12345Example. Supported operators: EQUALS, IN, NOT_IN AVAILABILITY The current availability of the device. Valid values are AVAILABLE, HIGHLY_AVAILABLE, BUSY, or TEMPORARY_NOT_AVAILABLE. Supported operators: EQUALS FLEET_TYPE The fleet type. Valid values are PUBLIC or PRIVATE. Supported operators: EQUALS FORM_FACTOR The device form factor. Valid values are PHONE or TABLET. Supported operators: EQUALS, IN, NOT_IN INSTANCE_ARN The Amazon Resource Name (ARN) of the device instance. Supported operators: IN, NOT_IN INSTANCE_LABELS The label of the device instance. Supported operators: CONTAINS MANUFACTURER The device manufacturer (for example, Apple). Supported operators: EQUALS, IN, NOT_IN MODEL The device model, such as Apple iPad Air 2 or Google Pixel. Supported operators: CONTAINS, EQUALS, IN, NOT_IN OS_VERSION The operating system version (for example, 10.3.2). Supported operators: EQUALS, GREATER_THAN, GREATER_THAN_OR_EQUALS, IN, LESS_THAN, LESS_THAN_OR_EQUALS, NOT_IN PLATFORM The device platform. Valid values are ANDROID or IOS. Supported operators: EQUALS, IN, NOT_IN REMOTE_ACCESS_ENABLED Whether the device is enabled for remote access. Valid values are TRUE or FALSE. Supported operators: EQUALS REMOTE_DEBUG_ENABLED Whether the device is enabled for remote debugging. Supported operators: EQUALS Because remote debugging is no longer supported, this filter is ignored. operator (string) --- Specifies how Device Farm compares the rule's attribute to the value. For the operators that are supported by each attribute, see the attribute descriptions. value (string) --- The rule's value.",
      "nested_params": [
        {
          "name": "attribute",
          "type": "string",
          "required": false,
          "description": "The rule's stringified attribute. For example, specify the value as \"\\\"abc\\\"\". The supported operators for each attribute are provided in the following list. The Appium version for the test. Supported operators: CONTAINS The Amazon Resource Name (ARN) of the device (for example, arn:aws:devicefarm:us-west-2::device:12345Example. Supported operators: EQUALS, IN, NOT_IN The current availability of the device. Valid values are AVAILABLE, HIGHLY_AVAILABLE, BUSY, or TEMPORARY_NOT_AVAILABLE. Supported operators: EQUALS The fleet type. Valid values are PUBLIC or PRIVATE. Supported operators: EQUALS The device form factor. Valid values are PHONE or TABLET. Supported operators: EQUALS, IN, NOT_IN The Amazon Resource Name (ARN) of the device instance. Supported operators: IN, NOT_IN The label of the device instance. Supported operators: CONTAINS The device manufacturer (for example, Apple). Supported operators: EQUALS, IN, NOT_IN The device model, such as Apple iPad Air 2 or Google Pixel. Supported operators: CONTAINS, EQUALS, IN, NOT_IN The operating system version (for example, 10.3.2). Supported operators: EQUALS, GREATER_THAN, GREATER_THAN_OR_EQUALS, IN, LESS_THAN, LESS_THAN_OR_EQUALS, NOT_IN The device platform. Valid values are ANDROID or IOS. Supported operators: EQUALS, IN, NOT_IN Whether the device is enabled for remote access. Valid values are TRUE or FALSE. Supported operators: EQUALS Whether the device is enabled for remote debugging. Supported operators: EQUALS Because remote debugging is no longer supported, this filter is ignored.",
          "nested_params": []
        },
        {
          "name": "operator",
          "type": "string",
          "required": false,
          "description": "Specifies how Device Farm compares the rule's attribute to the value. For the operators that are supported by each attribute, see the attribute descriptions.",
          "nested_params": []
        },
        {
          "name": "value",
          "type": "string",
          "required": false,
          "description": "The rule's value.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "maxDevices",
      "type": "integer",
      "required": false,
      "description": "The number of devices that Device Farm can add to your device pool. Device Farm adds devices that are available and meet the criteria that you assign for the rules parameter. Depending on how many devices meet these constraints, your device pool might contain fewer devices than the value for this parameter. By specifying the maximum number of devices, you can control the costs that you incur by running tests.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "devicePool",
          "type": "dict",
          "description": "The newly created device pool.",
          "nested_items": [
            {
              "name": "arn",
              "type": "string",
              "description": "The device pool's ARN.",
              "nested_items": []
            },
            {
              "name": "name",
              "type": "string",
              "description": "The device pool's name.",
              "nested_items": []
            },
            {
              "name": "description",
              "type": "string",
              "description": "The device pool's description.",
              "nested_items": []
            },
            {
              "name": "type",
              "type": "string",
              "description": "The device pool's type.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "CURATED: A device pool that is created and managed by AWS Device Farm.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "PRIVATE: A device pool that is created and managed by the device pool developer.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "rules",
              "type": "list",
              "description": "Information about the device pool's rules.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "attribute",
                      "type": "string",
                      "description": "The rule's stringified attribute. For example, specify the value as \"\\\"abc\\\"\".",
                      "nested_items": []
                    },
                    {
                      "name": "operator",
                      "type": "string",
                      "description": "Specifies how Device Farm compares the rule's attribute to the value. For the operators that are supported by each attribute, see the attribute descriptions.",
                      "nested_items": []
                    },
                    {
                      "name": "value",
                      "type": "string",
                      "description": "The rule's value.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "maxDevices",
              "type": "integer",
              "description": "The number of devices that Device Farm can add to your device pool. Device Farm adds devices that are available and meet the criteria that you assign for the rules parameter. Depending on how many devices meet these constraints, your device pool might contain fewer devices than the value for this parameter.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}