{
  "method_name": "batch_get_standards_control_associations",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/securityhub/client/batch_get_standards_control_associations.html",
  "description": "For a batch of security controls and standards, identifies whether each control is currently enabled or disabled in a standard. Calls to this operation return a RESOURCE_NOT_FOUND_EXCEPTION error when the standard subscription for the association has a NOT_READY_FOR_UPDATES value for StandardsControlsUpdatable.",
  "parameters": [
    {
      "name": "StandardsControlAssociationIds",
      "type": "list",
      "required": true,
      "description": "An array with one or more objects that includes a security control (identified with SecurityControlId, SecurityControlArn, or a mix of both parameters) and the Amazon Resource Name (ARN) of a standard. This field is used to query the enablement status of a control in a specified standard. The security control ID or ARN is the same across standards. (dict) --- An array with one or more objects that includes a security control (identified with SecurityControlId, SecurityControlArn, or a mix of both parameters) and the Amazon Resource Name (ARN) of a standard. SecurityControlId (string) --- The unique identifier (identified with SecurityControlId, SecurityControlArn, or a mix of both parameters) of a security control across standards. StandardsArn (string) --- The ARN of a standard.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "StandardsControlAssociationDetails",
          "type": "list",
          "description": "Provides the enablement status of a security control in a specified standard and other details for the control in relation to the specified standard.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "StandardsArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of a security standard.",
                  "nested_items": []
                },
                {
                  "name": "SecurityControlId",
                  "type": "string",
                  "description": "The unique identifier of a security control across standards. Values for this field typically consist of an Amazon Web Services service name and a number, such as APIGateway.3.",
                  "nested_items": []
                },
                {
                  "name": "SecurityControlArn",
                  "type": "string",
                  "description": "The ARN of a security control across standards, such as arn:aws:securityhub:eu-central-1:123456789012:security-control/S3.1. This parameter doesn't mention a specific standard.",
                  "nested_items": []
                },
                {
                  "name": "AssociationStatus",
                  "type": "string",
                  "description": "Specifies whether a control is enabled or disabled in a specified standard.",
                  "nested_items": []
                },
                {
                  "name": "RelatedRequirements",
                  "type": "list",
                  "description": "The requirement that underlies a control in the compliance framework related to the standard.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "UpdatedAt",
                  "type": "datetime",
                  "description": "The time at which the enablement status of the control in the specified standard was last updated.",
                  "nested_items": []
                },
                {
                  "name": "UpdatedReason",
                  "type": "string",
                  "description": "The reason for updating the enablement status of a control in a specified standard.",
                  "nested_items": []
                },
                {
                  "name": "StandardsControlTitle",
                  "type": "string",
                  "description": "The title of a control. This field may reference a specific standard.",
                  "nested_items": []
                },
                {
                  "name": "StandardsControlDescription",
                  "type": "string",
                  "description": "The description of a control. This typically summarizes how Security Hub evaluates the control and the conditions under which it produces a failed finding. This parameter may reference a specific standard.",
                  "nested_items": []
                },
                {
                  "name": "StandardsControlArns",
                  "type": "list",
                  "description": "Provides the input parameter that Security Hub uses to call the UpdateStandardsControl API. This API can be used to enable or disable a control in a specified standard.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "UnprocessedAssociations",
          "type": "list",
          "description": "A security control (identified with SecurityControlId, SecurityControlArn, or a mix of both parameters) whose enablement status in a specified standard cannot be returned.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "StandardsControlAssociationId",
                  "type": "dict",
                  "description": "An array with one or more objects that includes a security control (identified with SecurityControlId, SecurityControlArn, or a mix of both parameters) and the Amazon Resource Name (ARN) of a standard. This parameter shows the specific controls for which the enablement status couldn't be retrieved in specified standards when calling BatchUpdateStandardsControlAssociations.",
                  "nested_items": [
                    {
                      "name": "SecurityControlId",
                      "type": "string",
                      "description": "The unique identifier (identified with SecurityControlId, SecurityControlArn, or a mix of both parameters) of a security control across standards.",
                      "nested_items": []
                    },
                    {
                      "name": "StandardsArn",
                      "type": "string",
                      "description": "The ARN of a standard.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "ErrorCode",
                  "type": "string",
                  "description": "The error code for the unprocessed standard and control association.",
                  "nested_items": []
                },
                {
                  "name": "ErrorReason",
                  "type": "string",
                  "description": "The reason why the standard and control association was unprocessed.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}