{
  "method_name": "batch_update_standards_control_associations",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/securityhub/client/batch_update_standards_control_associations.html",
  "description": "For a batch of security controls and standards, this operation updates the enablement status of a control in a standard.",
  "parameters": [
    {
      "name": "StandardsControlAssociationUpdates",
      "type": "list",
      "required": true,
      "description": "Updates the enablement status of a security control in a specified standard. Calls to this operation return a RESOURCE_NOT_FOUND_EXCEPTION error when the standard subscription for the control has StandardsControlsUpdatable value NOT_READY_FOR_UPDATES. (dict) --- An array of requested updates to the enablement status of controls in specified standards. The objects in the array include a security control ID, the Amazon Resource Name (ARN) of the standard, the requested enablement status, and the reason for updating the enablement status. StandardsArn (string) --- The Amazon Resource Name (ARN) of the standard in which you want to update the control's enablement status. SecurityControlId (string) --- The unique identifier for the security control whose enablement status you want to update. AssociationStatus (string) --- The desired enablement status of the control in the standard. UpdatedReason (string) --- The reason for updating the control's enablement status in the standard.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "UnprocessedAssociationUpdates",
          "type": "list",
          "description": "A security control (identified with SecurityControlId, SecurityControlArn, or a mix of both parameters) whose enablement status in a specified standard couldn't be updated.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "StandardsControlAssociationUpdate",
                  "type": "dict",
                  "description": "An array of control and standard associations for which an update failed when calling BatchUpdateStandardsControlAssociations.",
                  "nested_items": [
                    {
                      "name": "StandardsArn",
                      "type": "string",
                      "description": "The Amazon Resource Name (ARN) of the standard in which you want to update the control's enablement status.",
                      "nested_items": []
                    },
                    {
                      "name": "SecurityControlId",
                      "type": "string",
                      "description": "The unique identifier for the security control whose enablement status you want to update.",
                      "nested_items": []
                    },
                    {
                      "name": "AssociationStatus",
                      "type": "string",
                      "description": "The desired enablement status of the control in the standard.",
                      "nested_items": []
                    },
                    {
                      "name": "UpdatedReason",
                      "type": "string",
                      "description": "The reason for updating the control's enablement status in the standard.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "ErrorCode",
                  "type": "string",
                  "description": "The error code for the unprocessed update of the control's enablement status in the specified standard.",
                  "nested_items": []
                },
                {
                  "name": "ErrorReason",
                  "type": "string",
                  "description": "The reason why a control's enablement status in the specified standard couldn't be updated.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}