{
  "method_name": "batch_get_configuration_policy_associations",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/securityhub/client/batch_get_configuration_policy_associations.html",
  "description": "Returns associations between an Security Hub configuration and a batch of target accounts, organizational units, or the root. Only the Security Hub delegated administrator can invoke this operation from the home Region. A configuration can refer to a configuration policy or to a self-managed configuration.",
  "parameters": [
    {
      "name": "ConfigurationPolicyAssociationIdentifiers",
      "type": "list",
      "required": true,
      "description": "Specifies one or more target account IDs, organizational unit (OU) IDs, or the root ID to retrieve associations for. (dict) --- Provides details about the association between an Security Hub configuration and a target account, organizational unit, or the root. An association can exist between a target and a configuration policy, or between a target and self-managed behavior. Target (dict) --- The target account, organizational unit, or the root. AccountId (string) --- The Amazon Web Services account ID of the target account. OrganizationalUnitId (string) --- The organizational unit ID of the target organizational unit. RootId (string) --- The ID of the organization root.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ConfigurationPolicyAssociations",
          "type": "list",
          "description": "Describes associations for the target accounts, OUs, or the root.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ConfigurationPolicyId",
                  "type": "string",
                  "description": "The universally unique identifier (UUID) of the configuration policy.",
                  "nested_items": []
                },
                {
                  "name": "TargetId",
                  "type": "string",
                  "description": "The identifier of the target account, organizational unit, or the root.",
                  "nested_items": []
                },
                {
                  "name": "TargetType",
                  "type": "string",
                  "description": "Specifies whether the target is an Amazon Web Services account, organizational unit, or the root.",
                  "nested_items": []
                },
                {
                  "name": "AssociationType",
                  "type": "string",
                  "description": "Indicates whether the association between the specified target and the configuration was directly applied by the Security Hub delegated administrator or inherited from a parent.",
                  "nested_items": []
                },
                {
                  "name": "UpdatedAt",
                  "type": "datetime",
                  "description": "The date and time, in UTC and ISO 8601 format, that the configuration policy association was last updated.",
                  "nested_items": []
                },
                {
                  "name": "AssociationStatus",
                  "type": "string",
                  "description": "The current status of the association between the specified target and the configuration.",
                  "nested_items": []
                },
                {
                  "name": "AssociationStatusMessage",
                  "type": "string",
                  "description": "The explanation for a FAILED value for AssociationStatus.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "UnprocessedConfigurationPolicyAssociations",
          "type": "list",
          "description": "An array of configuration policy associations, one for each configuration policy association identifier, that was specified in the request but couldn't be processed due to an error.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ConfigurationPolicyAssociationIdentifiers",
                  "type": "dict",
                  "description": "Configuration policy association identifiers that were specified in a BatchGetConfigurationPolicyAssociations request but couldn't be processed due to an error.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "AccountId",
                          "type": "string",
                          "description": "The Amazon Web Services account ID of the target account.",
                          "nested_items": []
                        },
                        {
                          "name": "OrganizationalUnitId",
                          "type": "string",
                          "description": "The organizational unit ID of the target organizational unit.",
                          "nested_items": []
                        },
                        {
                          "name": "RootId",
                          "type": "string",
                          "description": "The ID of the organization root.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "ErrorCode",
                  "type": "string",
                  "description": "An HTTP status code that identifies why the configuration policy association failed.",
                  "nested_items": []
                },
                {
                  "name": "ErrorReason",
                  "type": "string",
                  "description": "A string that identifies why the configuration policy association failed.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}