{
  "method_name": "batch_update_findings",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/securityhub/client/batch_update_findings.html",
  "description": "Used by Security Hub customers to update information about their investigation into one or more findings. Requested by administrator accounts or member accounts. Administrator accounts can update findings for their account and their member accounts. A member account can update findings only for their own account. Administrator and member accounts can use this operation to update the following fields and objects for one or more findings: If you use this operation to update a finding, your updates don't affect the value for the UpdatedAt field of the finding. Also note that it can take several minutes for Security Hub to process your request and update each finding specified in the request. You can configure IAM policies to restrict access to fields and field values. For example, you might not want member accounts to be able to suppress findings or change the finding severity. For more information see Configuring access to BatchUpdateFindings in the Security Hub User Guide.",
  "parameters": [
    {
      "name": "FindingIdentifiers",
      "type": "list",
      "required": true,
      "description": "The list of findings to update. BatchUpdateFindings can be used to update up to 100 findings at a time. For each finding, the list provides the finding identifier and the ARN of the finding provider. (dict) --- Identifies which finding to get the finding history for. The identifier of the finding that was specified by the finding provider. The ARN generated by Security Hub that uniquely identifies a product that generates findings. This can be the ARN for a third-party product that is integrated with Security Hub, or the ARN for a custom integration.",
      "nested_params": [
        {
          "name": "Id",
          "type": "string",
          "required": false,
          "description": "The identifier of the finding that was specified by the finding provider.",
          "nested_params": []
        },
        {
          "name": "ProductArn",
          "type": "string",
          "required": false,
          "description": "The ARN generated by Security Hub that uniquely identifies a product that generates findings. This can be the ARN for a third-party product that is integrated with Security Hub, or the ARN for a custom integration.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Note",
      "type": "dict",
      "required": true,
      "description": "The updated note. The updated note text. The principal that updated the note.",
      "nested_params": [
        {
          "name": "Text",
          "type": "string",
          "required": false,
          "description": "The updated note text.",
          "nested_params": []
        },
        {
          "name": "UpdatedBy",
          "type": "string",
          "required": false,
          "description": "The principal that updated the note.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Severity",
      "type": "dict",
      "required": false,
      "description": "Used to update the finding severity. Normalized (integer) --- The normalized severity for the finding. This attribute is to be deprecated in favor of Label. If you provide Normalized and don't provide Label, Label is set automatically as follows. 0 - INFORMATIONAL 1---39 - LOW 40---69 - MEDIUM 70---89 - HIGH 90---100 - CRITICAL Product (float) --- The native severity as defined by the Amazon Web Services service or integrated partner product that generated the finding. Label (string) --- The severity value of the finding. The allowed values are the following. INFORMATIONAL - No issue was found. LOW - The issue does not require action on its own. MEDIUM - The issue must be addressed but not urgently. HIGH - The issue must be addressed as a priority. CRITICAL - The issue must be remediated immediately to avoid it escalating.",
      "nested_params": [
        {
          "name": "Normalized",
          "type": "integer",
          "required": false,
          "description": "The normalized severity for the finding. This attribute is to be deprecated in favor of Label. If you provide Normalized and don't provide Label, Label is set automatically as follows.",
          "nested_params": []
        },
        {
          "name": "Product",
          "type": "float",
          "required": false,
          "description": "The native severity as defined by the Amazon Web Services service or integrated partner product that generated the finding.",
          "nested_params": []
        },
        {
          "name": "Label",
          "type": "string",
          "required": false,
          "description": "The severity value of the finding. The allowed values are the following.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "VerificationState",
      "type": "string",
      "required": false,
      "description": "Indicates the veracity of a finding. The available values for VerificationState are as follows. UNKNOWN --- The default disposition of a security finding TRUE_POSITIVE --- The security finding is confirmed FALSE_POSITIVE --- The security finding was determined to be a false alarm BENIGN_POSITIVE --- A special case of TRUE_POSITIVE where the finding doesn't pose any threat, is expected, or both.",
      "nested_params": []
    },
    {
      "name": "Confidence",
      "type": "integer",
      "required": false,
      "description": "The updated value for the finding confidence. Confidence is defined as the likelihood that a finding accurately identifies the behavior or issue that it was intended to identify. Confidence is scored on a 0-100 basis using a ratio scale, where 0 means zero percent confidence and 100 means 100 percent confidence.",
      "nested_params": []
    },
    {
      "name": "Criticality",
      "type": "integer",
      "required": false,
      "description": "The updated value for the level of importance assigned to the resources associated with the findings. A score of 0 means that the underlying resources have no criticality, and a score of 100 is reserved for the most critical resources.",
      "nested_params": []
    },
    {
      "name": "Types",
      "type": "list",
      "required": false,
      "description": "One or more finding types in the format of namespace/category/classifier that classify a finding. Valid namespace values are as follows. Software and Configuration Checks TTPs Effects Unusual Behaviors Sensitive Data Identifications (string) ---",
      "nested_params": []
    },
    {
      "name": "UserDefinedFields",
      "type": "dict",
      "required": false,
      "description": "A list of name/value string pairs associated with the finding. These are custom, user-defined fields added to a finding. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "Workflow",
      "type": "dict",
      "required": false,
      "description": "Used to update the workflow status of a finding. The workflow status indicates the progress of the investigation into the finding. Status (string) --- The status of the investigation into the finding. The workflow status is specific to an individual finding. It does not affect the generation of new findings. For example, setting the workflow status to SUPPRESSED or RESOLVED does not prevent a new finding for the same issue. The allowed values are the following. NEW - The initial state of a finding, before it is reviewed. Security Hub also resets WorkFlowStatus from NOTIFIED or RESOLVED to NEW in the following cases: The record state changes from ARCHIVED to ACTIVE. The compliance status changes from PASSED to either WARNING, FAILED, or NOT_AVAILABLE. NOTIFIED - Indicates that you notified the resource owner about the security issue. Used when the initial reviewer is not the resource owner, and needs intervention from the resource owner. RESOLVED - The finding was reviewed and remediated and is now considered resolved. SUPPRESSED - Indicates that you reviewed the finding and don't believe that any action is needed. The finding is no longer updated.",
      "nested_params": [
        {
          "name": "Status",
          "type": "string",
          "required": false,
          "description": "The status of the investigation into the finding. The workflow status is specific to an individual finding. It does not affect the generation of new findings. For example, setting the workflow status to SUPPRESSED or RESOLVED does not prevent a new finding for the same issue. The allowed values are the following.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "RelatedFindings",
      "type": "list",
      "required": true,
      "description": "A list of findings that are related to the updated findings. (dict) --- Details about a related finding. The ARN of the product that generated a related finding. The product-generated identifier for a related finding.",
      "nested_params": [
        {
          "name": "ProductArn",
          "type": "string",
          "required": false,
          "description": "The ARN of the product that generated a related finding.",
          "nested_params": []
        },
        {
          "name": "Id",
          "type": "string",
          "required": false,
          "description": "The product-generated identifier for a related finding.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ProcessedFindings",
          "type": "list",
          "description": "The list of findings that were updated successfully.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Id",
                  "type": "string",
                  "description": "The identifier of the finding that was specified by the finding provider.",
                  "nested_items": []
                },
                {
                  "name": "ProductArn",
                  "type": "string",
                  "description": "The ARN generated by Security Hub that uniquely identifies a product that generates findings. This can be the ARN for a third-party product that is integrated with Security Hub, or the ARN for a custom integration.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "UnprocessedFindings",
          "type": "list",
          "description": "The list of findings that were not updated.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "FindingIdentifier",
                  "type": "dict",
                  "description": "The identifier of the finding that was not updated.",
                  "nested_items": [
                    {
                      "name": "Id",
                      "type": "string",
                      "description": "The identifier of the finding that was specified by the finding provider.",
                      "nested_items": []
                    },
                    {
                      "name": "ProductArn",
                      "type": "string",
                      "description": "The ARN generated by Security Hub that uniquely identifies a product that generates findings. This can be the ARN for a third-party product that is integrated with Security Hub, or the ARN for a custom integration.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "ErrorCode",
                  "type": "string",
                  "description": "The code associated with the error. Possible values are:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "ConcurrentUpdateError - Another request attempted to update the finding while this request was being processed. This error may also occur if you call BatchUpdateFindings and BatchImportFindings at the same time.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "DuplicatedFindingIdentifier - The request included two or more findings with the same FindingIdentifier.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "FindingNotFound - The FindingIdentifier included in the request did not match an existing finding.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "FindingSizeExceeded - The finding size was greater than the permissible value of 240 KB.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "InternalFailure - An internal service failure occurred when updating the finding.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "InvalidInput - The finding update contained an invalid value that did not satisfy the Amazon Web Services Security Finding Format syntax.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "ErrorMessage",
                  "type": "string",
                  "description": "The message associated with the error. Possible values are:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "Concurrent finding updates detected.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Finding Identifier is duplicated.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Finding Not Found.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Finding size exceeded 240 KB.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Internal service failure.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Invalid Input.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}