{
  "method_name": "get_configuration_policy_association",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/securityhub/client/get_configuration_policy_association.html",
  "description": "Returns the association between a configuration and a target account, organizational unit, or the root. The configuration can be a configuration policy or self-managed behavior. Only the Security Hub delegated administrator can invoke this operation from the home Region.",
  "parameters": [
    {
      "name": "Target",
      "type": "dict",
      "required": true,
      "description": "The target account ID, organizational unit ID, or the root ID to retrieve the association for. AccountId (string) --- The Amazon Web Services account ID of the target account. OrganizationalUnitId (string) --- The organizational unit ID of the target organizational unit. RootId (string) --- The ID of the organization root.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ConfigurationPolicyId",
          "type": "string",
          "description": "The universally unique identifier (UUID) of a configuration policy. For self-managed behavior, the value is SELF_MANAGED_SECURITY_HUB.",
          "nested_items": []
        },
        {
          "name": "TargetId",
          "type": "string",
          "description": "The target account ID, organizational unit ID, or the root ID for which the association is retrieved.",
          "nested_items": []
        },
        {
          "name": "TargetType",
          "type": "string",
          "description": "Specifies whether the target is an Amazon Web Services account, organizational unit, or the organization root.",
          "nested_items": []
        },
        {
          "name": "AssociationType",
          "type": "string",
          "description": "Indicates whether the association between the specified target and the configuration was directly applied by the Security Hub delegated administrator or inherited from a parent.",
          "nested_items": []
        },
        {
          "name": "UpdatedAt",
          "type": "datetime",
          "description": "The date and time, in UTC and ISO 8601 format, that the configuration policy association was last updated.",
          "nested_items": []
        },
        {
          "name": "AssociationStatus",
          "type": "string",
          "description": "The current status of the association between the specified target and the configuration.",
          "nested_items": []
        },
        {
          "name": "AssociationStatusMessage",
          "type": "string",
          "description": "The explanation for a FAILED value for AssociationStatus.",
          "nested_items": []
        }
      ]
    }
  ]
}