{
  "method_name": "list_members",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/securityhub/client/list_members.html",
  "description": "Lists details about all member accounts for the current Security Hub administrator account. The results include both member accounts that belong to an organization and member accounts that were invited manually.",
  "parameters": [
    {
      "name": "OnlyAssociated",
      "type": "boolean",
      "required": false,
      "description": "Specifies which member accounts to include in the response based on their relationship status with the administrator account. The default value is TRUE. If OnlyAssociated is set to TRUE, the response includes member accounts whose relationship status with the administrator account is set to ENABLED. If OnlyAssociated is set to FALSE, the response includes all existing member accounts.",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "The token that is required for pagination. On your first call to the ListMembers operation, set the value of this parameter to NULL. For subsequent calls to the operation, to continue listing data, set the value of this parameter to the value returned from the previous response.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Members",
          "type": "list",
          "description": "Member details returned by the operation.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "AccountId",
                  "type": "string",
                  "description": "The Amazon Web Services account ID of the member account.",
                  "nested_items": []
                },
                {
                  "name": "Email",
                  "type": "string",
                  "description": "The email address of the member account.",
                  "nested_items": []
                },
                {
                  "name": "MasterId",
                  "type": "string",
                  "description": "This is replaced by AdministratorID.",
                  "nested_items": []
                },
                {
                  "name": "AdministratorId",
                  "type": "string",
                  "description": "The Amazon Web Services account ID of the Security Hub administrator account associated with this member account.",
                  "nested_items": []
                },
                {
                  "name": "MemberStatus",
                  "type": "string",
                  "description": "The status of the relationship between the member account and its administrator account.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "Created - Indicates that the administrator account added the member account, but has not yet invited the member account.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Invited - Indicates that the administrator account invited the member account. The member account has not yet responded to the invitation.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Enabled - Indicates that the member account is currently active. For manually invited member accounts, indicates that the member account accepted the invitation.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Removed - Indicates that the administrator account disassociated the member account.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Resigned - Indicates that the member account disassociated themselves from the administrator account.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Deleted - Indicates that the administrator account deleted the member account.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "AccountSuspended - Indicates that an organization account was suspended from Amazon Web Services at the same time that the administrator account tried to enable the organization account as a member account.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "InvitedAt",
                  "type": "datetime",
                  "description": "A timestamp for the date and time when the invitation was sent to the member account.",
                  "nested_items": []
                },
                {
                  "name": "UpdatedAt",
                  "type": "datetime",
                  "description": "The timestamp for the date and time when the member account was updated.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The pagination token to use to request the next page of results.",
          "nested_items": []
        }
      ]
    }
  ]
}