{
  "method_name": "list_configuration_policy_associations",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/securityhub/client/list_configuration_policy_associations.html",
  "description": "Provides information about the associations for your configuration policies and self-managed behavior. Only the Security Hub delegated administrator can invoke this operation from the home Region.",
  "parameters": [
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "dict",
      "required": false,
      "description": "Options for filtering the ListConfigurationPolicyAssociations response. You can filter by the Amazon Resource Name (ARN) or universally unique identifier (UUID) of a configuration, AssociationType, or AssociationStatus. ConfigurationPolicyId (string) --- The ARN or UUID of the configuration policy. AssociationType (string) --- Indicates whether the association between a target and a configuration was directly applied by the Security Hub delegated administrator or inherited from a parent. AssociationStatus (string) --- The current status of the association between a target and a configuration policy.",
      "nested_params": [
        {
          "name": "ConfigurationPolicyId",
          "type": "string",
          "required": false,
          "description": "The ARN or UUID of the configuration policy.",
          "nested_params": []
        },
        {
          "name": "AssociationType",
          "type": "string",
          "required": false,
          "description": "Indicates whether the association between a target and a configuration was directly applied by the Security Hub delegated administrator or inherited from a parent.",
          "nested_params": []
        },
        {
          "name": "AssociationStatus",
          "type": "string",
          "required": false,
          "description": "The current status of the association between a target and a configuration policy.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ConfigurationPolicyAssociationSummaries",
          "type": "list",
          "description": "An object that contains the details of each configuration policy association that's returned in a ListConfigurationPolicyAssociations request.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ConfigurationPolicyId",
                  "type": "string",
                  "description": "The universally unique identifier (UUID) of the configuration policy.",
                  "nested_items": []
                },
                {
                  "name": "TargetId",
                  "type": "string",
                  "description": "The identifier of the target account, organizational unit, or the root.",
                  "nested_items": []
                },
                {
                  "name": "TargetType",
                  "type": "string",
                  "description": "Specifies whether the target is an Amazon Web Services account, organizational unit, or the root.",
                  "nested_items": []
                },
                {
                  "name": "AssociationType",
                  "type": "string",
                  "description": "Indicates whether the association between the specified target and the configuration was directly applied by the Security Hub delegated administrator or inherited from a parent.",
                  "nested_items": []
                },
                {
                  "name": "UpdatedAt",
                  "type": "datetime",
                  "description": "The date and time, in UTC and ISO 8601 format, that the configuration policy association was last updated.",
                  "nested_items": []
                },
                {
                  "name": "AssociationStatus",
                  "type": "string",
                  "description": "The current status of the association between the specified target and the configuration.",
                  "nested_items": []
                },
                {
                  "name": "AssociationStatusMessage",
                  "type": "string",
                  "description": "The explanation for a FAILED value for AssociationStatus.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The NextToken value to include in the next ListConfigurationPolicyAssociations request. When the results of a ListConfigurationPolicyAssociations request exceed MaxResults, this value can be used to retrieve the next page of results. This value is null when there are no more results to return.",
          "nested_items": []
        }
      ]
    }
  ]
}