{
  "method_name": "start_configuration_policy_disassociation",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/securityhub/client/start_configuration_policy_disassociation.html",
  "description": "Disassociates a target account, organizational unit, or the root from a specified configuration. When you disassociate a configuration from its target, the target inherits the configuration of the closest parent. If there's no configuration to inherit, the target retains its settings but becomes a self-managed account. A target can be disassociated from a configuration policy or self-managed behavior. Only the Security Hub delegated administrator can invoke this operation from the home Region.",
  "parameters": [
    {
      "name": "Target",
      "type": "dict",
      "required": false,
      "description": "The identifier of the target account, organizational unit, or the root to disassociate from the specified configuration. AccountId (string) --- The Amazon Web Services account ID of the target account. OrganizationalUnitId (string) --- The organizational unit ID of the target organizational unit. RootId (string) --- The ID of the organization root.",
      "nested_params": [
        {
          "name": "AccountId",
          "type": "string",
          "required": false,
          "description": "The Amazon Web Services account ID of the target account.",
          "nested_params": []
        },
        {
          "name": "OrganizationalUnitId",
          "type": "string",
          "required": false,
          "description": "The organizational unit ID of the target organizational unit.",
          "nested_params": []
        },
        {
          "name": "RootId",
          "type": "string",
          "required": false,
          "description": "The ID of the organization root.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ConfigurationPolicyIdentifier",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of a configuration policy, the universally unique identifier (UUID) of a configuration policy, or a value of SELF_MANAGED_SECURITY_HUB for a self-managed configuration.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}