{
  "method_name": "create_cache_parameter_group",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/elasticache/client/create_cache_parameter_group.html",
  "description": "Creates a new Amazon ElastiCache cache parameter group. An ElastiCache cache parameter group is a collection of parameters and their values that are applied to all of the nodes in any cluster or replication group using the CacheParameterGroup. A newly created CacheParameterGroup is an exact duplicate of the default parameter group for the CacheParameterGroupFamily. To customize the newly created CacheParameterGroup you can change the values of specific parameters. For more information, see:",
  "parameters": [
    {
      "name": "CacheParameterGroupName",
      "type": "string",
      "required": true,
      "description": "A user-specified name for the cache parameter group.",
      "nested_params": []
    },
    {
      "name": "CacheParameterGroupFamily",
      "type": "string",
      "required": true,
      "description": "The name of the cache parameter group family that the cache parameter group can be used with. Valid values are: valkey8 | valkey7 | memcached1.4 | memcached1.5 | memcached1.6 | redis2.6 | redis2.8 | redis3.2 | redis4.0 | redis5.0 | redis6.x | redis7",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": true,
      "description": "A user-specified description for the cache parameter group.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": false,
      "description": "A list of tags to be added to this resource. A tag is a key-value pair. A tag key must be accompanied by a tag value, although null is accepted. (dict) --- A tag that can be added to an ElastiCache cluster or replication group. Tags are composed of a Key/Value pair. You can use tags to categorize and track all your ElastiCache resources, with the exception of global replication group. When you add or remove tags on replication groups, those actions will be replicated to all nodes in the replication group. A tag with a null Value is permitted. Key (string) --- The key for the tag. May not be null. Value (string) --- The tag's value. May be null.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key for the tag. May not be null.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The tag's value. May be null.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "CacheParameterGroup",
          "type": "dict",
          "description": "Represents the output of a CreateCacheParameterGroup operation.",
          "nested_items": [
            {
              "name": "CacheParameterGroupName",
              "type": "string",
              "description": "The name of the cache parameter group.",
              "nested_items": []
            },
            {
              "name": "CacheParameterGroupFamily",
              "type": "string",
              "description": "The name of the cache parameter group family that this cache parameter group is compatible with.",
              "nested_items": []
            },
            {
              "name": "Description",
              "type": "string",
              "description": "The description for this cache parameter group.",
              "nested_items": []
            },
            {
              "name": "IsGlobal",
              "type": "boolean",
              "description": "Indicates whether the parameter group is associated with a Global datastore.",
              "nested_items": []
            },
            {
              "name": "ARN",
              "type": "string",
              "description": "The ARN (Amazon Resource Name) of the cache parameter group.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}