{
  "method_name": "decrease_node_groups_in_global_replication_group",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/elasticache/client/decrease_node_groups_in_global_replication_group.html",
  "description": "Decreases the number of node groups in a Global datastore.",
  "parameters": [
    {
      "name": "GlobalReplicationGroupId",
      "type": "string",
      "required": true,
      "description": "The name of the Global datastore.",
      "nested_params": []
    },
    {
      "name": "NodeGroupCount",
      "type": "integer",
      "required": true,
      "description": "The number of node groups (shards) that results from the modification of the shard configuration.",
      "nested_params": []
    },
    {
      "name": "GlobalNodeGroupsToRemove",
      "type": "list",
      "required": false,
      "description": "If the value of NodeGroupCount is less than the current number of node groups (shards), then either NodeGroupsToRemove or NodeGroupsToRetain is required. GlobalNodeGroupsToRemove is a list of NodeGroupIds to remove from the cluster. ElastiCache will attempt to remove all node groups listed by GlobalNodeGroupsToRemove from the cluster. (string) ---",
      "nested_params": []
    },
    {
      "name": "GlobalNodeGroupsToRetain",
      "type": "list",
      "required": false,
      "description": "If the value of NodeGroupCount is less than the current number of node groups (shards), then either NodeGroupsToRemove or NodeGroupsToRetain is required. GlobalNodeGroupsToRetain is a list of NodeGroupIds to retain from the cluster. ElastiCache will attempt to retain all node groups listed by GlobalNodeGroupsToRetain from the cluster. (string) ---",
      "nested_params": []
    },
    {
      "name": "ApplyImmediately",
      "type": "boolean",
      "required": true,
      "description": "Indicates that the shard reconfiguration process begins immediately. At present, the only permitted value for this parameter is true.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "GlobalReplicationGroup",
          "type": "dict",
          "description": "Consists of a primary cluster that accepts writes and an associated secondary cluster that resides in a different Amazon region. The secondary cluster accepts only reads. The primary cluster automatically replicates updates to the secondary cluster.",
          "nested_items": [
            {
              "name": "GlobalReplicationGroupIdSuffix",
              "type": "",
              "description": "",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}