{
  "method_name": "export_serverless_cache_snapshot",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/elasticache/client/export_serverless_cache_snapshot.html",
  "description": "Provides the functionality to export the serverless cache snapshot data to Amazon S3. Available for Valkey and Redis OSS only.",
  "parameters": [
    {
      "name": "ServerlessCacheSnapshotName",
      "type": "string",
      "required": true,
      "description": "The identifier of the serverless cache snapshot to be exported to S3. Available for Valkey and Redis OSS only.",
      "nested_params": []
    },
    {
      "name": "S3BucketName",
      "type": "string",
      "required": true,
      "description": "Name of the Amazon S3 bucket to export the snapshot to. The Amazon S3 bucket must also be in same region as the snapshot. Available for Valkey and Redis OSS only.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ServerlessCacheSnapshot",
          "type": "dict",
          "description": "The state of a serverless cache at a specific point in time, to the millisecond. Available for Valkey, Redis OSS and Serverless Memcached only.",
          "nested_items": [
            {
              "name": "ServerlessCacheSnapshotName",
              "type": "string",
              "description": "The identifier of a serverless cache snapshot. Available for Valkey, Redis OSS and Serverless Memcached only.",
              "nested_items": []
            },
            {
              "name": "ARN",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of a serverless cache snapshot. Available for Valkey, Redis OSS and Serverless Memcached only.",
              "nested_items": []
            },
            {
              "name": "KmsKeyId",
              "type": "string",
              "description": "The ID of the Amazon Web Services Key Management Service (KMS) key of a serverless cache snapshot. Available for Valkey, Redis OSS and Serverless Memcached only.",
              "nested_items": []
            },
            {
              "name": "SnapshotType",
              "type": "string",
              "description": "The type of snapshot of serverless cache. Available for Valkey, Redis OSS and Serverless Memcached only.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The current status of the serverless cache. Available for Valkey, Redis OSS and Serverless Memcached only.",
              "nested_items": []
            },
            {
              "name": "CreateTime",
              "type": "datetime",
              "description": "The date and time that the source serverless cache's metadata and cache data set was obtained for the snapshot. Available for Valkey, Redis OSS and Serverless Memcached only.",
              "nested_items": []
            },
            {
              "name": "ExpiryTime",
              "type": "datetime",
              "description": "The time that the serverless cache snapshot will expire. Available for Valkey, Redis OSS and Serverless Memcached only.",
              "nested_items": []
            },
            {
              "name": "BytesUsedForCache",
              "type": "string",
              "description": "The total size of a serverless cache snapshot, in bytes. Available for Valkey, Redis OSS and Serverless Memcached only.",
              "nested_items": []
            },
            {
              "name": "ServerlessCacheConfiguration",
              "type": "dict",
              "description": "The configuration of the serverless cache, at the time the snapshot was taken. Available for Valkey, Redis OSS and Serverless Memcached only.",
              "nested_items": [
                {
                  "name": "ServerlessCacheName",
                  "type": "string",
                  "description": "The identifier of a serverless cache.",
                  "nested_items": []
                },
                {
                  "name": "Engine",
                  "type": "string",
                  "description": "The engine that the serverless cache is configured with.",
                  "nested_items": []
                },
                {
                  "name": "MajorEngineVersion",
                  "type": "string",
                  "description": "The engine version number that the serverless cache is configured with.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}