{
  "method_name": "disassociate_assets",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iotsitewise/client/disassociate_assets.html",
  "description": "Disassociates a child asset from the given parent asset through a hierarchy defined in the parent asset's model.",
  "parameters": [
    {
      "name": "assetId",
      "type": "string",
      "required": true,
      "description": "The ID of the parent asset from which to disassociate the child asset. This can be either the actual ID in UUID format, or else externalId: followed by the external ID, if it has one. For more information, see Referencing objects with external IDs in the IoT SiteWise User Guide.",
      "nested_params": []
    },
    {
      "name": "hierarchyId",
      "type": "string",
      "required": true,
      "description": "The ID of a hierarchy in the parent asset's model. (This can be either the actual ID in UUID format, or else externalId: followed by the external ID, if it has one. For more information, see Referencing objects with external IDs in the IoT SiteWise User Guide.) Hierarchies allow different groupings of assets to be formed that all come from the same asset model. You can use the hierarchy ID to identify the correct asset to disassociate. For more information, see Asset hierarchies in the IoT SiteWise User Guide.",
      "nested_params": []
    },
    {
      "name": "childAssetId",
      "type": "string",
      "required": true,
      "description": "The ID of the child asset to disassociate. This can be either the actual ID in UUID format, or else externalId: followed by the external ID, if it has one. For more information, see Referencing objects with external IDs in the IoT SiteWise User Guide.",
      "nested_params": []
    },
    {
      "name": "clientToken",
      "type": "string",
      "required": false,
      "description": "A unique case-sensitive identifier that you can provide to ensure the idempotency of the request. Don't reuse this client token if a new idempotent request is required. This field is autopopulated if not provided.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}