{
  "method_name": "clone_stack",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/opsworks/client/clone_stack.html",
  "description": "Creates a clone of a specified stack. For more information, see Clone a Stack. By default, all parameters are set to the values used by the parent stack. Required Permissions: To use this action, an IAM user must have an attached policy that explicitly grants permissions. For more information about user permissions, see Managing User Permissions.",
  "parameters": [
    {
      "name": "SourceStackId",
      "type": "string",
      "required": true,
      "description": "The source stack ID.",
      "nested_params": []
    },
    {
      "name": "Name",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Region",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "VpcId",
      "type": "string",
      "required": false,
      "description": "The ID of the VPC that the cloned stack is to be launched into. It must be in the specified region. All instances are launched into this VPC, and you cannot change the ID later. If your account supports EC2 Classic, the default value is no VPC. If your account does not support EC2 Classic, the default value is the default VPC for the specified region. If the VPC ID corresponds to a default VPC and you have specified either the DefaultAvailabilityZone or the DefaultSubnetId parameter only, OpsWorks Stacks infers the value of the other parameter. If you specify neither parameter, OpsWorks Stacks sets these parameters to the first valid Availability Zone for the specified region and the corresponding default VPC subnet ID, respectively. If you specify a nondefault VPC ID, note the following: It must belong to a VPC in your account that is in the specified region. You must specify a value for DefaultSubnetId. For more information about how to use OpsWorks Stacks with a VPC, see Running a Stack in a VPC. For more information about default VPC and EC2 Classic, see Supported Platforms.",
      "nested_params": []
    },
    {
      "name": "Attributes",
      "type": "dict",
      "required": false,
      "description": "A list of stack attributes and values as key/value pairs to be added to the cloned stack. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "ServiceRoleArn",
      "type": "string",
      "required": true,
      "description": "The stack Identity and Access Management (IAM) role, which allows OpsWorks Stacks to work with Amazon Web Services resources on your behalf. You must set this parameter to the Amazon Resource Name (ARN) for an existing IAM role. If you create a stack by using the OpsWorkss Stacks console, it creates the role for you. You can obtain an existing stack's IAM ARN programmatically by calling  DescribePermissions. For more information about IAM ARNs, see Using Identifiers.",
      "nested_params": []
    },
    {
      "name": "DefaultInstanceProfileArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DefaultOs",
      "type": "string",
      "required": false,
      "description": "The stack's operating system, which must be set to one of the following. A supported Linux operating system: An Amazon Linux version, such as Amazon Linux 2, Amazon Linux 2018.03, Amazon Linux 2017.09, Amazon Linux 2017.03, Amazon Linux 2016.09, Amazon Linux 2016.03, Amazon Linux 2015.09, or Amazon Linux 2015.03. A supported Ubuntu operating system, such as Ubuntu 18.04 LTS, Ubuntu 16.04 LTS, Ubuntu 14.04 LTS, or Ubuntu 12.04 LTS. CentOS Linux 7 Red Hat Enterprise Linux 7 Microsoft Windows Server 2012 R2 Base, Microsoft Windows Server 2012 R2 with SQL Server Express, Microsoft Windows Server 2012 R2 with SQL Server Standard, or Microsoft Windows Server 2012 R2 with SQL Server Web. A custom AMI: Custom. You specify the custom AMI you want to use when you create instances. For more information about how to use custom AMIs with OpsWorks, see Using Custom AMIs. The default option is the parent stack's operating system. Not all operating systems are supported with all versions of Chef. For more information about supported operating systems, see OpsWorks Stacks Operating Systems.",
      "nested_params": []
    },
    {
      "name": "HostnameTheme",
      "type": "string",
      "required": false,
      "description": "The stack's host name theme, with spaces are replaced by underscores. The theme is used to generate host names for the stack's instances. By default, HostnameTheme is set to Layer_Dependent, which creates host names by appending integers to the layer's short name. The other themes are: Baked_Goods Clouds Europe_Cities Fruits Greek_Deities_and_Titans Legendary_creatures_from_Japan Planets_and_Moons Roman_Deities Scottish_Islands US_Cities Wild_Cats To obtain a generated host name, call GetHostNameSuggestion, which returns a host name based on the current theme.",
      "nested_params": []
    },
    {
      "name": "DefaultAvailabilityZone",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DefaultSubnetId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "CustomJson",
      "type": "string",
      "required": false,
      "description": "A string that contains user-defined, custom JSON. It is used to override the corresponding default stack configuration JSON values. The string should be in the following format: \"{\\\"key1\\\": \\\"value1\\\", \\\"key2\\\": \\\"value2\\\",...}\" For more information about custom JSON, see Use Custom JSON to Modify the Stack Configuration Attributes.",
      "nested_params": []
    },
    {
      "name": "ConfigurationManager",
      "type": "dict",
      "required": false,
      "description": "The configuration manager. When you clone a stack we recommend that you use the configuration manager to specify the Chef version: 12, 11.10, or 11.4 for Linux stacks, or 12.2 for Windows stacks. The default value for Linux stacks is currently 12. Name (string) --- The name. This parameter must be set to Chef. Version (string) --- The Chef version. This parameter must be set to 12, 11.10, or 11.4 for Linux stacks, and to 12.2 for Windows stacks. The default value for Linux stacks is 12.",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name. This parameter must be set to Chef.",
          "nested_params": []
        },
        {
          "name": "Version",
          "type": "string",
          "required": false,
          "description": "The Chef version. This parameter must be set to 12, 11.10, or 11.4 for Linux stacks, and to 12.2 for Windows stacks. The default value for Linux stacks is 12.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ChefConfiguration",
      "type": "dict",
      "required": false,
      "description": "A ChefConfiguration object that specifies whether to enable Berkshelf and the Berkshelf version on Chef 11.10 stacks. For more information, see Create a New Stack. ManageBerkshelf (boolean) --- Whether to enable Berkshelf. BerkshelfVersion (string) --- The Berkshelf version.",
      "nested_params": [
        {
          "name": "ManageBerkshelf",
          "type": "boolean",
          "required": false,
          "description": "Whether to enable Berkshelf.",
          "nested_params": []
        },
        {
          "name": "BerkshelfVersion",
          "type": "string",
          "required": false,
          "description": "The Berkshelf version.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "UseCustomCookbooks",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "UseOpsworksSecurityGroups",
      "type": "boolean",
      "required": false,
      "description": "Whether to associate the OpsWorks Stacks built-in security groups with the stack's layers. OpsWorks Stacks provides a standard set of security groups, one for each layer, which are associated with layers by default. With UseOpsworksSecurityGroups you can instead provide your own custom security groups. UseOpsworksSecurityGroups has the following settings: True - OpsWorks Stacks automatically associates the appropriate built-in security group with each layer (default setting). You can associate additional security groups with a layer after you create it but you cannot delete the built-in security group. False - OpsWorks Stacks does not associate built-in security groups with layers. You must create appropriate Amazon EC2 security groups and associate a security group with each layer that you create. However, you can still manually associate a built-in security group with a layer on creation; custom security groups are required only for those layers that need custom settings. For more information, see Create a New Stack.",
      "nested_params": []
    },
    {
      "name": "CustomCookbooksSource",
      "type": "dict",
      "required": false,
      "description": "Contains the information required to retrieve an app or cookbook from a repository. For more information, see Adding Apps or Cookbooks and Recipes. Type (string) --- The repository type. Url (string) --- The source URL. The following is an example of an Amazon S3 source URL: https://s3.amazonaws.com/opsworks-demo-bucket/opsworks_cookbook_demo.tar.gz. Username (string) --- This parameter depends on the repository type. For Amazon S3 bundles, set Username to the appropriate IAM access key ID. For HTTP bundles, Git repositories, and Subversion repositories, set Username to the user name. Password (string) --- When included in a request, the parameter depends on the repository type. For Amazon S3 bundles, set Password to the appropriate IAM secret access key. For HTTP bundles and Subversion repositories, set Password to the password. For more information on how to safely handle IAM credentials, see https://docs.aws.amazon.com/general/latest/gr/aws-access-keys-best-practices.html. In responses, OpsWorks Stacks returns *****FILTERED***** instead of the actual value. SshKey (string) --- In requests, the repository's SSH key. Revision (string) --- The application's version. OpsWorks Stacks enables you to easily deploy new versions of an application. One of the simplest approaches is to have branches or revisions in your repository that represent different versions that can potentially be deployed.",
      "nested_params": [
        {
          "name": "Type",
          "type": "string",
          "required": false,
          "description": "The repository type.",
          "nested_params": []
        },
        {
          "name": "Url",
          "type": "string",
          "required": false,
          "description": "The source URL. The following is an example of an Amazon S3 source URL: https://s3.amazonaws.com/opsworks-demo-bucket/opsworks_cookbook_demo.tar.gz.",
          "nested_params": []
        },
        {
          "name": "Username",
          "type": "string",
          "required": false,
          "description": "This parameter depends on the repository type.",
          "nested_params": []
        },
        {
          "name": "Password",
          "type": "string",
          "required": false,
          "description": "When included in a request, the parameter depends on the repository type.",
          "nested_params": []
        },
        {
          "name": "SshKey",
          "type": "string",
          "required": false,
          "description": "In requests, the repository's SSH key. In responses, OpsWorks Stacks returns *****FILTERED***** instead of the actual value.",
          "nested_params": []
        },
        {
          "name": "Revision",
          "type": "string",
          "required": false,
          "description": "The application's version. OpsWorks Stacks enables you to easily deploy new versions of an application. One of the simplest approaches is to have branches or revisions in your repository that represent different versions that can potentially be deployed.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "DefaultSshKeyName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ClonePermissions",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "CloneAppIds",
      "type": "list",
      "required": false,
      "description": "A list of source stack app IDs to be included in the cloned stack. (string) ---",
      "nested_params": []
    },
    {
      "name": "DefaultRootDeviceType",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "AgentVersion",
      "type": "string",
      "required": false,
      "description": "The default OpsWorks Stacks agent version. You have the following options: Auto-update - Set this parameter to LATEST. OpsWorks Stacks automatically installs new agent versions on the stack's instances as soon as they are available. Fixed version - Set this parameter to your preferred agent version. To update the agent version, you must edit the stack configuration and specify a new version. OpsWorks Stacks automatically installs that version on the stack's instances. The default setting is LATEST. To specify an agent version, you must use the complete version number, not the abbreviated number shown on the console. For a list of available agent version numbers, call  DescribeAgentVersions. AgentVersion cannot be set to Chef 12.2.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "StackId",
          "type": "string",
          "description": "The cloned stack ID.",
          "nested_items": []
        }
      ]
    }
  ]
}