{
  "method_name": "create_deployment",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/opsworks/client/create_deployment.html",
  "description": "Runs deployment or stack commands. For more information, see Deploying Apps and Run Stack Commands. Required Permissions: To use this action, an IAM user must have a Deploy or Manage permissions level for the stack, or an attached policy that explicitly grants permissions. For more information on user permissions, see Managing User Permissions.",
  "parameters": [
    {
      "name": "StackId",
      "type": "string",
      "required": true,
      "description": "The stack ID.",
      "nested_params": []
    },
    {
      "name": "AppId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "InstanceIds",
      "type": "list",
      "required": false,
      "description": "The instance IDs for the deployment targets. (string) ---",
      "nested_params": []
    },
    {
      "name": "LayerIds",
      "type": "list",
      "required": false,
      "description": "The layer IDs for the deployment targets. (string) ---",
      "nested_params": []
    },
    {
      "name": "Command",
      "type": "dict",
      "required": true,
      "description": "A DeploymentCommand object that specifies the deployment command and any associated arguments. Specifies the operation. You can specify only one command. For stacks, the following commands are available: execute_recipes: Execute one or more recipes. To specify the recipes, set an Args parameter named recipes to the list of recipes to be executed. For example, to execute phpapp::appsetup, set Args to {\"recipes\":[\"phpapp::appsetup\"]}. install_dependencies: Install the stack's dependencies. update_custom_cookbooks: Update the stack's custom cookbooks. update_dependencies: Update the stack's dependencies. For apps, the following commands are available: deploy: Deploy an app. Ruby on Rails apps have an optional Args parameter named migrate. Set Args to {'migrate':['true']} to migrate the database. The default setting is {'migrate':['false']}. rollback Roll the app back to the previous version. When you update an app, OpsWorks Stacks stores the previous version, up to a maximum of five versions. You can use this command to roll an app back as many as four versions. start: Start the app's web or application server. stop: Stop the app's web or application server. restart: Restart the app's web or application server. undeploy: Undeploy the app. Args (dict) --- The arguments of those commands that take arguments. It should be set to a JSON object with the following format: {\"arg_name1\" : [\"value1\", \"value2\", ...], \"arg_name2\" : [\"value1\", \"value2\", ...], ...} The update_dependencies command takes two arguments: upgrade_os_to - Specifies the Amazon Linux version that you want instances to run, such as Amazon Linux 2. You must also set the allow_reboot argument to true. allow_reboot - Specifies whether to allow OpsWorks Stacks to reboot the instances if necessary, after installing the updates. This argument can be set to either true or false. The default value is false. For example, to upgrade an instance to Amazon Linux 2018.03, set Args to the following. { \"upgrade_os_to\":[\"Amazon Linux 2018.03\"], \"allow_reboot\":[\"true\"] } (string) --- (list) --- (string) ---",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "Specifies the operation. You can specify only one command. For stacks, the following commands are available:",
          "nested_params": []
        },
        {
          "name": "Args",
          "type": "dict",
          "required": false,
          "description": "The arguments of those commands that take arguments. It should be set to a JSON object with the following format: {\"arg_name1\" : [\"value1\", \"value2\", ...], \"arg_name2\" : [\"value1\", \"value2\", ...], ...} The update_dependencies command takes two arguments:",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Comment",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "CustomJson",
      "type": "string",
      "required": false,
      "description": "A string that contains user-defined, custom JSON. You can use this parameter to override some corresponding default stack configuration JSON values. The string should be in the following format: \"{\\\"key1\\\": \\\"value1\\\", \\\"key2\\\": \\\"value2\\\",...}\" For more information about custom JSON, see Use Custom JSON to Modify the Stack Configuration Attributes and Overriding Attributes With Custom JSON.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "DeploymentId",
          "type": "string",
          "description": "The deployment ID, which can be used with other requests to identify the deployment.",
          "nested_items": []
        }
      ]
    }
  ]
}