{
  "method_name": "add_association",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sagemaker/client/add_association.html",
  "description": "Creates an association between the source and the destination. A source can be associated with multiple destinations, and a destination can be associated with multiple sources. An association is a lineage tracking entity. For more information, see Amazon SageMaker ML Lineage Tracking.",
  "parameters": [
    {
      "name": "SourceArn",
      "type": "string",
      "required": true,
      "description": "The ARN of the source.",
      "nested_params": []
    },
    {
      "name": "DestinationArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the destination.",
      "nested_params": []
    },
    {
      "name": "AssociationType",
      "type": "string",
      "required": false,
      "description": "The type of association. The following are suggested uses for each type. Amazon SageMaker places no restrictions on their use. ContributedTo - The source contributed to the destination or had a part in enabling the destination. For example, the training data contributed to the training job. AssociatedWith - The source is connected to the destination. For example, an approval workflow is associated with a model deployment. DerivedFrom - The destination is a modification of the source. For example, a digest output of a channel input for a processing job is derived from the original inputs. Produced - The source generated the destination. For example, a training job produced a model artifact.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "SourceArn",
          "type": "string",
          "description": "The ARN of the source.",
          "nested_items": []
        },
        {
          "name": "DestinationArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the destination.",
          "nested_items": []
        }
      ]
    }
  ]
}