{
  "method_name": "create_project",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sagemaker/client/create_project.html",
  "description": "Creates a machine learning (ML) project that can contain one or more templates that set up an ML pipeline from training to deploying an approved model.",
  "parameters": [
    {
      "name": "ProjectName",
      "type": "string",
      "required": true,
      "description": "The name of the project.",
      "nested_params": []
    },
    {
      "name": "ProjectDescription",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ServiceCatalogProvisioningDetails",
      "type": "dict",
      "required": true,
      "description": "The product ID and provisioning artifact ID to provision a service catalog. The provisioning artifact ID will default to the latest provisioning artifact ID of the product, if you don't provide the provisioning artifact ID. For more information, see What is Amazon Web Services Service Catalog. The ID of the product to provision. ProvisioningArtifactId (string) --- The ID of the provisioning artifact. PathId (string) --- The path identifier of the product. This value is optional if the product has a default path, and required if the product has more than one path. ProvisioningParameters (list) --- A list of key value pairs that you specify when you provision a product. (dict) --- A key value pair used when you provision a project as a service catalog product. For information, see What is Amazon Web Services Service Catalog. Key (string) --- The key that identifies a provisioning parameter. Value (string) --- The value of the provisioning parameter.",
      "nested_params": [
        {
          "name": "ProductId",
          "type": "string",
          "required": false,
          "description": "The ID of the product to provision.",
          "nested_params": []
        },
        {
          "name": "ProvisioningArtifactId",
          "type": "string",
          "required": false,
          "description": "The ID of the provisioning artifact.",
          "nested_params": []
        },
        {
          "name": "PathId",
          "type": "string",
          "required": false,
          "description": "The path identifier of the product. This value is optional if the product has a default path, and required if the product has more than one path.",
          "nested_params": []
        },
        {
          "name": "ProvisioningParameters",
          "type": "list",
          "required": false,
          "description": "A list of key value pairs that you specify when you provision a product.",
          "nested_params": [
            {
              "name": "Key",
              "type": "string",
              "required": false,
              "description": "The key that identifies a provisioning parameter.",
              "nested_params": []
            },
            {
              "name": "Value",
              "type": "string",
              "required": false,
              "description": "The value of the provisioning parameter.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "An array of key-value pairs that you want to use to organize and track your Amazon Web Services resource costs. For more information, see Tagging Amazon Web Services resources in the Amazon Web Services General Reference Guide. (dict) --- A tag object that consists of a key and an optional value, used to manage metadata for SageMaker Amazon Web Services resources. You can add tags to notebook instances, training jobs, hyperparameter tuning jobs, batch transform jobs, models, labeling jobs, work teams, endpoint configurations, and endpoints. For more information on adding tags to SageMaker resources, see AddTags. For more information on adding metadata to your Amazon Web Services resources with tagging, see Tagging Amazon Web Services resources. For advice on best practices for managing Amazon Web Services resources with tagging, see Tagging Best Practices: Implement an Effective Amazon Web Services Resource Tagging Strategy. The tag key. Tag keys must be unique per resource. The tag value.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The tag key. Tag keys must be unique per resource.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The tag value.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "TemplateProviders",
      "type": "list",
      "required": true,
      "description": "An array of template provider configurations for creating infrastructure resources for the project. (dict) --- Contains configuration details for a template provider. Only one type of template provider can be specified. CfnTemplateProvider (dict) --- The CloudFormation template provider configuration for creating infrastructure resources. A unique identifier for the template within the project. The Amazon S3 URL of the CloudFormation template. RoleARN (string) --- The IAM role that CloudFormation assumes when creating the stack. Parameters (list) --- An array of CloudFormation stack parameters. (dict) --- A key-value pair that represents a parameter for the CloudFormation stack. The name of the CloudFormation parameter. Value (string) --- The value of the CloudFormation parameter.",
      "nested_params": [
        {
          "name": "CfnTemplateProvider",
          "type": "dict",
          "required": false,
          "description": "The CloudFormation template provider configuration for creating infrastructure resources.",
          "nested_params": [
            {
              "name": "TemplateName",
              "type": "string",
              "required": false,
              "description": "A unique identifier for the template within the project.",
              "nested_params": []
            },
            {
              "name": "TemplateURL",
              "type": "string",
              "required": false,
              "description": "The Amazon S3 URL of the CloudFormation template.",
              "nested_params": []
            },
            {
              "name": "RoleARN",
              "type": "string",
              "required": false,
              "description": "The IAM role that CloudFormation assumes when creating the stack.",
              "nested_params": []
            },
            {
              "name": "Parameters",
              "type": "list",
              "required": false,
              "description": "An array of CloudFormation stack parameters.",
              "nested_params": [
                {
                  "name": "Key",
                  "type": "string",
                  "required": false,
                  "description": "The name of the CloudFormation parameter.",
                  "nested_params": []
                },
                {
                  "name": "Value",
                  "type": "string",
                  "required": false,
                  "description": "The value of the CloudFormation parameter.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ProjectArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the project.",
          "nested_items": []
        },
        {
          "name": "ProjectId",
          "type": "string",
          "description": "The ID of the new project.",
          "nested_items": []
        }
      ]
    }
  ]
}