{
  "method_name": "create_edge_deployment_plan",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sagemaker/client/create_edge_deployment_plan.html",
  "description": "Creates an edge deployment plan, consisting of multiple stages. Each stage may have a different deployment configuration and devices.",
  "parameters": [
    {
      "name": "EdgeDeploymentPlanName",
      "type": "string",
      "required": true,
      "description": "The name of the edge deployment plan.",
      "nested_params": []
    },
    {
      "name": "ModelConfigs",
      "type": "list",
      "required": true,
      "description": "List of models associated with the edge deployment plan. (dict) --- Contains information about the configuration of a model in a deployment. The name the device application uses to reference this model. The edge packaging job associated with this deployment.",
      "nested_params": [
        {
          "name": "ModelHandle",
          "type": "string",
          "required": false,
          "description": "The name the device application uses to reference this model.",
          "nested_params": []
        },
        {
          "name": "EdgePackagingJobName",
          "type": "string",
          "required": false,
          "description": "The edge packaging job associated with this deployment.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "DeviceFleetName",
      "type": "string",
      "required": true,
      "description": "The device fleet used for this edge deployment plan.",
      "nested_params": []
    },
    {
      "name": "Stages",
      "type": "list",
      "required": true,
      "description": "List of stages of the edge deployment plan. The number of stages is limited to 10 per deployment. (dict) --- Contains information about a stage in an edge deployment plan. The name of the stage. Configuration of the devices in the stage. Type of device subsets to deploy to the current stage. Percentage (integer) --- Percentage of devices in the fleet to deploy to the current stage. DeviceNames (list) --- List of devices chosen to deploy. (string) --- DeviceNameContains (string) --- A filter to select devices with names containing this name. DeploymentConfig (dict) --- Configuration of the deployment details. Toggle that determines whether to rollback to previous configuration if the current deployment fails. By default this is turned on. You may turn this off if you want to investigate the errors yourself.",
      "nested_params": [
        {
          "name": "StageName",
          "type": "string",
          "required": false,
          "description": "The name of the stage.",
          "nested_params": []
        },
        {
          "name": "DeviceSelectionConfig",
          "type": "dict",
          "required": false,
          "description": "Configuration of the devices in the stage.",
          "nested_params": [
            {
              "name": "DeviceSubsetType",
              "type": "string",
              "required": false,
              "description": "Type of device subsets to deploy to the current stage.",
              "nested_params": []
            },
            {
              "name": "Percentage",
              "type": "integer",
              "required": false,
              "description": "Percentage of devices in the fleet to deploy to the current stage.",
              "nested_params": []
            },
            {
              "name": "DeviceNames",
              "type": "list",
              "required": false,
              "description": "List of devices chosen to deploy.",
              "nested_params": []
            },
            {
              "name": "DeviceNameContains",
              "type": "string",
              "required": false,
              "description": "A filter to select devices with names containing this name.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "DeploymentConfig",
          "type": "dict",
          "required": false,
          "description": "Configuration of the deployment details.",
          "nested_params": [
            {
              "name": "FailureHandlingPolicy",
              "type": "string",
              "required": false,
              "description": "Toggle that determines whether to rollback to previous configuration if the current deployment fails. By default this is turned on. You may turn this off if you want to investigate the errors yourself.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "List of tags with which to tag the edge deployment plan. (dict) --- A tag object that consists of a key and an optional value, used to manage metadata for SageMaker Amazon Web Services resources. You can add tags to notebook instances, training jobs, hyperparameter tuning jobs, batch transform jobs, models, labeling jobs, work teams, endpoint configurations, and endpoints. For more information on adding tags to SageMaker resources, see AddTags. For more information on adding metadata to your Amazon Web Services resources with tagging, see Tagging Amazon Web Services resources. For advice on best practices for managing Amazon Web Services resources with tagging, see Tagging Best Practices: Implement an Effective Amazon Web Services Resource Tagging Strategy. The tag key. Tag keys must be unique per resource. The tag value.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The tag key. Tag keys must be unique per resource.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The tag value.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "EdgeDeploymentPlanArn",
          "type": "string",
          "description": "The ARN of the edge deployment plan.",
          "nested_items": []
        }
      ]
    }
  ]
}