{
  "method_name": "create_trial",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sagemaker/client/create_trial.html",
  "description": "Creates an SageMaker trial. A trial is a set of steps called trial components that produce a machine learning model. A trial is part of a single SageMaker experiment. When you use SageMaker Studio or the SageMaker Python SDK, all experiments, trials, and trial components are automatically tracked, logged, and indexed. When you use the Amazon Web Services SDK for Python (Boto), you must use the logging APIs provided by the SDK. You can add tags to a trial and then use the Search API to search for the tags. To get a list of all your trials, call the ListTrials API. To view a trial's properties, call the DescribeTrial API. To create a trial component, call the CreateTrialComponent API.",
  "parameters": [
    {
      "name": "TrialName",
      "type": "string",
      "required": true,
      "description": "The name of the trial. The name must be unique in your Amazon Web Services account and is not case-sensitive.",
      "nested_params": []
    },
    {
      "name": "DisplayName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ExperimentName",
      "type": "string",
      "required": true,
      "description": "The name of the experiment to associate the trial with.",
      "nested_params": []
    },
    {
      "name": "MetadataProperties",
      "type": "dict",
      "required": false,
      "description": "Metadata properties of the tracking entity, trial, or trial component. CommitId (string) --- The commit ID. Repository (string) --- The repository. GeneratedBy (string) --- The entity this entity was generated by. ProjectId (string) --- The project ID.",
      "nested_params": [
        {
          "name": "CommitId",
          "type": "string",
          "required": false,
          "description": "The commit ID.",
          "nested_params": []
        },
        {
          "name": "Repository",
          "type": "string",
          "required": false,
          "description": "The repository.",
          "nested_params": []
        },
        {
          "name": "GeneratedBy",
          "type": "string",
          "required": false,
          "description": "The entity this entity was generated by.",
          "nested_params": []
        },
        {
          "name": "ProjectId",
          "type": "string",
          "required": false,
          "description": "The project ID.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "A list of tags to associate with the trial. You can use Search API to search on the tags. (dict) --- A tag object that consists of a key and an optional value, used to manage metadata for SageMaker Amazon Web Services resources. You can add tags to notebook instances, training jobs, hyperparameter tuning jobs, batch transform jobs, models, labeling jobs, work teams, endpoint configurations, and endpoints. For more information on adding tags to SageMaker resources, see AddTags. For more information on adding metadata to your Amazon Web Services resources with tagging, see Tagging Amazon Web Services resources. For advice on best practices for managing Amazon Web Services resources with tagging, see Tagging Best Practices: Implement an Effective Amazon Web Services Resource Tagging Strategy. The tag key. Tag keys must be unique per resource. The tag value.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The tag key. Tag keys must be unique per resource.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The tag value.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "TrialArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the trial.",
          "nested_items": []
        }
      ]
    }
  ]
}