{
  "method_name": "create_optimization_job",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sagemaker/client/create_optimization_job.html",
  "description": "Creates a job that optimizes a model for inference performance. To create the job, you provide the location of a source model, and you provide the settings for the optimization techniques that you want the job to apply. When the job completes successfully, SageMaker uploads the new optimized model to the output destination that you specify. For more information about how to use this action, and about the supported optimization techniques, see Optimize model inference with Amazon SageMaker.",
  "parameters": [
    {
      "name": "OptimizationJobName",
      "type": "string",
      "required": true,
      "description": "A custom name for the new optimization job.",
      "nested_params": []
    },
    {
      "name": "RoleArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of an IAM role that enables Amazon SageMaker AI to perform tasks on your behalf. During model optimization, Amazon SageMaker AI needs your permission to: Read input data from an S3 bucket Write model artifacts to an S3 bucket Write logs to Amazon CloudWatch Logs Publish metrics to Amazon CloudWatch You grant permissions for all of these tasks to an IAM role. To pass this role to Amazon SageMaker AI, the caller of this API must have the iam:PassRole permission. For more information, see Amazon SageMaker AI Roles.",
      "nested_params": []
    },
    {
      "name": "ModelSource",
      "type": "dict",
      "required": true,
      "description": "The location of the source model to optimize with an optimization job. S3 (dict) --- The Amazon S3 location of a source model to optimize with an optimization job. S3Uri (string) --- An Amazon S3 URI that locates a source model to optimize with an optimization job. ModelAccessConfig (dict) --- The access configuration settings for the source ML model for an optimization job, where you can accept the model end-user license agreement (EULA). Specifies agreement to the model end-user license agreement (EULA). The AcceptEula value must be explicitly defined as True in order to accept the EULA that this model requires. You are responsible for reviewing and complying with any applicable license terms and making sure they are acceptable for your use case before downloading or using a model.",
      "nested_params": [
        {
          "name": "S3",
          "type": "dict",
          "required": false,
          "description": "The Amazon S3 location of a source model to optimize with an optimization job.",
          "nested_params": [
            {
              "name": "S3Uri",
              "type": "string",
              "required": false,
              "description": "An Amazon S3 URI that locates a source model to optimize with an optimization job.",
              "nested_params": []
            },
            {
              "name": "ModelAccessConfig",
              "type": "dict",
              "required": false,
              "description": "The access configuration settings for the source ML model for an optimization job, where you can accept the model end-user license agreement (EULA).",
              "nested_params": [
                {
                  "name": "AcceptEula",
                  "type": "boolean",
                  "required": false,
                  "description": "Specifies agreement to the model end-user license agreement (EULA). The AcceptEula value must be explicitly defined as True in order to accept the EULA that this model requires. You are responsible for reviewing and complying with any applicable license terms and making sure they are acceptable for your use case before downloading or using a model.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "DeploymentInstanceType",
      "type": "string",
      "required": true,
      "description": "The type of instance that hosts the optimized model that you create with the optimization job.",
      "nested_params": []
    },
    {
      "name": "OptimizationEnvironment",
      "type": "dict",
      "required": false,
      "description": "The environment variables to set in the model container. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "OptimizationConfigs",
      "type": "list",
      "required": true,
      "description": "Settings for each of the optimization techniques that the job applies. (dict) --- Settings for an optimization technique that you apply with a model optimization job. ModelQuantizationConfig (dict) --- Settings for the model quantization technique that's applied by a model optimization job. Image (string) --- The URI of an LMI DLC in Amazon ECR. SageMaker uses this image to run the optimization. OverrideEnvironment (dict) --- Environment variables that override the default ones in the model container. (string) --- (string) --- ModelCompilationConfig (dict) --- Settings for the model compilation technique that's applied by a model optimization job. (string) --- (string) --- ModelShardingConfig (dict) --- Settings for the model sharding technique that's applied by a model optimization job. (string) --- (string) ---",
      "nested_params": [
        {
          "name": "ModelQuantizationConfig",
          "type": "dict",
          "required": false,
          "description": "Settings for the model quantization technique that's applied by a model optimization job.",
          "nested_params": [
            {
              "name": "Image",
              "type": "string",
              "required": false,
              "description": "The URI of an LMI DLC in Amazon ECR. SageMaker uses this image to run the optimization.",
              "nested_params": []
            },
            {
              "name": "OverrideEnvironment",
              "type": "dict",
              "required": false,
              "description": "Environment variables that override the default ones in the model container.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ModelCompilationConfig",
          "type": "dict",
          "required": false,
          "description": "Settings for the model compilation technique that's applied by a model optimization job.",
          "nested_params": [
            {
              "name": "Image",
              "type": "string",
              "required": false,
              "description": "The URI of an LMI DLC in Amazon ECR. SageMaker uses this image to run the optimization.",
              "nested_params": []
            },
            {
              "name": "OverrideEnvironment",
              "type": "dict",
              "required": false,
              "description": "Environment variables that override the default ones in the model container.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ModelShardingConfig",
          "type": "dict",
          "required": false,
          "description": "Settings for the model sharding technique that's applied by a model optimization job.",
          "nested_params": [
            {
              "name": "Image",
              "type": "string",
              "required": false,
              "description": "The URI of an LMI DLC in Amazon ECR. SageMaker uses this image to run the optimization.",
              "nested_params": []
            },
            {
              "name": "OverrideEnvironment",
              "type": "dict",
              "required": false,
              "description": "Environment variables that override the default ones in the model container.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "OutputConfig",
      "type": "dict",
      "required": true,
      "description": "Details for where to store the optimized model that you create with the optimization job. KmsKeyId (string) --- The Amazon Resource Name (ARN) of a key in Amazon Web Services KMS. SageMaker uses they key to encrypt the artifacts of the optimized model when SageMaker uploads the model to Amazon S3. The Amazon S3 URI for where to store the optimized model that you create with an optimization job.",
      "nested_params": [
        {
          "name": "KmsKeyId",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of a key in Amazon Web Services KMS. SageMaker uses they key to encrypt the artifacts of the optimized model when SageMaker uploads the model to Amazon S3.",
          "nested_params": []
        },
        {
          "name": "S3OutputLocation",
          "type": "string",
          "required": false,
          "description": "The Amazon S3 URI for where to store the optimized model that you create with an optimization job.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "StoppingCondition",
      "type": "dict",
      "required": true,
      "description": "Specifies a limit to how long a job can run. When the job reaches the time limit, SageMaker ends the job. Use this API to cap costs. To stop a training job, SageMaker sends the algorithm the SIGTERM signal, which delays job termination for 120 seconds. Algorithms can use this 120-second window to save the model artifacts, so the results of training are not lost. The training algorithms provided by SageMaker automatically save the intermediate results of a model training job when possible. This attempt to save artifacts is only a best effort case as model might not be in a state from which it can be saved. For example, if training has just started, the model might not be ready to save. When saved, this intermediate data is a valid model artifact. You can use it to create a model with CreateModel. MaxRuntimeInSeconds (integer) --- The maximum length of time, in seconds, that a training or compilation job can run before it is stopped. For compilation jobs, if the job does not complete during this time, a TimeOut error is generated. We recommend starting with 900 seconds and increasing as necessary based on your model. For all other jobs, if the job does not complete during this time, SageMaker ends the job. When RetryStrategy is specified in the job request, MaxRuntimeInSeconds specifies the maximum time for all of the attempts in total, not each individual attempt. The default value is 1 day. The maximum value is 28 days. The maximum time that a TrainingJob can run in total, including any time spent publishing metrics or archiving and uploading models after it has been stopped, is 30 days. MaxWaitTimeInSeconds (integer) --- The maximum length of time, in seconds, that a managed Spot training job has to complete. It is the amount of time spent waiting for Spot capacity plus the amount of time the job can run. It must be equal to or greater than MaxRuntimeInSeconds. If the job does not complete during this time, SageMaker ends the job. When RetryStrategy is specified in the job request, MaxWaitTimeInSeconds specifies the maximum time for all of the attempts in total, not each individual attempt. MaxPendingTimeInSeconds (integer) --- The maximum length of time, in seconds, that a training or compilation job can be pending before it is stopped.",
      "nested_params": [
        {
          "name": "MaxRuntimeInSeconds",
          "type": "integer",
          "required": false,
          "description": "The maximum length of time, in seconds, that a training or compilation job can run before it is stopped. For compilation jobs, if the job does not complete during this time, a TimeOut error is generated. We recommend starting with 900 seconds and increasing as necessary based on your model. For all other jobs, if the job does not complete during this time, SageMaker ends the job. When RetryStrategy is specified in the job request, MaxRuntimeInSeconds specifies the maximum time for all of the attempts in total, not each individual attempt. The default value is 1 day. The maximum value is 28 days. The maximum time that a TrainingJob can run in total, including any time spent publishing metrics or archiving and uploading models after it has been stopped, is 30 days.",
          "nested_params": []
        },
        {
          "name": "MaxWaitTimeInSeconds",
          "type": "integer",
          "required": false,
          "description": "The maximum length of time, in seconds, that a managed Spot training job has to complete. It is the amount of time spent waiting for Spot capacity plus the amount of time the job can run. It must be equal to or greater than MaxRuntimeInSeconds. If the job does not complete during this time, SageMaker ends the job. When RetryStrategy is specified in the job request, MaxWaitTimeInSeconds specifies the maximum time for all of the attempts in total, not each individual attempt.",
          "nested_params": []
        },
        {
          "name": "MaxPendingTimeInSeconds",
          "type": "integer",
          "required": false,
          "description": "The maximum length of time, in seconds, that a training or compilation job can be pending before it is stopped.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "A list of key-value pairs associated with the optimization job. For more information, see Tagging Amazon Web Services resources in the Amazon Web Services General Reference Guide. (dict) --- A tag object that consists of a key and an optional value, used to manage metadata for SageMaker Amazon Web Services resources. You can add tags to notebook instances, training jobs, hyperparameter tuning jobs, batch transform jobs, models, labeling jobs, work teams, endpoint configurations, and endpoints. For more information on adding tags to SageMaker resources, see AddTags. For more information on adding metadata to your Amazon Web Services resources with tagging, see Tagging Amazon Web Services resources. For advice on best practices for managing Amazon Web Services resources with tagging, see Tagging Best Practices: Implement an Effective Amazon Web Services Resource Tagging Strategy. The tag key. Tag keys must be unique per resource. The tag value.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The tag key. Tag keys must be unique per resource.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The tag value.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "VpcConfig",
      "type": "dict",
      "required": true,
      "description": "A VPC in Amazon VPC that your optimized model has access to. The VPC security group IDs, in the form sg-xxxxxxxx. Specify the security groups for the VPC that is specified in the Subnets field. (string) --- The ID of the subnets in the VPC to which you want to connect your optimized model. (string) ---",
      "nested_params": [
        {
          "name": "SecurityGroupIds",
          "type": "list",
          "required": false,
          "description": "The VPC security group IDs, in the form sg-xxxxxxxx. Specify the security groups for the VPC that is specified in the Subnets field.",
          "nested_params": []
        },
        {
          "name": "Subnets",
          "type": "list",
          "required": false,
          "description": "The ID of the subnets in the VPC to which you want to connect your optimized model.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "OptimizationJobArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the optimization job.",
          "nested_items": []
        }
      ]
    }
  ]
}