{
  "method_name": "start_pipeline_execution",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sagemaker/client/start_pipeline_execution.html",
  "description": "Starts a pipeline execution.",
  "parameters": [
    {
      "name": "PipelineName",
      "type": "string",
      "required": true,
      "description": "The name or Amazon Resource Name (ARN) of the pipeline.",
      "nested_params": []
    },
    {
      "name": "PipelineExecutionDisplayName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "PipelineParameters",
      "type": "list",
      "required": true,
      "description": "Contains a list of pipeline parameters. This list can be empty. (dict) --- Assigns a value to a named Pipeline parameter. The name of the parameter to assign a value to. This parameter name must match a named parameter in the pipeline definition. The literal value for the parameter.",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name of the parameter to assign a value to. This parameter name must match a named parameter in the pipeline definition.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The literal value for the parameter.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "PipelineExecutionDescription",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ClientRequestToken",
      "type": "string",
      "required": true,
      "description": "A unique, case-sensitive identifier that you provide to ensure the idempotency of the operation. An idempotent operation completes no more than once. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "ParallelismConfiguration",
      "type": "dict",
      "required": true,
      "description": "This configuration, if specified, overrides the parallelism configuration of the parent pipeline for this specific run. The max number of steps that can be executed in parallel.",
      "nested_params": [
        {
          "name": "MaxParallelExecutionSteps",
          "type": "integer",
          "required": false,
          "description": "The max number of steps that can be executed in parallel.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "SelectiveExecutionConfig",
      "type": "dict",
      "required": true,
      "description": "The selective execution configuration applied to the pipeline run. SourcePipelineExecutionArn (string) --- The ARN from a reference execution of the current pipeline. Used to copy input collaterals needed for the selected steps to run. The execution status of the pipeline can be either Failed or Success. This field is required if the steps you specify for SelectedSteps depend on output collaterals from any non-specified pipeline steps. For more information, see Selective Execution for Pipeline Steps. A list of pipeline steps to run. All step(s) in all path(s) between two selected steps should be included. (dict) --- A step selected to run in selective execution mode. The name of the pipeline step.",
      "nested_params": [
        {
          "name": "SourcePipelineExecutionArn",
          "type": "string",
          "required": false,
          "description": "The ARN from a reference execution of the current pipeline. Used to copy input collaterals needed for the selected steps to run. The execution status of the pipeline can be either Failed or Success. This field is required if the steps you specify for SelectedSteps depend on output collaterals from any non-specified pipeline steps. For more information, see Selective Execution for Pipeline Steps.",
          "nested_params": []
        },
        {
          "name": "SelectedSteps",
          "type": "list",
          "required": false,
          "description": "A list of pipeline steps to run. All step(s) in all path(s) between two selected steps should be included.",
          "nested_params": [
            {
              "name": "StepName",
              "type": "string",
              "required": false,
              "description": "The name of the pipeline step.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "PipelineExecutionArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the pipeline execution.",
          "nested_items": []
        }
      ]
    }
  ]
}