{
  "method_name": "update_cluster",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sagemaker/client/update_cluster.html",
  "description": "Updates a SageMaker HyperPod cluster.",
  "parameters": [
    {
      "name": "ClusterName",
      "type": "string",
      "required": true,
      "description": "Specify the name of the SageMaker HyperPod cluster you want to update.",
      "nested_params": []
    },
    {
      "name": "InstanceGroups",
      "type": "list",
      "required": true,
      "description": "Specify the instance groups to update. (dict) --- The specifications of an instance group that you need to define. Specifies the number of instances to add to the instance group of a SageMaker HyperPod cluster. Specifies the name of the instance group. Specifies the instance type of the instance group. Specifies the LifeCycle configuration for the instance group. An Amazon S3 bucket path where your lifecycle scripts are stored. The file name of the entrypoint script of lifecycle scripts under SourceS3Uri. This entrypoint script runs during cluster creation. Specifies an IAM execution role to be assumed by the instance group. ThreadsPerCore (integer) --- Specifies the value for Threads per core. For instance types that support multithreading, you can specify 1 for disabling multithreading and 2 for enabling multithreading. For instance types that doesn't support multithreading, specify 1. For more information, see the reference table of CPU cores and threads per CPU core per instance type in the Amazon Elastic Compute Cloud User Guide. InstanceStorageConfigs (list) --- Specifies the additional storage configurations for the instances in the SageMaker HyperPod cluster instance group. (dict) --- Defines the configuration for attaching additional storage to the instances in the SageMaker HyperPod cluster instance group. To learn more, see SageMaker HyperPod release notes: June 20, 2024. EbsVolumeConfig (dict) --- Defines the configuration for attaching additional Amazon Elastic Block Store (EBS) volumes to the instances in the SageMaker HyperPod cluster instance group. The additional EBS volume is attached to each instance within the SageMaker HyperPod cluster instance group and mounted to /opt/sagemaker. The size in gigabytes (GB) of the additional EBS volume to be attached to the instances in the SageMaker HyperPod cluster instance group. OnStartDeepHealthChecks (list) --- A flag indicating whether deep health checks should be performed when the cluster instance group is created or updated. (string) --- TrainingPlanArn (string) --- The Amazon Resource Name (ARN); of the training plan to use for this cluster instance group. For more information about how to reserve GPU capacity for your SageMaker HyperPod clusters using Amazon SageMaker Training Plan, see ``CreateTrainingPlan ``. OverrideVpcConfig (dict) --- To configure multi-AZ deployments, customize the Amazon VPC configuration at the instance group level. You can specify different subnets and security groups across different AZs in the instance group specification to override a SageMaker HyperPod cluster's default Amazon VPC configuration. For more information about deploying a cluster in multiple AZs, see Setting up SageMaker HyperPod clusters across multiple AZs. The VPC security group IDs, in the form sg-xxxxxxxx. Specify the security groups for the VPC that is specified in the Subnets field. (string) --- The ID of the subnets in the VPC to which you want to connect your training job or model. For information about the availability of specific instance types, see Supported Instance Types and Availability Zones. (string) --- ScheduledUpdateConfig (dict) --- The configuration object of the schedule that SageMaker uses to update the AMI. A cron expression that specifies the schedule that SageMaker follows when updating the AMI. DeploymentConfig (dict) --- The configuration to use when updating the AMI versions. RollingUpdatePolicy (dict) --- The policy that SageMaker uses when updating the AMI versions of the cluster. The maximum amount of instances in the cluster that SageMaker can update at a time. Specifies whether SageMaker should process the update by amount or percentage of instances. Specifies the amount or percentage of instances SageMaker updates at a time. RollbackMaximumBatchSize (dict) --- The maximum amount of instances in the cluster that SageMaker can roll back at a time. WaitIntervalInSeconds (integer) --- The duration in seconds that SageMaker waits before updating more instances in the cluster. AutoRollbackConfiguration (list) --- An array that contains the alarms that SageMaker monitors to know whether to roll back the AMI update. (dict) --- The details of the alarm to monitor during the AMI update. The name of the alarm.",
      "nested_params": [
        {
          "name": "InstanceCount",
          "type": "integer",
          "required": false,
          "description": "Specifies the number of instances to add to the instance group of a SageMaker HyperPod cluster.",
          "nested_params": []
        },
        {
          "name": "InstanceGroupName",
          "type": "string",
          "required": false,
          "description": "Specifies the name of the instance group.",
          "nested_params": []
        },
        {
          "name": "InstanceType",
          "type": "string",
          "required": false,
          "description": "Specifies the instance type of the instance group.",
          "nested_params": []
        },
        {
          "name": "LifeCycleConfig",
          "type": "dict",
          "required": false,
          "description": "Specifies the LifeCycle configuration for the instance group.",
          "nested_params": [
            {
              "name": "SourceS3Uri",
              "type": "string",
              "required": false,
              "description": "An Amazon S3 bucket path where your lifecycle scripts are stored.",
              "nested_params": []
            },
            {
              "name": "OnCreate",
              "type": "string",
              "required": false,
              "description": "The file name of the entrypoint script of lifecycle scripts under SourceS3Uri. This entrypoint script runs during cluster creation.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ExecutionRole",
          "type": "string",
          "required": false,
          "description": "Specifies an IAM execution role to be assumed by the instance group.",
          "nested_params": []
        },
        {
          "name": "ThreadsPerCore",
          "type": "integer",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "InstanceStorageConfigs",
          "type": "list",
          "required": false,
          "description": "Specifies the additional storage configurations for the instances in the SageMaker HyperPod cluster instance group.",
          "nested_params": [
            {
              "name": "EbsVolumeConfig",
              "type": "dict",
              "required": false,
              "description": "Defines the configuration for attaching additional Amazon Elastic Block Store (EBS) volumes to the instances in the SageMaker HyperPod cluster instance group. The additional EBS volume is attached to each instance within the SageMaker HyperPod cluster instance group and mounted to /opt/sagemaker.",
              "nested_params": [
                {
                  "name": "VolumeSizeInGB",
                  "type": "integer",
                  "required": false,
                  "description": "The size in gigabytes (GB) of the additional EBS volume to be attached to the instances in the SageMaker HyperPod cluster instance group. The additional EBS volume is attached to each instance within the SageMaker HyperPod cluster instance group and mounted to /opt/sagemaker.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "OnStartDeepHealthChecks",
          "type": "list",
          "required": false,
          "description": "A flag indicating whether deep health checks should be performed when the cluster instance group is created or updated.",
          "nested_params": []
        },
        {
          "name": "TrainingPlanArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN); of the training plan to use for this cluster instance group. For more information about how to reserve GPU capacity for your SageMaker HyperPod clusters using Amazon SageMaker Training Plan, see ``CreateTrainingPlan ``.",
          "nested_params": []
        },
        {
          "name": "OverrideVpcConfig",
          "type": "dict",
          "required": false,
          "description": "To configure multi-AZ deployments, customize the Amazon VPC configuration at the instance group level. You can specify different subnets and security groups across different AZs in the instance group specification to override a SageMaker HyperPod cluster's default Amazon VPC configuration. For more information about deploying a cluster in multiple AZs, see Setting up SageMaker HyperPod clusters across multiple AZs.",
          "nested_params": [
            {
              "name": "SecurityGroupIds",
              "type": "list",
              "required": false,
              "description": "The VPC security group IDs, in the form sg-xxxxxxxx. Specify the security groups for the VPC that is specified in the Subnets field.",
              "nested_params": []
            },
            {
              "name": "Subnets",
              "type": "list",
              "required": false,
              "description": "The ID of the subnets in the VPC to which you want to connect your training job or model. For information about the availability of specific instance types, see Supported Instance Types and Availability Zones.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ScheduledUpdateConfig",
          "type": "dict",
          "required": false,
          "description": "The configuration object of the schedule that SageMaker uses to update the AMI.",
          "nested_params": [
            {
              "name": "ScheduleExpression",
              "type": "string",
              "required": false,
              "description": "A cron expression that specifies the schedule that SageMaker follows when updating the AMI.",
              "nested_params": []
            },
            {
              "name": "DeploymentConfig",
              "type": "dict",
              "required": false,
              "description": "The configuration to use when updating the AMI versions.",
              "nested_params": [
                {
                  "name": "RollingUpdatePolicy",
                  "type": "dict",
                  "required": false,
                  "description": "The policy that SageMaker uses when updating the AMI versions of the cluster.",
                  "nested_params": [
                    {
                      "name": "MaximumBatchSize",
                      "type": "dict",
                      "required": false,
                      "description": "The maximum amount of instances in the cluster that SageMaker can update at a time.",
                      "nested_params": [
                        {
                          "name": "Type",
                          "type": "string",
                          "required": false,
                          "description": "Specifies whether SageMaker should process the update by amount or percentage of instances.",
                          "nested_params": []
                        },
                        {
                          "name": "Value",
                          "type": "integer",
                          "required": false,
                          "description": "Specifies the amount or percentage of instances SageMaker updates at a time.",
                          "nested_params": []
                        }
                      ]
                    },
                    {
                      "name": "RollbackMaximumBatchSize",
                      "type": "dict",
                      "required": false,
                      "description": "The maximum amount of instances in the cluster that SageMaker can roll back at a time.",
                      "nested_params": [
                        {
                          "name": "Type",
                          "type": "string",
                          "required": false,
                          "description": "Specifies whether SageMaker should process the update by amount or percentage of instances.",
                          "nested_params": []
                        },
                        {
                          "name": "Value",
                          "type": "integer",
                          "required": false,
                          "description": "Specifies the amount or percentage of instances SageMaker updates at a time.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "WaitIntervalInSeconds",
                  "type": "integer",
                  "required": false,
                  "description": "The duration in seconds that SageMaker waits before updating more instances in the cluster.",
                  "nested_params": []
                },
                {
                  "name": "AutoRollbackConfiguration",
                  "type": "list",
                  "required": false,
                  "description": "An array that contains the alarms that SageMaker monitors to know whether to roll back the AMI update.",
                  "nested_params": [
                    {
                      "name": "AlarmName",
                      "type": "string",
                      "required": false,
                      "description": "The name of the alarm.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "NodeRecovery",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "InstanceGroupsToDelete",
      "type": "list",
      "required": false,
      "description": "Specify the names of the instance groups to delete. Use a single , as the separator between multiple names. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ClusterArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the updated SageMaker HyperPod cluster.",
          "nested_items": []
        }
      ]
    }
  ]
}