{
  "method_name": "update_device_fleet",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sagemaker/client/update_device_fleet.html",
  "description": "Updates a fleet of devices.",
  "parameters": [
    {
      "name": "DeviceFleetName",
      "type": "string",
      "required": true,
      "description": "The name of the fleet.",
      "nested_params": []
    },
    {
      "name": "RoleArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "OutputConfig",
      "type": "dict",
      "required": true,
      "description": "Output configuration for storing sample data collected by the fleet. The Amazon Simple Storage (S3) bucker URI. KmsKeyId (string) --- The Amazon Web Services Key Management Service (Amazon Web Services KMS) key that Amazon SageMaker uses to encrypt data on the storage volume after compilation job. If you don't provide a KMS key ID, Amazon SageMaker uses the default KMS key for Amazon S3 for your role's account. PresetDeploymentType (string) --- The deployment type SageMaker Edge Manager will create. Currently only supports Amazon Web Services IoT Greengrass Version 2 components. PresetDeploymentConfig (string) --- The configuration used to create deployment artifacts. Specify configuration options with a JSON string. The available configuration options for each type are: ComponentName (optional) - Name of the GreenGrass V2 component. If not specified, the default name generated consists of 'SagemakerEdgeManager' and the name of your SageMaker Edge Manager packaging job. ComponentDescription (optional) - Description of the component. ComponentVersion (optional) - The version of the component. PlatformOS (optional) - The name of the operating system for the platform. Supported platforms include Windows and Linux. PlatformArchitecture (optional) - The processor architecture for the platform. Supported architectures Windows include: Windows32_x86, Windows64_x64. Supported architectures for Linux include: Linux x86_64, Linux ARMV8.",
      "nested_params": [
        {
          "name": "S3OutputLocation",
          "type": "string",
          "required": false,
          "description": "The Amazon Simple Storage (S3) bucker URI.",
          "nested_params": []
        },
        {
          "name": "KmsKeyId",
          "type": "string",
          "required": false,
          "description": "The Amazon Web Services Key Management Service (Amazon Web Services KMS) key that Amazon SageMaker uses to encrypt data on the storage volume after compilation job. If you don't provide a KMS key ID, Amazon SageMaker uses the default KMS key for Amazon S3 for your role's account.",
          "nested_params": []
        },
        {
          "name": "PresetDeploymentType",
          "type": "string",
          "required": false,
          "description": "The deployment type SageMaker Edge Manager will create. Currently only supports Amazon Web Services IoT Greengrass Version 2 components.",
          "nested_params": []
        },
        {
          "name": "PresetDeploymentConfig",
          "type": "string",
          "required": false,
          "description": "The configuration used to create deployment artifacts. Specify configuration options with a JSON string. The available configuration options for each type are:",
          "nested_params": []
        }
      ]
    },
    {
      "name": "EnableIotRoleAlias",
      "type": "boolean",
      "required": false,
      "description": "Whether to create an Amazon Web Services IoT Role Alias during device fleet creation. The name of the role alias generated will match this pattern: 'SageMakerEdge-{DeviceFleetName}'. For example, if your device fleet is called 'demo-fleet', the name of the role alias will be 'SageMakerEdge-demo-fleet'.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}