{
  "method_name": "create_training_dataset",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cleanroomsml/client/create_training_dataset.html",
  "description": "Defines the information necessary to create a training dataset. In Clean Rooms ML, the TrainingDataset is metadata that points to a Glue table, which is read only during AudienceModel creation.",
  "parameters": [
    {
      "name": "name",
      "type": "string",
      "required": true,
      "description": "The name of the training dataset. This name must be unique in your account and region.",
      "nested_params": []
    },
    {
      "name": "roleArn",
      "type": "string",
      "required": true,
      "description": "The ARN of the IAM role that Clean Rooms ML can assume to read the data referred to in the dataSource field of each dataset. Passing a role across AWS accounts is not allowed. If you pass a role that isn't in your account, you get an AccessDeniedException error.",
      "nested_params": []
    },
    {
      "name": "trainingData",
      "type": "list",
      "required": true,
      "description": "An array of information that lists the Dataset objects, which specifies the dataset type and details on its location and schema. You must provide a role that has read access to these tables. (dict) --- Defines where the training dataset is located, what type of data it contains, and how to access the data. What type of information is found in the dataset. A DatasetInputConfig object that defines the data source and schema mapping. The schema information for the training data. (dict) --- Metadata for a column. The name of a column. The data type of column. (string) --- A DataSource object that specifies the Glue data source for the training data. A GlueDataSource object that defines the catalog ID, database name, and table name for the training data. The Glue table that contains the training data. The Glue database that contains the training data. catalogId (string) --- The Glue catalog that contains the training data.",
      "nested_params": [
        {
          "name": "type",
          "type": "string",
          "required": false,
          "description": "What type of information is found in the dataset.",
          "nested_params": []
        },
        {
          "name": "inputConfig",
          "type": "dict",
          "required": false,
          "description": "A DatasetInputConfig object that defines the data source and schema mapping.",
          "nested_params": [
            {
              "name": "schema",
              "type": "list",
              "required": false,
              "description": "The schema information for the training data.",
              "nested_params": [
                {
                  "name": "columnName",
                  "type": "string",
                  "required": false,
                  "description": "The name of a column.",
                  "nested_params": []
                },
                {
                  "name": "columnTypes",
                  "type": "list",
                  "required": false,
                  "description": "The data type of column.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "dataSource",
              "type": "dict",
              "required": false,
              "description": "A DataSource object that specifies the Glue data source for the training data.",
              "nested_params": [
                {
                  "name": "glueDataSource",
                  "type": "dict",
                  "required": false,
                  "description": "A GlueDataSource object that defines the catalog ID, database name, and table name for the training data.",
                  "nested_params": [
                    {
                      "name": "tableName",
                      "type": "string",
                      "required": false,
                      "description": "The Glue table that contains the training data.",
                      "nested_params": []
                    },
                    {
                      "name": "databaseName",
                      "type": "string",
                      "required": false,
                      "description": "The Glue database that contains the training data.",
                      "nested_params": []
                    },
                    {
                      "name": "catalogId",
                      "type": "string",
                      "required": false,
                      "description": "The Glue catalog that contains the training data.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "tags",
      "type": "dict",
      "required": false,
      "description": "The optional metadata that you apply to the resource to help you categorize and organize them. Each tag consists of a key and an optional value, both of which you define. The following basic restrictions apply to tags: Maximum number of tags per resource - 50. For each resource, each tag key must be unique, and each tag key can have only one value. Maximum key length - 128 Unicode characters in UTF-8. Maximum value length - 256 Unicode characters in UTF-8. If your tagging schema is used across multiple services and resources, remember that other services may have restrictions on allowed characters. Generally allowed characters are: letters, numbers, and spaces representable in UTF-8, and the following characters: + - = . _ : / @. Tag keys and values are case sensitive. Do not use aws:, AWS:, or any upper or lowercase combination of such as a prefix for keys as it is reserved for AWS use. You cannot edit or delete tag keys with this prefix. Values can have this prefix. If a tag value has aws as its prefix but the key does not, then Clean Rooms ML considers it to be a user tag and will count against the limit of 50 tags. Tags with only the key prefix of aws do not count against your tags per resource limit. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "trainingDatasetArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the training dataset resource.",
          "nested_items": []
        }
      ]
    }
  ]
}