{
  "method_name": "create_configured_model_algorithm",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cleanroomsml/client/create_configured_model_algorithm.html",
  "description": "Creates a configured model algorithm using a container image stored in an ECR repository.",
  "parameters": [
    {
      "name": "name",
      "type": "string",
      "required": true,
      "description": "The name of the configured model algorithm.",
      "nested_params": []
    },
    {
      "name": "description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "roleArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the role that is used to access the repository.",
      "nested_params": []
    },
    {
      "name": "trainingContainerConfig",
      "type": "dict",
      "required": true,
      "description": "Configuration information for the training container, including entrypoints and arguments. The registry path of the docker image that contains the algorithm. Clean Rooms ML supports both registry/repository[:tag] and registry/repositry[@digest] image path formats. For more information about using images in Clean Rooms ML, see the Sagemaker API reference. entrypoint (list) --- The entrypoint script for a Docker container used to run a training job. This script takes precedence over the default train processing instructions. See How Amazon SageMaker Runs Your Training Image for additional information. For more information, see How Sagemaker runs your training image. (string) --- arguments (list) --- The arguments for a container used to run a training job. (string) --- metricDefinitions (list) --- A list of metric definition objects. Each object specifies the metric name and regular expressions used to parse algorithm logs. Amazon Web Services Clean Rooms ML publishes each metric to all members' Amazon CloudWatch using IAM role configured in  PutMLConfiguration. (dict) --- Information about the model metric that is reported for a trained model. The name of the model metric. The regular expression statement that defines how the model metric is reported.",
      "nested_params": [
        {
          "name": "imageUri",
          "type": "string",
          "required": false,
          "description": "The registry path of the docker image that contains the algorithm. Clean Rooms ML supports both registry/repository[:tag] and registry/repositry[@digest] image path formats. For more information about using images in Clean Rooms ML, see the Sagemaker API reference.",
          "nested_params": []
        },
        {
          "name": "entrypoint",
          "type": "list",
          "required": false,
          "description": "The entrypoint script for a Docker container used to run a training job. This script takes precedence over the default train processing instructions. See How Amazon SageMaker Runs Your Training Image for additional information. For more information, see How Sagemaker runs your training image.",
          "nested_params": []
        },
        {
          "name": "arguments",
          "type": "list",
          "required": false,
          "description": "The arguments for a container used to run a training job. See How Amazon SageMaker Runs Your Training Image for additional information. For more information, see How Sagemaker runs your training image.",
          "nested_params": []
        },
        {
          "name": "metricDefinitions",
          "type": "list",
          "required": false,
          "description": "A list of metric definition objects. Each object specifies the metric name and regular expressions used to parse algorithm logs. Amazon Web Services Clean Rooms ML publishes each metric to all members' Amazon CloudWatch using IAM role configured in  PutMLConfiguration.",
          "nested_params": [
            {
              "name": "name",
              "type": "string",
              "required": false,
              "description": "The name of the model metric.",
              "nested_params": []
            },
            {
              "name": "regex",
              "type": "string",
              "required": false,
              "description": "The regular expression statement that defines how the model metric is reported.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "inferenceContainerConfig",
      "type": "dict",
      "required": true,
      "description": "Configuration information for the inference container that is used when you run an inference job on a configured model algorithm. The registry path of the docker image that contains the inference algorithm. Clean Rooms ML supports both registry/repository[:tag] and registry/repositry[@digest] image path formats. For more information about using images in Clean Rooms ML, see the Sagemaker API reference.",
      "nested_params": [
        {
          "name": "imageUri",
          "type": "string",
          "required": false,
          "description": "The registry path of the docker image that contains the inference algorithm. Clean Rooms ML supports both registry/repository[:tag] and registry/repositry[@digest] image path formats. For more information about using images in Clean Rooms ML, see the Sagemaker API reference.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "tags",
      "type": "dict",
      "required": false,
      "description": "The optional metadata that you apply to the resource to help you categorize and organize them. Each tag consists of a key and an optional value, both of which you define. The following basic restrictions apply to tags: Maximum number of tags per resource - 50. For each resource, each tag key must be unique, and each tag key can have only one value. Maximum key length - 128 Unicode characters in UTF-8. Maximum value length - 256 Unicode characters in UTF-8. If your tagging schema is used across multiple services and resources, remember that other services may have restrictions on allowed characters. Generally allowed characters are: letters, numbers, and spaces representable in UTF-8, and the following characters: + - = . _ : / @. Tag keys and values are case sensitive. Do not use aws:, AWS:, or any upper or lowercase combination of such as a prefix for keys as it is reserved for AWS use. You cannot edit or delete tag keys with this prefix. Values can have this prefix. If a tag value has aws as its prefix but the key does not, then Clean Rooms ML considers it to be a user tag and will count against the limit of 50 tags. Tags with only the key prefix of aws do not count against your tags per resource limit. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "kmsKeyArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "configuredModelAlgorithmArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the configured model algorithm.",
          "nested_items": []
        }
      ]
    }
  ]
}