{
  "method_name": "create_ml_input_channel",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cleanroomsml/client/create_ml_input_channel.html",
  "description": "Provides the information to create an ML input channel. An ML input channel is the result of a query that can be used for ML modeling.",
  "parameters": [
    {
      "name": "membershipIdentifier",
      "type": "string",
      "required": true,
      "description": "The membership ID of the member that is creating the ML input channel.",
      "nested_params": []
    },
    {
      "name": "configuredModelAlgorithmAssociations",
      "type": "list",
      "required": true,
      "description": "The associated configured model algorithms that are necessary to create this ML input channel. (string) ---",
      "nested_params": []
    },
    {
      "name": "inputChannel",
      "type": "dict",
      "required": true,
      "description": "The input data that is used to create this ML input channel. The data source that is used to create the ML input channel. protectedQueryInputParameters (dict) --- Provides information necessary to perform the protected query. The parameters for the SQL type Protected Query. queryString (string) --- The query string to be submitted. analysisTemplateArn (string) --- The Amazon Resource Name (ARN) associated with the analysis template within a collaboration. parameters (dict) --- The protected query SQL parameters. (string) --- (string) --- computeConfiguration (dict) --- Provides configuration information for the workers that will perform the protected query. worker (dict) --- The worker instances that will perform the compute work. type (string) --- The instance type of the compute workers that are used. number (integer) --- The number of compute workers that are used. The ARN of the IAM role that Clean Rooms ML can assume to read the data referred to in the dataSource field the input channel. Passing a role across AWS accounts is not allowed. If you pass a role that isn't in your account, you get an AccessDeniedException error.",
      "nested_params": [
        {
          "name": "dataSource",
          "type": "dict",
          "required": false,
          "description": "The data source that is used to create the ML input channel.",
          "nested_params": [
            {
              "name": "protectedQueryInputParameters",
              "type": "dict",
              "required": false,
              "description": "Provides information necessary to perform the protected query.",
              "nested_params": [
                {
                  "name": "sqlParameters",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters for the SQL type Protected Query.",
                  "nested_params": [
                    {
                      "name": "queryString",
                      "type": "string",
                      "required": false,
                      "description": "The query string to be submitted.",
                      "nested_params": []
                    },
                    {
                      "name": "analysisTemplateArn",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Resource Name (ARN) associated with the analysis template within a collaboration.",
                      "nested_params": []
                    },
                    {
                      "name": "parameters",
                      "type": "dict",
                      "required": false,
                      "description": "The protected query SQL parameters.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "computeConfiguration",
                  "type": "dict",
                  "required": false,
                  "description": "Provides configuration information for the workers that will perform the protected query.",
                  "nested_params": [
                    {
                      "name": "worker",
                      "type": "dict",
                      "required": false,
                      "description": "The worker instances that will perform the compute work.",
                      "nested_params": [
                        {
                          "name": "type",
                          "type": "string",
                          "required": false,
                          "description": "The instance type of the compute workers that are used.",
                          "nested_params": []
                        },
                        {
                          "name": "number",
                          "type": "integer",
                          "required": false,
                          "description": "The number of compute workers that are used.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "roleArn",
          "type": "string",
          "required": false,
          "description": "The ARN of the IAM role that Clean Rooms ML can assume to read the data referred to in the dataSource field the input channel. Passing a role across AWS accounts is not allowed. If you pass a role that isn't in your account, you get an AccessDeniedException error.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "name",
      "type": "string",
      "required": true,
      "description": "The name of the ML input channel.",
      "nested_params": []
    },
    {
      "name": "retentionInDays",
      "type": "integer",
      "required": true,
      "description": "The number of days that the data in the ML input channel is retained.",
      "nested_params": []
    },
    {
      "name": "description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "kmsKeyArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "dict",
      "required": false,
      "description": "The optional metadata that you apply to the resource to help you categorize and organize them. Each tag consists of a key and an optional value, both of which you define. The following basic restrictions apply to tags: Maximum number of tags per resource - 50. For each resource, each tag key must be unique, and each tag key can have only one value. Maximum key length - 128 Unicode characters in UTF-8. Maximum value length - 256 Unicode characters in UTF-8. If your tagging schema is used across multiple services and resources, remember that other services may have restrictions on allowed characters. Generally allowed characters are: letters, numbers, and spaces representable in UTF-8, and the following characters: + - = . _ : / @. Tag keys and values are case sensitive. Do not use aws:, AWS:, or any upper or lowercase combination of such as a prefix for keys as it is reserved for AWS use. You cannot edit or delete tag keys with this prefix. Values can have this prefix. If a tag value has aws as its prefix but the key does not, then Clean Rooms ML considers it to be a user tag and will count against the limit of 50 tags. Tags with only the key prefix of aws do not count against your tags per resource limit. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "mlInputChannelArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the ML input channel.",
          "nested_items": []
        }
      ]
    }
  ]
}