{
  "method_name": "import_certificate_authority_certificate",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/acm-pca/client/import_certificate_authority_certificate.html",
  "description": "Imports a signed private CA certificate into Amazon Web Services Private CA. This action is used when you are using a chain of trust whose root is located outside Amazon Web Services Private CA. Before you can call this action, the following preparations must in place: Amazon Web Services Private CA supports three scenarios for installing a CA certificate: The following additional requirements apply when you import a CA certificate. Enforcement of Critical Constraints. Amazon Web Services Private CA allows the following extensions to be marked critical in the imported CA certificate or chain. Amazon Web Services Private CA rejects the following extensions when they are marked critical in an imported CA certificate or chain. Amazon Web Services Private Certificate Authority will also reject any other extension marked as critical not contained on the preceding list of allowed extensions.",
  "parameters": [
    {
      "name": "CertificateAuthorityArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) that was returned when you called CreateCertificateAuthority. This must be of the form: arn:aws:acm-pca:region:account:certificate-authority/12345678-1234-1234-1234-123456789012",
      "nested_params": []
    },
    {
      "name": "Certificate",
      "type": "bytes",
      "required": true,
      "description": "The PEM-encoded certificate for a private CA. This may be a self-signed certificate in the case of a root CA, or it may be signed by another CA that you control.",
      "nested_params": []
    },
    {
      "name": "CertificateChain",
      "type": "bytes",
      "required": false,
      "description": "A PEM-encoded file that contains all of your certificates, other than the certificate you're importing, chaining up to your root CA. Your Amazon Web Services Private CA-hosted or on-premises root certificate is the last in the chain, and each certificate in the chain signs the one preceding. This parameter must be supplied when you import a subordinate CA. When you import a root CA, there is no chain.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}