{
  "method_name": "delete_record",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sagemaker-featurestore-runtime/client/delete_record.html",
  "description": "Deletes a Record from a FeatureGroup in the OnlineStore. Feature Store supports both SoftDelete and HardDelete. For SoftDelete (default), feature columns are set to null and the record is no longer retrievable by GetRecord or BatchGetRecord. For HardDelete, the complete Record is removed from the OnlineStore. In both cases, Feature Store appends the deleted record marker to the OfflineStore. The deleted record marker is a record with the same RecordIdentifer as the original, but with is_deleted value set to True, EventTime set to the delete input EventTime, and other feature values set to null. Note that the EventTime specified in DeleteRecord should be set later than the EventTime of the existing record in the OnlineStore for that RecordIdentifer. If it is not, the deletion does not occur: When a record is deleted from the OnlineStore, the deleted record marker is appended to the OfflineStore. If you have the Iceberg table format enabled for your OfflineStore, you can remove all history of a record from the OfflineStore using Amazon Athena or Apache Spark. For information on how to hard delete a record from the OfflineStore with the Iceberg table format enabled, see Delete records from the offline store.",
  "parameters": [
    {
      "name": "FeatureGroupName",
      "type": "string",
      "required": true,
      "description": "The name or Amazon Resource Name (ARN) of the feature group to delete the record from.",
      "nested_params": []
    },
    {
      "name": "RecordIdentifierValueAsString",
      "type": "string",
      "required": true,
      "description": "The value for the RecordIdentifier that uniquely identifies the record, in string format.",
      "nested_params": []
    },
    {
      "name": "EventTime",
      "type": "string",
      "required": true,
      "description": "Timestamp indicating when the deletion event occurred. EventTime can be used to query data at a certain point in time.",
      "nested_params": []
    },
    {
      "name": "TargetStores",
      "type": "list",
      "required": false,
      "description": "A list of stores from which you're deleting the record. By default, Feature Store deletes the record from all of the stores that you're using for the FeatureGroup. (string) ---",
      "nested_params": []
    },
    {
      "name": "DeletionMode",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}