{
  "method_name": "describe_principal_mapping",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kendra/client/describe_principal_mapping.html",
  "description": "Describes the processing of PUT and DELETE actions for mapping users to their groups. This includes information on the status of actions currently processing or yet to be processed, when actions were last updated, when actions were received by Amazon Kendra, the latest action that should process and apply after other actions, and useful error messages if an action could not be processed. DescribePrincipalMapping is currently not supported in the Amazon Web Services GovCloud (US-West) region.",
  "parameters": [
    {
      "name": "IndexId",
      "type": "string",
      "required": true,
      "description": "The identifier of the index required to check the processing of PUT and DELETE actions for mapping users to their groups.",
      "nested_params": []
    },
    {
      "name": "DataSourceId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "GroupId",
      "type": "string",
      "required": true,
      "description": "The identifier of the group required to check the processing of PUT and DELETE actions for mapping users to their groups.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "IndexId",
          "type": "string",
          "description": "Shows the identifier of the index to see information on the processing of PUT and DELETE actions for mapping users to their groups.",
          "nested_items": []
        },
        {
          "name": "DataSourceId",
          "type": "string",
          "description": "Shows the identifier of the data source to see information on the processing of PUT and DELETE actions for mapping users to their groups.",
          "nested_items": []
        },
        {
          "name": "GroupId",
          "type": "string",
          "description": "Shows the identifier of the group to see information on the processing of PUT and DELETE actions for mapping users to their groups.",
          "nested_items": []
        },
        {
          "name": "GroupOrderingIdSummaries",
          "type": "list",
          "description": "Shows the following information on the processing of PUT and DELETE actions for mapping users to their groups:",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "Status--\u0094the status can be either PROCESSING, SUCCEEDED, DELETING, DELETED, or FAILED.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "Last updated--\u0094the last date-time an action was updated.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "Received--\u0094the last date-time an action was received or submitted.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "Ordering ID--\u0094the latest action that should process and apply after other actions.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "Failure reason--\u0094the reason an action could not be processed.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}