{
  "method_name": "list_items",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/mediastore-data/client/list_items.html",
  "description": "Provides a list of metadata entries about folders and objects in the specified folder.",
  "parameters": [
    {
      "name": "Path",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "The maximum number of results to return per API request. For example, you submit a ListItems request with MaxResults set at 500. Although 2,000 items match your request, the service returns no more than the first 500 items. (The service also returns a NextToken value that you can use to fetch the next batch of results.) The service might return fewer results than the MaxResults value. If MaxResults is not included in the request, the service defaults to pagination with a maximum of 1,000 results per page.",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "The token that identifies which batch of results that you want to see. For example, you submit a ListItems request with MaxResults set at 500. The service returns the first batch of results (up to 500) and a NextToken value. To see the next batch of results, you can submit the ListItems request a second time and specify the NextToken value. Tokens expire after 15 minutes.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Items",
          "type": "list",
          "description": "The metadata entries for the folders and objects at the requested path.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The name of the item.",
                  "nested_items": []
                },
                {
                  "name": "Type",
                  "type": "string",
                  "description": "The item type (folder or object).",
                  "nested_items": []
                },
                {
                  "name": "ETag",
                  "type": "string",
                  "description": "The ETag that represents a unique instance of the item.",
                  "nested_items": []
                },
                {
                  "name": "LastModified",
                  "type": "datetime",
                  "description": "The date and time that the item was last modified.",
                  "nested_items": []
                },
                {
                  "name": "ContentType",
                  "type": "string",
                  "description": "The content type of the item.",
                  "nested_items": []
                },
                {
                  "name": "ContentLength",
                  "type": "integer",
                  "description": "The length of the item in bytes.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The token that can be used in a request to view the next set of results. For example, you submit a ListItems request that matches 2,000 items with MaxResults set at 500. The service returns the first batch of results (up to 500) and a NextToken value that can be used to fetch the next batch of results.",
          "nested_items": []
        }
      ]
    }
  ]
}