{
  "method_name": "create_bill_of_materials_import_job",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/supplychain/client/create_bill_of_materials_import_job.html",
  "description": "CreateBillOfMaterialsImportJob creates an import job for the Product Bill Of Materials (BOM) entity. For information on the product_bom entity, see the AWS Supply Chain User Guide. The CSV file must be located in an Amazon S3 location accessible to AWS Supply Chain. It is recommended to use the same Amazon S3 bucket created during your AWS Supply Chain instance creation.",
  "parameters": [
    {
      "name": "instanceId",
      "type": "string",
      "required": true,
      "description": "The AWS Supply Chain instance identifier.",
      "nested_params": []
    },
    {
      "name": "s3uri",
      "type": "string",
      "required": true,
      "description": "The S3 URI of the CSV file to be imported. The bucket must grant permissions for AWS Supply Chain to read the file.",
      "nested_params": []
    },
    {
      "name": "clientToken",
      "type": "string",
      "required": false,
      "description": "An idempotency token ensures the API request is only completed no more than once. This way, retrying the request will not trigger the operation multiple times. A client token is a unique, case-sensitive string of 33 to 128 ASCII characters. To make an idempotent API request, specify a client token in the request. You should not reuse the same client token for other requests. If you retry a successful request with the same client token, the request will succeed with no further actions being taken, and you will receive the same API response as the original successful request. This field is autopopulated if not provided.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "jobId",
          "type": "string",
          "description": "The new BillOfMaterialsImportJob identifier.",
          "nested_items": []
        }
      ]
    }
  ]
}