{
  "method_name": "create_job",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/elastictranscoder/client/create_job.html",
  "description": "When you create a job, Elastic Transcoder returns JSON data that includes the values that you specified plus information about the job that is created. If you have specified more than one output for your jobs (for example, one output for the Kindle Fire and another output for the Apple iPhone 4s), you currently must use the Elastic Transcoder API to list the jobs (as opposed to the AWS Console).",
  "parameters": [
    {
      "name": "PipelineId",
      "type": "string",
      "required": true,
      "description": "The Id of the pipeline that you want Elastic Transcoder to use for transcoding. The pipeline determines several settings, including the Amazon S3 bucket from which Elastic Transcoder gets the files to transcode and the bucket into which Elastic Transcoder puts the transcoded files.",
      "nested_params": []
    },
    {
      "name": "Input",
      "type": "dict",
      "required": false,
      "description": "A section of the request body that provides information about the file that is being transcoded. Key (string) --- The name of the file to transcode. Elsewhere in the body of the JSON block is the the ID of the pipeline to use for processing the job. The InputBucket object in that pipeline tells Elastic Transcoder which Amazon S3 bucket to get the file from. If the file name includes a prefix, such as cooking/lasagna.mpg, include the prefix in the key. If the file isn't in the specified bucket, Elastic Transcoder returns an error. FrameRate (string) --- The frame rate of the input file. If you want Elastic Transcoder to automatically detect the frame rate of the input file, specify auto. If you want to specify the frame rate for the input file, enter one of the following values: 10, 15, 23.97, 24, 25, 29.97, 30, 60 If you specify a value other than auto, Elastic Transcoder disables automatic detection of the frame rate. Resolution (string) --- This value must be auto, which causes Elastic Transcoder to automatically detect the resolution of the input file. AspectRatio (string) --- The aspect ratio of the input file. If you want Elastic Transcoder to automatically detect the aspect ratio of the input file, specify auto. If you want to specify the aspect ratio for the output file, enter one of the following values: 1:1, 4:3, 3:2, 16:9 If you specify a value other than auto, Elastic Transcoder disables automatic detection of the aspect ratio. Interlaced (string) --- Whether the input file is interlaced. If you want Elastic Transcoder to automatically detect whether the input file is interlaced, specify auto. If you want to specify whether the input file is interlaced, enter one of the following values: true, false If you specify a value other than auto, Elastic Transcoder disables automatic detection of interlacing. Container (string) --- The container type for the input file. If you want Elastic Transcoder to automatically detect the container type of the input file, specify auto. If you want to specify the container type for the input file, enter one of the following values: 3gp, aac, asf, avi, divx, flv, m4a, mkv, mov, mp3, mp4, mpeg, mpeg-ps, mpeg-ts, mxf, ogg, vob, wav, webm Encryption (dict) --- The encryption settings, if any, that are used for decrypting your input files. If your input file is encrypted, you must specify the mode that Elastic Transcoder uses to decrypt your file. Mode (string) --- The specific server-side encryption mode that you want Elastic Transcoder to use when decrypting your input files or encrypting your output files. Elastic Transcoder supports the following options: s3: Amazon S3 creates and manages the keys used for encrypting your files. s3-aws-kms: Amazon S3 calls the Amazon Key Management Service, which creates and manages the keys that are used for encrypting your files. If you specify s3-aws-kms and you don't want to use the default key, you must add the AWS-KMS key that you want to use to your pipeline. aes-cbc-pkcs7: A padded cipher-block mode of operation originally used for HLS files. aes-ctr: AES Counter Mode. aes-gcm: AES Galois Counter Mode, a mode of operation that is an authenticated encryption format, meaning that a file, key, or initialization vector that has been tampered with fails the decryption process. For all three AES options, you must provide the following settings, which must be base64-encoded: Key (string) --- The data encryption key that you want Elastic Transcoder to use to encrypt your output file, or that was used to encrypt your input file. The key must be base64-encoded and it must be one of the following bit lengths before being base64-encoded: 128, 192, or 256. The key must also be encrypted by using the Amazon Key Management Service. KeyMd5 (string) --- The MD5 digest of the key that you used to encrypt your input file, or that you want Elastic Transcoder to use to encrypt your output file. Elastic Transcoder uses the key digest as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded. InitializationVector (string) --- The series of random bits created by a random bit generator, unique for every encryption operation, that you used to encrypt your input files or that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded. TimeSpan (dict) --- Settings for clipping an input. Each input can have different clip settings. StartTime (string) --- The place in the input file where you want a clip to start. The format can be either HH:mm:ss.SSS (maximum value: 23:59:59.999; SSS is thousandths of a second) or sssss.SSS (maximum value: 86399.999). If you don't specify a value, Elastic Transcoder starts at the beginning of the input file. Duration (string) --- The duration of the clip. If you don't specify a value, Elastic Transcoder creates an output file from StartTime to the end of the file. If you specify a value longer than the duration of the input file, Elastic Transcoder transcodes the file and returns a warning message. InputCaptions (dict) --- You can configure Elastic Transcoder to transcode captions, or subtitles, from one format to another. All captions must be in UTF-8. Elastic Transcoder supports two types of captions: Embedded: Embedded captions are included in the same file as the audio and video. Elastic Transcoder supports only one embedded caption per language, to a maximum of 300 embedded captions per file. Valid input values include: CEA-608 (EIA-608, first non-empty channel only), CEA-708 (EIA-708, first non-empty channel only), and mov-text Valid outputs include: mov-text Elastic Transcoder supports a maximum of one embedded format per output. Sidecar: Sidecar captions are kept in a separate metadata file from the audio and video data. Sidecar captions require a player that is capable of understanding the relationship between the video file and the sidecar file. Elastic Transcoder supports only one sidecar caption per language, to a maximum of 20 sidecar captions per file. Valid input values include: dfxp (first div element only), ebu-tt, scc, smpt, srt, ttml (first div element only), and webvtt Valid outputs include: dfxp (first div element only), scc, srt, and webvtt. If you want ttml or smpte-tt compatible captions, specify dfxp as your output format. Elastic Transcoder does not support OCR (Optical Character Recognition), does not accept pictures as a valid input for captions, and is not available for audio-only transcoding. Elastic Transcoder does not preserve text formatting (for example, italics) during the transcoding process. To remove captions or leave the captions empty, set Captions to null. To pass through existing captions unchanged, set the MergePolicy to MergeRetain, and pass in a null CaptionSources array. For more information on embedded files, see the Subtitles Wikipedia page. For more information on sidecar files, see the Extensible Metadata Platform and Sidecar file Wikipedia pages. MergePolicy (string) --- A policy that determines how Elastic Transcoder handles the existence of multiple captions. MergeOverride: Elastic Transcoder transcodes both embedded and sidecar captions into outputs. If captions for a language are embedded in the input file and also appear in a sidecar file, Elastic Transcoder uses the sidecar captions and ignores the embedded captions for that language. MergeRetain: Elastic Transcoder transcodes both embedded and sidecar captions into outputs. If captions for a language are embedded in the input file and also appear in a sidecar file, Elastic Transcoder uses the embedded captions and ignores the sidecar captions for that language. If CaptionSources is empty, Elastic Transcoder omits all sidecar captions from the output files. Override: Elastic Transcoder transcodes only the sidecar captions that you specify in CaptionSources. MergePolicy cannot be null. CaptionSources (list) --- Source files for the input sidecar captions used during the transcoding process. To omit all sidecar captions, leave CaptionSources blank. (dict) --- A source file for the input sidecar captions used during the transcoding process. Key (string) --- The name of the sidecar caption file that you want Elastic Transcoder to include in the output file. Language (string) --- A string that specifies the language of the caption. If you specified multiple inputs with captions, the caption language must match in order to be included in the output. Specify this as one of: 2-character ISO 639-1 code 3-character ISO 639-2 code For more information on ISO language codes and language names, see the List of ISO 639-1 codes. TimeOffset (string) --- For clip generation or captions that do not start at the same time as the associated video file, the TimeOffset tells Elastic Transcoder how much of the video to encode before including captions. Specify the TimeOffset in the form [+-]SS.sss or [+-]HH:mm:SS.ss. Label (string) --- The label of the caption shown in the player when choosing a language. We recommend that you put the caption language name here, in the language of the captions. Encryption (dict) --- The encryption settings, if any, that Elastic Transcoder needs to decyrpt your caption sources, or that you want Elastic Transcoder to apply to your caption sources. DetectedProperties (dict) --- The detected properties of the input file. Width (integer) --- The detected width of the input file, in pixels. Height (integer) --- The detected height of the input file, in pixels. FrameRate (string) --- The detected frame rate of the input file, in frames per second. FileSize (integer) --- The detected file size of the input file, in bytes. DurationMillis (integer) --- The detected duration of the input file, in milliseconds.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The name of the file to transcode. Elsewhere in the body of the JSON block is the the ID of the pipeline to use for processing the job. The InputBucket object in that pipeline tells Elastic Transcoder which Amazon S3 bucket to get the file from. If the file name includes a prefix, such as cooking/lasagna.mpg, include the prefix in the key. If the file isn't in the specified bucket, Elastic Transcoder returns an error.",
          "nested_params": []
        },
        {
          "name": "FrameRate",
          "type": "string",
          "required": false,
          "description": "The frame rate of the input file. If you want Elastic Transcoder to automatically detect the frame rate of the input file, specify auto. If you want to specify the frame rate for the input file, enter one of the following values: 10, 15, 23.97, 24, 25, 29.97, 30, 60 If you specify a value other than auto, Elastic Transcoder disables automatic detection of the frame rate.",
          "nested_params": []
        },
        {
          "name": "Resolution",
          "type": "string",
          "required": false,
          "description": "This value must be auto, which causes Elastic Transcoder to automatically detect the resolution of the input file.",
          "nested_params": []
        },
        {
          "name": "AspectRatio",
          "type": "string",
          "required": false,
          "description": "The aspect ratio of the input file. If you want Elastic Transcoder to automatically detect the aspect ratio of the input file, specify auto. If you want to specify the aspect ratio for the output file, enter one of the following values: 1:1, 4:3, 3:2, 16:9 If you specify a value other than auto, Elastic Transcoder disables automatic detection of the aspect ratio.",
          "nested_params": []
        },
        {
          "name": "Interlaced",
          "type": "string",
          "required": false,
          "description": "Whether the input file is interlaced. If you want Elastic Transcoder to automatically detect whether the input file is interlaced, specify auto. If you want to specify whether the input file is interlaced, enter one of the following values: true, false If you specify a value other than auto, Elastic Transcoder disables automatic detection of interlacing.",
          "nested_params": []
        },
        {
          "name": "Container",
          "type": "string",
          "required": false,
          "description": "The container type for the input file. If you want Elastic Transcoder to automatically detect the container type of the input file, specify auto. If you want to specify the container type for the input file, enter one of the following values: 3gp, aac, asf, avi, divx, flv, m4a, mkv, mov, mp3, mp4, mpeg, mpeg-ps, mpeg-ts, mxf, ogg, vob, wav, webm.",
          "nested_params": []
        },
        {
          "name": "Encryption",
          "type": "dict",
          "required": false,
          "description": "The encryption settings, if any, that are used for decrypting your input files. If your input file is encrypted, you must specify the mode that Elastic Transcoder uses to decrypt your file.",
          "nested_params": [
            {
              "name": "Mode",
              "type": "string",
              "required": false,
              "description": "The specific server-side encryption mode that you want Elastic Transcoder to use when decrypting your input files or encrypting your output files. Elastic Transcoder supports the following options:",
              "nested_params": [
                {
                  "name": "s3:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "s3-aws-kms:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "aes-cbc-pkcs7:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "aes-ctr:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "aes-gcm:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Key",
              "type": "string",
              "required": false,
              "description": "The data encryption key that you want Elastic Transcoder to use to encrypt your output file, or that was used to encrypt your input file. The key must be base64-encoded and it must be one of the following bit lengths before being base64-encoded: 128, 192, or 256. The key must also be encrypted by using the Amazon Key Management Service.",
              "nested_params": []
            },
            {
              "name": "KeyMd5",
              "type": "string",
              "required": false,
              "description": "The MD5 digest of the key that you used to encrypt your input file, or that you want Elastic Transcoder to use to encrypt your output file. Elastic Transcoder uses the key digest as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
              "nested_params": []
            },
            {
              "name": "InitializationVector",
              "type": "string",
              "required": false,
              "description": "The series of random bits created by a random bit generator, unique for every encryption operation, that you used to encrypt your input files or that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "TimeSpan",
          "type": "dict",
          "required": false,
          "description": "Settings for clipping an input. Each input can have different clip settings.",
          "nested_params": [
            {
              "name": "StartTime",
              "type": "string",
              "required": false,
              "description": "The place in the input file where you want a clip to start. The format can be either HH:mm:ss.SSS (maximum value: 23:59:59.999; SSS is thousandths of a second) or sssss.SSS (maximum value: 86399.999). If you don't specify a value, Elastic Transcoder starts at the beginning of the input file.",
              "nested_params": []
            },
            {
              "name": "Duration",
              "type": "string",
              "required": false,
              "description": "The duration of the clip. The format can be either HH:mm:ss.SSS (maximum value: 23:59:59.999; SSS is thousandths of a second) or sssss.SSS (maximum value: 86399.999). If you don't specify a value, Elastic Transcoder creates an output file from StartTime to the end of the file. If you specify a value longer than the duration of the input file, Elastic Transcoder transcodes the file and returns a warning message.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "InputCaptions",
          "type": "dict",
          "required": false,
          "description": "You can configure Elastic Transcoder to transcode captions, or subtitles, from one format to another. All captions must be in UTF-8. Elastic Transcoder supports two types of captions:",
          "nested_params": [
            {
              "name": "Embedded:",
              "type": "EIA-608, first non-empty channel only",
              "required": false,
              "description": "",
              "nested_params": []
            },
            {
              "name": "Sidecar:",
              "type": "first div element only",
              "required": false,
              "description": "",
              "nested_params": []
            }
          ]
        },
        {
          "name": "DetectedProperties",
          "type": "dict",
          "required": false,
          "description": "The detected properties of the input file.",
          "nested_params": [
            {
              "name": "Width",
              "type": "integer",
              "required": false,
              "description": "The detected width of the input file, in pixels.",
              "nested_params": []
            },
            {
              "name": "Height",
              "type": "integer",
              "required": false,
              "description": "The detected height of the input file, in pixels.",
              "nested_params": []
            },
            {
              "name": "FrameRate",
              "type": "string",
              "required": false,
              "description": "The detected frame rate of the input file, in frames per second.",
              "nested_params": []
            },
            {
              "name": "FileSize",
              "type": "integer",
              "required": false,
              "description": "The detected file size of the input file, in bytes.",
              "nested_params": []
            },
            {
              "name": "DurationMillis",
              "type": "integer",
              "required": false,
              "description": "The detected duration of the input file, in milliseconds.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "Inputs",
      "type": "list",
      "required": false,
      "description": "A section of the request body that provides information about the files that are being transcoded. (dict) --- Information about the file that you're transcoding. Key (string) --- The name of the file to transcode. Elsewhere in the body of the JSON block is the the ID of the pipeline to use for processing the job. The InputBucket object in that pipeline tells Elastic Transcoder which Amazon S3 bucket to get the file from. If the file name includes a prefix, such as cooking/lasagna.mpg, include the prefix in the key. If the file isn't in the specified bucket, Elastic Transcoder returns an error. FrameRate (string) --- The frame rate of the input file. If you want Elastic Transcoder to automatically detect the frame rate of the input file, specify auto. If you want to specify the frame rate for the input file, enter one of the following values: 10, 15, 23.97, 24, 25, 29.97, 30, 60 If you specify a value other than auto, Elastic Transcoder disables automatic detection of the frame rate. Resolution (string) --- This value must be auto, which causes Elastic Transcoder to automatically detect the resolution of the input file. AspectRatio (string) --- The aspect ratio of the input file. If you want Elastic Transcoder to automatically detect the aspect ratio of the input file, specify auto. If you want to specify the aspect ratio for the output file, enter one of the following values: 1:1, 4:3, 3:2, 16:9 If you specify a value other than auto, Elastic Transcoder disables automatic detection of the aspect ratio. Interlaced (string) --- Whether the input file is interlaced. If you want Elastic Transcoder to automatically detect whether the input file is interlaced, specify auto. If you want to specify whether the input file is interlaced, enter one of the following values: true, false If you specify a value other than auto, Elastic Transcoder disables automatic detection of interlacing. Container (string) --- The container type for the input file. If you want Elastic Transcoder to automatically detect the container type of the input file, specify auto. If you want to specify the container type for the input file, enter one of the following values: 3gp, aac, asf, avi, divx, flv, m4a, mkv, mov, mp3, mp4, mpeg, mpeg-ps, mpeg-ts, mxf, ogg, vob, wav, webm Encryption (dict) --- The encryption settings, if any, that are used for decrypting your input files. If your input file is encrypted, you must specify the mode that Elastic Transcoder uses to decrypt your file. Mode (string) --- The specific server-side encryption mode that you want Elastic Transcoder to use when decrypting your input files or encrypting your output files. Elastic Transcoder supports the following options: s3: Amazon S3 creates and manages the keys used for encrypting your files. s3-aws-kms: Amazon S3 calls the Amazon Key Management Service, which creates and manages the keys that are used for encrypting your files. If you specify s3-aws-kms and you don't want to use the default key, you must add the AWS-KMS key that you want to use to your pipeline. aes-cbc-pkcs7: A padded cipher-block mode of operation originally used for HLS files. aes-ctr: AES Counter Mode. aes-gcm: AES Galois Counter Mode, a mode of operation that is an authenticated encryption format, meaning that a file, key, or initialization vector that has been tampered with fails the decryption process. For all three AES options, you must provide the following settings, which must be base64-encoded: Key (string) --- The data encryption key that you want Elastic Transcoder to use to encrypt your output file, or that was used to encrypt your input file. The key must be base64-encoded and it must be one of the following bit lengths before being base64-encoded: 128, 192, or 256. The key must also be encrypted by using the Amazon Key Management Service. KeyMd5 (string) --- The MD5 digest of the key that you used to encrypt your input file, or that you want Elastic Transcoder to use to encrypt your output file. Elastic Transcoder uses the key digest as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded. InitializationVector (string) --- The series of random bits created by a random bit generator, unique for every encryption operation, that you used to encrypt your input files or that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded. TimeSpan (dict) --- Settings for clipping an input. Each input can have different clip settings. StartTime (string) --- The place in the input file where you want a clip to start. The format can be either HH:mm:ss.SSS (maximum value: 23:59:59.999; SSS is thousandths of a second) or sssss.SSS (maximum value: 86399.999). If you don't specify a value, Elastic Transcoder starts at the beginning of the input file. Duration (string) --- The duration of the clip. If you don't specify a value, Elastic Transcoder creates an output file from StartTime to the end of the file. If you specify a value longer than the duration of the input file, Elastic Transcoder transcodes the file and returns a warning message. InputCaptions (dict) --- You can configure Elastic Transcoder to transcode captions, or subtitles, from one format to another. All captions must be in UTF-8. Elastic Transcoder supports two types of captions: Embedded: Embedded captions are included in the same file as the audio and video. Elastic Transcoder supports only one embedded caption per language, to a maximum of 300 embedded captions per file. Valid input values include: CEA-608 (EIA-608, first non-empty channel only), CEA-708 (EIA-708, first non-empty channel only), and mov-text Valid outputs include: mov-text Elastic Transcoder supports a maximum of one embedded format per output. Sidecar: Sidecar captions are kept in a separate metadata file from the audio and video data. Sidecar captions require a player that is capable of understanding the relationship between the video file and the sidecar file. Elastic Transcoder supports only one sidecar caption per language, to a maximum of 20 sidecar captions per file. Valid input values include: dfxp (first div element only), ebu-tt, scc, smpt, srt, ttml (first div element only), and webvtt Valid outputs include: dfxp (first div element only), scc, srt, and webvtt. If you want ttml or smpte-tt compatible captions, specify dfxp as your output format. Elastic Transcoder does not support OCR (Optical Character Recognition), does not accept pictures as a valid input for captions, and is not available for audio-only transcoding. Elastic Transcoder does not preserve text formatting (for example, italics) during the transcoding process. To remove captions or leave the captions empty, set Captions to null. To pass through existing captions unchanged, set the MergePolicy to MergeRetain, and pass in a null CaptionSources array. For more information on embedded files, see the Subtitles Wikipedia page. For more information on sidecar files, see the Extensible Metadata Platform and Sidecar file Wikipedia pages. MergePolicy (string) --- A policy that determines how Elastic Transcoder handles the existence of multiple captions. MergeOverride: Elastic Transcoder transcodes both embedded and sidecar captions into outputs. If captions for a language are embedded in the input file and also appear in a sidecar file, Elastic Transcoder uses the sidecar captions and ignores the embedded captions for that language. MergeRetain: Elastic Transcoder transcodes both embedded and sidecar captions into outputs. If captions for a language are embedded in the input file and also appear in a sidecar file, Elastic Transcoder uses the embedded captions and ignores the sidecar captions for that language. If CaptionSources is empty, Elastic Transcoder omits all sidecar captions from the output files. Override: Elastic Transcoder transcodes only the sidecar captions that you specify in CaptionSources. MergePolicy cannot be null. CaptionSources (list) --- Source files for the input sidecar captions used during the transcoding process. To omit all sidecar captions, leave CaptionSources blank. (dict) --- A source file for the input sidecar captions used during the transcoding process. Key (string) --- The name of the sidecar caption file that you want Elastic Transcoder to include in the output file. Language (string) --- A string that specifies the language of the caption. If you specified multiple inputs with captions, the caption language must match in order to be included in the output. Specify this as one of: 2-character ISO 639-1 code 3-character ISO 639-2 code For more information on ISO language codes and language names, see the List of ISO 639-1 codes. TimeOffset (string) --- For clip generation or captions that do not start at the same time as the associated video file, the TimeOffset tells Elastic Transcoder how much of the video to encode before including captions. Specify the TimeOffset in the form [+-]SS.sss or [+-]HH:mm:SS.ss. Label (string) --- The label of the caption shown in the player when choosing a language. We recommend that you put the caption language name here, in the language of the captions. Encryption (dict) --- The encryption settings, if any, that Elastic Transcoder needs to decyrpt your caption sources, or that you want Elastic Transcoder to apply to your caption sources. DetectedProperties (dict) --- The detected properties of the input file. Width (integer) --- The detected width of the input file, in pixels. Height (integer) --- The detected height of the input file, in pixels. FrameRate (string) --- The detected frame rate of the input file, in frames per second. FileSize (integer) --- The detected file size of the input file, in bytes. DurationMillis (integer) --- The detected duration of the input file, in milliseconds.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The name of the file to transcode. Elsewhere in the body of the JSON block is the the ID of the pipeline to use for processing the job. The InputBucket object in that pipeline tells Elastic Transcoder which Amazon S3 bucket to get the file from. If the file name includes a prefix, such as cooking/lasagna.mpg, include the prefix in the key. If the file isn't in the specified bucket, Elastic Transcoder returns an error.",
          "nested_params": []
        },
        {
          "name": "FrameRate",
          "type": "string",
          "required": false,
          "description": "The frame rate of the input file. If you want Elastic Transcoder to automatically detect the frame rate of the input file, specify auto. If you want to specify the frame rate for the input file, enter one of the following values: 10, 15, 23.97, 24, 25, 29.97, 30, 60 If you specify a value other than auto, Elastic Transcoder disables automatic detection of the frame rate.",
          "nested_params": []
        },
        {
          "name": "Resolution",
          "type": "string",
          "required": false,
          "description": "This value must be auto, which causes Elastic Transcoder to automatically detect the resolution of the input file.",
          "nested_params": []
        },
        {
          "name": "AspectRatio",
          "type": "string",
          "required": false,
          "description": "The aspect ratio of the input file. If you want Elastic Transcoder to automatically detect the aspect ratio of the input file, specify auto. If you want to specify the aspect ratio for the output file, enter one of the following values: 1:1, 4:3, 3:2, 16:9 If you specify a value other than auto, Elastic Transcoder disables automatic detection of the aspect ratio.",
          "nested_params": []
        },
        {
          "name": "Interlaced",
          "type": "string",
          "required": false,
          "description": "Whether the input file is interlaced. If you want Elastic Transcoder to automatically detect whether the input file is interlaced, specify auto. If you want to specify whether the input file is interlaced, enter one of the following values: true, false If you specify a value other than auto, Elastic Transcoder disables automatic detection of interlacing.",
          "nested_params": []
        },
        {
          "name": "Container",
          "type": "string",
          "required": false,
          "description": "The container type for the input file. If you want Elastic Transcoder to automatically detect the container type of the input file, specify auto. If you want to specify the container type for the input file, enter one of the following values: 3gp, aac, asf, avi, divx, flv, m4a, mkv, mov, mp3, mp4, mpeg, mpeg-ps, mpeg-ts, mxf, ogg, vob, wav, webm.",
          "nested_params": []
        },
        {
          "name": "Encryption",
          "type": "dict",
          "required": false,
          "description": "The encryption settings, if any, that are used for decrypting your input files. If your input file is encrypted, you must specify the mode that Elastic Transcoder uses to decrypt your file.",
          "nested_params": [
            {
              "name": "Mode",
              "type": "string",
              "required": false,
              "description": "The specific server-side encryption mode that you want Elastic Transcoder to use when decrypting your input files or encrypting your output files. Elastic Transcoder supports the following options:",
              "nested_params": [
                {
                  "name": "s3:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "s3-aws-kms:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "aes-cbc-pkcs7:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "aes-ctr:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "aes-gcm:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Key",
              "type": "string",
              "required": false,
              "description": "The data encryption key that you want Elastic Transcoder to use to encrypt your output file, or that was used to encrypt your input file. The key must be base64-encoded and it must be one of the following bit lengths before being base64-encoded: 128, 192, or 256. The key must also be encrypted by using the Amazon Key Management Service.",
              "nested_params": []
            },
            {
              "name": "KeyMd5",
              "type": "string",
              "required": false,
              "description": "The MD5 digest of the key that you used to encrypt your input file, or that you want Elastic Transcoder to use to encrypt your output file. Elastic Transcoder uses the key digest as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
              "nested_params": []
            },
            {
              "name": "InitializationVector",
              "type": "string",
              "required": false,
              "description": "The series of random bits created by a random bit generator, unique for every encryption operation, that you used to encrypt your input files or that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "TimeSpan",
          "type": "dict",
          "required": false,
          "description": "Settings for clipping an input. Each input can have different clip settings.",
          "nested_params": [
            {
              "name": "StartTime",
              "type": "string",
              "required": false,
              "description": "The place in the input file where you want a clip to start. The format can be either HH:mm:ss.SSS (maximum value: 23:59:59.999; SSS is thousandths of a second) or sssss.SSS (maximum value: 86399.999). If you don't specify a value, Elastic Transcoder starts at the beginning of the input file.",
              "nested_params": []
            },
            {
              "name": "Duration",
              "type": "string",
              "required": false,
              "description": "The duration of the clip. The format can be either HH:mm:ss.SSS (maximum value: 23:59:59.999; SSS is thousandths of a second) or sssss.SSS (maximum value: 86399.999). If you don't specify a value, Elastic Transcoder creates an output file from StartTime to the end of the file. If you specify a value longer than the duration of the input file, Elastic Transcoder transcodes the file and returns a warning message.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "InputCaptions",
          "type": "dict",
          "required": false,
          "description": "You can configure Elastic Transcoder to transcode captions, or subtitles, from one format to another. All captions must be in UTF-8. Elastic Transcoder supports two types of captions:",
          "nested_params": [
            {
              "name": "Embedded:",
              "type": "EIA-608, first non-empty channel only",
              "required": false,
              "description": "",
              "nested_params": []
            },
            {
              "name": "Sidecar:",
              "type": "first div element only",
              "required": false,
              "description": "",
              "nested_params": []
            }
          ]
        },
        {
          "name": "DetectedProperties",
          "type": "dict",
          "required": false,
          "description": "The detected properties of the input file.",
          "nested_params": [
            {
              "name": "Width",
              "type": "integer",
              "required": false,
              "description": "The detected width of the input file, in pixels.",
              "nested_params": []
            },
            {
              "name": "Height",
              "type": "integer",
              "required": false,
              "description": "The detected height of the input file, in pixels.",
              "nested_params": []
            },
            {
              "name": "FrameRate",
              "type": "string",
              "required": false,
              "description": "The detected frame rate of the input file, in frames per second.",
              "nested_params": []
            },
            {
              "name": "FileSize",
              "type": "integer",
              "required": false,
              "description": "The detected file size of the input file, in bytes.",
              "nested_params": []
            },
            {
              "name": "DurationMillis",
              "type": "integer",
              "required": false,
              "description": "The detected duration of the input file, in milliseconds.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "Output",
      "type": "dict",
      "required": false,
      "description": "A section of the request body that provides information about the transcoded (target) file. We strongly recommend that you use the Outputs syntax instead of the Output syntax. Key (string) --- The name to assign to the transcoded file. Elastic Transcoder saves the file in the Amazon S3 bucket specified by the OutputBucket object in the pipeline that is specified by the pipeline ID. If a file with the specified name already exists in the output bucket, the job fails. ThumbnailPattern (string) --- Whether you want Elastic Transcoder to create thumbnails for your videos and, if so, how you want Elastic Transcoder to name the files. If you don't want Elastic Transcoder to create thumbnails, specify ''. If you do want Elastic Transcoder to create thumbnails, specify the information that you want to include in the file name for each thumbnail. You can specify the following values in any sequence: {count} (Required): If you want to create thumbnails, you must include {count} in the ThumbnailPattern object. Wherever you specify {count}, Elastic Transcoder adds a five-digit sequence number (beginning with 00001) to thumbnail file names. The number indicates where a given thumbnail appears in the sequence of thumbnails for a transcoded file. Literal values (Optional): You can specify literal values anywhere in the ThumbnailPattern object. For example, you can include them as a file name prefix or as a delimiter between {resolution} and {count}. {resolution} (Optional): If you want Elastic Transcoder to include the resolution in the file name, include {resolution} in the ThumbnailPattern object. When creating thumbnails, Elastic Transcoder automatically saves the files in the format (.jpg or .png) that appears in the preset that you specified in the PresetID value of CreateJobOutput. Elastic Transcoder also appends the applicable file name extension. ThumbnailEncryption (dict) --- The encryption settings, if any, that you want Elastic Transcoder to apply to your thumbnail. Mode (string) --- The specific server-side encryption mode that you want Elastic Transcoder to use when decrypting your input files or encrypting your output files. Elastic Transcoder supports the following options: s3: Amazon S3 creates and manages the keys used for encrypting your files. s3-aws-kms: Amazon S3 calls the Amazon Key Management Service, which creates and manages the keys that are used for encrypting your files. If you specify s3-aws-kms and you don't want to use the default key, you must add the AWS-KMS key that you want to use to your pipeline. aes-cbc-pkcs7: A padded cipher-block mode of operation originally used for HLS files. aes-ctr: AES Counter Mode. aes-gcm: AES Galois Counter Mode, a mode of operation that is an authenticated encryption format, meaning that a file, key, or initialization vector that has been tampered with fails the decryption process. For all three AES options, you must provide the following settings, which must be base64-encoded: Key (string) --- The data encryption key that you want Elastic Transcoder to use to encrypt your output file, or that was used to encrypt your input file. The key must be base64-encoded and it must be one of the following bit lengths before being base64-encoded: 128, 192, or 256. The key must also be encrypted by using the Amazon Key Management Service. KeyMd5 (string) --- The MD5 digest of the key that you used to encrypt your input file, or that you want Elastic Transcoder to use to encrypt your output file. Elastic Transcoder uses the key digest as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded. InitializationVector (string) --- The series of random bits created by a random bit generator, unique for every encryption operation, that you used to encrypt your input files or that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded. Rotate (string) --- The number of degrees clockwise by which you want Elastic Transcoder to rotate the output relative to the input. Enter one of the following values: auto, 0, 90, 180, 270. The value auto generally works only if the file that you're transcoding contains rotation metadata. PresetId (string) --- The Id of the preset to use for this job. The preset determines the audio, video, and thumbnail settings that Elastic Transcoder uses for transcoding. SegmentDuration (string) --- If you specify a preset in PresetId for which the value of Container is fmp4 (Fragmented MP4) or ts (MPEG-TS), SegmentDuration is the target maximum duration of each segment in seconds. For HLSv3 format playlists, each media segment is stored in a separate .ts file. For HLSv4 and Smooth playlists, all media segments for an output are stored in a single file. Each segment is approximately the length of the SegmentDuration, though individual segments might be shorter or longer. The range of valid values is 1 to 60 seconds. If the duration of the video is not evenly divisible by SegmentDuration, the duration of the last segment is the remainder of total length/SegmentDuration. Elastic Transcoder creates an output-specific playlist for each output HLS output that you specify in OutputKeys. To add an output to the master playlist for this job, include it in the OutputKeys of the associated playlist. Watermarks (list) --- Information about the watermarks that you want Elastic Transcoder to add to the video during transcoding. You can specify up to four watermarks for each output. Settings for each watermark must be defined in the preset for the current output. (dict) --- Watermarks can be in .png or .jpg format. If you want to display a watermark that is not rectangular, use the .png format, which supports transparency. PresetWatermarkId (string) --- The ID of the watermark settings that Elastic Transcoder uses to add watermarks to the video during transcoding. The settings are in the preset specified by Preset for the current output. In that preset, the value of Watermarks Id tells Elastic Transcoder which settings to use. InputKey (string) --- The name of the .png or .jpg file that you want to use for the watermark. To determine which Amazon S3 bucket contains the specified file, Elastic Transcoder checks the pipeline specified by Pipeline; the Input Bucket object in that pipeline identifies the bucket. If the file name includes a prefix, for example, logos/128x64.png, include the prefix in the key. If the file isn't in the specified bucket, Elastic Transcoder returns an error. Encryption (dict) --- The encryption settings, if any, that you want Elastic Transcoder to apply to your watermarks. AlbumArt (dict) --- Information about the album art that you want Elastic Transcoder to add to the file during transcoding. You can specify up to twenty album artworks for each output. Settings for each artwork must be defined in the job for the current output. MergePolicy (string) --- A policy that determines how Elastic Transcoder handles the existence of multiple album artwork files. Replace: The specified album art replaces any existing album art. Prepend: The specified album art is placed in front of any existing album art. Append: The specified album art is placed after any existing album art. Fallback: If the original input file contains artwork, Elastic Transcoder uses that artwork for the output. If the original input does not contain artwork, Elastic Transcoder uses the specified album art file. Artwork (list) --- The file to be used as album art. There can be multiple artworks associated with an audio file, to a maximum of 20. Valid formats are .jpg and .png (dict) --- The file to be used as album art. To remove artwork or leave the artwork empty, you can either set Artwork to null, or set the Merge Policy to 'Replace' and use an empty Artwork array. To pass through existing artwork unchanged, set the Merge Policy to 'Prepend', 'Append', or 'Fallback', and use an empty Artwork array. InputKey (string) --- The name of the file to be used as album art. To determine which Amazon S3 bucket contains the specified file, Elastic Transcoder checks the pipeline specified by PipelineId; the InputBucket object in that pipeline identifies the bucket. If the file name includes a prefix, for example, cooking/pie.jpg, include the prefix in the key. MaxWidth (string) --- The maximum width of the output album art in pixels. If you specify auto, Elastic Transcoder uses 600 as the default value. If you specify a numeric value, enter an even integer between 32 and 4096, inclusive. MaxHeight (string) --- The maximum height of the output album art in pixels. If you specify a numeric value, enter an even integer between 32 and 3072, inclusive. SizingPolicy (string) --- Specify one of the following values to control scaling of the output album art: Fit: Elastic Transcoder scales the output art so it matches the value that you specified in either MaxWidth or MaxHeight without exceeding the other value. Fill: Elastic Transcoder scales the output art so it matches the value that you specified in either MaxWidth or MaxHeight and matches or exceeds the other value. Elastic Transcoder centers the output art and then crops it in the dimension (if any) that exceeds the maximum value. Stretch: Elastic Transcoder stretches the output art to match the values that you specified for MaxWidth and MaxHeight. If the relative proportions of the input art and the output art are different, the output art will be distorted. Keep: Elastic Transcoder does not scale the output art. If either dimension of the input art exceeds the values that you specified for MaxWidth and MaxHeight, Elastic Transcoder crops the output art. ShrinkToFit: Elastic Transcoder scales the output art down so that its dimensions match the values that you specified for at least one of MaxWidth and MaxHeight without exceeding either value. If you specify this option, Elastic Transcoder does not scale the art up. ShrinkToFill Elastic Transcoder scales the output art down so that its dimensions match the values that you specified for at least one of MaxWidth and MaxHeight without dropping below either value. PaddingPolicy (string) --- When you set PaddingPolicy to Pad, Elastic Transcoder may add white bars to the top and bottom and/or left and right sides of the output album art to make the total size of the output art match the values that you specified for MaxWidth and MaxHeight. AlbumArtFormat (string) --- The format of album art, if any. Valid formats are .jpg and .png. Encryption (dict) --- The encryption settings, if any, that you want Elastic Transcoder to apply to your artwork. Composition (list) --- You can create an output file that contains an excerpt from the input file. This excerpt, called a clip, can come from the beginning, middle, or end of the file. The Composition object contains settings for the clips that make up an output file. For the current release, you can only specify settings for a single clip per output file. The Composition object cannot be null. (dict) --- Settings for one clip in a composition. All jobs in a playlist must have the same clip settings. TimeSpan (dict) --- Settings that determine when a clip begins and how long it lasts. StartTime (string) --- The place in the input file where you want a clip to start. The format can be either HH:mm:ss.SSS (maximum value: 23:59:59.999; SSS is thousandths of a second) or sssss.SSS (maximum value: 86399.999). If you don't specify a value, Elastic Transcoder starts at the beginning of the input file. Duration (string) --- The duration of the clip. If you don't specify a value, Elastic Transcoder creates an output file from StartTime to the end of the file. If you specify a value longer than the duration of the input file, Elastic Transcoder transcodes the file and returns a warning message. Captions (dict) --- You can configure Elastic Transcoder to transcode captions, or subtitles, from one format to another. All captions must be in UTF-8. Elastic Transcoder supports two types of captions: Embedded: Embedded captions are included in the same file as the audio and video. Elastic Transcoder supports only one embedded caption per language, to a maximum of 300 embedded captions per file. Valid input values include: CEA-608 (EIA-608, first non-empty channel only), CEA-708 (EIA-708, first non-empty channel only), and mov-text Valid outputs include: mov-text Elastic Transcoder supports a maximum of one embedded format per output. Sidecar: Sidecar captions are kept in a separate metadata file from the audio and video data. Sidecar captions require a player that is capable of understanding the relationship between the video file and the sidecar file. Elastic Transcoder supports only one sidecar caption per language, to a maximum of 20 sidecar captions per file. Valid input values include: dfxp (first div element only), ebu-tt, scc, smpt, srt, ttml (first div element only), and webvtt Valid outputs include: dfxp (first div element only), scc, srt, and webvtt. If you want ttml or smpte-tt compatible captions, specify dfxp as your output format. Elastic Transcoder does not support OCR (Optical Character Recognition), does not accept pictures as a valid input for captions, and is not available for audio-only transcoding. Elastic Transcoder does not preserve text formatting (for example, italics) during the transcoding process. To remove captions or leave the captions empty, set Captions to null. To pass through existing captions unchanged, set the MergePolicy to MergeRetain, and pass in a null CaptionSources array. For more information on embedded files, see the Subtitles Wikipedia page. For more information on sidecar files, see the Extensible Metadata Platform and Sidecar file Wikipedia pages. MergePolicy (string) --- A policy that determines how Elastic Transcoder handles the existence of multiple captions. MergeOverride: Elastic Transcoder transcodes both embedded and sidecar captions into outputs. If captions for a language are embedded in the input file and also appear in a sidecar file, Elastic Transcoder uses the sidecar captions and ignores the embedded captions for that language. MergeRetain: Elastic Transcoder transcodes both embedded and sidecar captions into outputs. If captions for a language are embedded in the input file and also appear in a sidecar file, Elastic Transcoder uses the embedded captions and ignores the sidecar captions for that language. If CaptionSources is empty, Elastic Transcoder omits all sidecar captions from the output files. Override: Elastic Transcoder transcodes only the sidecar captions that you specify in CaptionSources. MergePolicy cannot be null. CaptionSources (list) --- Source files for the input sidecar captions used during the transcoding process. To omit all sidecar captions, leave CaptionSources blank. (dict) --- A source file for the input sidecar captions used during the transcoding process. Key (string) --- The name of the sidecar caption file that you want Elastic Transcoder to include in the output file. Language (string) --- A string that specifies the language of the caption. If you specified multiple inputs with captions, the caption language must match in order to be included in the output. Specify this as one of: 2-character ISO 639-1 code 3-character ISO 639-2 code For more information on ISO language codes and language names, see the List of ISO 639-1 codes. TimeOffset (string) --- For clip generation or captions that do not start at the same time as the associated video file, the TimeOffset tells Elastic Transcoder how much of the video to encode before including captions. Specify the TimeOffset in the form [+-]SS.sss or [+-]HH:mm:SS.ss. Label (string) --- The label of the caption shown in the player when choosing a language. We recommend that you put the caption language name here, in the language of the captions. Encryption (dict) --- The encryption settings, if any, that Elastic Transcoder needs to decyrpt your caption sources, or that you want Elastic Transcoder to apply to your caption sources. CaptionFormats (list) --- The array of file formats for the output captions. If you leave this value blank, Elastic Transcoder returns an error. (dict) --- The file format of the output captions. Format (string) --- The format you specify determines whether Elastic Transcoder generates an embedded or sidecar caption for this output. for FLAC: None For MP3: None For MP4: mov-text For MPEG-TS: None For ogg: None For webm: None Valid Sidecar Caption Formats: Elastic Transcoder supports dfxp (first div element only), scc, srt, and webvtt. For FMP4: dfxp Non-FMP4 outputs: All sidecar types fmp4 captions have an extension of .ismt Pattern (string) --- The prefix for caption filenames, in the form description- {language}, where: description is a description of the video. {language} is a literal value that Elastic Transcoder replaces with the two- or three-letter code for the language of the caption in the output file names. If you don't include {language} in the file name pattern, Elastic Transcoder automatically appends ' {language}' to the value that you specify for the description. In addition, Elastic Transcoder automatically appends the count to the end of the segment files. For example, suppose you're transcoding into srt format. When you enter 'Sydney-{language}-sunrise', and the language of the captions is English (en), the name of the first caption file is be Sydney-en-sunrise00000.srt. Encryption (dict) --- The encryption settings, if any, that you want Elastic Transcoder to apply to your caption formats. Encryption (dict) --- You can specify encryption settings for any output files that you want to use for a transcoding job. This includes the output file and any watermarks, thumbnails, album art, or captions that you want to use. You must specify encryption settings for each file individually. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The name to assign to the transcoded file. Elastic Transcoder saves the file in the Amazon S3 bucket specified by the OutputBucket object in the pipeline that is specified by the pipeline ID. If a file with the specified name already exists in the output bucket, the job fails.",
          "nested_params": []
        },
        {
          "name": "ThumbnailPattern",
          "type": "string",
          "required": false,
          "description": "Whether you want Elastic Transcoder to create thumbnails for your videos and, if so, how you want Elastic Transcoder to name the files. If you don't want Elastic Transcoder to create thumbnails, specify ''. If you do want Elastic Transcoder to create thumbnails, specify the information that you want to include in the file name for each thumbnail. You can specify the following values in any sequence:",
          "nested_params": [
            {
              "name": "00001",
              "type": "Required",
              "required": false,
              "description": "",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ThumbnailEncryption",
          "type": "dict",
          "required": false,
          "description": "The encryption settings, if any, that you want Elastic Transcoder to apply to your thumbnail.",
          "nested_params": [
            {
              "name": "Mode",
              "type": "string",
              "required": false,
              "description": "The specific server-side encryption mode that you want Elastic Transcoder to use when decrypting your input files or encrypting your output files. Elastic Transcoder supports the following options:",
              "nested_params": [
                {
                  "name": "s3:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "s3-aws-kms:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "aes-cbc-pkcs7:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "aes-ctr:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "aes-gcm:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Key",
              "type": "string",
              "required": false,
              "description": "The data encryption key that you want Elastic Transcoder to use to encrypt your output file, or that was used to encrypt your input file. The key must be base64-encoded and it must be one of the following bit lengths before being base64-encoded: 128, 192, or 256. The key must also be encrypted by using the Amazon Key Management Service.",
              "nested_params": []
            },
            {
              "name": "KeyMd5",
              "type": "string",
              "required": false,
              "description": "The MD5 digest of the key that you used to encrypt your input file, or that you want Elastic Transcoder to use to encrypt your output file. Elastic Transcoder uses the key digest as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
              "nested_params": []
            },
            {
              "name": "InitializationVector",
              "type": "string",
              "required": false,
              "description": "The series of random bits created by a random bit generator, unique for every encryption operation, that you used to encrypt your input files or that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Rotate",
          "type": "string",
          "required": false,
          "description": "The number of degrees clockwise by which you want Elastic Transcoder to rotate the output relative to the input. Enter one of the following values: auto, 0, 90, 180, 270. The value auto generally works only if the file that you're transcoding contains rotation metadata.",
          "nested_params": []
        },
        {
          "name": "PresetId",
          "type": "string",
          "required": false,
          "description": "The Id of the preset to use for this job. The preset determines the audio, video, and thumbnail settings that Elastic Transcoder uses for transcoding.",
          "nested_params": []
        },
        {
          "name": "SegmentDuration",
          "type": "string",
          "required": false,
          "description": "If you specify a preset in PresetId for which the value of Container is fmp4 (Fragmented MP4) or ts (MPEG-TS), SegmentDuration is the target maximum duration of each segment in seconds. For HLSv3 format playlists, each media segment is stored in a separate .ts file. For HLSv4 and Smooth playlists, all media segments for an output are stored in a single file. Each segment is approximately the length of the SegmentDuration, though individual segments might be shorter or longer. The range of valid values is 1 to 60 seconds. If the duration of the video is not evenly divisible by SegmentDuration, the duration of the last segment is the remainder of total length/SegmentDuration. Elastic Transcoder creates an output-specific playlist for each output HLS output that you specify in OutputKeys. To add an output to the master playlist for this job, include it in the OutputKeys of the associated playlist.",
          "nested_params": []
        },
        {
          "name": "Watermarks",
          "type": "list",
          "required": false,
          "description": "Information about the watermarks that you want Elastic Transcoder to add to the video during transcoding. You can specify up to four watermarks for each output. Settings for each watermark must be defined in the preset for the current output.",
          "nested_params": [
            {
              "name": "PresetWatermarkId",
              "type": "string",
              "required": false,
              "description": "The ID of the watermark settings that Elastic Transcoder uses to add watermarks to the video during transcoding. The settings are in the preset specified by Preset for the current output. In that preset, the value of Watermarks Id tells Elastic Transcoder which settings to use.",
              "nested_params": []
            },
            {
              "name": "InputKey",
              "type": "string",
              "required": false,
              "description": "The name of the .png or .jpg file that you want to use for the watermark. To determine which Amazon S3 bucket contains the specified file, Elastic Transcoder checks the pipeline specified by Pipeline; the Input Bucket object in that pipeline identifies the bucket.",
              "nested_params": []
            },
            {
              "name": "Encryption",
              "type": "dict",
              "required": false,
              "description": "The encryption settings, if any, that you want Elastic Transcoder to apply to your watermarks.",
              "nested_params": [
                {
                  "name": "Mode",
                  "type": "string",
                  "required": false,
                  "description": "The specific server-side encryption mode that you want Elastic Transcoder to use when decrypting your input files or encrypting your output files. Elastic Transcoder supports the following options:",
                  "nested_params": [
                    {
                      "name": "s3:",
                      "type": "",
                      "required": false,
                      "description": "",
                      "nested_params": []
                    },
                    {
                      "name": "s3-aws-kms:",
                      "type": "",
                      "required": false,
                      "description": "",
                      "nested_params": []
                    },
                    {
                      "name": "aes-cbc-pkcs7:",
                      "type": "",
                      "required": false,
                      "description": "",
                      "nested_params": []
                    },
                    {
                      "name": "aes-ctr:",
                      "type": "",
                      "required": false,
                      "description": "",
                      "nested_params": []
                    },
                    {
                      "name": "aes-gcm:",
                      "type": "",
                      "required": false,
                      "description": "",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "Key",
                  "type": "string",
                  "required": false,
                  "description": "The data encryption key that you want Elastic Transcoder to use to encrypt your output file, or that was used to encrypt your input file. The key must be base64-encoded and it must be one of the following bit lengths before being base64-encoded: 128, 192, or 256. The key must also be encrypted by using the Amazon Key Management Service.",
                  "nested_params": []
                },
                {
                  "name": "KeyMd5",
                  "type": "string",
                  "required": false,
                  "description": "The MD5 digest of the key that you used to encrypt your input file, or that you want Elastic Transcoder to use to encrypt your output file. Elastic Transcoder uses the key digest as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                  "nested_params": []
                },
                {
                  "name": "InitializationVector",
                  "type": "string",
                  "required": false,
                  "description": "The series of random bits created by a random bit generator, unique for every encryption operation, that you used to encrypt your input files or that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "AlbumArt",
          "type": "dict",
          "required": false,
          "description": "Information about the album art that you want Elastic Transcoder to add to the file during transcoding. You can specify up to twenty album artworks for each output. Settings for each artwork must be defined in the job for the current output.",
          "nested_params": [
            {
              "name": "MergePolicy",
              "type": "string",
              "required": false,
              "description": "A policy that determines how Elastic Transcoder handles the existence of multiple album artwork files.",
              "nested_params": []
            },
            {
              "name": "Artwork",
              "type": "list",
              "required": false,
              "description": "The file to be used as album art. There can be multiple artworks associated with an audio file, to a maximum of 20. Valid formats are .jpg and .png.",
              "nested_params": [
                {
                  "name": "InputKey",
                  "type": "string",
                  "required": false,
                  "description": "The name of the file to be used as album art. To determine which Amazon S3 bucket contains the specified file, Elastic Transcoder checks the pipeline specified by PipelineId; the InputBucket object in that pipeline identifies the bucket. If the file name includes a prefix, for example, cooking/pie.jpg, include the prefix in the key. If the file isn't in the specified bucket, Elastic Transcoder returns an error.",
                  "nested_params": []
                },
                {
                  "name": "MaxWidth",
                  "type": "string",
                  "required": false,
                  "description": "The maximum width of the output album art in pixels. If you specify auto, Elastic Transcoder uses 600 as the default value. If you specify a numeric value, enter an even integer between 32 and 4096, inclusive.",
                  "nested_params": []
                },
                {
                  "name": "MaxHeight",
                  "type": "string",
                  "required": false,
                  "description": "The maximum height of the output album art in pixels. If you specify auto, Elastic Transcoder uses 600 as the default value. If you specify a numeric value, enter an even integer between 32 and 3072, inclusive.",
                  "nested_params": []
                },
                {
                  "name": "SizingPolicy",
                  "type": "string",
                  "required": false,
                  "description": "Specify one of the following values to control scaling of the output album art:",
                  "nested_params": []
                },
                {
                  "name": "PaddingPolicy",
                  "type": "string",
                  "required": false,
                  "description": "When you set PaddingPolicy to Pad, Elastic Transcoder may add white bars to the top and bottom and/or left and right sides of the output album art to make the total size of the output art match the values that you specified for MaxWidth and MaxHeight.",
                  "nested_params": []
                },
                {
                  "name": "AlbumArtFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format of album art, if any. Valid formats are .jpg and .png.",
                  "nested_params": []
                },
                {
                  "name": "Encryption",
                  "type": "dict",
                  "required": false,
                  "description": "The encryption settings, if any, that you want Elastic Transcoder to apply to your artwork.",
                  "nested_params": [
                    {
                      "name": "Mode",
                      "type": "string",
                      "required": false,
                      "description": "The specific server-side encryption mode that you want Elastic Transcoder to use when decrypting your input files or encrypting your output files. Elastic Transcoder supports the following options:",
                      "nested_params": [
                        {
                          "name": "s3:",
                          "type": "",
                          "required": false,
                          "description": "",
                          "nested_params": []
                        },
                        {
                          "name": "s3-aws-kms:",
                          "type": "",
                          "required": false,
                          "description": "",
                          "nested_params": []
                        },
                        {
                          "name": "aes-cbc-pkcs7:",
                          "type": "",
                          "required": false,
                          "description": "",
                          "nested_params": []
                        },
                        {
                          "name": "aes-ctr:",
                          "type": "",
                          "required": false,
                          "description": "",
                          "nested_params": []
                        },
                        {
                          "name": "aes-gcm:",
                          "type": "",
                          "required": false,
                          "description": "",
                          "nested_params": []
                        }
                      ]
                    },
                    {
                      "name": "Key",
                      "type": "string",
                      "required": false,
                      "description": "The data encryption key that you want Elastic Transcoder to use to encrypt your output file, or that was used to encrypt your input file. The key must be base64-encoded and it must be one of the following bit lengths before being base64-encoded: 128, 192, or 256. The key must also be encrypted by using the Amazon Key Management Service.",
                      "nested_params": []
                    },
                    {
                      "name": "KeyMd5",
                      "type": "string",
                      "required": false,
                      "description": "The MD5 digest of the key that you used to encrypt your input file, or that you want Elastic Transcoder to use to encrypt your output file. Elastic Transcoder uses the key digest as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                      "nested_params": []
                    },
                    {
                      "name": "InitializationVector",
                      "type": "string",
                      "required": false,
                      "description": "The series of random bits created by a random bit generator, unique for every encryption operation, that you used to encrypt your input files or that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Composition",
          "type": "list",
          "required": false,
          "description": "You can create an output file that contains an excerpt from the input file. This excerpt, called a clip, can come from the beginning, middle, or end of the file. The Composition object contains settings for the clips that make up an output file. For the current release, you can only specify settings for a single clip per output file. The Composition object cannot be null.",
          "nested_params": [
            {
              "name": "TimeSpan",
              "type": "dict",
              "required": false,
              "description": "Settings that determine when a clip begins and how long it lasts.",
              "nested_params": [
                {
                  "name": "StartTime",
                  "type": "string",
                  "required": false,
                  "description": "The place in the input file where you want a clip to start. The format can be either HH:mm:ss.SSS (maximum value: 23:59:59.999; SSS is thousandths of a second) or sssss.SSS (maximum value: 86399.999). If you don't specify a value, Elastic Transcoder starts at the beginning of the input file.",
                  "nested_params": []
                },
                {
                  "name": "Duration",
                  "type": "string",
                  "required": false,
                  "description": "The duration of the clip. The format can be either HH:mm:ss.SSS (maximum value: 23:59:59.999; SSS is thousandths of a second) or sssss.SSS (maximum value: 86399.999). If you don't specify a value, Elastic Transcoder creates an output file from StartTime to the end of the file. If you specify a value longer than the duration of the input file, Elastic Transcoder transcodes the file and returns a warning message.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "Captions",
          "type": "dict",
          "required": false,
          "description": "You can configure Elastic Transcoder to transcode captions, or subtitles, from one format to another. All captions must be in UTF-8. Elastic Transcoder supports two types of captions:",
          "nested_params": [
            {
              "name": "Embedded:",
              "type": "EIA-608, first non-empty channel only",
              "required": false,
              "description": "",
              "nested_params": []
            },
            {
              "name": "Sidecar:",
              "type": "first div element only",
              "required": false,
              "description": "",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Encryption",
          "type": "dict",
          "required": false,
          "description": "You can specify encryption settings for any output files that you want to use for a transcoding job. This includes the output file and any watermarks, thumbnails, album art, or captions that you want to use. You must specify encryption settings for each file individually.",
          "nested_params": [
            {
              "name": "Mode",
              "type": "string",
              "required": false,
              "description": "The specific server-side encryption mode that you want Elastic Transcoder to use when decrypting your input files or encrypting your output files. Elastic Transcoder supports the following options:",
              "nested_params": [
                {
                  "name": "s3:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "s3-aws-kms:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "aes-cbc-pkcs7:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "aes-ctr:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "aes-gcm:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Key",
              "type": "string",
              "required": false,
              "description": "The data encryption key that you want Elastic Transcoder to use to encrypt your output file, or that was used to encrypt your input file. The key must be base64-encoded and it must be one of the following bit lengths before being base64-encoded: 128, 192, or 256. The key must also be encrypted by using the Amazon Key Management Service.",
              "nested_params": []
            },
            {
              "name": "KeyMd5",
              "type": "string",
              "required": false,
              "description": "The MD5 digest of the key that you used to encrypt your input file, or that you want Elastic Transcoder to use to encrypt your output file. Elastic Transcoder uses the key digest as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
              "nested_params": []
            },
            {
              "name": "InitializationVector",
              "type": "string",
              "required": false,
              "description": "The series of random bits created by a random bit generator, unique for every encryption operation, that you used to encrypt your input files or that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "Outputs",
      "type": "list",
      "required": false,
      "description": "A section of the request body that provides information about the transcoded (target) files. We recommend that you use the Outputs syntax instead of the Output syntax. (dict) --- The CreateJobOutput structure. Key (string) --- The name to assign to the transcoded file. Elastic Transcoder saves the file in the Amazon S3 bucket specified by the OutputBucket object in the pipeline that is specified by the pipeline ID. If a file with the specified name already exists in the output bucket, the job fails. ThumbnailPattern (string) --- Whether you want Elastic Transcoder to create thumbnails for your videos and, if so, how you want Elastic Transcoder to name the files. If you don't want Elastic Transcoder to create thumbnails, specify ''. If you do want Elastic Transcoder to create thumbnails, specify the information that you want to include in the file name for each thumbnail. You can specify the following values in any sequence: {count} (Required): If you want to create thumbnails, you must include {count} in the ThumbnailPattern object. Wherever you specify {count}, Elastic Transcoder adds a five-digit sequence number (beginning with 00001) to thumbnail file names. The number indicates where a given thumbnail appears in the sequence of thumbnails for a transcoded file. Literal values (Optional): You can specify literal values anywhere in the ThumbnailPattern object. For example, you can include them as a file name prefix or as a delimiter between {resolution} and {count}. {resolution} (Optional): If you want Elastic Transcoder to include the resolution in the file name, include {resolution} in the ThumbnailPattern object. When creating thumbnails, Elastic Transcoder automatically saves the files in the format (.jpg or .png) that appears in the preset that you specified in the PresetID value of CreateJobOutput. Elastic Transcoder also appends the applicable file name extension. ThumbnailEncryption (dict) --- The encryption settings, if any, that you want Elastic Transcoder to apply to your thumbnail. Mode (string) --- The specific server-side encryption mode that you want Elastic Transcoder to use when decrypting your input files or encrypting your output files. Elastic Transcoder supports the following options: s3: Amazon S3 creates and manages the keys used for encrypting your files. s3-aws-kms: Amazon S3 calls the Amazon Key Management Service, which creates and manages the keys that are used for encrypting your files. If you specify s3-aws-kms and you don't want to use the default key, you must add the AWS-KMS key that you want to use to your pipeline. aes-cbc-pkcs7: A padded cipher-block mode of operation originally used for HLS files. aes-ctr: AES Counter Mode. aes-gcm: AES Galois Counter Mode, a mode of operation that is an authenticated encryption format, meaning that a file, key, or initialization vector that has been tampered with fails the decryption process. For all three AES options, you must provide the following settings, which must be base64-encoded: Key (string) --- The data encryption key that you want Elastic Transcoder to use to encrypt your output file, or that was used to encrypt your input file. The key must be base64-encoded and it must be one of the following bit lengths before being base64-encoded: 128, 192, or 256. The key must also be encrypted by using the Amazon Key Management Service. KeyMd5 (string) --- The MD5 digest of the key that you used to encrypt your input file, or that you want Elastic Transcoder to use to encrypt your output file. Elastic Transcoder uses the key digest as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded. InitializationVector (string) --- The series of random bits created by a random bit generator, unique for every encryption operation, that you used to encrypt your input files or that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded. Rotate (string) --- The number of degrees clockwise by which you want Elastic Transcoder to rotate the output relative to the input. Enter one of the following values: auto, 0, 90, 180, 270. The value auto generally works only if the file that you're transcoding contains rotation metadata. PresetId (string) --- The Id of the preset to use for this job. The preset determines the audio, video, and thumbnail settings that Elastic Transcoder uses for transcoding. SegmentDuration (string) --- If you specify a preset in PresetId for which the value of Container is fmp4 (Fragmented MP4) or ts (MPEG-TS), SegmentDuration is the target maximum duration of each segment in seconds. For HLSv3 format playlists, each media segment is stored in a separate .ts file. For HLSv4 and Smooth playlists, all media segments for an output are stored in a single file. Each segment is approximately the length of the SegmentDuration, though individual segments might be shorter or longer. The range of valid values is 1 to 60 seconds. If the duration of the video is not evenly divisible by SegmentDuration, the duration of the last segment is the remainder of total length/SegmentDuration. Elastic Transcoder creates an output-specific playlist for each output HLS output that you specify in OutputKeys. To add an output to the master playlist for this job, include it in the OutputKeys of the associated playlist. Watermarks (list) --- Information about the watermarks that you want Elastic Transcoder to add to the video during transcoding. You can specify up to four watermarks for each output. Settings for each watermark must be defined in the preset for the current output. (dict) --- Watermarks can be in .png or .jpg format. If you want to display a watermark that is not rectangular, use the .png format, which supports transparency. PresetWatermarkId (string) --- The ID of the watermark settings that Elastic Transcoder uses to add watermarks to the video during transcoding. The settings are in the preset specified by Preset for the current output. In that preset, the value of Watermarks Id tells Elastic Transcoder which settings to use. InputKey (string) --- The name of the .png or .jpg file that you want to use for the watermark. To determine which Amazon S3 bucket contains the specified file, Elastic Transcoder checks the pipeline specified by Pipeline; the Input Bucket object in that pipeline identifies the bucket. If the file name includes a prefix, for example, logos/128x64.png, include the prefix in the key. If the file isn't in the specified bucket, Elastic Transcoder returns an error. Encryption (dict) --- The encryption settings, if any, that you want Elastic Transcoder to apply to your watermarks. AlbumArt (dict) --- Information about the album art that you want Elastic Transcoder to add to the file during transcoding. You can specify up to twenty album artworks for each output. Settings for each artwork must be defined in the job for the current output. MergePolicy (string) --- A policy that determines how Elastic Transcoder handles the existence of multiple album artwork files. Replace: The specified album art replaces any existing album art. Prepend: The specified album art is placed in front of any existing album art. Append: The specified album art is placed after any existing album art. Fallback: If the original input file contains artwork, Elastic Transcoder uses that artwork for the output. If the original input does not contain artwork, Elastic Transcoder uses the specified album art file. Artwork (list) --- The file to be used as album art. There can be multiple artworks associated with an audio file, to a maximum of 20. Valid formats are .jpg and .png (dict) --- The file to be used as album art. To remove artwork or leave the artwork empty, you can either set Artwork to null, or set the Merge Policy to 'Replace' and use an empty Artwork array. To pass through existing artwork unchanged, set the Merge Policy to 'Prepend', 'Append', or 'Fallback', and use an empty Artwork array. InputKey (string) --- The name of the file to be used as album art. To determine which Amazon S3 bucket contains the specified file, Elastic Transcoder checks the pipeline specified by PipelineId; the InputBucket object in that pipeline identifies the bucket. If the file name includes a prefix, for example, cooking/pie.jpg, include the prefix in the key. MaxWidth (string) --- The maximum width of the output album art in pixels. If you specify auto, Elastic Transcoder uses 600 as the default value. If you specify a numeric value, enter an even integer between 32 and 4096, inclusive. MaxHeight (string) --- The maximum height of the output album art in pixels. If you specify a numeric value, enter an even integer between 32 and 3072, inclusive. SizingPolicy (string) --- Specify one of the following values to control scaling of the output album art: Fit: Elastic Transcoder scales the output art so it matches the value that you specified in either MaxWidth or MaxHeight without exceeding the other value. Fill: Elastic Transcoder scales the output art so it matches the value that you specified in either MaxWidth or MaxHeight and matches or exceeds the other value. Elastic Transcoder centers the output art and then crops it in the dimension (if any) that exceeds the maximum value. Stretch: Elastic Transcoder stretches the output art to match the values that you specified for MaxWidth and MaxHeight. If the relative proportions of the input art and the output art are different, the output art will be distorted. Keep: Elastic Transcoder does not scale the output art. If either dimension of the input art exceeds the values that you specified for MaxWidth and MaxHeight, Elastic Transcoder crops the output art. ShrinkToFit: Elastic Transcoder scales the output art down so that its dimensions match the values that you specified for at least one of MaxWidth and MaxHeight without exceeding either value. If you specify this option, Elastic Transcoder does not scale the art up. ShrinkToFill Elastic Transcoder scales the output art down so that its dimensions match the values that you specified for at least one of MaxWidth and MaxHeight without dropping below either value. PaddingPolicy (string) --- When you set PaddingPolicy to Pad, Elastic Transcoder may add white bars to the top and bottom and/or left and right sides of the output album art to make the total size of the output art match the values that you specified for MaxWidth and MaxHeight. AlbumArtFormat (string) --- The format of album art, if any. Valid formats are .jpg and .png. Encryption (dict) --- The encryption settings, if any, that you want Elastic Transcoder to apply to your artwork. Composition (list) --- You can create an output file that contains an excerpt from the input file. This excerpt, called a clip, can come from the beginning, middle, or end of the file. The Composition object contains settings for the clips that make up an output file. For the current release, you can only specify settings for a single clip per output file. The Composition object cannot be null. (dict) --- Settings for one clip in a composition. All jobs in a playlist must have the same clip settings. TimeSpan (dict) --- Settings that determine when a clip begins and how long it lasts. StartTime (string) --- The place in the input file where you want a clip to start. The format can be either HH:mm:ss.SSS (maximum value: 23:59:59.999; SSS is thousandths of a second) or sssss.SSS (maximum value: 86399.999). If you don't specify a value, Elastic Transcoder starts at the beginning of the input file. Duration (string) --- The duration of the clip. If you don't specify a value, Elastic Transcoder creates an output file from StartTime to the end of the file. If you specify a value longer than the duration of the input file, Elastic Transcoder transcodes the file and returns a warning message. Captions (dict) --- You can configure Elastic Transcoder to transcode captions, or subtitles, from one format to another. All captions must be in UTF-8. Elastic Transcoder supports two types of captions: Embedded: Embedded captions are included in the same file as the audio and video. Elastic Transcoder supports only one embedded caption per language, to a maximum of 300 embedded captions per file. Valid input values include: CEA-608 (EIA-608, first non-empty channel only), CEA-708 (EIA-708, first non-empty channel only), and mov-text Valid outputs include: mov-text Elastic Transcoder supports a maximum of one embedded format per output. Sidecar: Sidecar captions are kept in a separate metadata file from the audio and video data. Sidecar captions require a player that is capable of understanding the relationship between the video file and the sidecar file. Elastic Transcoder supports only one sidecar caption per language, to a maximum of 20 sidecar captions per file. Valid input values include: dfxp (first div element only), ebu-tt, scc, smpt, srt, ttml (first div element only), and webvtt Valid outputs include: dfxp (first div element only), scc, srt, and webvtt. If you want ttml or smpte-tt compatible captions, specify dfxp as your output format. Elastic Transcoder does not support OCR (Optical Character Recognition), does not accept pictures as a valid input for captions, and is not available for audio-only transcoding. Elastic Transcoder does not preserve text formatting (for example, italics) during the transcoding process. To remove captions or leave the captions empty, set Captions to null. To pass through existing captions unchanged, set the MergePolicy to MergeRetain, and pass in a null CaptionSources array. For more information on embedded files, see the Subtitles Wikipedia page. For more information on sidecar files, see the Extensible Metadata Platform and Sidecar file Wikipedia pages. MergePolicy (string) --- A policy that determines how Elastic Transcoder handles the existence of multiple captions. MergeOverride: Elastic Transcoder transcodes both embedded and sidecar captions into outputs. If captions for a language are embedded in the input file and also appear in a sidecar file, Elastic Transcoder uses the sidecar captions and ignores the embedded captions for that language. MergeRetain: Elastic Transcoder transcodes both embedded and sidecar captions into outputs. If captions for a language are embedded in the input file and also appear in a sidecar file, Elastic Transcoder uses the embedded captions and ignores the sidecar captions for that language. If CaptionSources is empty, Elastic Transcoder omits all sidecar captions from the output files. Override: Elastic Transcoder transcodes only the sidecar captions that you specify in CaptionSources. MergePolicy cannot be null. CaptionSources (list) --- Source files for the input sidecar captions used during the transcoding process. To omit all sidecar captions, leave CaptionSources blank. (dict) --- A source file for the input sidecar captions used during the transcoding process. Key (string) --- The name of the sidecar caption file that you want Elastic Transcoder to include in the output file. Language (string) --- A string that specifies the language of the caption. If you specified multiple inputs with captions, the caption language must match in order to be included in the output. Specify this as one of: 2-character ISO 639-1 code 3-character ISO 639-2 code For more information on ISO language codes and language names, see the List of ISO 639-1 codes. TimeOffset (string) --- For clip generation or captions that do not start at the same time as the associated video file, the TimeOffset tells Elastic Transcoder how much of the video to encode before including captions. Specify the TimeOffset in the form [+-]SS.sss or [+-]HH:mm:SS.ss. Label (string) --- The label of the caption shown in the player when choosing a language. We recommend that you put the caption language name here, in the language of the captions. Encryption (dict) --- The encryption settings, if any, that Elastic Transcoder needs to decyrpt your caption sources, or that you want Elastic Transcoder to apply to your caption sources. CaptionFormats (list) --- The array of file formats for the output captions. If you leave this value blank, Elastic Transcoder returns an error. (dict) --- The file format of the output captions. Format (string) --- The format you specify determines whether Elastic Transcoder generates an embedded or sidecar caption for this output. for FLAC: None For MP3: None For MP4: mov-text For MPEG-TS: None For ogg: None For webm: None Valid Sidecar Caption Formats: Elastic Transcoder supports dfxp (first div element only), scc, srt, and webvtt. For FMP4: dfxp Non-FMP4 outputs: All sidecar types fmp4 captions have an extension of .ismt Pattern (string) --- The prefix for caption filenames, in the form description- {language}, where: description is a description of the video. {language} is a literal value that Elastic Transcoder replaces with the two- or three-letter code for the language of the caption in the output file names. If you don't include {language} in the file name pattern, Elastic Transcoder automatically appends ' {language}' to the value that you specify for the description. In addition, Elastic Transcoder automatically appends the count to the end of the segment files. For example, suppose you're transcoding into srt format. When you enter 'Sydney-{language}-sunrise', and the language of the captions is English (en), the name of the first caption file is be Sydney-en-sunrise00000.srt. Encryption (dict) --- The encryption settings, if any, that you want Elastic Transcoder to apply to your caption formats. Encryption (dict) --- You can specify encryption settings for any output files that you want to use for a transcoding job. This includes the output file and any watermarks, thumbnails, album art, or captions that you want to use. You must specify encryption settings for each file individually. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The name to assign to the transcoded file. Elastic Transcoder saves the file in the Amazon S3 bucket specified by the OutputBucket object in the pipeline that is specified by the pipeline ID. If a file with the specified name already exists in the output bucket, the job fails.",
          "nested_params": []
        },
        {
          "name": "ThumbnailPattern",
          "type": "string",
          "required": false,
          "description": "Whether you want Elastic Transcoder to create thumbnails for your videos and, if so, how you want Elastic Transcoder to name the files. If you don't want Elastic Transcoder to create thumbnails, specify ''. If you do want Elastic Transcoder to create thumbnails, specify the information that you want to include in the file name for each thumbnail. You can specify the following values in any sequence:",
          "nested_params": [
            {
              "name": "00001",
              "type": "Required",
              "required": false,
              "description": "",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ThumbnailEncryption",
          "type": "dict",
          "required": false,
          "description": "The encryption settings, if any, that you want Elastic Transcoder to apply to your thumbnail.",
          "nested_params": [
            {
              "name": "Mode",
              "type": "string",
              "required": false,
              "description": "The specific server-side encryption mode that you want Elastic Transcoder to use when decrypting your input files or encrypting your output files. Elastic Transcoder supports the following options:",
              "nested_params": [
                {
                  "name": "s3:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "s3-aws-kms:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "aes-cbc-pkcs7:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "aes-ctr:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "aes-gcm:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Key",
              "type": "string",
              "required": false,
              "description": "The data encryption key that you want Elastic Transcoder to use to encrypt your output file, or that was used to encrypt your input file. The key must be base64-encoded and it must be one of the following bit lengths before being base64-encoded: 128, 192, or 256. The key must also be encrypted by using the Amazon Key Management Service.",
              "nested_params": []
            },
            {
              "name": "KeyMd5",
              "type": "string",
              "required": false,
              "description": "The MD5 digest of the key that you used to encrypt your input file, or that you want Elastic Transcoder to use to encrypt your output file. Elastic Transcoder uses the key digest as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
              "nested_params": []
            },
            {
              "name": "InitializationVector",
              "type": "string",
              "required": false,
              "description": "The series of random bits created by a random bit generator, unique for every encryption operation, that you used to encrypt your input files or that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Rotate",
          "type": "string",
          "required": false,
          "description": "The number of degrees clockwise by which you want Elastic Transcoder to rotate the output relative to the input. Enter one of the following values: auto, 0, 90, 180, 270. The value auto generally works only if the file that you're transcoding contains rotation metadata.",
          "nested_params": []
        },
        {
          "name": "PresetId",
          "type": "string",
          "required": false,
          "description": "The Id of the preset to use for this job. The preset determines the audio, video, and thumbnail settings that Elastic Transcoder uses for transcoding.",
          "nested_params": []
        },
        {
          "name": "SegmentDuration",
          "type": "string",
          "required": false,
          "description": "If you specify a preset in PresetId for which the value of Container is fmp4 (Fragmented MP4) or ts (MPEG-TS), SegmentDuration is the target maximum duration of each segment in seconds. For HLSv3 format playlists, each media segment is stored in a separate .ts file. For HLSv4 and Smooth playlists, all media segments for an output are stored in a single file. Each segment is approximately the length of the SegmentDuration, though individual segments might be shorter or longer. The range of valid values is 1 to 60 seconds. If the duration of the video is not evenly divisible by SegmentDuration, the duration of the last segment is the remainder of total length/SegmentDuration. Elastic Transcoder creates an output-specific playlist for each output HLS output that you specify in OutputKeys. To add an output to the master playlist for this job, include it in the OutputKeys of the associated playlist.",
          "nested_params": []
        },
        {
          "name": "Watermarks",
          "type": "list",
          "required": false,
          "description": "Information about the watermarks that you want Elastic Transcoder to add to the video during transcoding. You can specify up to four watermarks for each output. Settings for each watermark must be defined in the preset for the current output.",
          "nested_params": [
            {
              "name": "PresetWatermarkId",
              "type": "string",
              "required": false,
              "description": "The ID of the watermark settings that Elastic Transcoder uses to add watermarks to the video during transcoding. The settings are in the preset specified by Preset for the current output. In that preset, the value of Watermarks Id tells Elastic Transcoder which settings to use.",
              "nested_params": []
            },
            {
              "name": "InputKey",
              "type": "string",
              "required": false,
              "description": "The name of the .png or .jpg file that you want to use for the watermark. To determine which Amazon S3 bucket contains the specified file, Elastic Transcoder checks the pipeline specified by Pipeline; the Input Bucket object in that pipeline identifies the bucket.",
              "nested_params": []
            },
            {
              "name": "Encryption",
              "type": "dict",
              "required": false,
              "description": "The encryption settings, if any, that you want Elastic Transcoder to apply to your watermarks.",
              "nested_params": [
                {
                  "name": "Mode",
                  "type": "string",
                  "required": false,
                  "description": "The specific server-side encryption mode that you want Elastic Transcoder to use when decrypting your input files or encrypting your output files. Elastic Transcoder supports the following options:",
                  "nested_params": [
                    {
                      "name": "s3:",
                      "type": "",
                      "required": false,
                      "description": "",
                      "nested_params": []
                    },
                    {
                      "name": "s3-aws-kms:",
                      "type": "",
                      "required": false,
                      "description": "",
                      "nested_params": []
                    },
                    {
                      "name": "aes-cbc-pkcs7:",
                      "type": "",
                      "required": false,
                      "description": "",
                      "nested_params": []
                    },
                    {
                      "name": "aes-ctr:",
                      "type": "",
                      "required": false,
                      "description": "",
                      "nested_params": []
                    },
                    {
                      "name": "aes-gcm:",
                      "type": "",
                      "required": false,
                      "description": "",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "Key",
                  "type": "string",
                  "required": false,
                  "description": "The data encryption key that you want Elastic Transcoder to use to encrypt your output file, or that was used to encrypt your input file. The key must be base64-encoded and it must be one of the following bit lengths before being base64-encoded: 128, 192, or 256. The key must also be encrypted by using the Amazon Key Management Service.",
                  "nested_params": []
                },
                {
                  "name": "KeyMd5",
                  "type": "string",
                  "required": false,
                  "description": "The MD5 digest of the key that you used to encrypt your input file, or that you want Elastic Transcoder to use to encrypt your output file. Elastic Transcoder uses the key digest as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                  "nested_params": []
                },
                {
                  "name": "InitializationVector",
                  "type": "string",
                  "required": false,
                  "description": "The series of random bits created by a random bit generator, unique for every encryption operation, that you used to encrypt your input files or that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "AlbumArt",
          "type": "dict",
          "required": false,
          "description": "Information about the album art that you want Elastic Transcoder to add to the file during transcoding. You can specify up to twenty album artworks for each output. Settings for each artwork must be defined in the job for the current output.",
          "nested_params": [
            {
              "name": "MergePolicy",
              "type": "string",
              "required": false,
              "description": "A policy that determines how Elastic Transcoder handles the existence of multiple album artwork files.",
              "nested_params": []
            },
            {
              "name": "Artwork",
              "type": "list",
              "required": false,
              "description": "The file to be used as album art. There can be multiple artworks associated with an audio file, to a maximum of 20. Valid formats are .jpg and .png.",
              "nested_params": [
                {
                  "name": "InputKey",
                  "type": "string",
                  "required": false,
                  "description": "The name of the file to be used as album art. To determine which Amazon S3 bucket contains the specified file, Elastic Transcoder checks the pipeline specified by PipelineId; the InputBucket object in that pipeline identifies the bucket. If the file name includes a prefix, for example, cooking/pie.jpg, include the prefix in the key. If the file isn't in the specified bucket, Elastic Transcoder returns an error.",
                  "nested_params": []
                },
                {
                  "name": "MaxWidth",
                  "type": "string",
                  "required": false,
                  "description": "The maximum width of the output album art in pixels. If you specify auto, Elastic Transcoder uses 600 as the default value. If you specify a numeric value, enter an even integer between 32 and 4096, inclusive.",
                  "nested_params": []
                },
                {
                  "name": "MaxHeight",
                  "type": "string",
                  "required": false,
                  "description": "The maximum height of the output album art in pixels. If you specify auto, Elastic Transcoder uses 600 as the default value. If you specify a numeric value, enter an even integer between 32 and 3072, inclusive.",
                  "nested_params": []
                },
                {
                  "name": "SizingPolicy",
                  "type": "string",
                  "required": false,
                  "description": "Specify one of the following values to control scaling of the output album art:",
                  "nested_params": []
                },
                {
                  "name": "PaddingPolicy",
                  "type": "string",
                  "required": false,
                  "description": "When you set PaddingPolicy to Pad, Elastic Transcoder may add white bars to the top and bottom and/or left and right sides of the output album art to make the total size of the output art match the values that you specified for MaxWidth and MaxHeight.",
                  "nested_params": []
                },
                {
                  "name": "AlbumArtFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format of album art, if any. Valid formats are .jpg and .png.",
                  "nested_params": []
                },
                {
                  "name": "Encryption",
                  "type": "dict",
                  "required": false,
                  "description": "The encryption settings, if any, that you want Elastic Transcoder to apply to your artwork.",
                  "nested_params": [
                    {
                      "name": "Mode",
                      "type": "string",
                      "required": false,
                      "description": "The specific server-side encryption mode that you want Elastic Transcoder to use when decrypting your input files or encrypting your output files. Elastic Transcoder supports the following options:",
                      "nested_params": [
                        {
                          "name": "s3:",
                          "type": "",
                          "required": false,
                          "description": "",
                          "nested_params": []
                        },
                        {
                          "name": "s3-aws-kms:",
                          "type": "",
                          "required": false,
                          "description": "",
                          "nested_params": []
                        },
                        {
                          "name": "aes-cbc-pkcs7:",
                          "type": "",
                          "required": false,
                          "description": "",
                          "nested_params": []
                        },
                        {
                          "name": "aes-ctr:",
                          "type": "",
                          "required": false,
                          "description": "",
                          "nested_params": []
                        },
                        {
                          "name": "aes-gcm:",
                          "type": "",
                          "required": false,
                          "description": "",
                          "nested_params": []
                        }
                      ]
                    },
                    {
                      "name": "Key",
                      "type": "string",
                      "required": false,
                      "description": "The data encryption key that you want Elastic Transcoder to use to encrypt your output file, or that was used to encrypt your input file. The key must be base64-encoded and it must be one of the following bit lengths before being base64-encoded: 128, 192, or 256. The key must also be encrypted by using the Amazon Key Management Service.",
                      "nested_params": []
                    },
                    {
                      "name": "KeyMd5",
                      "type": "string",
                      "required": false,
                      "description": "The MD5 digest of the key that you used to encrypt your input file, or that you want Elastic Transcoder to use to encrypt your output file. Elastic Transcoder uses the key digest as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                      "nested_params": []
                    },
                    {
                      "name": "InitializationVector",
                      "type": "string",
                      "required": false,
                      "description": "The series of random bits created by a random bit generator, unique for every encryption operation, that you used to encrypt your input files or that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Composition",
          "type": "list",
          "required": false,
          "description": "You can create an output file that contains an excerpt from the input file. This excerpt, called a clip, can come from the beginning, middle, or end of the file. The Composition object contains settings for the clips that make up an output file. For the current release, you can only specify settings for a single clip per output file. The Composition object cannot be null.",
          "nested_params": [
            {
              "name": "TimeSpan",
              "type": "dict",
              "required": false,
              "description": "Settings that determine when a clip begins and how long it lasts.",
              "nested_params": [
                {
                  "name": "StartTime",
                  "type": "string",
                  "required": false,
                  "description": "The place in the input file where you want a clip to start. The format can be either HH:mm:ss.SSS (maximum value: 23:59:59.999; SSS is thousandths of a second) or sssss.SSS (maximum value: 86399.999). If you don't specify a value, Elastic Transcoder starts at the beginning of the input file.",
                  "nested_params": []
                },
                {
                  "name": "Duration",
                  "type": "string",
                  "required": false,
                  "description": "The duration of the clip. The format can be either HH:mm:ss.SSS (maximum value: 23:59:59.999; SSS is thousandths of a second) or sssss.SSS (maximum value: 86399.999). If you don't specify a value, Elastic Transcoder creates an output file from StartTime to the end of the file. If you specify a value longer than the duration of the input file, Elastic Transcoder transcodes the file and returns a warning message.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "Captions",
          "type": "dict",
          "required": false,
          "description": "You can configure Elastic Transcoder to transcode captions, or subtitles, from one format to another. All captions must be in UTF-8. Elastic Transcoder supports two types of captions:",
          "nested_params": [
            {
              "name": "Embedded:",
              "type": "EIA-608, first non-empty channel only",
              "required": false,
              "description": "",
              "nested_params": []
            },
            {
              "name": "Sidecar:",
              "type": "first div element only",
              "required": false,
              "description": "",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Encryption",
          "type": "dict",
          "required": false,
          "description": "You can specify encryption settings for any output files that you want to use for a transcoding job. This includes the output file and any watermarks, thumbnails, album art, or captions that you want to use. You must specify encryption settings for each file individually.",
          "nested_params": [
            {
              "name": "Mode",
              "type": "string",
              "required": false,
              "description": "The specific server-side encryption mode that you want Elastic Transcoder to use when decrypting your input files or encrypting your output files. Elastic Transcoder supports the following options:",
              "nested_params": [
                {
                  "name": "s3:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "s3-aws-kms:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "aes-cbc-pkcs7:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "aes-ctr:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "aes-gcm:",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Key",
              "type": "string",
              "required": false,
              "description": "The data encryption key that you want Elastic Transcoder to use to encrypt your output file, or that was used to encrypt your input file. The key must be base64-encoded and it must be one of the following bit lengths before being base64-encoded: 128, 192, or 256. The key must also be encrypted by using the Amazon Key Management Service.",
              "nested_params": []
            },
            {
              "name": "KeyMd5",
              "type": "string",
              "required": false,
              "description": "The MD5 digest of the key that you used to encrypt your input file, or that you want Elastic Transcoder to use to encrypt your output file. Elastic Transcoder uses the key digest as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
              "nested_params": []
            },
            {
              "name": "InitializationVector",
              "type": "string",
              "required": false,
              "description": "The series of random bits created by a random bit generator, unique for every encryption operation, that you used to encrypt your input files or that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "OutputKeyPrefix",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Playlists",
      "type": "list",
      "required": false,
      "description": "If you specify a preset in PresetId for which the value of Container is fmp4 (Fragmented MP4) or ts (MPEG-TS), Playlists contains information about the master playlists that you want Elastic Transcoder to create. The maximum number of master playlists in a job is 30. (dict) --- Information about the master playlist. Name (string) --- The name that you want Elastic Transcoder to assign to the master playlist, for example, nyc-vacation.m3u8. If the name includes a / character, the section of the name before the last / must be identical for all Name objects. If you create more than one master playlist, the values of all Name objects must be unique. Format (string) --- The format of the output playlist. Valid formats include HLSv3, HLSv4, and Smooth. OutputKeys (list) --- For each output in this job that you want to include in a master playlist, the value of the Outputs:Key object. If your output is not HLS or does not have a segment duration set, the name of the output file is a concatenation of OutputKeyPrefix and Outputs:Key: OutputKeyPrefix Outputs:Key If your output is HLSv3 and has a segment duration set, or is not included in a playlist, Elastic Transcoder creates an output playlist file with a file extension of .m3u8, and a series of .ts files that include a five-digit sequential counter beginning with 00000: OutputKeyPrefix Outputs:Key.m3u8 OutputKeyPrefix ``Outputs:Key``00000.ts If your output is HLSv4, has a segment duration set, and is included in an HLSv4 playlist, Elastic Transcoder creates an output playlist file with a file extension of _v4.m3u8. If the output is video, Elastic Transcoder also creates an output file with an extension of _iframe.m3u8: OutputKeyPrefix Outputs:Key``_v4.m3u8 OutputKeyPrefix ``Outputs:Key``_iframe.m3u8 OutputKeyPrefix ``Outputs:Key.ts Elastic Transcoder automatically appends the relevant file extension to the file name. If you include a file extension in Output Key, the file name will have two extensions. If you include more than one output in a playlist, any segment duration settings, clip settings, or caption settings must be the same for all outputs in the playlist. For Smooth playlists, the Audio:Profile, Video:Profile, and Video:FrameRate to Video:KeyframesMaxDist ratio must be the same for all outputs. (string) --- HlsContentProtection (dict) --- The HLS content protection settings, if any, that you want Elastic Transcoder to apply to the output files associated with this playlist. Method (string) --- The content protection method for your output. The only valid value is: aes-128. This value is written into the method attribute of the EXT-X-KEY metadata tag in the output playlist. Key (string) --- If you want Elastic Transcoder to generate a key for you, leave this field blank. If you choose to supply your own key, you must encrypt the key by using AWS KMS. The key must be base64-encoded, and it must be one of the following bit lengths before being base64-encoded: 128, 192, or 256. KeyMd5 (string) --- If Elastic Transcoder is generating your key for you, you must leave this field blank. The MD5 digest of the key that you want Elastic Transcoder to use to encrypt your output file, and that you want Elastic Transcoder to use as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes before being base64- encoded. InitializationVector (string) --- If Elastic Transcoder is generating your key for you, you must leave this field blank. The series of random bits created by a random bit generator, unique for every encryption operation, that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes before being base64-encoded. LicenseAcquisitionUrl (string) --- The location of the license key required to decrypt your HLS playlist. The URL must be an absolute path, and is referenced in the URI attribute of the EXT-X-KEY metadata tag in the playlist file. KeyStoragePolicy (string) --- Specify whether you want Elastic Transcoder to write your HLS license key to an Amazon S3 bucket. If you choose WithVariantPlaylists, LicenseAcquisitionUrl must be left blank and Elastic Transcoder writes your data key into the same bucket as the associated playlist. PlayReadyDrm (dict) --- The DRM settings, if any, that you want Elastic Transcoder to apply to the output files associated with this playlist. Format (string) --- The type of DRM, if any, that you want Elastic Transcoder to apply to the output files associated with this playlist. Key (string) --- The DRM key for your file, provided by your DRM license provider. The key must also be encrypted by using AWS KMS. KeyMd5 (string) --- The MD5 digest of the key used for DRM on your file, and that you want Elastic Transcoder to use as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes before being base64-encoded. KeyId (string) --- The ID for your DRM key, so that your DRM license provider knows which key to provide. The key ID must be provided in big endian, and Elastic Transcoder converts it to little endian before inserting it into the PlayReady DRM headers. If you are unsure whether your license server provides your key ID in big or little endian, check with your DRM provider. InitializationVector (string) --- The series of random bits created by a random bit generator, unique for every encryption operation, that you want Elastic Transcoder to use to encrypt your files. The initialization vector must be base64-encoded, and it must be exactly 8 bytes long before being base64-encoded. If no initialization vector is provided, Elastic Transcoder generates one for you. LicenseAcquisitionUrl (string) --- The location of the license key required to play DRM content. The URL must be an absolute path, and is referenced by the PlayReady header. The PlayReady header is referenced in the protection header of the client manifest for Smooth Streaming outputs, and in the EXT-X-DXDRM and EXT-XDXDRMINFO metadata tags for HLS playlist outputs. An example URL looks like this: https://www.example.com/exampleKey/",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name that you want Elastic Transcoder to assign to the master playlist, for example, nyc-vacation.m3u8. If the name includes a / character, the section of the name before the last / must be identical for all Name objects. If you create more than one master playlist, the values of all Name objects must be unique.",
          "nested_params": []
        },
        {
          "name": "Format",
          "type": "string",
          "required": false,
          "description": "The format of the output playlist. Valid formats include HLSv3, HLSv4, and Smooth.",
          "nested_params": []
        },
        {
          "name": "OutputKeys",
          "type": "list",
          "required": false,
          "description": "For each output in this job that you want to include in a master playlist, the value of the Outputs:Key object.",
          "nested_params": []
        },
        {
          "name": "HlsContentProtection",
          "type": "dict",
          "required": false,
          "description": "The HLS content protection settings, if any, that you want Elastic Transcoder to apply to the output files associated with this playlist.",
          "nested_params": [
            {
              "name": "Method",
              "type": "string",
              "required": false,
              "description": "The content protection method for your output. The only valid value is: aes-128. This value is written into the method attribute of the EXT-X-KEY metadata tag in the output playlist.",
              "nested_params": []
            },
            {
              "name": "Key",
              "type": "string",
              "required": false,
              "description": "If you want Elastic Transcoder to generate a key for you, leave this field blank. If you choose to supply your own key, you must encrypt the key by using AWS KMS. The key must be base64-encoded, and it must be one of the following bit lengths before being base64-encoded: 128, 192, or 256.",
              "nested_params": []
            },
            {
              "name": "KeyMd5",
              "type": "string",
              "required": false,
              "description": "If Elastic Transcoder is generating your key for you, you must leave this field blank. The MD5 digest of the key that you want Elastic Transcoder to use to encrypt your output file, and that you want Elastic Transcoder to use as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes before being base64- encoded.",
              "nested_params": []
            },
            {
              "name": "InitializationVector",
              "type": "string",
              "required": false,
              "description": "If Elastic Transcoder is generating your key for you, you must leave this field blank. The series of random bits created by a random bit generator, unique for every encryption operation, that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes before being base64-encoded.",
              "nested_params": []
            },
            {
              "name": "LicenseAcquisitionUrl",
              "type": "string",
              "required": false,
              "description": "The location of the license key required to decrypt your HLS playlist. The URL must be an absolute path, and is referenced in the URI attribute of the EXT-X-KEY metadata tag in the playlist file.",
              "nested_params": []
            },
            {
              "name": "KeyStoragePolicy",
              "type": "string",
              "required": false,
              "description": "Specify whether you want Elastic Transcoder to write your HLS license key to an Amazon S3 bucket. If you choose WithVariantPlaylists, LicenseAcquisitionUrl must be left blank and Elastic Transcoder writes your data key into the same bucket as the associated playlist.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "PlayReadyDrm",
          "type": "dict",
          "required": false,
          "description": "The DRM settings, if any, that you want Elastic Transcoder to apply to the output files associated with this playlist.",
          "nested_params": [
            {
              "name": "Format",
              "type": "string",
              "required": false,
              "description": "The type of DRM, if any, that you want Elastic Transcoder to apply to the output files associated with this playlist.",
              "nested_params": []
            },
            {
              "name": "Key",
              "type": "string",
              "required": false,
              "description": "The DRM key for your file, provided by your DRM license provider. The key must be base64-encoded, and it must be one of the following bit lengths before being base64-encoded: 128, 192, or 256. The key must also be encrypted by using AWS KMS.",
              "nested_params": []
            },
            {
              "name": "KeyMd5",
              "type": "string",
              "required": false,
              "description": "The MD5 digest of the key used for DRM on your file, and that you want Elastic Transcoder to use as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes before being base64-encoded.",
              "nested_params": []
            },
            {
              "name": "KeyId",
              "type": "string",
              "required": false,
              "description": "The ID for your DRM key, so that your DRM license provider knows which key to provide. The key ID must be provided in big endian, and Elastic Transcoder converts it to little endian before inserting it into the PlayReady DRM headers. If you are unsure whether your license server provides your key ID in big or little endian, check with your DRM provider.",
              "nested_params": []
            },
            {
              "name": "InitializationVector",
              "type": "string",
              "required": false,
              "description": "The series of random bits created by a random bit generator, unique for every encryption operation, that you want Elastic Transcoder to use to encrypt your files. The initialization vector must be base64-encoded, and it must be exactly 8 bytes long before being base64-encoded. If no initialization vector is provided, Elastic Transcoder generates one for you.",
              "nested_params": []
            },
            {
              "name": "LicenseAcquisitionUrl",
              "type": "string",
              "required": false,
              "description": "The location of the license key required to play DRM content. The URL must be an absolute path, and is referenced by the PlayReady header. The PlayReady header is referenced in the protection header of the client manifest for Smooth Streaming outputs, and in the EXT-X-DXDRM and EXT-XDXDRMINFO metadata tags for HLS playlist outputs. An example URL looks like this: https://www.example.com/exampleKey/",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "UserMetadata",
      "type": "dict",
      "required": false,
      "description": "User-defined metadata that you want to associate with an Elastic Transcoder job. You specify metadata in key/value pairs, and you can add up to 10 key/value pairs per job. Elastic Transcoder does not guarantee that key/value pairs are returned in the same order in which you specify them. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "Id",
              "type": "string",
              "description": "The identifier that Elastic Transcoder assigned to the job. You use this value to get settings for the job or to delete the job.",
              "nested_items": []
            },
            {
              "name": "Arn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) for the job.",
              "nested_items": []
            },
            {
              "name": "PipelineId",
              "type": "string",
              "description": "The Id of the pipeline that you want Elastic Transcoder to use for transcoding. The pipeline determines several settings, including the Amazon S3 bucket from which Elastic Transcoder gets the files to transcode and the bucket into which Elastic Transcoder puts the transcoded files.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Key",
                  "type": "string",
                  "description": "The name of the file to transcode. Elsewhere in the body of the JSON block is the the ID of the pipeline to use for processing the job. The InputBucket object in that pipeline tells Elastic Transcoder which Amazon S3 bucket to get the file from.",
                  "nested_items": []
                },
                {
                  "name": "FrameRate",
                  "type": "string",
                  "description": "The frame rate of the input file. If you want Elastic Transcoder to automatically detect the frame rate of the input file, specify auto. If you want to specify the frame rate for the input file, enter one of the following values:",
                  "nested_items": []
                },
                {
                  "name": "Resolution",
                  "type": "string",
                  "description": "This value must be auto, which causes Elastic Transcoder to automatically detect the resolution of the input file.",
                  "nested_items": []
                },
                {
                  "name": "AspectRatio",
                  "type": "string",
                  "description": "The aspect ratio of the input file. If you want Elastic Transcoder to automatically detect the aspect ratio of the input file, specify auto. If you want to specify the aspect ratio for the output file, enter one of the following values:",
                  "nested_items": []
                },
                {
                  "name": "Interlaced",
                  "type": "string",
                  "description": "Whether the input file is interlaced. If you want Elastic Transcoder to automatically detect whether the input file is interlaced, specify auto. If you want to specify whether the input file is interlaced, enter one of the following values:",
                  "nested_items": []
                },
                {
                  "name": "Container",
                  "type": "string",
                  "description": "The container type for the input file. If you want Elastic Transcoder to automatically detect the container type of the input file, specify auto. If you want to specify the container type for the input file, enter one of the following values:",
                  "nested_items": []
                },
                {
                  "name": "Encryption",
                  "type": "dict",
                  "description": "The encryption settings, if any, that are used for decrypting your input files. If your input file is encrypted, you must specify the mode that Elastic Transcoder uses to decrypt your file.",
                  "nested_items": [
                    {
                      "name": "Mode",
                      "type": "string",
                      "description": "The specific server-side encryption mode that you want Elastic Transcoder to use when decrypting your input files or encrypting your output files. Elastic Transcoder supports the following options:",
                      "nested_items": [
                        {
                          "name": "s3:",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "s3-aws-kms:",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "aes-cbc-pkcs7:",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "aes-ctr:",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "aes-gcm:",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "Key",
                      "type": "string",
                      "description": "The data encryption key that you want Elastic Transcoder to use to encrypt your output file, or that was used to encrypt your input file. The key must be base64-encoded and it must be one of the following bit lengths before being base64-encoded:",
                      "nested_items": []
                    },
                    {
                      "name": "KeyMd5",
                      "type": "string",
                      "description": "The MD5 digest of the key that you used to encrypt your input file, or that you want Elastic Transcoder to use to encrypt your output file. Elastic Transcoder uses the key digest as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                      "nested_items": []
                    },
                    {
                      "name": "InitializationVector",
                      "type": "string",
                      "description": "The series of random bits created by a random bit generator, unique for every encryption operation, that you used to encrypt your input files or that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "StartTime",
                      "type": "string",
                      "description": "The place in the input file where you want a clip to start. The format can be either HH:mm:ss.SSS (maximum value: 23:59:59.999; SSS is thousandths of a second) or sssss.SSS (maximum value: 86399.999). If you don't specify a value, Elastic Transcoder starts at the beginning of the input file.",
                      "nested_items": []
                    },
                    {
                      "name": "Duration",
                      "type": "string",
                      "description": "The duration of the clip. The format can be either HH:mm:ss.SSS (maximum value: 23:59:59.999; SSS is thousandths of a second) or sssss.SSS (maximum value: 86399.999). If you don't specify a value, Elastic Transcoder creates an output file from StartTime to the end of the file.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "InputCaptions",
                  "type": "dict",
                  "description": "You can configure Elastic Transcoder to transcode captions, or subtitles, from one format to another. All captions must be in UTF-8. Elastic Transcoder supports two types of captions:",
                  "nested_items": [
                    {
                      "name": "Embedded:",
                      "type": "EIA-608, first non-empty channel only",
                      "description": "",
                      "nested_items": []
                    },
                    {
                      "name": "Sidecar:",
                      "type": "first div element only",
                      "description": "",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "DetectedProperties",
                  "type": "dict",
                  "description": "The detected properties of the input file.",
                  "nested_items": [
                    {
                      "name": "Width",
                      "type": "integer",
                      "description": "The detected width of the input file, in pixels.",
                      "nested_items": []
                    },
                    {
                      "name": "Height",
                      "type": "integer",
                      "description": "The detected height of the input file, in pixels.",
                      "nested_items": []
                    },
                    {
                      "name": "FrameRate",
                      "type": "string",
                      "description": "The detected frame rate of the input file, in frames per second.",
                      "nested_items": []
                    },
                    {
                      "name": "FileSize",
                      "type": "integer",
                      "description": "The detected file size of the input file, in bytes.",
                      "nested_items": []
                    },
                    {
                      "name": "DurationMillis",
                      "type": "integer",
                      "description": "The detected duration of the input file, in milliseconds.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "Inputs",
              "type": "list",
              "description": "Information about the files that you're transcoding. If you specified multiple files for this job, Elastic Transcoder stitches the files together to make one output.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Key",
                      "type": "string",
                      "description": "The name of the file to transcode. Elsewhere in the body of the JSON block is the the ID of the pipeline to use for processing the job. The InputBucket object in that pipeline tells Elastic Transcoder which Amazon S3 bucket to get the file from.",
                      "nested_items": []
                    },
                    {
                      "name": "FrameRate",
                      "type": "string",
                      "description": "The frame rate of the input file. If you want Elastic Transcoder to automatically detect the frame rate of the input file, specify auto. If you want to specify the frame rate for the input file, enter one of the following values:",
                      "nested_items": []
                    },
                    {
                      "name": "Resolution",
                      "type": "string",
                      "description": "This value must be auto, which causes Elastic Transcoder to automatically detect the resolution of the input file.",
                      "nested_items": []
                    },
                    {
                      "name": "AspectRatio",
                      "type": "string",
                      "description": "The aspect ratio of the input file. If you want Elastic Transcoder to automatically detect the aspect ratio of the input file, specify auto. If you want to specify the aspect ratio for the output file, enter one of the following values:",
                      "nested_items": []
                    },
                    {
                      "name": "Interlaced",
                      "type": "string",
                      "description": "Whether the input file is interlaced. If you want Elastic Transcoder to automatically detect whether the input file is interlaced, specify auto. If you want to specify whether the input file is interlaced, enter one of the following values:",
                      "nested_items": []
                    },
                    {
                      "name": "Container",
                      "type": "string",
                      "description": "The container type for the input file. If you want Elastic Transcoder to automatically detect the container type of the input file, specify auto. If you want to specify the container type for the input file, enter one of the following values:",
                      "nested_items": []
                    },
                    {
                      "name": "Encryption",
                      "type": "dict",
                      "description": "The encryption settings, if any, that are used for decrypting your input files. If your input file is encrypted, you must specify the mode that Elastic Transcoder uses to decrypt your file.",
                      "nested_items": [
                        {
                          "name": "Mode",
                          "type": "string",
                          "description": "The specific server-side encryption mode that you want Elastic Transcoder to use when decrypting your input files or encrypting your output files. Elastic Transcoder supports the following options:",
                          "nested_items": [
                            {
                              "name": "s3:",
                              "type": "",
                              "description": "",
                              "nested_items": []
                            },
                            {
                              "name": "s3-aws-kms:",
                              "type": "",
                              "description": "",
                              "nested_items": []
                            },
                            {
                              "name": "aes-cbc-pkcs7:",
                              "type": "",
                              "description": "",
                              "nested_items": []
                            },
                            {
                              "name": "aes-ctr:",
                              "type": "",
                              "description": "",
                              "nested_items": []
                            },
                            {
                              "name": "aes-gcm:",
                              "type": "",
                              "description": "",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "Key",
                          "type": "string",
                          "description": "The data encryption key that you want Elastic Transcoder to use to encrypt your output file, or that was used to encrypt your input file. The key must be base64-encoded and it must be one of the following bit lengths before being base64-encoded:",
                          "nested_items": []
                        },
                        {
                          "name": "KeyMd5",
                          "type": "string",
                          "description": "The MD5 digest of the key that you used to encrypt your input file, or that you want Elastic Transcoder to use to encrypt your output file. Elastic Transcoder uses the key digest as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                          "nested_items": []
                        },
                        {
                          "name": "InitializationVector",
                          "type": "string",
                          "description": "The series of random bits created by a random bit generator, unique for every encryption operation, that you used to encrypt your input files or that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "StartTime",
                          "type": "string",
                          "description": "The place in the input file where you want a clip to start. The format can be either HH:mm:ss.SSS (maximum value: 23:59:59.999; SSS is thousandths of a second) or sssss.SSS (maximum value: 86399.999). If you don't specify a value, Elastic Transcoder starts at the beginning of the input file.",
                          "nested_items": []
                        },
                        {
                          "name": "Duration",
                          "type": "string",
                          "description": "The duration of the clip. The format can be either HH:mm:ss.SSS (maximum value: 23:59:59.999; SSS is thousandths of a second) or sssss.SSS (maximum value: 86399.999). If you don't specify a value, Elastic Transcoder creates an output file from StartTime to the end of the file.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "InputCaptions",
                      "type": "dict",
                      "description": "You can configure Elastic Transcoder to transcode captions, or subtitles, from one format to another. All captions must be in UTF-8. Elastic Transcoder supports two types of captions:",
                      "nested_items": [
                        {
                          "name": "Embedded:",
                          "type": "EIA-608, first non-empty channel only",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "Sidecar:",
                          "type": "first div element only",
                          "description": "",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "DetectedProperties",
                      "type": "dict",
                      "description": "The detected properties of the input file.",
                      "nested_items": [
                        {
                          "name": "Width",
                          "type": "integer",
                          "description": "The detected width of the input file, in pixels.",
                          "nested_items": []
                        },
                        {
                          "name": "Height",
                          "type": "integer",
                          "description": "The detected height of the input file, in pixels.",
                          "nested_items": []
                        },
                        {
                          "name": "FrameRate",
                          "type": "string",
                          "description": "The detected frame rate of the input file, in frames per second.",
                          "nested_items": []
                        },
                        {
                          "name": "FileSize",
                          "type": "integer",
                          "description": "The detected file size of the input file, in bytes.",
                          "nested_items": []
                        },
                        {
                          "name": "DurationMillis",
                          "type": "integer",
                          "description": "The detected duration of the input file, in milliseconds.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Id",
                  "type": "string",
                  "description": "A sequential counter, starting with 1, that identifies an output among the outputs from the current job. In the Output syntax, this value is always 1.",
                  "nested_items": []
                },
                {
                  "name": "Key",
                  "type": "string",
                  "description": "The name to assign to the transcoded file. Elastic Transcoder saves the file in the Amazon S3 bucket specified by the OutputBucket object in the pipeline that is specified by the pipeline ID.",
                  "nested_items": []
                },
                {
                  "name": "ThumbnailPattern",
                  "type": "string",
                  "description": "Whether you want Elastic Transcoder to create thumbnails for your videos and, if so, how you want Elastic Transcoder to name the files.",
                  "nested_items": [
                    {
                      "name": "00001",
                      "type": "Required",
                      "description": "",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "ThumbnailEncryption",
                  "type": "dict",
                  "description": "The encryption settings, if any, that you want Elastic Transcoder to apply to your thumbnail.",
                  "nested_items": [
                    {
                      "name": "Mode",
                      "type": "string",
                      "description": "The specific server-side encryption mode that you want Elastic Transcoder to use when decrypting your input files or encrypting your output files. Elastic Transcoder supports the following options:",
                      "nested_items": [
                        {
                          "name": "s3:",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "s3-aws-kms:",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "aes-cbc-pkcs7:",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "aes-ctr:",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "aes-gcm:",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "Key",
                      "type": "string",
                      "description": "The data encryption key that you want Elastic Transcoder to use to encrypt your output file, or that was used to encrypt your input file. The key must be base64-encoded and it must be one of the following bit lengths before being base64-encoded:",
                      "nested_items": []
                    },
                    {
                      "name": "KeyMd5",
                      "type": "string",
                      "description": "The MD5 digest of the key that you used to encrypt your input file, or that you want Elastic Transcoder to use to encrypt your output file. Elastic Transcoder uses the key digest as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                      "nested_items": []
                    },
                    {
                      "name": "InitializationVector",
                      "type": "string",
                      "description": "The series of random bits created by a random bit generator, unique for every encryption operation, that you used to encrypt your input files or that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Rotate",
                  "type": "string",
                  "description": "The number of degrees clockwise by which you want Elastic Transcoder to rotate the output relative to the input. Enter one of the following values:",
                  "nested_items": []
                },
                {
                  "name": "PresetId",
                  "type": "string",
                  "description": "The value of the Id object for the preset that you want to use for this job. The preset determines the audio, video, and thumbnail settings that Elastic Transcoder uses for transcoding. To use a preset that you created, specify the preset ID that Elastic Transcoder returned in the response when you created the preset. You can also use the Elastic Transcoder system presets, which you can get with ListPresets.",
                  "nested_items": []
                },
                {
                  "name": "SegmentDuration",
                  "type": "string",
                  "description": "If you specify a preset in PresetId for which the value of Container is fmp4 (Fragmented MP4) or ts (MPEG-TS), SegmentDuration is the target maximum duration of each segment in seconds. For HLSv3 format playlists, each media segment is stored in a separate .ts file. For HLSv4, MPEG-DASH, and Smooth playlists, all media segments for an output are stored in a single file. Each segment is approximately the length of the SegmentDuration, though individual segments might be shorter or longer.",
                  "nested_items": []
                },
                {
                  "name": "Status",
                  "type": "string",
                  "description": "The status of one output in a job. If you specified only one output for the job, Outputs:Status is always the same as Job:Status. If you specified more than one output:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "Job:Status and Outputs:Status for all of the outputs is Submitted until Elastic Transcoder starts to process the first output.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "When Elastic Transcoder starts to process the first output, Outputs:Status for that output and Job:Status both change to Progressing. For each output, the value of Outputs:Status remains Submitted until Elastic Transcoder starts to process the output.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Job:Status remains Progressing until all of the outputs reach a terminal status, either Complete or Error.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "When all of the outputs reach a terminal status, Job:Status changes to Complete only if Outputs:Status for all of the outputs is Complete. If Outputs:Status for one or more outputs is Error, the terminal status for Job:Status is also Error.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "StatusDetail",
                  "type": "string",
                  "description": "Information that further explains Status.",
                  "nested_items": []
                },
                {
                  "name": "Duration",
                  "type": "integer",
                  "description": "Duration of the output file, in seconds.",
                  "nested_items": []
                },
                {
                  "name": "Width",
                  "type": "integer",
                  "description": "Specifies the width of the output file in pixels.",
                  "nested_items": []
                },
                {
                  "name": "Height",
                  "type": "integer",
                  "description": "Height of the output file, in pixels.",
                  "nested_items": []
                },
                {
                  "name": "FrameRate",
                  "type": "string",
                  "description": "Frame rate of the output file, in frames per second.",
                  "nested_items": []
                },
                {
                  "name": "FileSize",
                  "type": "integer",
                  "description": "File size of the output file, in bytes.",
                  "nested_items": []
                },
                {
                  "name": "DurationMillis",
                  "type": "integer",
                  "description": "Duration of the output file, in milliseconds.",
                  "nested_items": []
                },
                {
                  "name": "Watermarks",
                  "type": "list",
                  "description": "Information about the watermarks that you want Elastic Transcoder to add to the video during transcoding. You can specify up to four watermarks for each output. Settings for each watermark must be defined in the preset that you specify in Preset for the current output.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "PresetWatermarkId",
                          "type": "string",
                          "description": "The ID of the watermark settings that Elastic Transcoder uses to add watermarks to the video during transcoding. The settings are in the preset specified by Preset for the current output. In that preset, the value of Watermarks Id tells Elastic Transcoder which settings to use.",
                          "nested_items": []
                        },
                        {
                          "name": "InputKey",
                          "type": "string",
                          "description": "The name of the .png or .jpg file that you want to use for the watermark. To determine which Amazon S3 bucket contains the specified file, Elastic Transcoder checks the pipeline specified by Pipeline; the Input Bucket object in that pipeline identifies the bucket.",
                          "nested_items": []
                        },
                        {
                          "name": "Encryption",
                          "type": "dict",
                          "description": "The encryption settings, if any, that you want Elastic Transcoder to apply to your watermarks.",
                          "nested_items": [
                            {
                              "name": "Mode",
                              "type": "string",
                              "description": "The specific server-side encryption mode that you want Elastic Transcoder to use when decrypting your input files or encrypting your output files. Elastic Transcoder supports the following options:",
                              "nested_items": [
                                {
                                  "name": "s3:",
                                  "type": "",
                                  "description": "",
                                  "nested_items": []
                                },
                                {
                                  "name": "s3-aws-kms:",
                                  "type": "",
                                  "description": "",
                                  "nested_items": []
                                },
                                {
                                  "name": "aes-cbc-pkcs7:",
                                  "type": "",
                                  "description": "",
                                  "nested_items": []
                                },
                                {
                                  "name": "aes-ctr:",
                                  "type": "",
                                  "description": "",
                                  "nested_items": []
                                },
                                {
                                  "name": "aes-gcm:",
                                  "type": "",
                                  "description": "",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "Key",
                              "type": "string",
                              "description": "The data encryption key that you want Elastic Transcoder to use to encrypt your output file, or that was used to encrypt your input file. The key must be base64-encoded and it must be one of the following bit lengths before being base64-encoded:",
                              "nested_items": []
                            },
                            {
                              "name": "KeyMd5",
                              "type": "string",
                              "description": "The MD5 digest of the key that you used to encrypt your input file, or that you want Elastic Transcoder to use to encrypt your output file. Elastic Transcoder uses the key digest as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                              "nested_items": []
                            },
                            {
                              "name": "InitializationVector",
                              "type": "string",
                              "description": "The series of random bits created by a random bit generator, unique for every encryption operation, that you used to encrypt your input files or that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "MergePolicy",
                      "type": "string",
                      "description": "A policy that determines how Elastic Transcoder handles the existence of multiple album artwork files.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "Replace: The specified album art replaces any existing album art.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "Prepend: The specified album art is placed in front of any existing album art.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "Append: The specified album art is placed after any existing album art.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "Fallback: If the original input file contains artwork, Elastic Transcoder uses that artwork for the output. If the original input does not contain artwork, Elastic Transcoder uses the specified album art file.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "Artwork",
                      "type": "list",
                      "description": "The file to be used as album art. There can be multiple artworks associated with an audio file, to a maximum of 20. Valid formats are .jpg and .png.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "InputKey",
                              "type": "string",
                              "description": "The name of the file to be used as album art. To determine which Amazon S3 bucket contains the specified file, Elastic Transcoder checks the pipeline specified by PipelineId; the InputBucket object in that pipeline identifies the bucket.",
                              "nested_items": []
                            },
                            {
                              "name": "MaxWidth",
                              "type": "string",
                              "description": "The maximum width of the output album art in pixels. If you specify auto, Elastic Transcoder uses 600 as the default value. If you specify a numeric value, enter an even integer between 32 and 4096, inclusive.",
                              "nested_items": []
                            },
                            {
                              "name": "MaxHeight",
                              "type": "string",
                              "description": "The maximum height of the output album art in pixels. If you specify auto, Elastic Transcoder uses 600 as the default value. If you specify a numeric value, enter an even integer between 32 and 3072, inclusive.",
                              "nested_items": []
                            },
                            {
                              "name": "SizingPolicy",
                              "type": "string",
                              "description": "Specify one of the following values to control scaling of the output album art:",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "Fit: Elastic Transcoder scales the output art so it matches the value that you specified in either MaxWidth or MaxHeight without exceeding the other value.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "if any",
                                  "description": "Fill: Elastic Transcoder scales the output art so it matches the value that you specified in either MaxWidth or MaxHeight and matches or exceeds the other value. Elastic Transcoder centers the output art and then crops it in the dimension (if any) that exceeds the maximum value.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "Stretch: Elastic Transcoder stretches the output art to match the values that you specified for MaxWidth and MaxHeight. If the relative proportions of the input art and the output art are different, the output art will be distorted.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "Keep: Elastic Transcoder does not scale the output art. If either dimension of the input art exceeds the values that you specified for MaxWidth and MaxHeight, Elastic Transcoder crops the output art.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "ShrinkToFit: Elastic Transcoder scales the output art down so that its dimensions match the values that you specified for at least one of MaxWidth and MaxHeight without exceeding either value. If you specify this option, Elastic Transcoder does not scale the art up.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "ShrinkToFill Elastic Transcoder scales the output art down so that its dimensions match the values that you specified for at least one of MaxWidth and MaxHeight without dropping below either value. If you specify this option, Elastic Transcoder does not scale the art up.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "PaddingPolicy",
                              "type": "string",
                              "description": "When you set PaddingPolicy to Pad, Elastic Transcoder may add white bars to the top and bottom and/or left and right sides of the output album art to make the total size of the output art match the values that you specified for MaxWidth and MaxHeight.",
                              "nested_items": []
                            },
                            {
                              "name": "AlbumArtFormat",
                              "type": "string",
                              "description": "The format of album art, if any. Valid formats are .jpg and .png.",
                              "nested_items": []
                            },
                            {
                              "name": "Encryption",
                              "type": "dict",
                              "description": "The encryption settings, if any, that you want Elastic Transcoder to apply to your artwork.",
                              "nested_items": [
                                {
                                  "name": "Mode",
                                  "type": "string",
                                  "description": "The specific server-side encryption mode that you want Elastic Transcoder to use when decrypting your input files or encrypting your output files. Elastic Transcoder supports the following options:",
                                  "nested_items": [
                                    {
                                      "name": "s3:",
                                      "type": "",
                                      "description": "",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "s3-aws-kms:",
                                      "type": "",
                                      "description": "",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "aes-cbc-pkcs7:",
                                      "type": "",
                                      "description": "",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "aes-ctr:",
                                      "type": "",
                                      "description": "",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "aes-gcm:",
                                      "type": "",
                                      "description": "",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "Key",
                                  "type": "string",
                                  "description": "The data encryption key that you want Elastic Transcoder to use to encrypt your output file, or that was used to encrypt your input file. The key must be base64-encoded and it must be one of the following bit lengths before being base64-encoded:",
                                  "nested_items": []
                                },
                                {
                                  "name": "KeyMd5",
                                  "type": "string",
                                  "description": "The MD5 digest of the key that you used to encrypt your input file, or that you want Elastic Transcoder to use to encrypt your output file. Elastic Transcoder uses the key digest as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                                  "nested_items": []
                                },
                                {
                                  "name": "InitializationVector",
                                  "type": "string",
                                  "description": "The series of random bits created by a random bit generator, unique for every encryption operation, that you used to encrypt your input files or that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "Composition",
                  "type": "list",
                  "description": "You can create an output file that contains an excerpt from the input file. This excerpt, called a clip, can come from the beginning, middle, or end of the file. The Composition object contains settings for the clips that make up an output file. For the current release, you can only specify settings for a single clip per output file. The Composition object cannot be null.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "StartTime",
                              "type": "string",
                              "description": "The place in the input file where you want a clip to start. The format can be either HH:mm:ss.SSS (maximum value: 23:59:59.999; SSS is thousandths of a second) or sssss.SSS (maximum value: 86399.999). If you don't specify a value, Elastic Transcoder starts at the beginning of the input file.",
                              "nested_items": []
                            },
                            {
                              "name": "Duration",
                              "type": "string",
                              "description": "The duration of the clip. The format can be either HH:mm:ss.SSS (maximum value: 23:59:59.999; SSS is thousandths of a second) or sssss.SSS (maximum value: 86399.999). If you don't specify a value, Elastic Transcoder creates an output file from StartTime to the end of the file.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Embedded:",
                      "type": "EIA-608, first non-empty channel only",
                      "description": "",
                      "nested_items": []
                    },
                    {
                      "name": "Sidecar:",
                      "type": "first div element only",
                      "description": "",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Encryption",
                  "type": "dict",
                  "description": "The encryption settings, if any, that you want Elastic Transcoder to apply to your output files. If you choose to use encryption, you must specify a mode to use. If you choose not to use encryption, Elastic Transcoder writes an unencrypted file to your Amazon S3 bucket.",
                  "nested_items": [
                    {
                      "name": "Mode",
                      "type": "string",
                      "description": "The specific server-side encryption mode that you want Elastic Transcoder to use when decrypting your input files or encrypting your output files. Elastic Transcoder supports the following options:",
                      "nested_items": [
                        {
                          "name": "s3:",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "s3-aws-kms:",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "aes-cbc-pkcs7:",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "aes-ctr:",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "aes-gcm:",
                          "type": "",
                          "description": "",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "Key",
                      "type": "string",
                      "description": "The data encryption key that you want Elastic Transcoder to use to encrypt your output file, or that was used to encrypt your input file. The key must be base64-encoded and it must be one of the following bit lengths before being base64-encoded:",
                      "nested_items": []
                    },
                    {
                      "name": "KeyMd5",
                      "type": "string",
                      "description": "The MD5 digest of the key that you used to encrypt your input file, or that you want Elastic Transcoder to use to encrypt your output file. Elastic Transcoder uses the key digest as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                      "nested_items": []
                    },
                    {
                      "name": "InitializationVector",
                      "type": "string",
                      "description": "The series of random bits created by a random bit generator, unique for every encryption operation, that you used to encrypt your input files or that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "AppliedColorSpaceConversion",
                  "type": "string",
                  "description": "If Elastic Transcoder used a preset with a ColorSpaceConversionMode to transcode the output file, the AppliedColorSpaceConversion parameter shows the conversion used. If no ColorSpaceConversionMode was defined in the preset, this parameter is not be included in the job response.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Outputs",
              "type": "list",
              "description": "Information about the output files. We recommend that you use the Outputs syntax for all jobs, even when you want Elastic Transcoder to transcode a file into only one format. Do not use both the Outputs and Output syntaxes in the same request. You can create a maximum of 30 outputs per job.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Id",
                      "type": "string",
                      "description": "A sequential counter, starting with 1, that identifies an output among the outputs from the current job. In the Output syntax, this value is always 1.",
                      "nested_items": []
                    },
                    {
                      "name": "Key",
                      "type": "string",
                      "description": "The name to assign to the transcoded file. Elastic Transcoder saves the file in the Amazon S3 bucket specified by the OutputBucket object in the pipeline that is specified by the pipeline ID.",
                      "nested_items": []
                    },
                    {
                      "name": "ThumbnailPattern",
                      "type": "string",
                      "description": "Whether you want Elastic Transcoder to create thumbnails for your videos and, if so, how you want Elastic Transcoder to name the files.",
                      "nested_items": [
                        {
                          "name": "00001",
                          "type": "Required",
                          "description": "",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "ThumbnailEncryption",
                      "type": "dict",
                      "description": "The encryption settings, if any, that you want Elastic Transcoder to apply to your thumbnail.",
                      "nested_items": [
                        {
                          "name": "Mode",
                          "type": "string",
                          "description": "The specific server-side encryption mode that you want Elastic Transcoder to use when decrypting your input files or encrypting your output files. Elastic Transcoder supports the following options:",
                          "nested_items": [
                            {
                              "name": "s3:",
                              "type": "",
                              "description": "",
                              "nested_items": []
                            },
                            {
                              "name": "s3-aws-kms:",
                              "type": "",
                              "description": "",
                              "nested_items": []
                            },
                            {
                              "name": "aes-cbc-pkcs7:",
                              "type": "",
                              "description": "",
                              "nested_items": []
                            },
                            {
                              "name": "aes-ctr:",
                              "type": "",
                              "description": "",
                              "nested_items": []
                            },
                            {
                              "name": "aes-gcm:",
                              "type": "",
                              "description": "",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "Key",
                          "type": "string",
                          "description": "The data encryption key that you want Elastic Transcoder to use to encrypt your output file, or that was used to encrypt your input file. The key must be base64-encoded and it must be one of the following bit lengths before being base64-encoded:",
                          "nested_items": []
                        },
                        {
                          "name": "KeyMd5",
                          "type": "string",
                          "description": "The MD5 digest of the key that you used to encrypt your input file, or that you want Elastic Transcoder to use to encrypt your output file. Elastic Transcoder uses the key digest as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                          "nested_items": []
                        },
                        {
                          "name": "InitializationVector",
                          "type": "string",
                          "description": "The series of random bits created by a random bit generator, unique for every encryption operation, that you used to encrypt your input files or that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "Rotate",
                      "type": "string",
                      "description": "The number of degrees clockwise by which you want Elastic Transcoder to rotate the output relative to the input. Enter one of the following values:",
                      "nested_items": []
                    },
                    {
                      "name": "PresetId",
                      "type": "string",
                      "description": "The value of the Id object for the preset that you want to use for this job. The preset determines the audio, video, and thumbnail settings that Elastic Transcoder uses for transcoding. To use a preset that you created, specify the preset ID that Elastic Transcoder returned in the response when you created the preset. You can also use the Elastic Transcoder system presets, which you can get with ListPresets.",
                      "nested_items": []
                    },
                    {
                      "name": "SegmentDuration",
                      "type": "string",
                      "description": "If you specify a preset in PresetId for which the value of Container is fmp4 (Fragmented MP4) or ts (MPEG-TS), SegmentDuration is the target maximum duration of each segment in seconds. For HLSv3 format playlists, each media segment is stored in a separate .ts file. For HLSv4, MPEG-DASH, and Smooth playlists, all media segments for an output are stored in a single file. Each segment is approximately the length of the SegmentDuration, though individual segments might be shorter or longer.",
                      "nested_items": []
                    },
                    {
                      "name": "Status",
                      "type": "string",
                      "description": "The status of one output in a job. If you specified only one output for the job, Outputs:Status is always the same as Job:Status. If you specified more than one output:",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "Job:Status and Outputs:Status for all of the outputs is Submitted until Elastic Transcoder starts to process the first output.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "When Elastic Transcoder starts to process the first output, Outputs:Status for that output and Job:Status both change to Progressing. For each output, the value of Outputs:Status remains Submitted until Elastic Transcoder starts to process the output.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "Job:Status remains Progressing until all of the outputs reach a terminal status, either Complete or Error.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "When all of the outputs reach a terminal status, Job:Status changes to Complete only if Outputs:Status for all of the outputs is Complete. If Outputs:Status for one or more outputs is Error, the terminal status for Job:Status is also Error.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "StatusDetail",
                      "type": "string",
                      "description": "Information that further explains Status.",
                      "nested_items": []
                    },
                    {
                      "name": "Duration",
                      "type": "integer",
                      "description": "Duration of the output file, in seconds.",
                      "nested_items": []
                    },
                    {
                      "name": "Width",
                      "type": "integer",
                      "description": "Specifies the width of the output file in pixels.",
                      "nested_items": []
                    },
                    {
                      "name": "Height",
                      "type": "integer",
                      "description": "Height of the output file, in pixels.",
                      "nested_items": []
                    },
                    {
                      "name": "FrameRate",
                      "type": "string",
                      "description": "Frame rate of the output file, in frames per second.",
                      "nested_items": []
                    },
                    {
                      "name": "FileSize",
                      "type": "integer",
                      "description": "File size of the output file, in bytes.",
                      "nested_items": []
                    },
                    {
                      "name": "DurationMillis",
                      "type": "integer",
                      "description": "Duration of the output file, in milliseconds.",
                      "nested_items": []
                    },
                    {
                      "name": "Watermarks",
                      "type": "list",
                      "description": "Information about the watermarks that you want Elastic Transcoder to add to the video during transcoding. You can specify up to four watermarks for each output. Settings for each watermark must be defined in the preset that you specify in Preset for the current output.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "PresetWatermarkId",
                              "type": "string",
                              "description": "The ID of the watermark settings that Elastic Transcoder uses to add watermarks to the video during transcoding. The settings are in the preset specified by Preset for the current output. In that preset, the value of Watermarks Id tells Elastic Transcoder which settings to use.",
                              "nested_items": []
                            },
                            {
                              "name": "InputKey",
                              "type": "string",
                              "description": "The name of the .png or .jpg file that you want to use for the watermark. To determine which Amazon S3 bucket contains the specified file, Elastic Transcoder checks the pipeline specified by Pipeline; the Input Bucket object in that pipeline identifies the bucket.",
                              "nested_items": []
                            },
                            {
                              "name": "Encryption",
                              "type": "dict",
                              "description": "The encryption settings, if any, that you want Elastic Transcoder to apply to your watermarks.",
                              "nested_items": [
                                {
                                  "name": "Mode",
                                  "type": "string",
                                  "description": "The specific server-side encryption mode that you want Elastic Transcoder to use when decrypting your input files or encrypting your output files. Elastic Transcoder supports the following options:",
                                  "nested_items": [
                                    {
                                      "name": "s3:",
                                      "type": "",
                                      "description": "",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "s3-aws-kms:",
                                      "type": "",
                                      "description": "",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "aes-cbc-pkcs7:",
                                      "type": "",
                                      "description": "",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "aes-ctr:",
                                      "type": "",
                                      "description": "",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "aes-gcm:",
                                      "type": "",
                                      "description": "",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "Key",
                                  "type": "string",
                                  "description": "The data encryption key that you want Elastic Transcoder to use to encrypt your output file, or that was used to encrypt your input file. The key must be base64-encoded and it must be one of the following bit lengths before being base64-encoded:",
                                  "nested_items": []
                                },
                                {
                                  "name": "KeyMd5",
                                  "type": "string",
                                  "description": "The MD5 digest of the key that you used to encrypt your input file, or that you want Elastic Transcoder to use to encrypt your output file. Elastic Transcoder uses the key digest as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                                  "nested_items": []
                                },
                                {
                                  "name": "InitializationVector",
                                  "type": "string",
                                  "description": "The series of random bits created by a random bit generator, unique for every encryption operation, that you used to encrypt your input files or that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "MergePolicy",
                          "type": "string",
                          "description": "A policy that determines how Elastic Transcoder handles the existence of multiple album artwork files.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "",
                              "description": "Replace: The specified album art replaces any existing album art.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "Prepend: The specified album art is placed in front of any existing album art.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "Append: The specified album art is placed after any existing album art.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "Fallback: If the original input file contains artwork, Elastic Transcoder uses that artwork for the output. If the original input does not contain artwork, Elastic Transcoder uses the specified album art file.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "Artwork",
                          "type": "list",
                          "description": "The file to be used as album art. There can be multiple artworks associated with an audio file, to a maximum of 20. Valid formats are .jpg and .png.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "dict",
                              "description": "",
                              "nested_items": [
                                {
                                  "name": "InputKey",
                                  "type": "string",
                                  "description": "The name of the file to be used as album art. To determine which Amazon S3 bucket contains the specified file, Elastic Transcoder checks the pipeline specified by PipelineId; the InputBucket object in that pipeline identifies the bucket.",
                                  "nested_items": []
                                },
                                {
                                  "name": "MaxWidth",
                                  "type": "string",
                                  "description": "The maximum width of the output album art in pixels. If you specify auto, Elastic Transcoder uses 600 as the default value. If you specify a numeric value, enter an even integer between 32 and 4096, inclusive.",
                                  "nested_items": []
                                },
                                {
                                  "name": "MaxHeight",
                                  "type": "string",
                                  "description": "The maximum height of the output album art in pixels. If you specify auto, Elastic Transcoder uses 600 as the default value. If you specify a numeric value, enter an even integer between 32 and 3072, inclusive.",
                                  "nested_items": []
                                },
                                {
                                  "name": "SizingPolicy",
                                  "type": "string",
                                  "description": "Specify one of the following values to control scaling of the output album art:",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "Fit: Elastic Transcoder scales the output art so it matches the value that you specified in either MaxWidth or MaxHeight without exceeding the other value.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "if any",
                                      "description": "Fill: Elastic Transcoder scales the output art so it matches the value that you specified in either MaxWidth or MaxHeight and matches or exceeds the other value. Elastic Transcoder centers the output art and then crops it in the dimension (if any) that exceeds the maximum value.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "Stretch: Elastic Transcoder stretches the output art to match the values that you specified for MaxWidth and MaxHeight. If the relative proportions of the input art and the output art are different, the output art will be distorted.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "Keep: Elastic Transcoder does not scale the output art. If either dimension of the input art exceeds the values that you specified for MaxWidth and MaxHeight, Elastic Transcoder crops the output art.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "ShrinkToFit: Elastic Transcoder scales the output art down so that its dimensions match the values that you specified for at least one of MaxWidth and MaxHeight without exceeding either value. If you specify this option, Elastic Transcoder does not scale the art up.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "ShrinkToFill Elastic Transcoder scales the output art down so that its dimensions match the values that you specified for at least one of MaxWidth and MaxHeight without dropping below either value. If you specify this option, Elastic Transcoder does not scale the art up.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "PaddingPolicy",
                                  "type": "string",
                                  "description": "When you set PaddingPolicy to Pad, Elastic Transcoder may add white bars to the top and bottom and/or left and right sides of the output album art to make the total size of the output art match the values that you specified for MaxWidth and MaxHeight.",
                                  "nested_items": []
                                },
                                {
                                  "name": "AlbumArtFormat",
                                  "type": "string",
                                  "description": "The format of album art, if any. Valid formats are .jpg and .png.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Encryption",
                                  "type": "dict",
                                  "description": "The encryption settings, if any, that you want Elastic Transcoder to apply to your artwork.",
                                  "nested_items": [
                                    {
                                      "name": "Mode",
                                      "type": "string",
                                      "description": "The specific server-side encryption mode that you want Elastic Transcoder to use when decrypting your input files or encrypting your output files. Elastic Transcoder supports the following options:",
                                      "nested_items": [
                                        {
                                          "name": "s3:",
                                          "type": "",
                                          "description": "",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "s3-aws-kms:",
                                          "type": "",
                                          "description": "",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "aes-cbc-pkcs7:",
                                          "type": "",
                                          "description": "",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "aes-ctr:",
                                          "type": "",
                                          "description": "",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "aes-gcm:",
                                          "type": "",
                                          "description": "",
                                          "nested_items": []
                                        }
                                      ]
                                    },
                                    {
                                      "name": "Key",
                                      "type": "string",
                                      "description": "The data encryption key that you want Elastic Transcoder to use to encrypt your output file, or that was used to encrypt your input file. The key must be base64-encoded and it must be one of the following bit lengths before being base64-encoded:",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "KeyMd5",
                                      "type": "string",
                                      "description": "The MD5 digest of the key that you used to encrypt your input file, or that you want Elastic Transcoder to use to encrypt your output file. Elastic Transcoder uses the key digest as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "InitializationVector",
                                      "type": "string",
                                      "description": "The series of random bits created by a random bit generator, unique for every encryption operation, that you used to encrypt your input files or that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "Composition",
                      "type": "list",
                      "description": "You can create an output file that contains an excerpt from the input file. This excerpt, called a clip, can come from the beginning, middle, or end of the file. The Composition object contains settings for the clips that make up an output file. For the current release, you can only specify settings for a single clip per output file. The Composition object cannot be null.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "dict",
                              "description": "",
                              "nested_items": [
                                {
                                  "name": "StartTime",
                                  "type": "string",
                                  "description": "The place in the input file where you want a clip to start. The format can be either HH:mm:ss.SSS (maximum value: 23:59:59.999; SSS is thousandths of a second) or sssss.SSS (maximum value: 86399.999). If you don't specify a value, Elastic Transcoder starts at the beginning of the input file.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Duration",
                                  "type": "string",
                                  "description": "The duration of the clip. The format can be either HH:mm:ss.SSS (maximum value: 23:59:59.999; SSS is thousandths of a second) or sssss.SSS (maximum value: 86399.999). If you don't specify a value, Elastic Transcoder creates an output file from StartTime to the end of the file.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Embedded:",
                          "type": "EIA-608, first non-empty channel only",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "Sidecar:",
                          "type": "first div element only",
                          "description": "",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "Encryption",
                      "type": "dict",
                      "description": "The encryption settings, if any, that you want Elastic Transcoder to apply to your output files. If you choose to use encryption, you must specify a mode to use. If you choose not to use encryption, Elastic Transcoder writes an unencrypted file to your Amazon S3 bucket.",
                      "nested_items": [
                        {
                          "name": "Mode",
                          "type": "string",
                          "description": "The specific server-side encryption mode that you want Elastic Transcoder to use when decrypting your input files or encrypting your output files. Elastic Transcoder supports the following options:",
                          "nested_items": [
                            {
                              "name": "s3:",
                              "type": "",
                              "description": "",
                              "nested_items": []
                            },
                            {
                              "name": "s3-aws-kms:",
                              "type": "",
                              "description": "",
                              "nested_items": []
                            },
                            {
                              "name": "aes-cbc-pkcs7:",
                              "type": "",
                              "description": "",
                              "nested_items": []
                            },
                            {
                              "name": "aes-ctr:",
                              "type": "",
                              "description": "",
                              "nested_items": []
                            },
                            {
                              "name": "aes-gcm:",
                              "type": "",
                              "description": "",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "Key",
                          "type": "string",
                          "description": "The data encryption key that you want Elastic Transcoder to use to encrypt your output file, or that was used to encrypt your input file. The key must be base64-encoded and it must be one of the following bit lengths before being base64-encoded:",
                          "nested_items": []
                        },
                        {
                          "name": "KeyMd5",
                          "type": "string",
                          "description": "The MD5 digest of the key that you used to encrypt your input file, or that you want Elastic Transcoder to use to encrypt your output file. Elastic Transcoder uses the key digest as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                          "nested_items": []
                        },
                        {
                          "name": "InitializationVector",
                          "type": "string",
                          "description": "The series of random bits created by a random bit generator, unique for every encryption operation, that you used to encrypt your input files or that you want Elastic Transcoder to use to encrypt your output files. The initialization vector must be base64-encoded, and it must be exactly 16 bytes long before being base64-encoded.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "AppliedColorSpaceConversion",
                      "type": "string",
                      "description": "If Elastic Transcoder used a preset with a ColorSpaceConversionMode to transcode the output file, the AppliedColorSpaceConversion parameter shows the conversion used. If no ColorSpaceConversionMode was defined in the preset, this parameter is not be included in the job response.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "OutputKeyPrefix",
              "type": "string",
              "description": "The value, if any, that you want Elastic Transcoder to prepend to the names of all files that this job creates, including output files, thumbnails, and playlists. We recommend that you add a / or some other delimiter to the end of the OutputKeyPrefix.",
              "nested_items": []
            },
            {
              "name": "Playlists",
              "type": "list",
              "description": "If you specify a preset in PresetId for which the value of Container is fmp4 (Fragmented MP4) or ts (MPEG-TS), Playlists contains information about the master playlists that you want Elastic Transcoder to create.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Name",
                      "type": "string",
                      "description": "The name that you want Elastic Transcoder to assign to the master playlist, for example, nyc-vacation.m3u8. If the name includes a / character, the section of the name before the last / must be identical for all Name objects. If you create more than one master playlist, the values of all Name objects must be unique.",
                      "nested_items": []
                    },
                    {
                      "name": "Format",
                      "type": "string",
                      "description": "The format of the output playlist. Valid formats include HLSv3, HLSv4, and Smooth.",
                      "nested_items": []
                    },
                    {
                      "name": "OutputKeys",
                      "type": "list",
                      "description": "For each output in this job that you want to include in a master playlist, the value of the Outputs:Key object.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "If your output is not HLS or does not have a segment duration set, the name of the output file is a concatenation of OutputKeyPrefix and Outputs:Key: OutputKeyPrefix Outputs:Key.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "If your output is HLSv3 and has a segment duration set, or is not included in a playlist, Elastic Transcoder creates an output playlist file with a file extension of .m3u8, and a series of .ts files that include a five-digit sequential counter beginning with 00000: OutputKeyPrefix Outputs:Key.m3u8 OutputKeyPrefix ``Outputs:Key``00000.ts.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "If your output is HLSv4, has a segment duration set, and is included in an HLSv4 playlist, Elastic Transcoder creates an output playlist file with a file extension of _v4.m3u8. If the output is video, Elastic Transcoder also creates an output file with an extension of _iframe.m3u8: OutputKeyPrefix Outputs:Key``_v4.m3u8 OutputKeyPrefix ``Outputs:Key``_iframe.m3u8 OutputKeyPrefix ``Outputs:Key.ts.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "HlsContentProtection",
                      "type": "dict",
                      "description": "The HLS content protection settings, if any, that you want Elastic Transcoder to apply to the output files associated with this playlist.",
                      "nested_items": [
                        {
                          "name": "Method",
                          "type": "string",
                          "description": "The content protection method for your output. The only valid value is: aes-128.",
                          "nested_items": []
                        },
                        {
                          "name": "Key",
                          "type": "string",
                          "description": "If you want Elastic Transcoder to generate a key for you, leave this field blank.",
                          "nested_items": []
                        },
                        {
                          "name": "KeyMd5",
                          "type": "string",
                          "description": "If Elastic Transcoder is generating your key for you, you must leave this field blank.",
                          "nested_items": []
                        },
                        {
                          "name": "InitializationVector",
                          "type": "string",
                          "description": "If Elastic Transcoder is generating your key for you, you must leave this field blank.",
                          "nested_items": []
                        },
                        {
                          "name": "LicenseAcquisitionUrl",
                          "type": "string",
                          "description": "The location of the license key required to decrypt your HLS playlist. The URL must be an absolute path, and is referenced in the URI attribute of the EXT-X-KEY metadata tag in the playlist file.",
                          "nested_items": []
                        },
                        {
                          "name": "KeyStoragePolicy",
                          "type": "string",
                          "description": "Specify whether you want Elastic Transcoder to write your HLS license key to an Amazon S3 bucket. If you choose WithVariantPlaylists, LicenseAcquisitionUrl must be left blank and Elastic Transcoder writes your data key into the same bucket as the associated playlist.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "PlayReadyDrm",
                      "type": "dict",
                      "description": "The DRM settings, if any, that you want Elastic Transcoder to apply to the output files associated with this playlist.",
                      "nested_items": [
                        {
                          "name": "Format",
                          "type": "string",
                          "description": "The type of DRM, if any, that you want Elastic Transcoder to apply to the output files associated with this playlist.",
                          "nested_items": []
                        },
                        {
                          "name": "Key",
                          "type": "string",
                          "description": "The DRM key for your file, provided by your DRM license provider. The key must be base64-encoded, and it must be one of the following bit lengths before being base64-encoded:",
                          "nested_items": []
                        },
                        {
                          "name": "KeyMd5",
                          "type": "string",
                          "description": "The MD5 digest of the key used for DRM on your file, and that you want Elastic Transcoder to use as a checksum to make sure your key was not corrupted in transit. The key MD5 must be base64-encoded, and it must be exactly 16 bytes before being base64-encoded.",
                          "nested_items": []
                        },
                        {
                          "name": "KeyId",
                          "type": "string",
                          "description": "The ID for your DRM key, so that your DRM license provider knows which key to provide.",
                          "nested_items": []
                        },
                        {
                          "name": "InitializationVector",
                          "type": "string",
                          "description": "The series of random bits created by a random bit generator, unique for every encryption operation, that you want Elastic Transcoder to use to encrypt your files. The initialization vector must be base64-encoded, and it must be exactly 8 bytes long before being base64-encoded. If no initialization vector is provided, Elastic Transcoder generates one for you.",
                          "nested_items": []
                        },
                        {
                          "name": "LicenseAcquisitionUrl",
                          "type": "string",
                          "description": "The location of the license key required to play DRM content. The URL must be an absolute path, and is referenced by the PlayReady header. The PlayReady header is referenced in the protection header of the client manifest for Smooth Streaming outputs, and in the EXT-X-DXDRM and EXT-XDXDRMINFO metadata tags for HLS playlist outputs. An example URL looks like this: https://www.example.com/exampleKey/",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "Status",
                      "type": "string",
                      "description": "The status of the job with which the playlist is associated.",
                      "nested_items": []
                    },
                    {
                      "name": "StatusDetail",
                      "type": "string",
                      "description": "Information that further explains the status.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The status of the job: Submitted, Progressing, Complete, Canceled, or Error.",
              "nested_items": []
            },
            {
              "name": "UserMetadata",
              "type": "dict",
              "description": "User-defined metadata that you want to associate with an Elastic Transcoder job. You specify metadata in key/value pairs, and you can add up to 10 key/value pairs per job. Elastic Transcoder does not guarantee that key/value pairs are returned in the same order in which you specify them.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "0-9",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "A-Z and a-z.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Space.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "The following symbols: _.:/=+-%@",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "SubmitTimeMillis",
                  "type": "integer",
                  "description": "The time the job was submitted to Elastic Transcoder, in epoch milliseconds.",
                  "nested_items": []
                },
                {
                  "name": "StartTimeMillis",
                  "type": "integer",
                  "description": "The time the job began transcoding, in epoch milliseconds.",
                  "nested_items": []
                },
                {
                  "name": "FinishTimeMillis",
                  "type": "integer",
                  "description": "The time the job finished transcoding, in epoch milliseconds.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}