{
  "method_name": "update_pipeline_notifications",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/elastictranscoder/client/update_pipeline_notifications.html",
  "description": "With the UpdatePipelineNotifications operation, you can update Amazon Simple Notification Service (Amazon SNS) notifications for a pipeline. When you update notifications for a pipeline, Elastic Transcoder returns the values that you specified in the request.",
  "parameters": [
    {
      "name": "Id",
      "type": "string",
      "required": true,
      "description": "The identifier of the pipeline for which you want to change notification settings.",
      "nested_params": []
    },
    {
      "name": "Notifications",
      "type": "dict",
      "required": true,
      "description": "The topic ARN for the Amazon Simple Notification Service (Amazon SNS) topic that you want to notify to report job status. Progressing: The topic ARN for the Amazon Simple Notification Service (Amazon SNS) topic that you want to notify when Elastic Transcoder has started to process jobs that are added to this pipeline. This is the ARN that Amazon SNS returned when you created the topic. Complete: The topic ARN for the Amazon SNS topic that you want to notify when Elastic Transcoder has finished processing a job. Warning: The topic ARN for the Amazon SNS topic that you want to notify when Elastic Transcoder encounters a warning condition. Error: The topic ARN for the Amazon SNS topic that you want to notify when Elastic Transcoder encounters an error condition. Progressing (string) --- The Amazon Simple Notification Service (Amazon SNS) topic that you want to notify when Elastic Transcoder has started to process the job. Completed (string) --- The Amazon SNS topic that you want to notify when Elastic Transcoder has finished processing the job. Warning (string) --- The Amazon SNS topic that you want to notify when Elastic Transcoder encounters a warning condition. Error (string) --- The Amazon SNS topic that you want to notify when Elastic Transcoder encounters an error condition.",
      "nested_params": [
        {
          "name": "Progressing",
          "type": "Amazon SNS",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "Complete",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "Warning",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "Error",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "Id",
              "type": "string",
              "description": "The identifier for the pipeline. You use this value to identify the pipeline in which you want to perform a variety of operations, such as creating a job or a preset.",
              "nested_items": []
            },
            {
              "name": "Arn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) for the pipeline.",
              "nested_items": []
            },
            {
              "name": "Name",
              "type": "string",
              "description": "The name of the pipeline. We recommend that the name be unique within the AWS account, but uniqueness is not enforced.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The current status of the pipeline:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "Active: The pipeline is processing jobs.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Paused: The pipeline is not currently processing jobs.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "InputBucket",
              "type": "string",
              "description": "The Amazon S3 bucket from which Elastic Transcoder gets media files for transcoding and the graphics files, if any, that you want to use for watermarks.",
              "nested_items": []
            },
            {
              "name": "OutputBucket",
              "type": "string",
              "description": "The Amazon S3 bucket in which you want Elastic Transcoder to save transcoded files, thumbnails, and playlists. Either you specify this value, or you specify both ContentConfig and ThumbnailConfig.",
              "nested_items": []
            },
            {
              "name": "Role",
              "type": "string",
              "description": "The IAM Amazon Resource Name (ARN) for the role that Elastic Transcoder uses to transcode jobs for this pipeline.",
              "nested_items": []
            },
            {
              "name": "AwsKmsKeyArn",
              "type": "string",
              "description": "The AWS Key Management Service (AWS KMS) key that you want to use with this pipeline.",
              "nested_items": []
            },
            {
              "name": "Notifications",
              "type": "dict",
              "description": "The Amazon Simple Notification Service (Amazon SNS) topic that you want to notify to report job status.",
              "nested_items": [
                {
                  "name": "Progressing",
                  "type": "optional",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "Complete",
                  "type": "optional",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "Warning",
                  "type": "optional",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "Error",
                  "type": "optional",
                  "description": "",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "ContentConfig",
              "type": "dict",
              "description": "Information about the Amazon S3 bucket in which you want Elastic Transcoder to save transcoded files and playlists. Either you specify both ContentConfig and ThumbnailConfig, or you specify OutputBucket.",
              "nested_items": [
                {
                  "name": "Bucket",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "Permissions",
                  "type": "",
                  "description": "GranteeType: The type of value that appears in the Grantee object:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "GranteeType: The type of value that appears in the Grantee object:",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "Canonical: Either the canonical user ID for an AWS account or an origin access identity for an Amazon CloudFront distribution.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "Email: The registered email address of an AWS account.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "Group: One of the following predefined Amazon S3 groups: AllUsers, AuthenticatedUsers, or LogDelivery.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Grantee: The AWS user or group that you want to have access to transcoded files and playlists.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Access: The permission that you want to give to the AWS user that is listed in Grantee. Valid values include:",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "READ: The grantee can read the objects and metadata for objects that Elastic Transcoder adds to the Amazon S3 bucket.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "READ_ACP: The grantee can read the object ACL for objects that Elastic Transcoder adds to the Amazon S3 bucket.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "WRITE_ACP: The grantee can write the ACL for the objects that Elastic Transcoder adds to the Amazon S3 bucket.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "FULL_CONTROL: The grantee has READ, READ_ACP, and WRITE_ACP permissions for the objects that Elastic Transcoder adds to the Amazon S3 bucket.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "StorageClass",
                  "type": "",
                  "description": "",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "ThumbnailConfig",
              "type": "dict",
              "description": "Information about the Amazon S3 bucket in which you want Elastic Transcoder to save thumbnail files. Either you specify both ContentConfig and ThumbnailConfig, or you specify OutputBucket.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "Bucket: The Amazon S3 bucket in which you want Elastic Transcoder to save thumbnail files.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Permissions: A list of the users and/or predefined Amazon S3 groups you want to have access to thumbnail files, and the type of access that you want them to have.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "GranteeType: The type of value that appears in the Grantee object:",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "Canonical: Either the canonical user ID for an AWS account or an origin access identity for an Amazon CloudFront distribution.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Grantee: The AWS user or group that you want to have access to thumbnail files.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Access: The permission that you want to give to the AWS user that is listed in Grantee. Valid values include:",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "READ: The grantee can read the thumbnails and metadata for thumbnails that Elastic Transcoder adds to the Amazon S3 bucket.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "READ_ACP: The grantee can read the object ACL for thumbnails that Elastic Transcoder adds to the Amazon S3 bucket.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "WRITE_ACP: The grantee can write the ACL for the thumbnails that Elastic Transcoder adds to the Amazon S3 bucket.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "FULL_CONTROL: The grantee has READ, READ_ACP, and WRITE_ACP permissions for the thumbnails that Elastic Transcoder adds to the Amazon S3 bucket.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "",
                  "type": "",
                  "description": "StorageClass: The Amazon S3 storage class, Standard or ReducedRedundancy, that you want Elastic Transcoder to assign to the thumbnails that it stores in your Amazon S3 bucket.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}