{
  "method_name": "describe_portfolio_shares",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/servicecatalog/client/describe_portfolio_shares.html",
  "description": "Returns a summary of each of the portfolio shares that were created for the specified portfolio. You can use this API to determine which accounts or organizational nodes this portfolio have been shared, whether the recipient entity has imported the share, and whether TagOptions are included with the share. The PortfolioId and Type parameters are both required.",
  "parameters": [
    {
      "name": "PortfolioId",
      "type": "string",
      "required": true,
      "description": "The unique identifier of the portfolio for which shares will be retrieved.",
      "nested_params": []
    },
    {
      "name": "Type",
      "type": "string",
      "required": true,
      "description": "The type of portfolio share to summarize. This field acts as a filter on the type of portfolio share, which can be one of the following: ACCOUNT - Represents an external account to account share. ORGANIZATION - Represents a share to an organization. This share is available to every account in the organization. ORGANIZATIONAL_UNIT - Represents a share to an organizational unit. ORGANIZATION_MEMBER_ACCOUNT - Represents a share to an account in the organization.",
      "nested_params": []
    },
    {
      "name": "PageToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "PageSize",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "NextPageToken",
          "type": "string",
          "description": "The page token to use to retrieve the next set of results. If there are no additional results, this value is null.",
          "nested_items": []
        },
        {
          "name": "PortfolioShareDetails",
          "type": "list",
          "description": "Summaries about each of the portfolio shares.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "PrincipalId",
                  "type": "string",
                  "description": "The identifier of the recipient entity that received the portfolio share. The recipient entity can be one of the following:",
                  "nested_items": []
                },
                {
                  "name": "Type",
                  "type": "string",
                  "description": "The type of the portfolio share.",
                  "nested_items": []
                },
                {
                  "name": "Accepted",
                  "type": "boolean",
                  "description": "Indicates whether the shared portfolio is imported by the recipient account. If the recipient is in an organization node, the share is automatically imported, and the field is always set to true.",
                  "nested_items": []
                },
                {
                  "name": "ShareTagOptions",
                  "type": "boolean",
                  "description": "Indicates whether TagOptions sharing is enabled or disabled for the portfolio share.",
                  "nested_items": []
                },
                {
                  "name": "SharePrincipals",
                  "type": "boolean",
                  "description": "Indicates if Principal sharing is enabled or disabled for the portfolio share.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}