{
  "method_name": "update_provisioned_product",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/servicecatalog/client/update_provisioned_product.html",
  "description": "Requests updates to the configuration of the specified provisioned product. If there are tags associated with the object, they cannot be updated or added. Depending on the specific updates requested, this operation can update with no interruption, with some interruption, or replace the provisioned product entirely. You can check the status of this request using  DescribeRecord.",
  "parameters": [
    {
      "name": "AcceptLanguage",
      "type": "string",
      "required": false,
      "description": "The language code. jp - Japanese zh - Chinese.",
      "nested_params": []
    },
    {
      "name": "ProvisionedProductName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ProvisionedProductId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ProductId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ProductName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ProvisioningArtifactId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ProvisioningArtifactName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "PathId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "PathName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ProvisioningParameters",
      "type": "list",
      "required": false,
      "description": "The new parameters. (dict) --- The parameter key-value pair used to update a provisioned product. Key (string) --- The parameter key. Value (string) --- The parameter value. UsePreviousValue (boolean) --- If set to true, Value is ignored and the previous parameter value is kept.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The parameter key.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The parameter value.",
          "nested_params": []
        },
        {
          "name": "UsePreviousValue",
          "type": "boolean",
          "required": false,
          "description": "If set to true, Value is ignored and the previous parameter value is kept.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ProvisioningPreferences",
      "type": "dict",
      "required": false,
      "description": "An object that contains information about the provisioning preferences for a stack set. StackSetAccounts (list) --- One or more Amazon Web Services accounts that will have access to the provisioned product. Applicable only to a CFN_STACKSET provisioned product type. The Amazon Web Services accounts specified should be within the list of accounts in the STACKSET constraint. To get the list of accounts in the STACKSET constraint, use the DescribeProvisioningParameters operation. If no values are specified, the default value is all accounts from the STACKSET constraint. (string) --- StackSetRegions (list) --- One or more Amazon Web Services Regions where the provisioned product will be available. The specified Regions should be within the list of Regions from the STACKSET constraint. To get the list of Regions in the STACKSET constraint, use the DescribeProvisioningParameters operation. If no values are specified, the default value is all Regions from the STACKSET constraint. (string) --- StackSetFailureToleranceCount (integer) --- The number of accounts, per Region, for which this operation can fail before Service Catalog stops the operation in that Region. If the operation is stopped in a Region, Service Catalog doesn't attempt the operation in any subsequent Regions. Conditional: You must specify either StackSetFailureToleranceCount or StackSetFailureTolerancePercentage, but not both. The default value is 0 if no value is specified. StackSetFailureTolerancePercentage (integer) --- The percentage of accounts, per Region, for which this stack operation can fail before Service Catalog stops the operation in that Region. When calculating the number of accounts based on the specified percentage, Service Catalog rounds down to the next whole number. StackSetMaxConcurrencyCount (integer) --- The maximum number of accounts in which to perform this operation at one time. This is dependent on the value of StackSetFailureToleranceCount. StackSetMaxConcurrentCount is at most one more than the StackSetFailureToleranceCount. Note that this setting lets you specify the maximum for operations. For large deployments, under certain circumstances the actual number of accounts acted upon concurrently may be lower due to service throttling. Conditional: You must specify either StackSetMaxConcurrentCount or StackSetMaxConcurrentPercentage, but not both. StackSetMaxConcurrencyPercentage (integer) --- The maximum percentage of accounts in which to perform this operation at one time. This is true except in cases where rounding down would result is zero. In this case, Service Catalog sets the number as 1 instead. StackSetOperationType (string) --- Determines what action Service Catalog performs to a stack set or a stack instance represented by the provisioned product. The default value is UPDATE if nothing is specified. CREATE Creates a new stack instance in the stack set represented by the provisioned product. In this case, only new stack instances are created based on accounts and Regions; if new ProductId or ProvisioningArtifactID are passed, they will be ignored. UPDATE Updates the stack set represented by the provisioned product and also its stack instances. DELETE Deletes a stack instance in the stack set represented by the provisioned product.",
      "nested_params": [
        {
          "name": "StackSetAccounts",
          "type": "list",
          "required": false,
          "description": "One or more Amazon Web Services accounts that will have access to the provisioned product. Applicable only to a CFN_STACKSET provisioned product type. The Amazon Web Services accounts specified should be within the list of accounts in the STACKSET constraint. To get the list of accounts in the STACKSET constraint, use the DescribeProvisioningParameters operation. If no values are specified, the default value is all accounts from the STACKSET constraint.",
          "nested_params": []
        },
        {
          "name": "StackSetRegions",
          "type": "list",
          "required": false,
          "description": "One or more Amazon Web Services Regions where the provisioned product will be available. Applicable only to a CFN_STACKSET provisioned product type. The specified Regions should be within the list of Regions from the STACKSET constraint. To get the list of Regions in the STACKSET constraint, use the DescribeProvisioningParameters operation. If no values are specified, the default value is all Regions from the STACKSET constraint.",
          "nested_params": []
        },
        {
          "name": "StackSetFailureToleranceCount",
          "type": "integer",
          "required": false,
          "description": "The number of accounts, per Region, for which this operation can fail before Service Catalog stops the operation in that Region. If the operation is stopped in a Region, Service Catalog doesn't attempt the operation in any subsequent Regions. Applicable only to a CFN_STACKSET provisioned product type. Conditional: You must specify either StackSetFailureToleranceCount or StackSetFailureTolerancePercentage, but not both. The default value is 0 if no value is specified.",
          "nested_params": []
        },
        {
          "name": "StackSetFailureTolerancePercentage",
          "type": "integer",
          "required": false,
          "description": "The percentage of accounts, per Region, for which this stack operation can fail before Service Catalog stops the operation in that Region. If the operation is stopped in a Region, Service Catalog doesn't attempt the operation in any subsequent Regions. When calculating the number of accounts based on the specified percentage, Service Catalog rounds down to the next whole number. Applicable only to a CFN_STACKSET provisioned product type. Conditional: You must specify either StackSetFailureToleranceCount or StackSetFailureTolerancePercentage, but not both.",
          "nested_params": []
        },
        {
          "name": "StackSetMaxConcurrencyCount",
          "type": "integer",
          "required": false,
          "description": "The maximum number of accounts in which to perform this operation at one time. This is dependent on the value of StackSetFailureToleranceCount. StackSetMaxConcurrentCount is at most one more than the StackSetFailureToleranceCount. Note that this setting lets you specify the maximum for operations. For large deployments, under certain circumstances the actual number of accounts acted upon concurrently may be lower due to service throttling. Applicable only to a CFN_STACKSET provisioned product type. Conditional: You must specify either StackSetMaxConcurrentCount or StackSetMaxConcurrentPercentage, but not both.",
          "nested_params": []
        },
        {
          "name": "StackSetMaxConcurrencyPercentage",
          "type": "integer",
          "required": false,
          "description": "The maximum percentage of accounts in which to perform this operation at one time. When calculating the number of accounts based on the specified percentage, Service Catalog rounds down to the next whole number. This is true except in cases where rounding down would result is zero. In this case, Service Catalog sets the number as 1 instead. Note that this setting lets you specify the maximum for operations. For large deployments, under certain circumstances the actual number of accounts acted upon concurrently may be lower due to service throttling. Applicable only to a CFN_STACKSET provisioned product type. Conditional: You must specify either StackSetMaxConcurrentCount or StackSetMaxConcurrentPercentage, but not both.",
          "nested_params": []
        },
        {
          "name": "StackSetOperationType",
          "type": "string",
          "required": false,
          "description": "Determines what action Service Catalog performs to a stack set or a stack instance represented by the provisioned product. The default value is UPDATE if nothing is specified. Applicable only to a CFN_STACKSET provisioned product type. Creates a new stack instance in the stack set represented by the provisioned product. In this case, only new stack instances are created based on accounts and Regions; if new ProductId or ProvisioningArtifactID are passed, they will be ignored. Updates the stack set represented by the provisioned product and also its stack instances. Deletes a stack instance in the stack set represented by the provisioned product.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "One or more tags. Requires the product to have RESOURCE_UPDATE constraint with TagUpdatesOnProvisionedProduct set to ALLOWED to allow tag updates. (dict) --- Information about a tag. A tag is a key-value pair. Tags are propagated to the resources created when provisioning a product. The tag key. The value for this key.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The tag key.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value for this key.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "UpdateToken",
      "type": "string",
      "required": true,
      "description": "The idempotency token that uniquely identifies the provisioning update request. This field is autopopulated if not provided.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "RecordDetail",
          "type": "dict",
          "description": "Information about the result of the request.",
          "nested_items": [
            {
              "name": "RecordId",
              "type": "string",
              "description": "The identifier of the record.",
              "nested_items": []
            },
            {
              "name": "ProvisionedProductName",
              "type": "string",
              "description": "The user-friendly name of the provisioned product.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The status of the provisioned product.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "CREATED - The request was created but the operation has not started.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "IN_PROGRESS - The requested operation is in progress.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "IN_PROGRESS_IN_ERROR - The provisioned product is under change but the requested operation failed and some remediation is occurring. For example, a rollback.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "SUCCEEDED - The requested operation has successfully completed.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "FAILED - The requested operation has unsuccessfully completed. Investigate using the error messages returned.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "CreatedTime",
              "type": "datetime",
              "description": "The UTC time stamp of the creation time.",
              "nested_items": []
            },
            {
              "name": "UpdatedTime",
              "type": "datetime",
              "description": "The time when the record was last updated.",
              "nested_items": []
            },
            {
              "name": "ProvisionedProductType",
              "type": "string",
              "description": "The type of provisioned product. The supported values are CFN_STACK, CFN_STACKSET, TERRAFORM_OPEN_SOURCE, TERRAFORM_CLOUD, and EXTERNAL.",
              "nested_items": []
            },
            {
              "name": "RecordType",
              "type": "string",
              "description": "The record type.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "PROVISION_PRODUCT.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "UPDATE_PROVISIONED_PRODUCT.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "TERMINATE_PROVISIONED_PRODUCT.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "ProvisionedProductId",
              "type": "string",
              "description": "The identifier of the provisioned product.",
              "nested_items": []
            },
            {
              "name": "ProductId",
              "type": "string",
              "description": "The product identifier.",
              "nested_items": []
            },
            {
              "name": "ProvisioningArtifactId",
              "type": "string",
              "description": "The identifier of the provisioning artifact.",
              "nested_items": []
            },
            {
              "name": "PathId",
              "type": "string",
              "description": "The path identifier.",
              "nested_items": []
            },
            {
              "name": "RecordErrors",
              "type": "list",
              "description": "The errors that occurred.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Code",
                      "type": "string",
                      "description": "The numeric value of the error.",
                      "nested_items": []
                    },
                    {
                      "name": "Description",
                      "type": "string",
                      "description": "The description of the error.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "RecordTags",
              "type": "list",
              "description": "One or more tags.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Key",
                      "type": "string",
                      "description": "The key for this tag.",
                      "nested_items": []
                    },
                    {
                      "name": "Value",
                      "type": "string",
                      "description": "The value for this tag.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "LaunchRoleArn",
              "type": "string",
              "description": "The ARN of the launch role associated with the provisioned product.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}