{
  "method_name": "create_repository_creation_template",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ecr/client/create_repository_creation_template.html",
  "description": "Creates a repository creation template. This template is used to define the settings for repositories created by Amazon ECR on your behalf. For example, repositories created through pull through cache actions. For more information, see Private repository creation templates in the Amazon Elastic Container Registry User Guide.",
  "parameters": [
    {
      "name": "prefix",
      "type": "string",
      "required": true,
      "description": "The repository namespace prefix to associate with the template. All repositories created using this namespace prefix will have the settings defined in this template applied. For example, a prefix of prod would apply to all repositories beginning with prod/. Similarly, a prefix of prod/team would apply to all repositories beginning with prod/team/. To apply a template to all repositories in your registry that don't have an associated creation template, you can use ROOT as the prefix.",
      "nested_params": []
    },
    {
      "name": "description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "encryptionConfiguration",
      "type": "dict",
      "required": true,
      "description": "The encryption configuration to use for repositories created using the template. The encryption type to use. If you use the KMS encryption type, the contents of the repository will be encrypted using server-side encryption with Key Management Service key stored in KMS. When you use KMS to encrypt your data, you can either use the default Amazon Web Services managed KMS key for Amazon ECR, or specify your own KMS key, which you already created. For more information, see Protecting data using server-side encryption with an KMS key stored in Key Management Service (SSE-KMS) in the Amazon Simple Storage Service Console Developer Guide. If you use the AES256 encryption type, Amazon ECR uses server-side encryption with Amazon S3-managed encryption keys which encrypts the images in the repository using an AES256 encryption algorithm. For more information, see Protecting data using server-side encryption with Amazon S3-managed encryption keys (SSE-S3) in the Amazon Simple Storage Service Console Developer Guide. kmsKey (string) --- If you use the KMS encryption type, specify the KMS key to use for encryption. The full ARN of the KMS key must be specified. The key must exist in the same Region as the repository. If no key is specified, the default Amazon Web Services managed KMS key for Amazon ECR will be used.",
      "nested_params": [
        {
          "name": "encryptionType",
          "type": "string",
          "required": false,
          "description": "The encryption type to use. If you use the KMS encryption type, the contents of the repository will be encrypted using server-side encryption with Key Management Service key stored in KMS. When you use KMS to encrypt your data, you can either use the default Amazon Web Services managed KMS key for Amazon ECR, or specify your own KMS key, which you already created. For more information, see Protecting data using server-side encryption with an KMS key stored in Key Management Service (SSE-KMS) in the Amazon Simple Storage Service Console Developer Guide. If you use the AES256 encryption type, Amazon ECR uses server-side encryption with Amazon S3-managed encryption keys which encrypts the images in the repository using an AES256 encryption algorithm. For more information, see Protecting data using server-side encryption with Amazon S3-managed encryption keys (SSE-S3) in the Amazon Simple Storage Service Console Developer Guide.",
          "nested_params": []
        },
        {
          "name": "kmsKey",
          "type": "string",
          "required": false,
          "description": "If you use the KMS encryption type, specify the KMS key to use for encryption. The full ARN of the KMS key must be specified. The key must exist in the same Region as the repository. If no key is specified, the default Amazon Web Services managed KMS key for Amazon ECR will be used.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "resourceTags",
      "type": "list",
      "required": true,
      "description": "The metadata to apply to the repository to help you categorize and organize. Each tag consists of a key and an optional value, both of which you define. Tag keys can have a maximum character length of 128 characters, and tag values can have a maximum length of 256 characters. (dict) --- The metadata to apply to a resource to help you categorize and organize them. Each tag consists of a key and a value, both of which you define. One part of a key-value pair that make up a tag. A key is a general label that acts like a category for more specific tag values. A value acts as a descriptor within a tag category (key).",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "One part of a key-value pair that make up a tag. A key is a general label that acts like a category for more specific tag values.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "A value acts as a descriptor within a tag category (key).",
          "nested_params": []
        }
      ]
    },
    {
      "name": "imageTagMutability",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "repositoryPolicy",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "lifecyclePolicy",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "appliedFor",
      "type": "list",
      "required": true,
      "description": "A list of enumerable strings representing the Amazon ECR repository creation scenarios that this template will apply towards. The two supported scenarios are PULL_THROUGH_CACHE and REPLICATION (string) ---",
      "nested_params": []
    },
    {
      "name": "customRoleArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "registryId",
          "type": "string",
          "description": "The registry ID associated with the request.",
          "nested_items": []
        },
        {
          "name": "repositoryCreationTemplate",
          "type": "dict",
          "description": "The details of the repository creation template associated with the request.",
          "nested_items": [
            {
              "name": "prefix",
              "type": "string",
              "description": "The repository namespace prefix associated with the repository creation template.",
              "nested_items": []
            },
            {
              "name": "description",
              "type": "string",
              "description": "The description associated with the repository creation template.",
              "nested_items": []
            },
            {
              "name": "encryptionConfiguration",
              "type": "dict",
              "description": "The encryption configuration associated with the repository creation template.",
              "nested_items": [
                {
                  "name": "encryptionType",
                  "type": "string",
                  "description": "The encryption type to use.",
                  "nested_items": []
                },
                {
                  "name": "kmsKey",
                  "type": "string",
                  "description": "If you use the KMS encryption type, specify the KMS key to use for encryption. The full ARN of the KMS key must be specified. The key must exist in the same Region as the repository. If no key is specified, the default Amazon Web Services managed KMS key for Amazon ECR will be used.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "resourceTags",
              "type": "list",
              "description": "The metadata to apply to the repository to help you categorize and organize. Each tag consists of a key and an optional value, both of which you define. Tag keys can have a maximum character length of 128 characters, and tag values can have a maximum length of 256 characters.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Key",
                      "type": "string",
                      "description": "One part of a key-value pair that make up a tag. A key is a general label that acts like a category for more specific tag values.",
                      "nested_items": []
                    },
                    {
                      "name": "Value",
                      "type": "string",
                      "description": "A value acts as a descriptor within a tag category (key).",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "imageTagMutability",
              "type": "string",
              "description": "The tag mutability setting for the repository. If this parameter is omitted, the default setting of MUTABLE will be used which will allow image tags to be overwritten. If IMMUTABLE is specified, all image tags within the repository will be immutable which will prevent them from being overwritten.",
              "nested_items": []
            },
            {
              "name": "repositoryPolicy",
              "type": "string",
              "description": "The repository policy to apply to repositories created using the template. A repository policy is a permissions policy associated with a repository to control access permissions.",
              "nested_items": []
            },
            {
              "name": "lifecyclePolicy",
              "type": "string",
              "description": "The lifecycle policy to use for repositories created using the template.",
              "nested_items": []
            },
            {
              "name": "appliedFor",
              "type": "list",
              "description": "A list of enumerable Strings representing the repository creation scenarios that this template will apply towards. The two supported scenarios are PULL_THROUGH_CACHE and REPLICATION.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "customRoleArn",
              "type": "string",
              "description": "The ARN of the role to be assumed by Amazon ECR. Amazon ECR will assume your supplied role when the customRoleArn is specified. When this field isn't specified, Amazon ECR will use the service-linked role for the repository creation template.",
              "nested_items": []
            },
            {
              "name": "createdAt",
              "type": "datetime",
              "description": "The date and time, in JavaScript date format, when the repository creation template was created.",
              "nested_items": []
            },
            {
              "name": "updatedAt",
              "type": "datetime",
              "description": "The date and time, in JavaScript date format, when the repository creation template was last updated.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}