{
  "method_name": "put_replication_configuration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ecr/client/put_replication_configuration.html",
  "description": "Creates or updates the replication configuration for a registry. The existing replication configuration for a repository can be retrieved with the  DescribeRegistry API action. The first time the PutReplicationConfiguration API is called, a service-linked IAM role is created in your account for the replication process. For more information, see Using service-linked roles for Amazon ECR in the Amazon Elastic Container Registry User Guide. For more information on the custom role for replication, see Creating an IAM role for replication.",
  "parameters": [
    {
      "name": "replicationConfiguration",
      "type": "dict",
      "required": true,
      "description": "An object representing the replication configuration for a registry. rules (list) --- An array of objects representing the replication destinations and repository filters for a replication configuration. (dict) --- An array of objects representing the replication destinations and repository filters for a replication configuration. destinations (list) --- An array of objects representing the destination for a replication rule. (dict) --- An array of objects representing the destination for a replication rule. region (string) --- The Region to replicate to. registryId (string) --- The Amazon Web Services account ID of the Amazon ECR private registry to replicate to. When configuring cross-Region replication within your own registry, specify your own account ID. repositoryFilters (list) --- An array of objects representing the filters for a replication rule. Specifying a repository filter for a replication rule provides a method for controlling which repositories in a private registry are replicated. (dict) --- The filter settings used with image replication. Specifying a repository filter to a replication rule provides a method for controlling which repositories in a private registry are replicated. If no filters are added, the contents of all repositories are replicated. filter (string) --- The repository filter details. When the PREFIX_MATCH filter type is specified, this value is required and should be the repository name prefix to configure replication for. filterType (string) --- The repository filter type. The only supported value is PREFIX_MATCH, which is a repository name prefix specified with the filter parameter.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "replicationConfiguration",
          "type": "dict",
          "description": "The contents of the replication configuration for the registry.",
          "nested_items": [
            {
              "name": "rules",
              "type": "list",
              "description": "An array of objects representing the replication destinations and repository filters for a replication configuration.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "destinations",
                      "type": "list",
                      "description": "An array of objects representing the destination for a replication rule.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "region",
                              "type": "string",
                              "description": "The Region to replicate to.",
                              "nested_items": []
                            },
                            {
                              "name": "registryId",
                              "type": "string",
                              "description": "The Amazon Web Services account ID of the Amazon ECR private registry to replicate to. When configuring cross-Region replication within your own registry, specify your own account ID.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "repositoryFilters",
                      "type": "list",
                      "description": "An array of objects representing the filters for a replication rule. Specifying a repository filter for a replication rule provides a method for controlling which repositories in a private registry are replicated.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "filter",
                              "type": "string",
                              "description": "The repository filter details. When the PREFIX_MATCH filter type is specified, this value is required and should be the repository name prefix to configure replication for.",
                              "nested_items": []
                            },
                            {
                              "name": "filterType",
                              "type": "string",
                              "description": "The repository filter type. The only supported value is PREFIX_MATCH, which is a repository name prefix specified with the filter parameter.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}