{
  "method_name": "put_attributes",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sdb/client/put_attributes.html",
  "description": "The PutAttributes operation creates or replaces attributes in an item. The client may specify new attributes using a combination of the Attribute.X.Name and Attribute.X.Value parameters. The client specifies the first attribute by the parameters Attribute.0.Name and Attribute.0.Value, the second attribute by the parameters Attribute.1.Name and Attribute.1.Value, and so on. Attributes are uniquely identified in an item by their name/value combination. For example, a single item can have the attributes { \"first_name\", \"first_value\" } and { \"first_name\", second_value\" }. However, it cannot have two attribute instances where both the Attribute.X.Name and Attribute.X.Value are the same. Optionally, the requestor can supply the Replace parameter for each individual attribute. Setting this value to true causes the new attribute value to replace the existing attribute value(s). For example, if an item has the attributes { 'a', '1' }, { 'b', '2'} and { 'b', '3' } and the requestor calls PutAttributes using the attributes { 'b', '4' } with the Replace parameter set to true, the final attributes of the item are changed to { 'a', '1' } and { 'b', '4' }, which replaces the previous values of the --\u0098b' attribute with the new value. You cannot specify an empty string as an attribute name. Because Amazon SimpleDB makes multiple copies of client data and uses an eventual consistency update model, an immediate  GetAttributes or  Select operation (read) immediately after a  PutAttributes or  DeleteAttributes operation (write) might not return the updated data. The following limitations are enforced for this operation:",
  "parameters": [
    {
      "name": "DomainName",
      "type": "string",
      "required": true,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ItemName",
      "type": "string",
      "required": true,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Attributes",
      "type": "list",
      "required": true,
      "description": "(dict) --- Replace (boolean) --- A flag specifying whether or not to replace the attribute/value pair or to add a new attribute/value pair. The default setting is false.",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "Replace",
          "type": "boolean",
          "required": false,
          "description": "",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Expected",
      "type": "dict",
      "required": false,
      "description": "The update condition which, if specified, determines whether the specified attributes will be updated or not. The update condition must be satisfied in order for this request to be processed and the attributes to be updated. Name (string) --- The name of the attribute involved in the condition. Value (string) --- The value of an attribute. This value can only be specified when the Exists parameter is equal to true. Exists (boolean) --- A value specifying whether or not the specified attribute must exist with the specified value in order for the update condition to be satisfied. Specify true if the attribute must exist for the update condition to be satisfied. Specify false if the attribute should not exist in order for the update condition to be satisfied.",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name of the attribute involved in the condition.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value of an attribute. This value can only be specified when the Exists parameter is equal to true.",
          "nested_params": []
        },
        {
          "name": "Exists",
          "type": "boolean",
          "required": false,
          "description": "A value specifying whether or not the specified attribute must exist with the specified value in order for the update condition to be satisfied. Specify true if the attribute must exist for the update condition to be satisfied. Specify false if the attribute should not exist in order for the update condition to be satisfied.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}