{
  "method_name": "poll_for_task",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/datapipeline/client/poll_for_task.html",
  "description": "Task runners call PollForTask to receive a task to perform from AWS Data Pipeline. The task runner specifies which tasks it can perform by setting a value for the workerGroup parameter. The task returned can come from any of the pipelines that match the workerGroup value passed in by the task runner and that was launched using the IAM user credentials specified by the task runner. If tasks are ready in the work queue, PollForTask returns a response immediately. If no tasks are available in the queue, PollForTask uses long-polling and holds on to a poll connection for up to a 90 seconds, during which time the first newly scheduled task is handed to the task runner. To accomodate this, set the socket timeout in your task runner to 90 seconds. The task runner should not call PollForTask again on the same workerGroup until it receives a response, and this can take up to 90 seconds.",
  "parameters": [
    {
      "name": "workerGroup",
      "type": "string",
      "required": true,
      "description": "The type of task the task runner is configured to accept and process. The worker group is set as a field on objects in the pipeline when they are created. You can only specify a single value for workerGroup in the call to PollForTask. There are no wildcard values permitted in workerGroup; the string must be an exact, case-sensitive, match.",
      "nested_params": []
    },
    {
      "name": "hostname",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "instanceIdentity",
      "type": "dict",
      "required": false,
      "description": "Identity information for the EC2 instance that is hosting the task runner. You can get this value from the instance using http://169.254.169.254/latest/meta-data/instance-id. For more information, see Instance Metadata in the Amazon Elastic Compute Cloud User Guide. Passing in this value proves that your task runner is running on an EC2 instance, and ensures the proper AWS Data Pipeline service charges are applied to your pipeline. document (string) --- A description of an EC2 instance that is generated when the instance is launched and exposed to the instance via the instance metadata service in the form of a JSON representation of an object. signature (string) --- A signature which can be used to verify the accuracy and authenticity of the information provided in the instance identity document.",
      "nested_params": [
        {
          "name": "document",
          "type": "string",
          "required": false,
          "description": "A description of an EC2 instance that is generated when the instance is launched and exposed to the instance via the instance metadata service in the form of a JSON representation of an object.",
          "nested_params": []
        },
        {
          "name": "signature",
          "type": "string",
          "required": false,
          "description": "A signature which can be used to verify the accuracy and authenticity of the information provided in the instance identity document.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "taskObject",
          "type": "dict",
          "description": "The information needed to complete the task that is being assigned to the task runner. One of the fields returned in this object is taskId, which contains an identifier for the task being assigned. The calling task runner uses taskId in subsequent calls to  ReportTaskProgress and  SetTaskStatus.",
          "nested_items": [
            {
              "name": "taskId",
              "type": "string",
              "description": "An internal identifier for the task. This ID is passed to the  SetTaskStatus and  ReportTaskProgress actions.",
              "nested_items": []
            },
            {
              "name": "pipelineId",
              "type": "string",
              "description": "The ID of the pipeline that provided the task.",
              "nested_items": []
            },
            {
              "name": "attemptId",
              "type": "string",
              "description": "The ID of the pipeline task attempt object. AWS Data Pipeline uses this value to track how many times a task is attempted.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "id",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "id",
                          "type": "string",
                          "description": "The ID of the object.",
                          "nested_items": []
                        },
                        {
                          "name": "name",
                          "type": "string",
                          "description": "The name of the object.",
                          "nested_items": []
                        },
                        {
                          "name": "fields",
                          "type": "list",
                          "description": "Key-value pairs that define the properties of the object.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "dict",
                              "description": "",
                              "nested_items": [
                                {
                                  "name": "key",
                                  "type": "string",
                                  "description": "The field identifier.",
                                  "nested_items": []
                                },
                                {
                                  "name": "stringValue",
                                  "type": "string",
                                  "description": "The field value, expressed as a String.",
                                  "nested_items": []
                                },
                                {
                                  "name": "refValue",
                                  "type": "string",
                                  "description": "The field value, expressed as the identifier of another object.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}