{
  "method_name": "report_task_progress",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/datapipeline/client/report_task_progress.html",
  "description": "Task runners call ReportTaskProgress when assigned a task to acknowledge that it has the task. If the web service does not receive this acknowledgement within 2 minutes, it assigns the task in a subsequent  PollForTask call. After this initial acknowledgement, the task runner only needs to report progress every 15 minutes to maintain its ownership of the task. You can change this reporting time from 15 minutes by specifying a reportProgressTimeout field in your pipeline. If a task runner does not report its status after 5 minutes, AWS Data Pipeline assumes that the task runner is unable to process the task and reassigns the task in a subsequent response to  PollForTask. Task runners should call ReportTaskProgress every 60 seconds.",
  "parameters": [
    {
      "name": "taskId",
      "type": "string",
      "required": true,
      "description": "The ID of the task assigned to the task runner. This value is provided in the response for  PollForTask.",
      "nested_params": []
    },
    {
      "name": "fields",
      "type": "list",
      "required": true,
      "description": "Key-value pairs that define the properties of the ReportTaskProgressInput object. (dict) --- A key-value pair that describes a property of a pipeline object. The value is specified as either a string value ( StringValue) or a reference to another object ( RefValue) but not as both. The field identifier. stringValue (string) --- The field value, expressed as a String. refValue (string) --- The field value, expressed as the identifier of another object.",
      "nested_params": [
        {
          "name": "key",
          "type": "string",
          "required": false,
          "description": "The field identifier.",
          "nested_params": []
        },
        {
          "name": "stringValue",
          "type": "string",
          "required": false,
          "description": "The field value, expressed as a String.",
          "nested_params": []
        },
        {
          "name": "refValue",
          "type": "string",
          "required": false,
          "description": "The field value, expressed as the identifier of another object.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "canceled",
          "type": "boolean",
          "description": "If true, the calling task runner should cancel processing of the task. The task runner does not need to call  SetTaskStatus for canceled tasks.",
          "nested_items": []
        }
      ]
    }
  ]
}