{
  "method_name": "put_graphql_api_environment_variables",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/appsync/client/put_graphql_api_environment_variables.html",
  "description": "Creates a list of environmental variables in an API by its ID value. When creating an environmental variable, it must follow the constraints below: When creating an environmental variable key-value pair, it must follow the additional constraints below: You can create a list of environmental variables by adding it to the environmentVariables payload as a list in the format {\"key1\":\"value1\",\"key2\":\"value2\", --¦}. Note that each call of the PutGraphqlApiEnvironmentVariables action will result in the overwriting of the existing environmental variable list of that API. This means the existing environmental variables will be lost. To avoid this, you must include all existing and new environmental variables in the list each time you call this action.",
  "parameters": [
    {
      "name": "apiId",
      "type": "string",
      "required": true,
      "description": "The ID of the API to which the environmental variable list will be written.",
      "nested_params": []
    },
    {
      "name": "environmentVariables",
      "type": "dict",
      "required": true,
      "description": "The list of environmental variables to add to the API. When creating an environmental variable key-value pair, it must follow the additional constraints below: Keys must begin with a letter. Keys must be at least two characters long. Keys can only contain letters, numbers, and the underscore character (_). Values can be up to 512 characters long. You can configure up to 50 key-value pairs in a GraphQL API. You can create a list of environmental variables by adding it to the environmentVariables payload as a list in the format {\"key1\":\"value1\",\"key2\":\"value2\", --¦}. Note that each call of the PutGraphqlApiEnvironmentVariables action will result in the overwriting of the existing environmental variable list of that API. This means the existing environmental variables will be lost. To avoid this, you must include all existing and new environmental variables in the list each time you call this action. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "environmentVariables",
          "type": "dict",
          "description": "The payload containing each environmental variable in the \"key\" : \"value\" format.",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}