{
  "method_name": "describe_activity_type",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/swf/client/describe_activity_type.html",
  "description": "Returns information about the specified activity type. This includes configuration settings provided when the type was registered and other general information about the type. You can use IAM policies to control this action's access to Amazon SWF resources as follows: If the caller doesn't have sufficient permissions to invoke the action, or the parameter values fall outside the specified constraints, the action fails. The associated event attribute's cause parameter is set to OPERATION_NOT_PERMITTED. For details and example IAM policies, see Using IAM to Manage Access to Amazon SWF Workflows in the Amazon SWF Developer Guide.",
  "parameters": [
    {
      "name": "domain",
      "type": "string",
      "required": true,
      "description": "The name of the domain in which the activity type is registered.",
      "nested_params": []
    },
    {
      "name": "activityType",
      "type": "dict",
      "required": true,
      "description": "The activity type to get information about. Activity types are identified by the name and version that were supplied when the activity was registered. The name of this activity. The version of this activity.",
      "nested_params": [
        {
          "name": "name",
          "type": "string",
          "required": false,
          "description": "The name of this activity.",
          "nested_params": []
        },
        {
          "name": "version",
          "type": "string",
          "required": false,
          "description": "The version of this activity.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "REGISTERED --- The type is registered and available. Workers supporting this type should be running.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "DEPRECATED --- The type was deprecated using  DeprecateActivityType, but is still in use. You should keep workers supporting this type running. You cannot create new tasks of this type.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "configuration",
          "type": "dict",
          "description": "The configuration settings registered with the activity type.",
          "nested_items": [
            {
              "name": "defaultTaskStartToCloseTimeout",
              "type": "string",
              "description": "The default maximum duration for tasks of an activity type specified when registering the activity type. You can override this default when scheduling a task through the ScheduleActivityTask  Decision.",
              "nested_items": []
            },
            {
              "name": "defaultTaskHeartbeatTimeout",
              "type": "string",
              "description": "The default maximum time, in seconds, before which a worker processing a task must report progress by calling  RecordActivityTaskHeartbeat.",
              "nested_items": []
            },
            {
              "name": "defaultTaskList",
              "type": "dict",
              "description": "The default task list specified for this activity type at registration. This default is used if a task list isn't provided when a task is scheduled through the ScheduleActivityTask  Decision. You can override the default registered task list when scheduling a task through the ScheduleActivityTask  Decision.",
              "nested_items": [
                {
                  "name": "name",
                  "type": "string",
                  "description": "The name of the task list.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "defaultTaskPriority",
              "type": "string",
              "description": "The default task priority for tasks of this activity type, specified at registration. If not set, then 0 is used as the default priority. This default can be overridden when scheduling an activity task.",
              "nested_items": []
            },
            {
              "name": "defaultTaskScheduleToStartTimeout",
              "type": "string",
              "description": "The default maximum duration, specified when registering the activity type, that a task of an activity type can wait before being assigned to a worker. You can override this default when scheduling a task through the ScheduleActivityTask  Decision.",
              "nested_items": []
            },
            {
              "name": "defaultTaskScheduleToCloseTimeout",
              "type": "string",
              "description": "The default maximum duration, specified when registering the activity type, for tasks of this activity type. You can override this default when scheduling a task through the ScheduleActivityTask  Decision.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}