{
  "method_name": "list_domains",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/swf/client/list_domains.html",
  "description": "Returns the list of domains registered in the account. The results may be split into multiple pages. To retrieve subsequent pages, make the call again using the nextPageToken returned by the initial call. You can use IAM policies to control this action's access to Amazon SWF resources as follows: If the caller doesn't have sufficient permissions to invoke the action, or the parameter values fall outside the specified constraints, the action fails. The associated event attribute's cause parameter is set to OPERATION_NOT_PERMITTED. For details and example IAM policies, see Using IAM to Manage Access to Amazon SWF Workflows in the Amazon SWF Developer Guide.",
  "parameters": [
    {
      "name": "nextPageToken",
      "type": "string",
      "required": false,
      "description": "If NextPageToken is returned there are more results available. The value of NextPageToken is a unique pagination token for each page. Make the call again using the returned token to retrieve the next page. Keep all other arguments unchanged. Each pagination token expires after 24 hours. Using an expired pagination token will return a 400 error: ' Specified token has exceeded its maximum lifetime'. The configured maximumPageSize determines how many results can be returned in a single call.",
      "nested_params": []
    },
    {
      "name": "registrationStatus",
      "type": "string",
      "required": true,
      "description": "Specifies the registration status of the domains to list.",
      "nested_params": []
    },
    {
      "name": "maximumPageSize",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "reverseOrder",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "domainInfos",
          "type": "list",
          "description": "A list of DomainInfo structures.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "name",
                  "type": "string",
                  "description": "The name of the domain. This name is unique within the account.",
                  "nested_items": []
                },
                {
                  "name": "status",
                  "type": "string",
                  "description": "The status of the domain:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "REGISTERED --- The domain is properly registered and available. You can use this domain for registering types and creating new workflow executions.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "DEPRECATED --- The domain was deprecated using  DeprecateDomain, but is still in use. You should not create new workflow executions in this domain.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "description",
                  "type": "string",
                  "description": "The description of the domain provided through  RegisterDomain.",
                  "nested_items": []
                },
                {
                  "name": "arn",
                  "type": "string",
                  "description": "The ARN of the domain.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "nextPageToken",
          "type": "string",
          "description": "If a NextPageToken was returned by a previous call, there are more results available. To retrieve the next page of results, make the call again using the returned token in nextPageToken. Keep all other arguments unchanged.",
          "nested_items": []
        }
      ]
    }
  ]
}