{
  "method_name": "register_workflow_type",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/swf/client/register_workflow_type.html",
  "description": "Registers a new workflow type and its configuration settings in the specified domain. The retention period for the workflow history is set by the  RegisterDomain action. You can use IAM policies to control this action's access to Amazon SWF resources as follows: If the caller doesn't have sufficient permissions to invoke the action, or the parameter values fall outside the specified constraints, the action fails. The associated event attribute's cause parameter is set to OPERATION_NOT_PERMITTED. For details and example IAM policies, see Using IAM to Manage Access to Amazon SWF Workflows in the Amazon SWF Developer Guide.",
  "parameters": [
    {
      "name": "domain",
      "type": "string",
      "required": true,
      "description": "The name of the domain in which to register the workflow type.",
      "nested_params": []
    },
    {
      "name": "name",
      "type": "string",
      "required": true,
      "description": "The name of the workflow type. The specified string must not contain a : (colon), / (slash), | (vertical bar), or any control characters ( \\u0000-\\u001f | \\u007f-\\u009f). Also, it must not be the literal string arn.",
      "nested_params": []
    },
    {
      "name": "version",
      "type": "string",
      "required": true,
      "description": "The version of the workflow type. The specified string must not contain a : (colon), / (slash), | (vertical bar), or any control characters ( \\u0000-\\u001f | \\u007f-\\u009f). Also, it must not be the literal string arn.",
      "nested_params": []
    },
    {
      "name": "description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "defaultTaskStartToCloseTimeout",
      "type": "string",
      "required": false,
      "description": "If set, specifies the default maximum duration of decision tasks for this workflow type. This default can be overridden when starting a workflow execution using the  StartWorkflowExecution action or the StartChildWorkflowExecution  Decision. The duration is specified in seconds, an integer greater than or equal to 0. You can use NONE to specify unlimited duration.",
      "nested_params": []
    },
    {
      "name": "defaultExecutionStartToCloseTimeout",
      "type": "string",
      "required": false,
      "description": "If set, specifies the default maximum duration for executions of this workflow type. You can override this default when starting an execution through the  StartWorkflowExecution Action or StartChildWorkflowExecution  Decision. The duration is specified in seconds; an integer greater than or equal to 0. Unlike some of the other timeout parameters in Amazon SWF, you cannot specify a value of 'NONE' for defaultExecutionStartToCloseTimeout; there is a one-year max limit on the time that a workflow execution can run. Exceeding this limit always causes the workflow execution to time out.",
      "nested_params": []
    },
    {
      "name": "defaultTaskList",
      "type": "dict",
      "required": true,
      "description": "If set, specifies the default task list to use for scheduling decision tasks for executions of this workflow type. This default is used only if a task list isn't provided when starting the execution through the  StartWorkflowExecution Action or StartChildWorkflowExecution  Decision. The name of the task list.",
      "nested_params": [
        {
          "name": "name",
          "type": "string",
          "required": false,
          "description": "The name of the task list.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "defaultTaskPriority",
      "type": "string",
      "required": false,
      "description": "The default task priority to assign to the workflow type. If not assigned, then 0 is used. Valid values are integers that range from Java's Integer.MIN_VALUE (-2147483648) to Integer.MAX_VALUE (2147483647). Higher numbers indicate higher priority. For more information about setting task priority, see Setting Task Priority in the Amazon SWF Developer Guide.",
      "nested_params": []
    },
    {
      "name": "defaultChildPolicy",
      "type": "string",
      "required": false,
      "description": "If set, specifies the default policy to use for the child workflow executions when a workflow execution of this type is terminated, by calling the  TerminateWorkflowExecution action explicitly or due to an expired timeout. This default can be overridden when starting a workflow execution using the  StartWorkflowExecution action or the StartChildWorkflowExecution  Decision. The supported child policies are: TERMINATE --- The child executions are terminated. REQUEST_CANCEL --- A request to cancel is attempted for each child execution by recording a WorkflowExecutionCancelRequested event in its history. It is up to the decider to take appropriate actions when it receives an execution history with this event. ABANDON --- No action is taken. The child executions continue to run.",
      "nested_params": []
    },
    {
      "name": "defaultLambdaRole",
      "type": "string",
      "required": false,
      "description": "The default IAM role attached to this workflow type.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}