{
  "method_name": "respond_decision_task_completed",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/swf/client/respond_decision_task_completed.html",
  "description": "Used by deciders to tell the service that the  DecisionTask identified by the taskToken has successfully completed. The decisions argument specifies the list of decisions made while processing the task. A DecisionTaskCompleted event is added to the workflow history. The executionContext specified is attached to the event in the workflow execution history. If an IAM policy grants permission to use RespondDecisionTaskCompleted, it can express permissions for the list of decisions in the decisions parameter. Each of the decisions has one or more parameters, much like a regular API call. To allow for policies to be as readable as possible, you can express permissions on decisions as if they were actual API calls, including applying conditions to some parameters. For more information, see Using IAM to Manage Access to Amazon SWF Workflows in the Amazon SWF Developer Guide.",
  "parameters": [
    {
      "name": "taskToken",
      "type": "string",
      "required": true,
      "description": "The taskToken from the  DecisionTask.",
      "nested_params": []
    },
    {
      "name": "decisions",
      "type": "list",
      "required": true,
      "description": "The list of decisions (possibly empty) made by the decider while processing this decision task. See the docs for the  Decision structure for details. (dict) --- Specifies a decision made by the decider. A decision can be one of these types: CancelTimer --- Cancels a previously started timer and records a TimerCanceled event in the history. CancelWorkflowExecution --- Closes the workflow execution and records a WorkflowExecutionCanceled event in the history. CompleteWorkflowExecution --- Closes the workflow execution and records a WorkflowExecutionCompleted event in the history . ContinueAsNewWorkflowExecution --- Closes the workflow execution and starts a new workflow execution of the same type using the same workflow ID and a unique run Id. A WorkflowExecutionContinuedAsNew event is recorded in the history. FailWorkflowExecution --- Closes the workflow execution and records a WorkflowExecutionFailed event in the history. RecordMarker --- Records a MarkerRecorded event in the history. Markers can be used for adding custom information in the history for instance to let deciders know that they don't need to look at the history beyond the marker event. RequestCancelActivityTask --- Attempts to cancel a previously scheduled activity task. If the activity task was scheduled but has not been assigned to a worker, then it is canceled. If the activity task was already assigned to a worker, then the worker is informed that cancellation has been requested in the response to  RecordActivityTaskHeartbeat. RequestCancelExternalWorkflowExecution --- Requests that a request be made to cancel the specified external workflow execution and records a RequestCancelExternalWorkflowExecutionInitiated event in the history. ScheduleActivityTask --- Schedules an activity task. SignalExternalWorkflowExecution --- Requests a signal to be delivered to the specified external workflow execution and records a SignalExternalWorkflowExecutionInitiated event in the history. StartChildWorkflowExecution --- Requests that a child workflow execution be started and records a StartChildWorkflowExecutionInitiated event in the history. The child workflow execution is a separate workflow execution with its own history. StartTimer --- Starts a timer for this workflow execution and records a TimerStarted event in the history. This timer fires after the specified delay and record a TimerFired event. If you grant permission to use RespondDecisionTaskCompleted, you can use IAM policies to express permissions for the list of decisions returned by this action as if they were members of the API. Treating decisions as a pseudo API maintains a uniform conceptual model and helps keep policies readable. For details and example IAM policies, see Using IAM to Manage Access to Amazon SWF Workflows in the Amazon SWF Developer Guide. Decisions can fail for several reasons The ordering of decisions should follow a logical flow. Some decisions might not make sense in the current context of the workflow execution and therefore fails. A limit on your account was reached. The decision lacks sufficient permissions. One of the following events might be added to the history to indicate an error. The event attribute's cause parameter indicates the cause. If cause is set to OPERATION_NOT_PERMITTED, the decision failed because it lacked sufficient permissions. ScheduleActivityTaskFailed --- A ScheduleActivityTask decision failed. This could happen if the activity type specified in the decision isn't registered, is in a deprecated state, or the decision isn't properly configured. RequestCancelActivityTaskFailed --- A RequestCancelActivityTask decision failed. This could happen if there is no open activity task with the specified activityId. StartTimerFailed --- A StartTimer decision failed. This could happen if there is another open timer with the same timerId. CancelTimerFailed --- A CancelTimer decision failed. This could happen if there is no open timer with the specified timerId. StartChildWorkflowExecutionFailed --- A StartChildWorkflowExecution decision failed. This could happen if the workflow type specified isn't registered, is deprecated, or the decision isn't properly configured. SignalExternalWorkflowExecutionFailed --- A SignalExternalWorkflowExecution decision failed. This could happen if the workflowID specified in the decision was incorrect. RequestCancelExternalWorkflowExecutionFailed --- A RequestCancelExternalWorkflowExecution decision failed. CancelWorkflowExecutionFailed --- A CancelWorkflowExecution decision failed. This could happen if there is an unhandled decision task pending in the workflow execution. CompleteWorkflowExecutionFailed --- A CompleteWorkflowExecution decision failed. ContinueAsNewWorkflowExecutionFailed --- A ContinueAsNewWorkflowExecution decision failed. This could happen if there is an unhandled decision task pending in the workflow execution or the ContinueAsNewWorkflowExecution decision was not configured correctly. FailWorkflowExecutionFailed --- A FailWorkflowExecution decision failed. The preceding error events might occur due to an error in the decider logic, which might put the workflow execution in an unstable state The cause field in the event structure for the error event indicates the cause of the error. You code a decision by first setting the decision type field to one of the above decision values, and then set the corresponding attributes field shown below: ScheduleActivityTaskDecisionAttributes RequestCancelActivityTaskDecisionAttributes CompleteWorkflowExecutionDecisionAttributes FailWorkflowExecutionDecisionAttributes CancelWorkflowExecutionDecisionAttributes ContinueAsNewWorkflowExecutionDecisionAttributes RecordMarkerDecisionAttributes StartTimerDecisionAttributes CancelTimerDecisionAttributes SignalExternalWorkflowExecutionDecisionAttributes RequestCancelExternalWorkflowExecutionDecisionAttributes StartChildWorkflowExecutionDecisionAttributes Specifies the type of the decision. scheduleActivityTaskDecisionAttributes (dict) --- Provides the details of the ScheduleActivityTask decision. It isn't set for other decision types. The type of the activity task to schedule. The name of this activity. The version of this activity. The activityId of the activity task. The specified string must not contain a : (colon), / (slash), | (vertical bar), or any control characters ( \\u0000-\\u001f | \\u007f-\\u009f). Also, it must not be the literal string arn. control (string) --- Data attached to the event that can be used by the decider in subsequent workflow tasks. This data isn't sent to the activity. input (string) --- The input provided to the activity task. scheduleToCloseTimeout (string) --- The maximum duration for this activity task. The duration is specified in seconds, an integer greater than or equal to 0. You can use NONE to specify unlimited duration. taskList (dict) --- If set, specifies the name of the task list in which to schedule the activity task. If not specified, the defaultTaskList registered with the activity type is used. The name of the task list. taskPriority (string) --- If set, specifies the priority with which the activity task is to be assigned to a worker. This overrides the defaultTaskPriority specified when registering the activity type using  RegisterActivityType. Valid values are integers that range from Java's Integer.MIN_VALUE (-2147483648) to Integer.MAX_VALUE (2147483647). Higher numbers indicate higher priority. For more information about setting task priority, see Setting Task Priority in the Amazon SWF Developer Guide. scheduleToStartTimeout (string) --- If set, specifies the maximum duration the activity task can wait to be assigned to a worker. This overrides the default schedule-to-start timeout specified when registering the activity type using  RegisterActivityType. startToCloseTimeout (string) --- If set, specifies the maximum duration a worker may take to process this activity task. This overrides the default start-to-close timeout specified when registering the activity type using  RegisterActivityType. heartbeatTimeout (string) --- If set, specifies the maximum time before which a worker processing a task of this type must report progress by calling  RecordActivityTaskHeartbeat. If the timeout is exceeded, the activity task is automatically timed out. If the worker subsequently attempts to record a heartbeat or returns a result, it is ignored. This overrides the default heartbeat timeout specified when registering the activity type using  RegisterActivityType. requestCancelActivityTaskDecisionAttributes (dict) --- Provides the details of the RequestCancelActivityTask decision. The activityId of the activity task to be canceled. completeWorkflowExecutionDecisionAttributes (dict) --- Provides the details of the CompleteWorkflowExecution decision. result (string) --- The result of the workflow execution. The form of the result is implementation defined. failWorkflowExecutionDecisionAttributes (dict) --- Provides the details of the FailWorkflowExecution decision. reason (string) --- A descriptive reason for the failure that may help in diagnostics. details (string) --- Details of the failure. cancelWorkflowExecutionDecisionAttributes (dict) --- Provides the details of the CancelWorkflowExecution decision. details (string) --- Details of the cancellation. continueAsNewWorkflowExecutionDecisionAttributes (dict) --- Provides the details of the ContinueAsNewWorkflowExecution decision. input (string) --- The input provided to the new workflow execution. executionStartToCloseTimeout (string) --- If set, specifies the total duration for this workflow execution. This overrides the defaultExecutionStartToCloseTimeout specified when registering the workflow type. taskList (dict) --- The task list to use for the decisions of the new (continued) workflow execution. taskPriority (string) --- The task priority that, if set, specifies the priority for the decision tasks for this workflow execution. This overrides the defaultTaskPriority specified when registering the workflow type. taskStartToCloseTimeout (string) --- Specifies the maximum duration of decision tasks for the new workflow execution. This parameter overrides the defaultTaskStartToCloseTimout specified when registering the workflow type using  RegisterWorkflowType. childPolicy (string) --- If set, specifies the policy to use for the child workflow executions of the new execution if it is terminated by calling the  TerminateWorkflowExecution action explicitly or due to an expired timeout. This policy overrides the default child policy specified when registering the workflow type using  RegisterWorkflowType. The supported child policies are: TERMINATE --- The child executions are terminated. REQUEST_CANCEL --- A request to cancel is attempted for each child execution by recording a WorkflowExecutionCancelRequested event in its history. It is up to the decider to take appropriate actions when it receives an execution history with this event. ABANDON --- No action is taken. The child executions continue to run. tagList (list) --- The list of tags to associate with the new workflow execution. A maximum of 5 tags can be specified. You can list workflow executions with a specific tag by calling  ListOpenWorkflowExecutions or  ListClosedWorkflowExecutions and specifying a  TagFilter. (string) --- workflowTypeVersion (string) --- The version of the workflow to start. lambdaRole (string) --- The IAM role to attach to the new (continued) execution. recordMarkerDecisionAttributes (dict) --- Provides the details of the RecordMarker decision. The name of the marker. details (string) --- The details of the marker. startTimerDecisionAttributes (dict) --- Provides the details of the StartTimer decision. The unique ID of the timer. control (string) --- The data attached to the event that can be used by the decider in subsequent workflow tasks. The duration to wait before firing the timer. cancelTimerDecisionAttributes (dict) --- Provides the details of the CancelTimer decision. The unique ID of the timer to cancel. signalExternalWorkflowExecutionDecisionAttributes (dict) --- Provides the details of the SignalExternalWorkflowExecution decision. The workflowId of the workflow execution to be signaled. runId (string) --- The runId of the workflow execution to be signaled. The name of the signal.The target workflow execution uses the signal name and input to process the signal. input (string) --- The input data to be provided with the signal. The target workflow execution uses the signal name and input data to process the signal. control (string) --- The data attached to the event that can be used by the decider in subsequent decision tasks. requestCancelExternalWorkflowExecutionDecisionAttributes (dict) --- Provides the details of the RequestCancelExternalWorkflowExecution decision. The workflowId of the external workflow execution to cancel. runId (string) --- The runId of the external workflow execution to cancel. startChildWorkflowExecutionDecisionAttributes (dict) --- Provides the details of the StartChildWorkflowExecution decision. The type of the workflow execution to be started. The name of the workflow type. The version of the workflow type. The workflowId of the workflow execution. This data isn't sent to the child workflow execution. input (string) --- The input to be provided to the workflow execution. executionStartToCloseTimeout (string) --- The total duration for this workflow execution. taskList (dict) --- The name of the task list to be used for decision tasks of the child workflow execution. The specified string must not start or end with whitespace. It must not contain a : (colon), / (slash), | (vertical bar), or any control characters ( \\u0000-\\u001f | \\u007f-\\u009f). taskPriority (string) --- A task priority that, if set, specifies the priority for a decision task of this workflow execution. taskStartToCloseTimeout (string) --- Specifies the maximum duration of decision tasks for this workflow execution. childPolicy (string) --- If set, specifies the policy to use for the child workflow executions if the workflow execution being started is terminated by calling the  TerminateWorkflowExecution action explicitly or due to an expired timeout. tagList (list) --- The list of tags to associate with the child workflow execution. (string) --- lambdaRole (string) --- The IAM role attached to the child workflow execution. scheduleLambdaFunctionDecisionAttributes (dict) --- Provides the details of the ScheduleLambdaFunction decision. A string that identifies the Lambda function execution in the event history. The name, or ARN, of the Lambda function to schedule. control (string) --- The data attached to the event that the decider can use in subsequent workflow tasks. This data isn't sent to the Lambda task. input (string) --- The optional input data to be supplied to the Lambda function. startToCloseTimeout (string) --- The timeout value, in seconds, after which the Lambda function is considered to be failed once it has started. This can be any integer from 1-900 (1s-15m). If no value is supplied, then a default value of 900s is assumed.",
      "nested_params": []
    },
    {
      "name": "executionContext",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "taskList",
      "type": "dict",
      "required": true,
      "description": "The task list to use for the future decision tasks of this workflow execution. This list overrides the original task list you specified while starting the workflow execution. The name of the task list.",
      "nested_params": [
        {
          "name": "name",
          "type": "string",
          "required": false,
          "description": "The name of the task list.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "taskListScheduleToStartTimeout",
      "type": "string",
      "required": false,
      "description": "Specifies a timeout (in seconds) for the task list override. When this parameter is missing, the task list override is permanent. This parameter makes it possible to temporarily override the task list. If a decision task scheduled on the override task list is not started within the timeout, the decision task will time out. Amazon SWF will revert the override and schedule a new decision task to the original task list. If a decision task scheduled on the override task list is started within the timeout, but not completed within the start-to-close timeout, Amazon SWF will also revert the override and schedule a new decision task to the original task list.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}