{
  "method_name": "start_workflow_execution",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/swf/client/start_workflow_execution.html",
  "description": "Starts an execution of the workflow type in the specified domain using the provided workflowId and input data. This action returns the newly started workflow execution. You can use IAM policies to control this action's access to Amazon SWF resources as follows: If the caller doesn't have sufficient permissions to invoke the action, or the parameter values fall outside the specified constraints, the action fails. The associated event attribute's cause parameter is set to OPERATION_NOT_PERMITTED. For details and example IAM policies, see Using IAM to Manage Access to Amazon SWF Workflows in the Amazon SWF Developer Guide.",
  "parameters": [
    {
      "name": "domain",
      "type": "string",
      "required": true,
      "description": "The name of the domain in which the workflow execution is created. The specified string must not contain a : (colon), / (slash), | (vertical bar), or any control characters ( \\u0000-\\u001f | \\u007f-\\u009f). Also, it must not be the literal string arn.",
      "nested_params": []
    },
    {
      "name": "workflowId",
      "type": "string",
      "required": true,
      "description": "The user defined identifier associated with the workflow execution. You can use this to associate a custom identifier with the workflow execution. You may specify the same identifier if a workflow execution is logically a restart of a previous execution. You cannot have two open workflow executions with the same workflowId at the same time within the same domain. The specified string must not contain a : (colon), / (slash), | (vertical bar), or any control characters ( \\u0000-\\u001f | \\u007f-\\u009f). Also, it must not be the literal string arn.",
      "nested_params": []
    },
    {
      "name": "workflowType",
      "type": "dict",
      "required": true,
      "description": "The type of the workflow to start. The name of the workflow type. The version of the workflow type.",
      "nested_params": [
        {
          "name": "name",
          "type": "string",
          "required": false,
          "description": "The name of the workflow type.",
          "nested_params": []
        },
        {
          "name": "version",
          "type": "string",
          "required": false,
          "description": "The version of the workflow type.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "taskList",
      "type": "dict",
      "required": true,
      "description": "The task list to use for the decision tasks generated for this workflow execution. This overrides the defaultTaskList specified when registering the workflow type. The specified string must not contain a : (colon), / (slash), | (vertical bar), or any control characters ( \\u0000-\\u001f | \\u007f-\\u009f). Also, it must not be the literal string arn. The name of the task list.",
      "nested_params": [
        {
          "name": "name",
          "type": "string",
          "required": false,
          "description": "The name of the task list.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "taskPriority",
      "type": "string",
      "required": false,
      "description": "The task priority to use for this workflow execution. This overrides any default priority that was assigned when the workflow type was registered. If not set, then the default task priority for the workflow type is used. Valid values are integers that range from Java's Integer.MIN_VALUE (-2147483648) to Integer.MAX_VALUE (2147483647). Higher numbers indicate higher priority. For more information about setting task priority, see Setting Task Priority in the Amazon SWF Developer Guide.",
      "nested_params": []
    },
    {
      "name": "input",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "executionStartToCloseTimeout",
      "type": "string",
      "required": false,
      "description": "The total duration for this workflow execution. This overrides the defaultExecutionStartToCloseTimeout specified when registering the workflow type. The duration is specified in seconds; an integer greater than or equal to 0. Exceeding this limit causes the workflow execution to time out. Unlike some of the other timeout parameters in Amazon SWF, you cannot specify a value of 'NONE' for this timeout; there is a one-year max limit on the time that a workflow execution can run.",
      "nested_params": []
    },
    {
      "name": "tagList",
      "type": "list",
      "required": false,
      "description": "The list of tags to associate with the workflow execution. You can specify a maximum of 5 tags. You can list workflow executions with a specific tag by calling  ListOpenWorkflowExecutions or  ListClosedWorkflowExecutions and specifying a  TagFilter. (string) ---",
      "nested_params": []
    },
    {
      "name": "taskStartToCloseTimeout",
      "type": "string",
      "required": false,
      "description": "Specifies the maximum duration of decision tasks for this workflow execution. This parameter overrides the defaultTaskStartToCloseTimout specified when registering the workflow type using  RegisterWorkflowType. The duration is specified in seconds, an integer greater than or equal to 0. You can use NONE to specify unlimited duration.",
      "nested_params": []
    },
    {
      "name": "childPolicy",
      "type": "string",
      "required": false,
      "description": "If set, specifies the policy to use for the child workflow executions of this workflow execution if it is terminated, by calling the  TerminateWorkflowExecution action explicitly or due to an expired timeout. This policy overrides the default child policy specified when registering the workflow type using  RegisterWorkflowType. The supported child policies are: TERMINATE --- The child executions are terminated. REQUEST_CANCEL --- A request to cancel is attempted for each child execution by recording a WorkflowExecutionCancelRequested event in its history. It is up to the decider to take appropriate actions when it receives an execution history with this event. ABANDON --- No action is taken. The child executions continue to run.",
      "nested_params": []
    },
    {
      "name": "lambdaRole",
      "type": "string",
      "required": false,
      "description": "The IAM role to attach to this workflow execution.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "runId",
          "type": "string",
          "description": "The runId of a workflow execution. This ID is generated by the service and can be used to uniquely identify the workflow execution within a domain.",
          "nested_items": []
        }
      ]
    }
  ]
}