{
  "method_name": "list_groups",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/identitystore/client/list_groups.html",
  "description": "Lists all groups in the identity store. Returns a paginated list of complete Group objects. Filtering for a Group by the DisplayName attribute is deprecated. Instead, use the GetGroupId API action.",
  "parameters": [
    {
      "name": "IdentityStoreId",
      "type": "string",
      "required": true,
      "description": "The globally unique identifier for the identity store, such as d-1234567890. In this example, d- is a fixed prefix, and 1234567890 is a randomly generated string that contains numbers and lower case letters. This value is generated at the time that a new identity store is created.",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": true,
      "description": "A list of Filter objects, which is used in the ListUsers and ListGroups requests. (dict) --- A query filter used by ListUsers and ListGroups. This filter object provides the attribute name and attribute value to search users or groups. The attribute path that is used to specify which attribute name to search. Length limit is 255 characters. For example, UserName is a valid attribute path for the ListUsers API, and DisplayName is a valid attribute path for the ListGroups API. Represents the data for an attribute. Each attribute value is described as a name-value pair.",
      "nested_params": [
        {
          "name": "AttributePath",
          "type": "string",
          "required": false,
          "description": "The attribute path that is used to specify which attribute name to search. Length limit is 255 characters. For example, UserName is a valid attribute path for the ListUsers API, and DisplayName is a valid attribute path for the ListGroups API.",
          "nested_params": []
        },
        {
          "name": "AttributeValue",
          "type": "string",
          "required": false,
          "description": "Represents the data for an attribute. Each attribute value is described as a name-value pair.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Groups",
          "type": "list",
          "description": "A list of Group objects in the identity store.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "GroupId",
                  "type": "string",
                  "description": "The identifier for a group in the identity store.",
                  "nested_items": []
                },
                {
                  "name": "DisplayName",
                  "type": "string",
                  "description": "The display name value for the group. The length limit is 1,024 characters. This value can consist of letters, accented characters, symbols, numbers, punctuation, tab, new line, carriage return, space, and nonbreaking space in this attribute. This value is specified at the time the group is created and stored as an attribute of the group object in the identity store.",
                  "nested_items": []
                },
                {
                  "name": "ExternalIds",
                  "type": "list",
                  "description": "A list of ExternalId objects that contains the identifiers issued to this resource by an external identity provider.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Issuer",
                          "type": "string",
                          "description": "The issuer for an external identifier.",
                          "nested_items": []
                        },
                        {
                          "name": "Id",
                          "type": "string",
                          "description": "The identifier issued to this resource by an external identity provider.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "Description",
                  "type": "string",
                  "description": "A string containing a description of the specified group.",
                  "nested_items": []
                },
                {
                  "name": "IdentityStoreId",
                  "type": "string",
                  "description": "The globally unique identifier for the identity store.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The pagination token used for the ListUsers and ListGroups API operations. This value is generated by the identity store service. It is returned in the API response if the total results are more than the size of one page. This token is also returned when it1 is used in the API request to search for the next page.",
          "nested_items": []
        }
      ]
    }
  ]
}