{
  "method_name": "get_integration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/apigateway/client/get_integration.html",
  "description": "Get the integration settings.",
  "parameters": [
    {
      "name": "restApiId",
      "type": "string",
      "required": true,
      "description": "The string identifier of the associated RestApi.",
      "nested_params": []
    },
    {
      "name": "resourceId",
      "type": "string",
      "required": true,
      "description": "Specifies a get integration request's resource identifier.",
      "nested_params": []
    },
    {
      "name": "httpMethod",
      "type": "string",
      "required": true,
      "description": "Specifies a get integration request's HTTP method.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "type",
          "type": "string",
          "description": "Specifies an API method integration type. The valid value is one of the following:",
          "nested_items": []
        },
        {
          "name": "httpMethod",
          "type": "string",
          "description": "Specifies the integration's HTTP method type. For the Type property, if you specify MOCK, this property is optional. For Lambda integrations, you must set the integration method to POST. For all other types, you must specify this property.",
          "nested_items": []
        },
        {
          "name": "uri",
          "type": "string",
          "description": "Specifies Uniform Resource Identifier (URI) of the integration endpoint.",
          "nested_items": []
        },
        {
          "name": "connectionType",
          "type": "string",
          "description": "The type of the network connection to the integration endpoint. The valid value is INTERNET for connections through the public routable internet or VPC_LINK for private connections between API Gateway and a network load balancer in a VPC. The default value is INTERNET.",
          "nested_items": []
        },
        {
          "name": "connectionId",
          "type": "string",
          "description": "The ID of the VpcLink used for the integration when connectionType=VPC_LINK and undefined, otherwise.",
          "nested_items": []
        },
        {
          "name": "credentials",
          "type": "string",
          "description": "Specifies the credentials required for the integration, if any. For AWS integrations, three options are available. To specify an IAM Role for API Gateway to assume, use the role's Amazon Resource Name (ARN). To require that the caller's identity be passed through from the request, specify the string arn:aws:iam::\\*:user/\\*. To use resource-based permissions on supported Amazon Web Services services, specify null.",
          "nested_items": []
        },
        {
          "name": "requestParameters",
          "type": "dict",
          "description": "A key-value map specifying request parameters that are passed from the method request to the back end. The key is an integration request parameter name and the associated value is a method request parameter value or static value that must be enclosed within single quotes and pre-encoded as required by the back end. The method request parameter value must match the pattern of method.request.{location}.{name}, where location is querystring, path, or header and name must be a valid and unique method request parameter name.",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "requestTemplates",
          "type": "dict",
          "description": "Represents a map of Velocity templates that are applied on the request payload based on the value of the Content-Type header sent by the client. The content type value is the key in this map, and the template (as a String) is the value.",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "passthroughBehavior",
          "type": "string",
          "description": "Specifies how the method request body of an unmapped content type will be passed through the integration request to the back end without transformation. A content type is unmapped if no mapping template is defined in the integration or the content type does not match any of the mapped content types, as specified in requestTemplates. The valid value is one of the following: WHEN_NO_MATCH: passes the method request body through the integration request to the back end without transformation when the method request content type does not match any content type associated with the mapping templates defined in the integration request. WHEN_NO_TEMPLATES: passes the method request body through the integration request to the back end without transformation when no mapping template is defined in the integration request. If a template is defined when this option is selected, the method request of an unmapped content-type will be rejected with an HTTP 415 Unsupported Media Type response. NEVER: rejects the method request with an HTTP 415 Unsupported Media Type response when either the method request content type does not match any content type associated with the mapping templates defined in the integration request or no mapping template is defined in the integration request.",
          "nested_items": []
        },
        {
          "name": "contentHandling",
          "type": "string",
          "description": "Specifies how to handle request payload content type conversions. Supported values are CONVERT_TO_BINARY and CONVERT_TO_TEXT, with the following behaviors:",
          "nested_items": []
        },
        {
          "name": "timeoutInMillis",
          "type": "integer",
          "description": "Custom timeout between 50 and 29,000 milliseconds. The default value is 29,000 milliseconds or 29 seconds.",
          "nested_items": []
        },
        {
          "name": "cacheNamespace",
          "type": "string",
          "description": "Specifies a group of related cached parameters. By default, API Gateway uses the resource ID as the cacheNamespace. You can specify the same cacheNamespace across resources to return the same cached data for requests to different resources.",
          "nested_items": []
        },
        {
          "name": "cacheKeyParameters",
          "type": "list",
          "description": "A list of request parameters whose values API Gateway caches. To be valid values for cacheKeyParameters, these parameters must also be specified for Method requestParameters.",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": []
            }
          ]
        },
        {
          "name": "integrationResponses",
          "type": "dict",
          "description": "Specifies the integration's responses.",
          "nested_items": [
            {
              "name": "statusCode",
              "type": "string",
              "description": "(string) ---",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "statusCode",
                      "type": "string",
                      "description": "Specifies the status code that is used to map the integration response to an existing MethodResponse.",
                      "nested_items": []
                    },
                    {
                      "name": "selectionPattern",
                      "type": "string",
                      "description": "Specifies the regular expression (regex) pattern used to choose an integration response based on the response from the back end. For example, if the success response returns nothing and the error response returns some string, you could use the .+ regex to match error response. However, make sure that the error response does not contain any newline ( \\n) character in such cases. If the back end is an Lambda function, the Lambda function error header is matched. For all other HTTP and Amazon Web Services back ends, the HTTP status code is matched.",
                      "nested_items": []
                    },
                    {
                      "name": "responseParameters",
                      "type": "dict",
                      "description": "A key-value map specifying response parameters that are passed to the method response from the back end. The key is a method response header parameter name and the mapped value is an integration response header value, a static value enclosed within a pair of single quotes, or a JSON expression from the integration response body. The mapping key must match the pattern of method.response.header.{name}, where name is a valid and unique header name. The mapped non-static value must match the pattern of integration.response.header.{name} or integration.response.body.{JSON-expression}, where name is a valid and unique response header name and JSON-expression is a valid JSON expression without the $ prefix.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "responseTemplates",
                      "type": "dict",
                      "description": "Specifies the templates used to transform the integration response body. Response templates are represented as a key/value map, with a content-type as the key and a template as the value.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "contentHandling",
                      "type": "string",
                      "description": "Specifies how to handle response payload content type conversions. Supported values are CONVERT_TO_BINARY and CONVERT_TO_TEXT, with the following behaviors:",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "tlsConfig",
          "type": "dict",
          "description": "Specifies the TLS configuration for an integration.",
          "nested_items": [
            {
              "name": "insecureSkipVerification",
              "type": "boolean",
              "description": "Specifies whether or not API Gateway skips verification that the certificate for an integration endpoint is issued by a supported certificate authority. This isn't recommended, but it enables you to use certificates that are signed by private certificate authorities, or certificates that are self-signed. If enabled, API Gateway still performs basic certificate validation, which includes checking the certificate's expiration date, hostname, and presence of a root certificate authority. Supported only for HTTP and HTTP_PROXY integrations.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}