{
  "method_name": "create_policy",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/organizations/client/create_policy.html",
  "description": "Creates a policy of a specified type that you can attach to a root, an organizational unit (OU), or an individual Amazon Web Services account. For more information about policies and their use, see Managing Organizations policies. If the request includes tags, then the requester must have the organizations:TagResource permission. This operation can be called only from the organization's management account or by a member account that is a delegated administrator.",
  "parameters": [
    {
      "name": "Content",
      "type": "string",
      "required": true,
      "description": "The policy text content to add to the new policy. The text that you supply must adhere to the rules of the policy type you specify in the Type parameter. The maximum size of a policy document depends on the policy's type. For more information, see Maximum and minimum values in the Organizations User Guide.",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": true,
      "description": "An optional description to assign to the policy.",
      "nested_params": []
    },
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "The friendly name to assign to the policy. The regex pattern that is used to validate this parameter is a string of any of the characters in the ASCII character range.",
      "nested_params": []
    },
    {
      "name": "Type",
      "type": "string",
      "required": true,
      "description": "The type of policy to create. You can specify one of the following values: SERVICE_CONTROL_POLICY RESOURCE_CONTROL_POLICY DECLARATIVE_POLICY_EC2 BACKUP_POLICY TAG_POLICY CHATBOT_POLICY AISERVICES_OPT_OUT_POLICY SECURITYHUB_POLICY.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "A list of tags that you want to attach to the newly created policy. For each tag in the list, you must specify both a tag key and a value. You can set the value to an empty string, but you can't set it to null. For more information about tagging, see Tagging Organizations resources in the Organizations User Guide. (dict) --- A custom key-value pair associated with a resource within your organization. You can attach tags to any of the following organization resources. Amazon Web Services account Organizational unit (OU) Organization root Policy The key identifier, or name, of the tag. The string value that's associated with the key of the tag. You can set the value of a tag to an empty string, but you can't set the value of a tag to null.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "PolicySummary",
              "type": "dict",
              "description": "A structure that contains additional details about the policy.",
              "nested_items": [
                {
                  "name": "Id",
                  "type": "string",
                  "description": "The unique identifier (ID) of the policy.",
                  "nested_items": []
                },
                {
                  "name": "Arn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the policy.",
                  "nested_items": []
                },
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The friendly name of the policy.",
                  "nested_items": []
                },
                {
                  "name": "Description",
                  "type": "string",
                  "description": "The description of the policy.",
                  "nested_items": []
                },
                {
                  "name": "Type",
                  "type": "string",
                  "description": "The type of policy.",
                  "nested_items": []
                },
                {
                  "name": "AwsManaged",
                  "type": "boolean",
                  "description": "A boolean value that indicates whether the specified policy is an Amazon Web Services managed policy. If true, then you can attach the policy to roots, OUs, or accounts, but you cannot edit it.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Content",
              "type": "string",
              "description": "The text content of the policy.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}