{
  "method_name": "create_organization",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/organizations/client/create_organization.html",
  "description": "Creates an Amazon Web Services organization. The account whose user is calling the CreateOrganization operation automatically becomes the management account of the new organization. This operation must be called using credentials from the account that is to become the new organization's management account. The principal must also have the relevant IAM permissions. By default (or if you set the FeatureSet parameter to ALL), the new organization is created with all features enabled and service control policies automatically enabled in the root. If you instead choose to create the organization supporting only the consolidated billing features by setting the FeatureSet parameter to CONSOLIDATED_BILLING, no policy types are enabled by default and you can't use organization policies.",
  "parameters": [],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Organization",
          "type": "dict",
          "description": "A structure that contains details about the newly created organization.",
          "nested_items": [
            {
              "name": "Id",
              "type": "string",
              "description": "The unique identifier (ID) of an organization.",
              "nested_items": []
            },
            {
              "name": "Arn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of an organization.",
              "nested_items": []
            },
            {
              "name": "FeatureSet",
              "type": "string",
              "description": "Specifies the functionality that currently is available to the organization. If set to 'ALL', then all features are enabled and policies can be applied to accounts in the organization. If set to 'CONSOLIDATED_BILLING', then only consolidated billing functionality is available. For more information, see Enabling all features in your organization in the Organizations User Guide.",
              "nested_items": []
            },
            {
              "name": "MasterAccountArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the account that is designated as the management account for the organization.",
              "nested_items": []
            },
            {
              "name": "MasterAccountId",
              "type": "string",
              "description": "The unique identifier (ID) of the management account of an organization.",
              "nested_items": []
            },
            {
              "name": "MasterAccountEmail",
              "type": "string",
              "description": "The email address that is associated with the Amazon Web Services account that is designated as the management account for the organization.",
              "nested_items": []
            },
            {
              "name": "AvailablePolicyTypes",
              "type": "list",
              "description": "To determine the policies that are enabled and available for use in your organization, use the  ListRoots operation instead.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Type",
                      "type": "string",
                      "description": "The name of the policy type.",
                      "nested_items": []
                    },
                    {
                      "name": "Status",
                      "type": "string",
                      "description": "The status of the policy type as it relates to the associated root. To attach a policy of the specified type to a root or to an OU or account in that root, it must be available in the organization and enabled for that root.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}