{
  "method_name": "enable_all_features",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/organizations/client/enable_all_features.html",
  "description": "Enables all features in an organization. This enables the use of organization policies that can restrict the services and actions that can be called in each account. Until you enable all features, you have access only to consolidated billing, and you can't use any of the advanced account administration features that Organizations supports. For more information, see Enabling all features in your organization in the Organizations User Guide. After you enable all features, you can separately enable or disable individual policy types in a root using  EnablePolicyType and  DisablePolicyType. To see the status of policy types in a root, use  ListRoots. After all invited member accounts accept the handshake, you finalize the feature set change by accepting the handshake that contains \"Action\": \"ENABLE_ALL_FEATURES\". This completes the change. After you enable all features in your organization, the management account in the organization can apply policies on all member accounts. These policies can restrict what users and even administrators in those accounts can do. The management account can apply policies that prevent accounts from leaving the organization. Ensure that your account administrators are aware of this. This operation can be called only from the organization's management account.",
  "parameters": [],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Handshake",
          "type": "dict",
          "description": "A structure that contains details about the handshake created to support this request to enable all features in the organization.",
          "nested_items": [
            {
              "name": "Id",
              "type": "string",
              "description": "The unique identifier (ID) of a handshake. The originating account creates the ID when it initiates the handshake.",
              "nested_items": []
            },
            {
              "name": "Arn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of a handshake.",
              "nested_items": []
            },
            {
              "name": "Parties",
              "type": "list",
              "description": "Information about the two accounts that are participating in the handshake.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Id",
                      "type": "string",
                      "description": "The unique identifier (ID) for the party.",
                      "nested_items": []
                    },
                    {
                      "name": "Type",
                      "type": "string",
                      "description": "The type of party.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "State",
              "type": "string",
              "description": "The current state of the handshake. Use the state to trace the flow of the handshake through the process from its creation to its acceptance. The meaning of each of the valid values is as follows:",
              "nested_items": [
                {
                  "name": "REQUESTED",
                  "type": "applicable to only some handshake types",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "OPEN",
                  "type": "applicable to only some policy types",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "CANCELED",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "ACCEPTED",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "DECLINED",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "EXPIRED",
                  "type": "15 days",
                  "description": "",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "RequestedTimestamp",
              "type": "datetime",
              "description": "The date and time that the handshake request was made.",
              "nested_items": []
            },
            {
              "name": "ExpirationTimestamp",
              "type": "datetime",
              "description": "The date and time that the handshake expires. If the recipient of the handshake request fails to respond before the specified date and time, the handshake becomes inactive and is no longer valid.",
              "nested_items": []
            },
            {
              "name": "Action",
              "type": "string",
              "description": "The type of handshake, indicating what action occurs when the recipient accepts the handshake. The following handshake types are supported:",
              "nested_items": [
                {
                  "name": "INVITE",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "ENABLE_ALL_FEATURES",
                  "type": "",
                  "description": "",
                  "nested_items": []
                },
                {
                  "name": "APPROVE_ALL_FEATURES",
                  "type": "",
                  "description": "",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Resources",
              "type": "list",
              "description": "Additional information that is needed to process the handshake.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Value",
                      "type": "string",
                      "description": "The information that is passed to the other party in the handshake. The format of the value string must match the requirements of the specified type.",
                      "nested_items": []
                    },
                    {
                      "name": "Type",
                      "type": "string",
                      "description": "The type of information being passed, specifying how the value is to be interpreted by the other party:",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "ACCOUNT - Specifies an Amazon Web Services account ID number.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "ORGANIZATION - Specifies an organization ID number.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "EMAIL - Specifies the email address that is associated with the account that receives the handshake.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "OWNER_EMAIL - Specifies the email address associated with the management account. Included as information about an organization.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "OWNER_NAME - Specifies the name associated with the management account. Included as information about an organization.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "NOTES - Additional text provided by the handshake initiator and intended for the recipient to read.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "Resources",
                      "type": "list",
                      "description": "When needed, contains an additional array of HandshakeResource objects.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}