{
  "method_name": "enable_policy_type",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/organizations/client/enable_policy_type.html",
  "description": "Enables a policy type in a root. After you enable a policy type in a root, you can attach policies of that type to the root, any organizational unit (OU), or account in that root. You can undo this by using the  DisablePolicyType operation. This is an asynchronous request that Amazon Web Services performs in the background. Amazon Web Services recommends that you first use  ListRoots to see the status of policy types for a specified root, and then use this operation. This operation can be called only from the organization's management account or by a member account that is a delegated administrator. You can enable a policy type in a root only if that policy type is available in the organization. To view the status of available policy types in the organization, use  DescribeOrganization.",
  "parameters": [
    {
      "name": "RootId",
      "type": "string",
      "required": true,
      "description": "The unique identifier (ID) of the root in which you want to enable a policy type. You can get the ID from the  ListRoots operation. The regex pattern for a root ID string requires 'r-' followed by from 4 to 32 lowercase letters or digits.",
      "nested_params": []
    },
    {
      "name": "PolicyType",
      "type": "string",
      "required": true,
      "description": "The policy type that you want to enable. You can specify one of the following values: SERVICE_CONTROL_POLICY RESOURCE_CONTROL_POLICY DECLARATIVE_POLICY_EC2 BACKUP_POLICY TAG_POLICY CHATBOT_POLICY AISERVICES_OPT_OUT_POLICY SECURITYHUB_POLICY.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "Id",
              "type": "string",
              "description": "The unique identifier (ID) for the root. The ID is unique to the organization only.",
              "nested_items": []
            },
            {
              "name": "Arn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the root.",
              "nested_items": []
            },
            {
              "name": "Name",
              "type": "string",
              "description": "The friendly name of the root.",
              "nested_items": []
            },
            {
              "name": "PolicyTypes",
              "type": "list",
              "description": "The types of policies that are currently enabled for the root and therefore can be attached to the root or to its OUs or accounts.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Type",
                      "type": "string",
                      "description": "The name of the policy type.",
                      "nested_items": []
                    },
                    {
                      "name": "Status",
                      "type": "string",
                      "description": "The status of the policy type as it relates to the associated root. To attach a policy of the specified type to a root or to an OU or account in that root, it must be available in the organization and enabled for that root.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}