{
  "method_name": "list_aws_service_access_for_organization",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/organizations/client/list_aws_service_access_for_organization.html",
  "description": "Returns a list of the Amazon Web Services services that you enabled to integrate with your organization. After a service on this list creates the resources that it requires for the integration, it can perform operations on your organization and its accounts. For more information about integrating other services with Organizations, including the list of services that currently work with Organizations, see Using Organizations with other Amazon Web Services services in the Organizations User Guide. This operation can be called only from the organization's management account or by a member account that is a delegated administrator.",
  "parameters": [
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "EnabledServicePrincipals",
          "type": "list",
          "description": "A list of the service principals for the services that are enabled to integrate with your organization. Each principal is a structure that includes the name and the date that it was enabled for integration with Organizations.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ServicePrincipal",
                  "type": "string",
                  "description": "The name of the service principal. This is typically in the form of a URL, such as: servicename.amazonaws.com.",
                  "nested_items": []
                },
                {
                  "name": "DateEnabled",
                  "type": "datetime",
                  "description": "The date that the service principal was enabled for integration with Organizations.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "If present, indicates that more output is available than is included in the current response. Use this value in the NextToken request parameter in a subsequent call to the operation to get the next part of the output. You should repeat this until the NextToken response element comes back as null.",
          "nested_items": []
        }
      ]
    }
  ]
}