{
  "method_name": "list_create_account_status",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/organizations/client/list_create_account_status.html",
  "description": "Lists the account creation requests that match the specified status that is currently being tracked for the organization. This operation can be called only from the organization's management account or by a member account that is a delegated administrator.",
  "parameters": [
    {
      "name": "States",
      "type": "list",
      "required": false,
      "description": "A list of one or more states that you want included in the response. If this parameter isn't present, all requests are included in the response. (string) ---",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "CreateAccountStatuses",
          "type": "list",
          "description": "A list of objects with details about the requests. Certain elements, such as the accountId number, are present in the output only after the account has been successfully created.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Id",
                  "type": "string",
                  "description": "The unique identifier (ID) that references this request. You get this value from the response of the initial  CreateAccount request to create the account.",
                  "nested_items": []
                },
                {
                  "name": "AccountName",
                  "type": "string",
                  "description": "The account name given to the account when it was created.",
                  "nested_items": []
                },
                {
                  "name": "State",
                  "type": "string",
                  "description": "The status of the asynchronous request to create an Amazon Web Services account.",
                  "nested_items": []
                },
                {
                  "name": "RequestedTimestamp",
                  "type": "datetime",
                  "description": "The date and time that the request was made for the account creation.",
                  "nested_items": []
                },
                {
                  "name": "CompletedTimestamp",
                  "type": "datetime",
                  "description": "The date and time that the account was created and the request completed.",
                  "nested_items": []
                },
                {
                  "name": "AccountId",
                  "type": "string",
                  "description": "If the account was created successfully, the unique identifier (ID) of the new account.",
                  "nested_items": []
                },
                {
                  "name": "GovCloudAccountId",
                  "type": "string",
                  "description": "If the account was created successfully, the unique identifier (ID) of the new account in the Amazon Web Services GovCloud (US) Region.",
                  "nested_items": []
                },
                {
                  "name": "FailureReason",
                  "type": "string",
                  "description": "If the request failed, a description of the reason for the failure.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "ACCOUNT_LIMIT_EXCEEDED: The account couldn't be created because you reached the limit on the number of accounts in your organization.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "CONCURRENT_ACCOUNT_MODIFICATION: You already submitted a request with the same information.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "EMAIL_ALREADY_EXISTS: The account could not be created because another Amazon Web Services account with that email address already exists.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "FAILED_BUSINESS_VALIDATION: The Amazon Web Services account that owns your organization failed to receive business license validation.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "US",
                      "description": "GOVCLOUD_ACCOUNT_ALREADY_EXISTS: The account in the Amazon Web Services GovCloud (US) Region could not be created because this Region already includes an account with that email address.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "IDENTITY_INVALID_BUSINESS_VALIDATION: The Amazon Web Services account that owns your organization can't complete business license validation because it doesn't have valid identity data.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "INVALID_ADDRESS: The account could not be created because the address you provided is not valid.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "INVALID_EMAIL: The account could not be created because the email address you provided is not valid.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "INVALID_PAYMENT_INSTRUMENT: The Amazon Web Services account that owns your organization does not have a supported payment method associated with the account. Amazon Web Services does not support cards issued by financial institutions in Russia or Belarus. For more information, see Managing your Amazon Web Services payments.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "INTERNAL_FAILURE: The account could not be created because of an internal failure. Try again later. If the problem persists, contact Amazon Web Services Customer Support.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "MISSING_BUSINESS_VALIDATION: The Amazon Web Services account that owns your organization has not received Business Validation.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "MISSING_PAYMENT_INSTRUMENT: You must configure the management account with a valid payment method, such as a credit card.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "PENDING_BUSINESS_VALIDATION: The Amazon Web Services account that owns your organization is still in the process of completing business license validation.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "UNKNOWN_BUSINESS_VALIDATION: The Amazon Web Services account that owns your organization has an unknown issue with business license validation.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "If present, indicates that more output is available than is included in the current response. Use this value in the NextToken request parameter in a subsequent call to the operation to get the next part of the output. You should repeat this until the NextToken response element comes back as null.",
          "nested_items": []
        }
      ]
    }
  ]
}