{
  "method_name": "list_protections",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/shield/client/list_protections.html",
  "description": "Retrieves  Protection objects for the account. You can retrieve all protections or you can provide filtering criteria and retrieve just the subset of protections that match the criteria.",
  "parameters": [
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "When you request a list of objects from Shield Advanced, if the response does not include all of the remaining available objects, Shield Advanced includes a NextToken value in the response. You can retrieve the next batch of objects by requesting the list again and providing the token that was returned by the prior call in your request. You can indicate the maximum number of objects that you want Shield Advanced to return for a single call with the MaxResults setting. Shield Advanced will not return more than MaxResults objects, but may return fewer, even if more objects are still available. Whenever more objects remain that Shield Advanced has not yet returned to you, the response will include a NextToken value. On your first call to a list operation, leave this setting empty.",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "The greatest number of objects that you want Shield Advanced to return to the list request. Shield Advanced might return fewer objects than you indicate in this setting, even if more objects are available. If there are more objects remaining, Shield Advanced will always also return a NextToken value in the response. The default setting is 20.",
      "nested_params": []
    },
    {
      "name": "InclusionFilters",
      "type": "dict",
      "required": false,
      "description": "Narrows the set of protections that the call retrieves. You can retrieve a single protection by providing its name or the ARN (Amazon Resource Name) of its protected resource. You can also retrieve all protections for a specific resource type. You can provide up to one criteria per filter type. Shield Advanced returns protections that exactly match all of the filter criteria that you provide. ResourceArns (list) --- The ARN (Amazon Resource Name) of the resource whose protection you want to retrieve. (string) --- ProtectionNames (list) --- The name of the protection that you want to retrieve. (string) --- ResourceTypes (list) --- The type of protected resource whose protections you want to retrieve. (string) ---",
      "nested_params": [
        {
          "name": "ResourceArns",
          "type": "list",
          "required": false,
          "description": "The ARN (Amazon Resource Name) of the resource whose protection you want to retrieve.",
          "nested_params": []
        },
        {
          "name": "ProtectionNames",
          "type": "list",
          "required": false,
          "description": "The name of the protection that you want to retrieve.",
          "nested_params": []
        },
        {
          "name": "ResourceTypes",
          "type": "list",
          "required": false,
          "description": "The type of protected resource whose protections you want to retrieve.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Protections",
          "type": "list",
          "description": "The array of enabled  Protection objects.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Id",
                  "type": "string",
                  "description": "The unique identifier (ID) of the protection.",
                  "nested_items": []
                },
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The name of the protection. For example, My CloudFront distributions.",
                  "nested_items": []
                },
                {
                  "name": "ResourceArn",
                  "type": "string",
                  "description": "The ARN (Amazon Resource Name) of the Amazon Web Services resource that is protected.",
                  "nested_items": []
                },
                {
                  "name": "HealthCheckIds",
                  "type": "list",
                  "description": "The unique identifier (ID) for the Route 53 health check that's associated with the protection.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "ProtectionArn",
                  "type": "string",
                  "description": "The ARN (Amazon Resource Name) of the protection.",
                  "nested_items": []
                },
                {
                  "name": "ApplicationLayerAutomaticResponseConfiguration",
                  "type": "dict",
                  "description": "The automatic application layer DDoS mitigation settings for the protection. This configuration determines whether Shield Advanced automatically manages rules in the web ACL in order to respond to application layer events that Shield Advanced determines to be DDoS attacks.",
                  "nested_items": [
                    {
                      "name": "Status",
                      "type": "string",
                      "description": "Indicates whether automatic application layer DDoS mitigation is enabled for the protection.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "When you request a list of objects from Shield Advanced, if the response does not include all of the remaining available objects, Shield Advanced includes a NextToken value in the response. You can retrieve the next batch of objects by requesting the list again and providing the token that was returned by the prior call in your request.",
          "nested_items": []
        }
      ]
    }
  ]
}