{
  "method_name": "list_model_invocation_jobs",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/bedrock/client/list_model_invocation_jobs.html",
  "description": "Lists all batch inference jobs in the account. For more information, see View details about a batch inference job.",
  "parameters": [
    {
      "name": "submitTimeAfter",
      "type": "datetime",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "submitTimeBefore",
      "type": "datetime",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "statusEquals",
      "type": "string",
      "required": false,
      "description": "Specify a status to filter for batch inference jobs whose statuses match the string you specify. The following statuses are possible: Submitted --- This job has been submitted to a queue for validation. Validating --- This job is being validated for the requirements described in Format and upload your batch inference data. The criteria include the following: Your IAM service role has access to the Amazon S3 buckets containing your files. Your files are .jsonl files and each individual record is a JSON object in the correct format. Note that validation doesn't check if the modelInput value matches the request body for the model. Your files fulfill the requirements for file size and number of records. For more information, see Quotas for Amazon Bedrock. Scheduled --- This job has been validated and is now in a queue. The job will automatically start when it reaches its turn. Expired --- This job timed out because it was scheduled but didn't begin before the set timeout duration. Submit a new job request. InProgress --- This job has begun. You can start viewing the results in the output S3 location. Completed --- This job has successfully completed. View the output files in the output S3 location. PartiallyCompleted --- This job has partially completed. Not all of your records could be processed in time. Failed --- This job has failed. Check the failure message for any further details. For further assistance, reach out to the Amazon Web ServicesSupport Center. Stopped --- This job was stopped by a user. Stopping --- This job is being stopped by a user.",
      "nested_params": []
    },
    {
      "name": "nameContains",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "maxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "nextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "sortBy",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "sortOrder",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "nextToken",
          "type": "string",
          "description": "If there are more results than can fit in the response, a nextToken is returned. Use the nextToken in a request to return the next batch of results.",
          "nested_items": []
        },
        {
          "name": "invocationJobSummaries",
          "type": "list",
          "description": "A list of items, each of which contains a summary about a batch inference job.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "jobArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the batch inference job.",
                  "nested_items": []
                },
                {
                  "name": "jobName",
                  "type": "string",
                  "description": "The name of the batch inference job.",
                  "nested_items": []
                },
                {
                  "name": "modelId",
                  "type": "string",
                  "description": "The unique identifier of the foundation model used for model inference.",
                  "nested_items": []
                },
                {
                  "name": "clientRequestToken",
                  "type": "string",
                  "description": "A unique, case-sensitive identifier to ensure that the API request completes no more than one time. If this token matches a previous request, Amazon Bedrock ignores the request, but does not return an error. For more information, see Ensuring idempotency.",
                  "nested_items": []
                },
                {
                  "name": "roleArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the service role with permissions to carry out and manage batch inference. You can use the console to create a default service role or follow the steps at Create a service role for batch inference.",
                  "nested_items": []
                },
                {
                  "name": "status",
                  "type": "string",
                  "description": "The status of the batch inference job.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "Submitted --- This job has been submitted to a queue for validation.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Validating --- This job is being validated for the requirements described in Format and upload your batch inference data. The criteria include the following:",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "Your IAM service role has access to the Amazon S3 buckets containing your files.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "Your files are .jsonl files and each individual record is a JSON object in the correct format. Note that validation doesn't check if the modelInput value matches the request body for the model.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "Your files fulfill the requirements for file size and number of records. For more information, see Quotas for Amazon Bedrock.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Scheduled --- This job has been validated and is now in a queue. The job will automatically start when it reaches its turn.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Expired --- This job timed out because it was scheduled but didn't begin before the set timeout duration. Submit a new job request.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "InProgress --- This job has begun. You can start viewing the results in the output S3 location.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Completed --- This job has successfully completed. View the output files in the output S3 location.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "PartiallyCompleted --- This job has partially completed. Not all of your records could be processed in time. View the output files in the output S3 location.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Failed --- This job has failed. Check the failure message for any further details. For further assistance, reach out to the Amazon Web ServicesSupport Center.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Stopped --- This job was stopped by a user.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Stopping --- This job is being stopped by a user.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "message",
                  "type": "string",
                  "description": "If the batch inference job failed, this field contains a message describing why the job failed.",
                  "nested_items": []
                },
                {
                  "name": "submitTime",
                  "type": "datetime",
                  "description": "The time at which the batch inference job was submitted.",
                  "nested_items": []
                },
                {
                  "name": "lastModifiedTime",
                  "type": "datetime",
                  "description": "The time at which the batch inference job was last modified.",
                  "nested_items": []
                },
                {
                  "name": "endTime",
                  "type": "datetime",
                  "description": "The time at which the batch inference job ended.",
                  "nested_items": []
                },
                {
                  "name": "inputDataConfig",
                  "type": "dict",
                  "description": "Details about the location of the input to the batch inference job.",
                  "nested_items": [
                    {
                      "name": "s3InputDataConfig",
                      "type": "dict",
                      "description": "Contains the configuration of the S3 location of the input data.",
                      "nested_items": [
                        {
                          "name": "s3InputFormat",
                          "type": "string",
                          "description": "The format of the input data.",
                          "nested_items": []
                        },
                        {
                          "name": "s3Uri",
                          "type": "string",
                          "description": "The S3 location of the input data.",
                          "nested_items": []
                        },
                        {
                          "name": "s3BucketOwner",
                          "type": "string",
                          "description": "The ID of the Amazon Web Services account that owns the S3 bucket containing the input data.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "outputDataConfig",
                  "type": "dict",
                  "description": "Details about the location of the output of the batch inference job.",
                  "nested_items": [
                    {
                      "name": "s3OutputDataConfig",
                      "type": "dict",
                      "description": "Contains the configuration of the S3 location of the output data.",
                      "nested_items": [
                        {
                          "name": "s3Uri",
                          "type": "string",
                          "description": "The S3 location of the output data.",
                          "nested_items": []
                        },
                        {
                          "name": "s3EncryptionKeyId",
                          "type": "string",
                          "description": "The unique identifier of the key that encrypts the S3 location of the output data.",
                          "nested_items": []
                        },
                        {
                          "name": "s3BucketOwner",
                          "type": "string",
                          "description": "The ID of the Amazon Web Services account that owns the S3 bucket containing the output data.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "vpcConfig",
                  "type": "dict",
                  "description": "The configuration of the Virtual Private Cloud (VPC) for the data in the batch inference job. For more information, see Protect batch inference jobs using a VPC.",
                  "nested_items": [
                    {
                      "name": "subnetIds",
                      "type": "list",
                      "description": "An array of IDs for each subnet in the VPC to use.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "securityGroupIds",
                      "type": "list",
                      "description": "An array of IDs for each security group in the VPC to use.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "timeoutDurationInHours",
                  "type": "integer",
                  "description": "The number of hours after which the batch inference job was set to time out.",
                  "nested_items": []
                },
                {
                  "name": "jobExpirationTime",
                  "type": "datetime",
                  "description": "The time at which the batch inference job times or timed out.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}