{
  "method_name": "create_image_pipeline",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/imagebuilder/client/create_image_pipeline.html",
  "description": "Creates a new image pipeline. Image pipelines enable you to automate the creation and distribution of images.",
  "parameters": [
    {
      "name": "name",
      "type": "string",
      "required": true,
      "description": "The name of the image pipeline.",
      "nested_params": []
    },
    {
      "name": "description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "imageRecipeArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "containerRecipeArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "infrastructureConfigurationArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the infrastructure configuration that will be used to build images created by this image pipeline.",
      "nested_params": []
    },
    {
      "name": "distributionConfigurationArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "imageTestsConfiguration",
      "type": "dict",
      "required": false,
      "description": "The image test configuration of the image pipeline. imageTestsEnabled (boolean) --- Determines if tests should run after building the image. Image Builder defaults to enable tests to run following the image build, before image distribution. timeoutMinutes (integer) --- The maximum time in minutes that tests are permitted to run.",
      "nested_params": [
        {
          "name": "imageTestsEnabled",
          "type": "boolean",
          "required": false,
          "description": "Determines if tests should run after building the image. Image Builder defaults to enable tests to run following the image build, before image distribution.",
          "nested_params": []
        },
        {
          "name": "timeoutMinutes",
          "type": "integer",
          "required": false,
          "description": "The maximum time in minutes that tests are permitted to run.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "enhancedImageMetadataEnabled",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "schedule",
      "type": "dict",
      "required": false,
      "description": "The schedule of the image pipeline. scheduleExpression (string) --- The cron expression determines how often EC2 Image Builder evaluates your pipelineExecutionStartCondition. For information on how to format a cron expression in Image Builder, see Use cron expressions in EC2 Image Builder. timezone (string) --- The timezone that applies to the scheduling expression. For example, 'Etc/UTC', 'America/Los_Angeles' in the IANA timezone format. If not specified this defaults to UTC. pipelineExecutionStartCondition (string) --- The start condition configures when the pipeline should trigger a new image build, as follows. If no value is set Image Builder defaults to EXPRESSION_MATCH_AND_DEPENDENCY_UPDATES_AVAILABLE. EXPRESSION_MATCH_AND_DEPENDENCY_UPDATES_AVAILABLE (default) --- When you use semantic version filters on the base image or components in your image recipe, EC2 Image Builder builds a new image only when there are new versions of the base image or components in your recipe that match the filter. EXPRESSION_MATCH_ONLY --- This condition builds a new image every time the CRON expression matches the current time.",
      "nested_params": [
        {
          "name": "scheduleExpression",
          "type": "string",
          "required": false,
          "description": "The cron expression determines how often EC2 Image Builder evaluates your pipelineExecutionStartCondition. For information on how to format a cron expression in Image Builder, see Use cron expressions in EC2 Image Builder.",
          "nested_params": []
        },
        {
          "name": "timezone",
          "type": "string",
          "required": false,
          "description": "The timezone that applies to the scheduling expression. For example, 'Etc/UTC', 'America/Los_Angeles' in the IANA timezone format. If not specified this defaults to UTC.",
          "nested_params": []
        },
        {
          "name": "pipelineExecutionStartCondition",
          "type": "string",
          "required": false,
          "description": "The start condition configures when the pipeline should trigger a new image build, as follows. If no value is set Image Builder defaults to EXPRESSION_MATCH_AND_DEPENDENCY_UPDATES_AVAILABLE.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "status",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "dict",
      "required": false,
      "description": "The tags of the image pipeline. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "clientToken",
      "type": "string",
      "required": true,
      "description": "Unique, case-sensitive identifier you provide to ensure idempotency of the request. For more information, see Ensuring idempotency in the Amazon EC2 API Reference. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "imageScanningConfiguration",
      "type": "dict",
      "required": false,
      "description": "Contains settings for vulnerability scans. imageScanningEnabled (boolean) --- A setting that indicates whether Image Builder keeps a snapshot of the vulnerability scans that Amazon Inspector runs against the build instance when you create a new image. ecrConfiguration (dict) --- Contains Amazon ECR settings for vulnerability scans. repositoryName (string) --- The name of the container repository that Amazon Inspector scans to identify findings for your container images. The name includes the path for the repository location. If you don't provide this information, Image Builder creates a repository in your account named image-builder-image-scanning-repository for vulnerability scans of your output container images. containerTags (list) --- Tags for Image Builder to apply to the output container image that Amazon Inspector scans. Tags can help you identify and manage your scanned images. (string) ---",
      "nested_params": [
        {
          "name": "imageScanningEnabled",
          "type": "boolean",
          "required": false,
          "description": "A setting that indicates whether Image Builder keeps a snapshot of the vulnerability scans that Amazon Inspector runs against the build instance when you create a new image.",
          "nested_params": []
        },
        {
          "name": "ecrConfiguration",
          "type": "dict",
          "required": false,
          "description": "Contains Amazon ECR settings for vulnerability scans.",
          "nested_params": [
            {
              "name": "repositoryName",
              "type": "string",
              "required": false,
              "description": "The name of the container repository that Amazon Inspector scans to identify findings for your container images. The name includes the path for the repository location. If you don't provide this information, Image Builder creates a repository in your account named image-builder-image-scanning-repository for vulnerability scans of your output container images.",
              "nested_params": []
            },
            {
              "name": "containerTags",
              "type": "list",
              "required": false,
              "description": "Tags for Image Builder to apply to the output container image that Amazon Inspector scans. Tags can help you identify and manage your scanned images.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "workflows",
      "type": "list",
      "required": true,
      "description": "Contains an array of workflow configuration objects. (dict) --- Contains control settings and configurable inputs for a workflow resource. The Amazon Resource Name (ARN) of the workflow resource. parameters (list) --- Contains parameter values for each of the parameters that the workflow document defined for the workflow resource. (dict) --- Contains a key/value pair that sets the named workflow parameter. The name of the workflow parameter to set. Sets the value for the named workflow parameter. (string) --- parallelGroup (string) --- Test workflows are defined within named runtime groups called parallel groups. The parallel group is the named group that contains this test workflow. Test workflows within a parallel group can run at the same time. Image Builder starts up to five test workflows in the group at the same time, and starts additional workflows as others complete, until all workflows in the group have completed. This field only applies for test workflows. onFailure (string) --- The action to take if the workflow fails.",
      "nested_params": [
        {
          "name": "workflowArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the workflow resource.",
          "nested_params": []
        },
        {
          "name": "parameters",
          "type": "list",
          "required": false,
          "description": "Contains parameter values for each of the parameters that the workflow document defined for the workflow resource.",
          "nested_params": [
            {
              "name": "name",
              "type": "string",
              "required": false,
              "description": "The name of the workflow parameter to set.",
              "nested_params": []
            },
            {
              "name": "value",
              "type": "list",
              "required": false,
              "description": "Sets the value for the named workflow parameter.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "parallelGroup",
          "type": "string",
          "required": false,
          "description": "Test workflows are defined within named runtime groups called parallel groups. The parallel group is the named group that contains this test workflow. Test workflows within a parallel group can run at the same time. Image Builder starts up to five test workflows in the group at the same time, and starts additional workflows as others complete, until all workflows in the group have completed. This field only applies for test workflows.",
          "nested_params": []
        },
        {
          "name": "onFailure",
          "type": "string",
          "required": false,
          "description": "The action to take if the workflow fails.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "executionRole",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "requestId",
          "type": "string",
          "description": "The request ID that uniquely identifies this request.",
          "nested_items": []
        },
        {
          "name": "clientToken",
          "type": "string",
          "description": "The client token that uniquely identifies the request.",
          "nested_items": []
        },
        {
          "name": "imagePipelineArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the image pipeline that was created by this request.",
          "nested_items": []
        }
      ]
    }
  ]
}