{
  "method_name": "get_workflow_execution",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/imagebuilder/client/get_workflow_execution.html",
  "description": "Get the runtime information that was logged for a specific runtime instance of the workflow.",
  "parameters": [
    {
      "name": "workflowExecutionId",
      "type": "string",
      "required": true,
      "description": "Use the unique identifier for a runtime instance of the workflow to get runtime details.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "requestId",
          "type": "string",
          "description": "The request ID that uniquely identifies this request.",
          "nested_items": []
        },
        {
          "name": "workflowBuildVersionArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the build version for the Image Builder workflow resource that defines the specified runtime instance of the workflow.",
          "nested_items": []
        },
        {
          "name": "workflowExecutionId",
          "type": "string",
          "description": "The unique identifier that Image Builder assigned to keep track of runtime details when it ran the workflow.",
          "nested_items": []
        },
        {
          "name": "imageBuildVersionArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the image resource build version that the specified runtime instance of the workflow created.",
          "nested_items": []
        },
        {
          "name": "type",
          "type": "string",
          "description": "The type of workflow that Image Builder ran for the specified runtime instance of the workflow.",
          "nested_items": []
        },
        {
          "name": "status",
          "type": "string",
          "description": "The current runtime status for the specified runtime instance of the workflow.",
          "nested_items": []
        },
        {
          "name": "message",
          "type": "string",
          "description": "The output message from the specified runtime instance of the workflow, if applicable.",
          "nested_items": []
        },
        {
          "name": "totalStepCount",
          "type": "integer",
          "description": "The total number of steps in the specified runtime instance of the workflow that ran. This number should equal the sum of the step counts for steps that succeeded, were skipped, and failed.",
          "nested_items": []
        },
        {
          "name": "totalStepsSucceeded",
          "type": "integer",
          "description": "A runtime count for the number of steps that ran successfully in the specified runtime instance of the workflow.",
          "nested_items": []
        },
        {
          "name": "totalStepsFailed",
          "type": "integer",
          "description": "A runtime count for the number of steps that failed in the specified runtime instance of the workflow.",
          "nested_items": []
        },
        {
          "name": "totalStepsSkipped",
          "type": "integer",
          "description": "A runtime count for the number of steps that were skipped in the specified runtime instance of the workflow.",
          "nested_items": []
        },
        {
          "name": "startTime",
          "type": "string",
          "description": "The timestamp when the specified runtime instance of the workflow started.",
          "nested_items": []
        },
        {
          "name": "endTime",
          "type": "string",
          "description": "The timestamp when the specified runtime instance of the workflow finished.",
          "nested_items": []
        },
        {
          "name": "parallelGroup",
          "type": "string",
          "description": "Test workflows are defined within named runtime groups. The parallel group is a named group that contains one or more test workflows.",
          "nested_items": []
        }
      ]
    }
  ]
}