{
  "method_name": "import_vm_image",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/imagebuilder/client/import_vm_image.html",
  "description": "When you export your virtual machine (VM) from its virtualization environment, that process creates a set of one or more disk container files that act as snapshots of your VM's environment, settings, and data. The Amazon EC2 API ImportImage action uses those files to import your VM and create an AMI. To import using the CLI command, see import-image. You can reference the task ID from the VM import to pull in the AMI that the import created as the base image for your Image Builder recipe.",
  "parameters": [
    {
      "name": "name",
      "type": "string",
      "required": true,
      "description": "The name of the base image that is created by the import process.",
      "nested_params": []
    },
    {
      "name": "semanticVersion",
      "type": "string",
      "required": true,
      "description": "The semantic version to attach to the base image that was created during the import process. This version follows the semantic version syntax.",
      "nested_params": []
    },
    {
      "name": "description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "platform",
      "type": "string",
      "required": true,
      "description": "The operating system platform for the imported VM.",
      "nested_params": []
    },
    {
      "name": "osVersion",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "vmImportTaskId",
      "type": "string",
      "required": true,
      "description": "The importTaskId (API) or ImportTaskId (CLI) from the Amazon EC2 VM import process. Image Builder retrieves information from the import process to pull in the AMI that is created from the VM source as the base image for your recipe.",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "dict",
      "required": false,
      "description": "Tags that are attached to the import resources. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "clientToken",
      "type": "string",
      "required": true,
      "description": "Unique, case-sensitive identifier you provide to ensure idempotency of the request. For more information, see Ensuring idempotency in the Amazon EC2 API Reference. This field is autopopulated if not provided.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "requestId",
          "type": "string",
          "description": "The request ID that uniquely identifies this request.",
          "nested_items": []
        },
        {
          "name": "imageArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the AMI that was created during the VM import process. This AMI is used as the base image for the recipe that imported the VM.",
          "nested_items": []
        },
        {
          "name": "clientToken",
          "type": "string",
          "description": "The client token that uniquely identifies the request.",
          "nested_items": []
        }
      ]
    }
  ]
}