{
  "method_name": "update_lifecycle_policy",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/imagebuilder/client/update_lifecycle_policy.html",
  "description": "Update the specified lifecycle policy.",
  "parameters": [
    {
      "name": "lifecyclePolicyArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the lifecycle policy resource.",
      "nested_params": []
    },
    {
      "name": "description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "status",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "executionRole",
      "type": "string",
      "required": true,
      "description": "The name or Amazon Resource Name (ARN) of the IAM role that Image Builder uses to update the lifecycle policy.",
      "nested_params": []
    },
    {
      "name": "resourceType",
      "type": "string",
      "required": true,
      "description": "The type of image resource that the lifecycle policy applies to.",
      "nested_params": []
    },
    {
      "name": "policyDetails",
      "type": "list",
      "required": true,
      "description": "The configuration details for a lifecycle policy resource. (dict) --- The configuration details for a lifecycle policy resource. Configuration details for the policy action. Specifies the lifecycle action to take. includeResources (dict) --- Specifies the resources that the lifecycle policy applies to. amis (boolean) --- Specifies whether the lifecycle action should apply to distributed AMIs. snapshots (boolean) --- Specifies whether the lifecycle action should apply to snapshots associated with distributed AMIs. containers (boolean) --- Specifies whether the lifecycle action should apply to distributed containers. Specifies the resources that the lifecycle policy applies to. Filter resources based on either age or count. The number of units for the time period or for the count. For example, a value of 6 might refer to six months or six AMIs. unit (string) --- Defines the unit of time that the lifecycle policy uses to determine impacted resources. This is required for age-based rules. retainAtLeast (integer) --- For age-based filters, this is the number of resources to keep on hand after the lifecycle DELETE action is applied. Impacted resources are only deleted if you have more than this number of resources. If you have fewer resources than this number, the impacted resource is not deleted. exclusionRules (dict) --- Additional rules to specify resources that should be exempt from policy actions. tagMap (dict) --- Contains a list of tags that Image Builder uses to skip lifecycle actions for Image Builder image resources that have them. (string) --- (string) --- amis (dict) --- Lists configuration values that apply to AMIs that Image Builder should exclude from the lifecycle action. isPublic (boolean) --- Configures whether public AMIs are excluded from the lifecycle action. regions (list) --- Configures Amazon Web Services Regions that are excluded from the lifecycle action. (string) --- sharedAccounts (list) --- Specifies Amazon Web Services accounts whose resources are excluded from the lifecycle action. (string) --- lastLaunched (dict) --- Specifies configuration details for Image Builder to exclude the most recent resources from lifecycle actions. The integer number of units for the time period. For example 6 (months). Defines the unit of time that the lifecycle policy uses to calculate elapsed time since the last instance launched from the AMI. For example: days, weeks, months, or years. tagMap (dict) --- Lists tags that should be excluded from lifecycle actions for the AMIs that have them. (string) --- (string) ---",
      "nested_params": [
        {
          "name": "action",
          "type": "dict",
          "required": false,
          "description": "Configuration details for the policy action.",
          "nested_params": [
            {
              "name": "type",
              "type": "string",
              "required": false,
              "description": "Specifies the lifecycle action to take.",
              "nested_params": []
            },
            {
              "name": "includeResources",
              "type": "dict",
              "required": false,
              "description": "Specifies the resources that the lifecycle policy applies to.",
              "nested_params": [
                {
                  "name": "amis",
                  "type": "boolean",
                  "required": false,
                  "description": "Specifies whether the lifecycle action should apply to distributed AMIs.",
                  "nested_params": []
                },
                {
                  "name": "snapshots",
                  "type": "boolean",
                  "required": false,
                  "description": "Specifies whether the lifecycle action should apply to snapshots associated with distributed AMIs.",
                  "nested_params": []
                },
                {
                  "name": "containers",
                  "type": "boolean",
                  "required": false,
                  "description": "Specifies whether the lifecycle action should apply to distributed containers.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "filter",
          "type": "dict",
          "required": false,
          "description": "Specifies the resources that the lifecycle policy applies to.",
          "nested_params": [
            {
              "name": "type",
              "type": "string",
              "required": false,
              "description": "Filter resources based on either age or count.",
              "nested_params": []
            },
            {
              "name": "value",
              "type": "integer",
              "required": false,
              "description": "The number of units for the time period or for the count. For example, a value of 6 might refer to six months or six AMIs.",
              "nested_params": []
            },
            {
              "name": "unit",
              "type": "string",
              "required": false,
              "description": "Defines the unit of time that the lifecycle policy uses to determine impacted resources. This is required for age-based rules.",
              "nested_params": []
            },
            {
              "name": "retainAtLeast",
              "type": "integer",
              "required": false,
              "description": "For age-based filters, this is the number of resources to keep on hand after the lifecycle DELETE action is applied. Impacted resources are only deleted if you have more than this number of resources. If you have fewer resources than this number, the impacted resource is not deleted.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "exclusionRules",
          "type": "dict",
          "required": false,
          "description": "Additional rules to specify resources that should be exempt from policy actions.",
          "nested_params": [
            {
              "name": "tagMap",
              "type": "dict",
              "required": false,
              "description": "Contains a list of tags that Image Builder uses to skip lifecycle actions for Image Builder image resources that have them.",
              "nested_params": []
            },
            {
              "name": "amis",
              "type": "dict",
              "required": false,
              "description": "Lists configuration values that apply to AMIs that Image Builder should exclude from the lifecycle action.",
              "nested_params": [
                {
                  "name": "isPublic",
                  "type": "boolean",
                  "required": false,
                  "description": "Configures whether public AMIs are excluded from the lifecycle action.",
                  "nested_params": []
                },
                {
                  "name": "regions",
                  "type": "list",
                  "required": false,
                  "description": "Configures Amazon Web Services Regions that are excluded from the lifecycle action.",
                  "nested_params": []
                },
                {
                  "name": "sharedAccounts",
                  "type": "list",
                  "required": false,
                  "description": "Specifies Amazon Web Services accounts whose resources are excluded from the lifecycle action.",
                  "nested_params": []
                },
                {
                  "name": "lastLaunched",
                  "type": "dict",
                  "required": false,
                  "description": "Specifies configuration details for Image Builder to exclude the most recent resources from lifecycle actions.",
                  "nested_params": [
                    {
                      "name": "value",
                      "type": "integer",
                      "required": false,
                      "description": "The integer number of units for the time period. For example 6 (months).",
                      "nested_params": []
                    },
                    {
                      "name": "unit",
                      "type": "string",
                      "required": false,
                      "description": "Defines the unit of time that the lifecycle policy uses to calculate elapsed time since the last instance launched from the AMI. For example: days, weeks, months, or years.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "tagMap",
                  "type": "dict",
                  "required": false,
                  "description": "Lists tags that should be excluded from lifecycle actions for the AMIs that have them.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "resourceSelection",
      "type": "dict",
      "required": true,
      "description": "Selection criteria for resources that the lifecycle policy applies to. recipes (list) --- A list of recipes that are used as selection criteria for the output images that the lifecycle policy applies to. (dict) --- Specifies an Image Builder recipe that the lifecycle policy uses for resource selection. The name of an Image Builder recipe that the lifecycle policy uses for resource selection. The version of the Image Builder recipe specified by the name field. tagMap (dict) --- A list of tags that are used as selection criteria for the Image Builder image resources that the lifecycle policy applies to. (string) --- (string) ---",
      "nested_params": [
        {
          "name": "recipes",
          "type": "list",
          "required": false,
          "description": "A list of recipes that are used as selection criteria for the output images that the lifecycle policy applies to.",
          "nested_params": [
            {
              "name": "name",
              "type": "string",
              "required": false,
              "description": "The name of an Image Builder recipe that the lifecycle policy uses for resource selection.",
              "nested_params": []
            },
            {
              "name": "semanticVersion",
              "type": "string",
              "required": false,
              "description": "The version of the Image Builder recipe specified by the name field.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "tagMap",
          "type": "dict",
          "required": false,
          "description": "A list of tags that are used as selection criteria for the Image Builder image resources that the lifecycle policy applies to.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "clientToken",
      "type": "string",
      "required": true,
      "description": "Unique, case-sensitive identifier you provide to ensure idempotency of the request. For more information, see Ensuring idempotency in the Amazon EC2 API Reference. This field is autopopulated if not provided.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "lifecyclePolicyArn",
          "type": "string",
          "description": "The ARN of the image lifecycle policy resource that was updated.",
          "nested_items": []
        }
      ]
    }
  ]
}