{
  "method_name": "put_permission",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/codeguruprofiler/client/put_permission.html",
  "description": "Adds permissions to a profiling group's resource-based policy that are provided using an action group. If a profiling group doesn't have a resource-based policy, one is created for it using the permissions in the action group and the roles and users in the principals parameter.",
  "parameters": [
    {
      "name": "actionGroup",
      "type": "string",
      "required": true,
      "description": "Specifies an action group that contains permissions to add to a profiling group resource. One action group is supported, agentPermissions, which grants permission to perform actions required by the profiling agent, ConfigureAgent and PostAgentProfile permissions.",
      "nested_params": []
    },
    {
      "name": "principals",
      "type": "list",
      "required": true,
      "description": "A list ARNs for the roles and users you want to grant access to the profiling group. Wildcards are not are supported in the ARNs. (string) ---",
      "nested_params": []
    },
    {
      "name": "profilingGroupName",
      "type": "string",
      "required": true,
      "description": "The name of the profiling group to grant access to.",
      "nested_params": []
    },
    {
      "name": "revisionId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "policy",
          "type": "string",
          "description": "The JSON-formatted resource-based policy on the profiling group that includes the added permissions.",
          "nested_items": []
        },
        {
          "name": "revisionId",
          "type": "string",
          "description": "A universally unique identifier (UUID) for the revision of the resource-based policy that includes the added permissions. The JSON-formatted policy is in the policy element of the response.",
          "nested_items": []
        }
      ]
    }
  ]
}