{
  "method_name": "create_job",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/braket/client/create_job.html",
  "description": "Creates an Amazon Braket job.",
  "parameters": [
    {
      "name": "algorithmSpecification",
      "type": "dict",
      "required": true,
      "description": "Definition of the Amazon Braket job to be created. Specifies the container image the job uses and information about the Python scripts used for entry and training. containerImage (dict) --- The container image used to create an Amazon Braket job. The URI locating the container image. scriptModeConfig (dict) --- Configures the paths to the Python scripts used for entry and training. compressionType (string) --- The type of compression used by the Python scripts for an Amazon Braket job. The path to the Python script that serves as the entry point for an Amazon Braket job. The URI that specifies the S3 path to the Python script module that contains the training script used by an Amazon Braket job.",
      "nested_params": [
        {
          "name": "containerImage",
          "type": "dict",
          "required": false,
          "description": "The container image used to create an Amazon Braket job.",
          "nested_params": [
            {
              "name": "uri",
              "type": "string",
              "required": false,
              "description": "The URI locating the container image.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "scriptModeConfig",
          "type": "dict",
          "required": false,
          "description": "Configures the paths to the Python scripts used for entry and training.",
          "nested_params": [
            {
              "name": "compressionType",
              "type": "string",
              "required": false,
              "description": "The type of compression used by the Python scripts for an Amazon Braket job.",
              "nested_params": []
            },
            {
              "name": "entryPoint",
              "type": "string",
              "required": false,
              "description": "The path to the Python script that serves as the entry point for an Amazon Braket job.",
              "nested_params": []
            },
            {
              "name": "s3Uri",
              "type": "string",
              "required": false,
              "description": "The URI that specifies the S3 path to the Python script module that contains the training script used by an Amazon Braket job.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "associations",
      "type": "list",
      "required": true,
      "description": "The list of Amazon Braket resources associated with the hybrid job. (dict) --- The Amazon Braket resource and the association type. The Amazon Braket resource arn. The association type for the specified Amazon Braket resource arn.",
      "nested_params": [
        {
          "name": "arn",
          "type": "string",
          "required": false,
          "description": "The Amazon Braket resource arn.",
          "nested_params": []
        },
        {
          "name": "type",
          "type": "string",
          "required": false,
          "description": "The association type for the specified Amazon Braket resource arn.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "checkpointConfig",
      "type": "dict",
      "required": true,
      "description": "Information about the output locations for job checkpoint data. localPath (string) --- (Optional) The local directory where checkpoints are written. The default directory is /opt/braket/checkpoints/. Identifies the S3 path where you want Amazon Braket to store checkpoints. For example, s3://bucket-name/key-name-prefix.",
      "nested_params": [
        {
          "name": "localPath",
          "type": "string",
          "required": false,
          "description": "(Optional) The local directory where checkpoints are written. The default directory is /opt/braket/checkpoints/.",
          "nested_params": []
        },
        {
          "name": "s3Uri",
          "type": "string",
          "required": false,
          "description": "Identifies the S3 path where you want Amazon Braket to store checkpoints. For example, s3://bucket-name/key-name-prefix.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "clientToken",
      "type": "string",
      "required": true,
      "description": "A unique token that guarantees that the call to this API is idempotent. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "deviceConfig",
      "type": "dict",
      "required": true,
      "description": "The quantum processing unit (QPU) or simulator used to create an Amazon Braket job. The primary quantum processing unit (QPU) or simulator used to create and run an Amazon Braket job.",
      "nested_params": [
        {
          "name": "device",
          "type": "string",
          "required": false,
          "description": "The primary quantum processing unit (QPU) or simulator used to create and run an Amazon Braket job.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "hyperParameters",
      "type": "dict",
      "required": false,
      "description": "Algorithm-specific parameters used by an Amazon Braket job that influence the quality of the training job. The values are set with a string of JSON key:value pairs, where the key is the name of the hyperparameter and the value is the value of th hyperparameter. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "inputDataConfig",
      "type": "list",
      "required": true,
      "description": "A list of parameters that specify the name and type of input data and where it is located. (dict) --- A list of parameters that specify the input channels, type of input data, and where it is located. A named input source that an Amazon Braket job can consume. contentType (string) --- The MIME type of the data. The location of the channel data. Information about the data stored in Amazon S3 used by the Amazon Braket job. Depending on the value specified for the S3DataType, identifies either a key name prefix or a manifest that locates the S3 data source.",
      "nested_params": [
        {
          "name": "channelName",
          "type": "string",
          "required": false,
          "description": "A named input source that an Amazon Braket job can consume.",
          "nested_params": []
        },
        {
          "name": "contentType",
          "type": "string",
          "required": false,
          "description": "The MIME type of the data.",
          "nested_params": []
        },
        {
          "name": "dataSource",
          "type": "dict",
          "required": false,
          "description": "The location of the channel data.",
          "nested_params": [
            {
              "name": "s3DataSource",
              "type": "dict",
              "required": false,
              "description": "Information about the data stored in Amazon S3 used by the Amazon Braket job.",
              "nested_params": [
                {
                  "name": "s3Uri",
                  "type": "string",
                  "required": false,
                  "description": "Depending on the value specified for the S3DataType, identifies either a key name prefix or a manifest that locates the S3 data source.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "instanceConfig",
      "type": "dict",
      "required": true,
      "description": "Configuration of the resource instances to use while running the hybrid job on Amazon Braket. instanceCount (integer) --- Configures the number of resource instances to use while running an Amazon Braket job on Amazon Braket. The default value is 1. Configures the type resource instances to use while running an Amazon Braket hybrid job. The size of the storage volume, in GB, that user wants to provision.",
      "nested_params": [
        {
          "name": "instanceCount",
          "type": "integer",
          "required": false,
          "description": "Configures the number of resource instances to use while running an Amazon Braket job on Amazon Braket. The default value is 1.",
          "nested_params": []
        },
        {
          "name": "instanceType",
          "type": "string",
          "required": false,
          "description": "Configures the type resource instances to use while running an Amazon Braket hybrid job.",
          "nested_params": []
        },
        {
          "name": "volumeSizeInGb",
          "type": "integer",
          "required": false,
          "description": "The size of the storage volume, in GB, that user wants to provision.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "jobName",
      "type": "string",
      "required": true,
      "description": "The name of the Amazon Braket job.",
      "nested_params": []
    },
    {
      "name": "outputDataConfig",
      "type": "dict",
      "required": true,
      "description": "The path to the S3 location where you want to store job artifacts and the encryption key used to store them. kmsKeyId (string) --- The AWS Key Management Service (AWS KMS) key that Amazon Braket uses to encrypt the job training artifacts at rest using Amazon S3 server-side encryption. Identifies the S3 path where you want Amazon Braket to store the job training artifacts. For example, s3://bucket-name/key-name-prefix.",
      "nested_params": [
        {
          "name": "kmsKeyId",
          "type": "string",
          "required": false,
          "description": "The AWS Key Management Service (AWS KMS) key that Amazon Braket uses to encrypt the job training artifacts at rest using Amazon S3 server-side encryption.",
          "nested_params": []
        },
        {
          "name": "s3Path",
          "type": "string",
          "required": false,
          "description": "Identifies the S3 path where you want Amazon Braket to store the job training artifacts. For example, s3://bucket-name/key-name-prefix.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "roleArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of an IAM role that Amazon Braket can assume to perform tasks on behalf of a user. It can access user resources, run an Amazon Braket job container on behalf of user, and output resources to the users' s3 buckets.",
      "nested_params": []
    },
    {
      "name": "stoppingCondition",
      "type": "dict",
      "required": false,
      "description": "The user-defined criteria that specifies when a job stops running. maxRuntimeInSeconds (integer) --- The maximum length of time, in seconds, that an Amazon Braket job can run.",
      "nested_params": [
        {
          "name": "maxRuntimeInSeconds",
          "type": "integer",
          "required": false,
          "description": "The maximum length of time, in seconds, that an Amazon Braket job can run.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "tags",
      "type": "dict",
      "required": false,
      "description": "A tag object that consists of a key and an optional value, used to manage metadata for Amazon Braket resources. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "jobArn",
          "type": "string",
          "description": "The ARN of the Amazon Braket job created.",
          "nested_items": []
        }
      ]
    }
  ]
}