{
  "method_name": "get_compliance_summary",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/resourcegroupstaggingapi/client/get_compliance_summary.html",
  "description": "Returns a table that shows counts of resources that are noncompliant with their tag policies. For more information on tag policies, see Tag Policies in the Organizations User Guide. You can call this operation only from the organization's management account and from the us-east-1 Region. This operation supports pagination, where the response can be sent in multiple pages. You should check the PaginationToken response parameter to determine if there are additional results available to return. Repeat the query, passing the PaginationToken response parameter value as an input to the next request until you recieve a null value. A null value for PaginationToken indicates that there are no more results waiting to be returned.",
  "parameters": [
    {
      "name": "TargetIdFilters",
      "type": "list",
      "required": false,
      "description": "Specifies target identifiers (usually, specific account IDs) to limit the output by. If you use this parameter, the count of returned noncompliant resources includes only resources with the specified target IDs. (string) ---",
      "nested_params": []
    },
    {
      "name": "RegionFilters",
      "type": "list",
      "required": false,
      "description": "Specifies a list of Amazon Web Services Regions to limit the output to. If you use this parameter, the count of returned noncompliant resources includes only resources in the specified Regions. (string) ---",
      "nested_params": []
    },
    {
      "name": "ResourceTypeFilters",
      "type": "list",
      "required": false,
      "description": "Specifies that you want the response to include information for only resources of the specified types. The format of each resource type is service[:resourceType]. For example, specifying a resource type of ec2 returns all Amazon EC2 resources (which includes EC2 instances). Specifying a resource type of ec2:instance returns only EC2 instances. The string for each service name and resource type is the same as that embedded in a resource's Amazon Resource Name (ARN). Consult the Amazon Web Services General Reference for the following: For a list of service name strings, see Amazon Web Services Service Namespaces. For resource type strings, see Example ARNs. For more information about ARNs, see Amazon Resource Names (ARNs) and Amazon Web Services Service Namespaces. You can specify multiple resource types by using a comma separated array. The array can include up to 100 items. Note that the length constraint requirement applies to each resource type filter. (string) ---",
      "nested_params": []
    },
    {
      "name": "TagKeyFilters",
      "type": "list",
      "required": false,
      "description": "Specifies that you want the response to include information for only resources that have tags with the specified tag keys. If you use this parameter, the count of returned noncompliant resources includes only resources that have the specified tag keys. (string) ---",
      "nested_params": []
    },
    {
      "name": "GroupBy",
      "type": "list",
      "required": false,
      "description": "Specifies a list of attributes to group the counts of noncompliant resources by. If supplied, the counts are sorted by those attributes. (string) ---",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "PaginationToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "SummaryList",
          "type": "list",
          "description": "A table that shows counts of noncompliant resources.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "LastUpdated",
                  "type": "string",
                  "description": "The timestamp that shows when this summary was generated in this Region.",
                  "nested_items": []
                },
                {
                  "name": "TargetId",
                  "type": "string",
                  "description": "The account identifier or the root identifier of the organization. If you don't know the root ID, you can call the Organizations ListRoots API.",
                  "nested_items": []
                },
                {
                  "name": "TargetIdType",
                  "type": "string",
                  "description": "Whether the target is an account, an OU, or the organization root.",
                  "nested_items": []
                },
                {
                  "name": "Region",
                  "type": "string",
                  "description": "The Amazon Web Services Region that the summary applies to.",
                  "nested_items": []
                },
                {
                  "name": "ResourceType",
                  "type": "string",
                  "description": "The Amazon Web Services resource type.",
                  "nested_items": []
                },
                {
                  "name": "NonCompliantResources",
                  "type": "integer",
                  "description": "The count of noncompliant resources.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "PaginationToken",
          "type": "string",
          "description": "A string that indicates that there is more data available than this response contains. To receive the next part of the response, specify this response value as the PaginationToken value in the request for the next page.",
          "nested_items": []
        }
      ]
    }
  ]
}