{
  "method_name": "list_repository_associations",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/codeguru-reviewer/client/list_repository_associations.html",
  "description": "Returns a list of RepositoryAssociationSummary objects that contain summary information about a repository association. You can filter the returned list by ProviderType, Name, State, and Owner.",
  "parameters": [
    {
      "name": "ProviderTypes",
      "type": "list",
      "required": false,
      "description": "List of provider types to use as a filter. (string) ---",
      "nested_params": []
    },
    {
      "name": "States",
      "type": "list",
      "required": false,
      "description": "List of repository association states to use as a filter. The valid repository association states are: Associated: The repository association is complete. Associating: CodeGuru Reviewer is: Setting up pull request notifications. This is required for pull requests to trigger a CodeGuru Reviewer review. Setting up source code access. This is required for CodeGuru Reviewer to securely clone code in your repository. Failed: The repository failed to associate or disassociate. Disassociating: CodeGuru Reviewer is removing the repository's pull request notifications and source code access. Disassociated: CodeGuru Reviewer successfully disassociated the repository. You can create a new association with this repository if you want to review source code in it later. You can control access to code reviews created in anassociated repository with tags after it has been disassociated. For more information, see Using tags to control access to associated repositories in the Amazon CodeGuru Reviewer User Guide. (string) ---",
      "nested_params": [
        {
          "name": "Associated",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "Associating",
          "type": "",
          "required": false,
          "description": "Setting up pull request notifications. This is required for pull requests to trigger a CodeGuru Reviewer review. Setting up source code access. This is required for CodeGuru Reviewer to securely clone code in your repository.",
          "nested_params": []
        },
        {
          "name": "Failed",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "Disassociating",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Names",
      "type": "list",
      "required": false,
      "description": "List of repository names to use as a filter. (string) ---",
      "nested_params": []
    },
    {
      "name": "Owners",
      "type": "list",
      "required": false,
      "description": "List of owners to use as a filter. For Amazon Web Services CodeCommit, it is the name of the CodeCommit account that was used to associate the repository. For other repository source providers, such as Bitbucket and GitHub Enterprise Server, this is name of the account that was used to associate the repository. (string) ---",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "The nextToken value returned from a previous paginated ListRepositoryAssociations request where maxResults was used and the results exceeded the value of that parameter. Pagination continues from the end of the previous results that returned the nextToken value.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "RepositoryAssociationSummaries",
          "type": "list",
          "description": "A list of repository associations that meet the criteria of the request.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "AssociationArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the RepositoryAssociation object. You can retrieve this ARN by calling ListRepositoryAssociations.",
                  "nested_items": []
                },
                {
                  "name": "ConnectionArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of an Amazon Web Services CodeStar Connections connection. Its format is arn:aws:codestar-connections:region-id:aws-account_id:connection/connection-id. For more information, see Connection in the Amazon Web Services CodeStar Connections API Reference.",
                  "nested_items": []
                },
                {
                  "name": "LastUpdatedTimeStamp",
                  "type": "datetime",
                  "description": "The time, in milliseconds since the epoch, since the repository association was last updated.",
                  "nested_items": []
                },
                {
                  "name": "AssociationId",
                  "type": "string",
                  "description": "The repository association ID.",
                  "nested_items": []
                },
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The name of the repository association.",
                  "nested_items": []
                },
                {
                  "name": "Owner",
                  "type": "string",
                  "description": "The owner of the repository. For an Amazon Web Services CodeCommit repository, this is the Amazon Web Services account ID of the account that owns the repository. For a GitHub, GitHub Enterprise Server, or Bitbucket repository, this is the username for the account that owns the repository. For an S3 repository, it can be the username or Amazon Web Services account ID.",
                  "nested_items": []
                },
                {
                  "name": "ProviderType",
                  "type": "string",
                  "description": "The provider type of the repository association.",
                  "nested_items": []
                },
                {
                  "name": "State",
                  "type": "string",
                  "description": "The state of the repository association.",
                  "nested_items": [
                    {
                      "name": "Associated",
                      "type": "",
                      "description": "",
                      "nested_items": []
                    },
                    {
                      "name": "Associating",
                      "type": "",
                      "description": "Setting up pull request notifications. This is required for pull requests to trigger a CodeGuru Reviewer review.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "Setting up pull request notifications. This is required for pull requests to trigger a CodeGuru Reviewer review.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "Failed",
                      "type": "",
                      "description": "",
                      "nested_items": []
                    },
                    {
                      "name": "Disassociating",
                      "type": "",
                      "description": "",
                      "nested_items": []
                    },
                    {
                      "name": "Disassociated",
                      "type": "",
                      "description": "",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The nextToken value to include in a future ListRecommendations request. When the results of a ListRecommendations request exceed maxResults, this value can be used to retrieve the next page of results. This value is null when there are no more results to return.",
          "nested_items": []
        }
      ]
    }
  ]
}