{
  "method_name": "create_log_anomaly_detector",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/logs/client/create_log_anomaly_detector.html",
  "description": "Creates an anomaly detector that regularly scans one or more log groups and look for patterns and anomalies in the logs. An anomaly detector can help surface issues by automatically discovering anomalies in your log event traffic. An anomaly detector uses machine learning algorithms to scan log events and find patterns. A pattern is a shared text structure that recurs among your log fields. Patterns provide a useful tool for analyzing large sets of logs because a large number of log events can often be compressed into a few patterns. The anomaly detector uses pattern recognition to find anomalies, which are unusual log events. It uses the evaluationFrequency to compare current log events and patterns with trained baselines. Fields within a pattern are called tokens. Fields that vary within a pattern, such as a request ID or timestamp, are referred to as dynamic tokens and represented by <*>. The following is an example of a pattern: [INFO] Request time: <*> ms. This pattern represents log events like [INFO] Request time: 327 ms and other similar log events that differ only by the number, in this csse 327. When the pattern is displayed, the different numbers are replaced by <*>",
  "parameters": [
    {
      "name": "logGroupArnList",
      "type": "list",
      "required": true,
      "description": "An array containing the ARN of the log group that this anomaly detector will watch. You can specify only one log group ARN. (string) ---",
      "nested_params": []
    },
    {
      "name": "detectorName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "evaluationFrequency",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "filterPattern",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "kmsKeyId",
      "type": "string",
      "required": false,
      "description": "Optionally assigns a KMS key to secure this anomaly detector and its findings. If a key is assigned, the anomalies found and the model used by this detector are encrypted at rest with the key. If a key is assigned to an anomaly detector, a user must have permissions for both this key and for the anomaly detector to retrieve information about the anomalies that it finds. Make sure the value provided is a valid KMS key ARN. For more information about using a KMS key and to see the required IAM policy, see Use a KMS key with an anomaly detector.",
      "nested_params": []
    },
    {
      "name": "anomalyVisibilityTime",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "dict",
      "required": false,
      "description": "An optional list of key-value pairs to associate with the resource. For more information about tagging, see Tagging Amazon Web Services resources (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "anomalyDetectorArn",
          "type": "string",
          "description": "The ARN of the log anomaly detector that you just created.",
          "nested_items": []
        }
      ]
    }
  ]
}