{
  "method_name": "describe_job_queues",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/batch/client/describe_job_queues.html",
  "description": "Describes one or more of your job queues.",
  "parameters": [
    {
      "name": "jobQueues",
      "type": "list",
      "required": false,
      "description": "A list of up to 100 queue names or full queue Amazon Resource Name (ARN) entries. (string) ---",
      "nested_params": []
    },
    {
      "name": "maxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "nextToken",
      "type": "string",
      "required": false,
      "description": "The nextToken value returned from a previous paginated DescribeJobQueues request where maxResults was used and the results exceeded the value of that parameter. Pagination continues from the end of the previous results that returned the nextToken value. This value is null when there are no more results to return.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "jobQueues",
          "type": "list",
          "description": "The list of job queues.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "jobQueueName",
                  "type": "string",
                  "description": "The job queue name.",
                  "nested_items": []
                },
                {
                  "name": "jobQueueArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the job queue.",
                  "nested_items": []
                },
                {
                  "name": "state",
                  "type": "string",
                  "description": "Describes the ability of the queue to accept new jobs. If the job queue state is ENABLED, it can accept jobs. If the job queue state is DISABLED, new jobs can't be added to the queue, but jobs already in the queue can finish.",
                  "nested_items": []
                },
                {
                  "name": "schedulingPolicyArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the scheduling policy. The format is aws:Partition:batch:Region:Account:scheduling-policy/Name ``. For example, ``aws:aws:batch:us-west-2:123456789012:scheduling-policy/MySchedulingPolicy.",
                  "nested_items": []
                },
                {
                  "name": "status",
                  "type": "string",
                  "description": "The status of the job queue (for example, CREATING or VALID).",
                  "nested_items": []
                },
                {
                  "name": "statusReason",
                  "type": "string",
                  "description": "A short, human-readable string to provide additional details for the current status of the job queue.",
                  "nested_items": []
                },
                {
                  "name": "priority",
                  "type": "integer",
                  "description": "The priority of the job queue. Job queue priority determines the order that job queues are evaluated when multiple queues dispatch jobs within a shared compute environment. A higher value for priority indicates a higher priority. Queues are evaluated in cycles, in descending order by priority. For example, a job queue with a priority value of 10 is evaluated before a queue with a priority value of 1. All of the compute environments must be either Amazon EC2 ( EC2 or SPOT) or Fargate ( FARGATE or FARGATE_SPOT). Amazon EC2 and Fargate compute environments can't be mixed.",
                  "nested_items": []
                },
                {
                  "name": "computeEnvironmentOrder",
                  "type": "list",
                  "description": "The compute environments that are attached to the job queue and the order that job placement is preferred. Compute environments are selected for job placement in ascending order.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "order",
                          "type": "integer",
                          "description": "The order of the compute environment. Compute environments are tried in ascending order. For example, if two compute environments are associated with a job queue, the compute environment with a lower order integer value is tried for job placement first.",
                          "nested_items": []
                        },
                        {
                          "name": "computeEnvironment",
                          "type": "string",
                          "description": "The Amazon Resource Name (ARN) of the compute environment.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "jobStateTimeLimitActions",
                  "type": "list",
                  "description": "The set of actions that Batch perform on jobs that remain at the head of the job queue in the specified state longer than specified times. Batch will perform each action after maxTimeSeconds has passed.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "reason",
                          "type": "string",
                          "description": "The reason to log for the action being taken.",
                          "nested_items": []
                        },
                        {
                          "name": "state",
                          "type": "string",
                          "description": "The state of the job needed to trigger the action. The only supported value is RUNNABLE.",
                          "nested_items": []
                        },
                        {
                          "name": "maxTimeSeconds",
                          "type": "integer",
                          "description": "The approximate amount of time, in seconds, that must pass with the job in the specified state before the action is taken. The minimum value is 600 (10 minutes) and the maximum value is 86,400 (24 hours).",
                          "nested_items": []
                        },
                        {
                          "name": "action",
                          "type": "string",
                          "description": "The action to take when a job is at the head of the job queue in the specified state for the specified period of time. The only supported value is CANCEL, which will cancel the job.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "nextToken",
          "type": "string",
          "description": "The nextToken value to include in a future DescribeJobQueues request. When the results of a DescribeJobQueues request exceed maxResults, this value can be used to retrieve the next page of results. This value is null when there are no more results to return.",
          "nested_items": []
        }
      ]
    }
  ]
}