{
  "method_name": "submit_job",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/batch/client/submit_job.html",
  "description": "Submits an Batch job from a job definition. Parameters that are specified during  SubmitJob override parameters defined in the job definition. vCPU and memory requirements that are specified in the resourceRequirements objects in the job definition are the exception. They can't be overridden this way using the memory and vcpus parameters. Rather, you must specify updates to job definition parameters in a resourceRequirements object that's included in the containerOverrides parameter.",
  "parameters": [
    {
      "name": "jobName",
      "type": "string",
      "required": true,
      "description": "The name of the job. It can be up to 128 letters long. The first character must be alphanumeric, can contain uppercase and lowercase letters, numbers, hyphens (-), and underscores (_).",
      "nested_params": []
    },
    {
      "name": "jobQueue",
      "type": "string",
      "required": true,
      "description": "The job queue where the job is submitted. You can specify either the name or the Amazon Resource Name (ARN) of the queue.",
      "nested_params": []
    },
    {
      "name": "shareIdentifier",
      "type": "string",
      "required": false,
      "description": "The share identifier for the job. Don't specify this parameter if the job queue doesn't have a fair-share scheduling policy. If the job queue has a fair-share scheduling policy, then this parameter must be specified. This string is limited to 255 alphanumeric characters, and can be followed by an asterisk (*).",
      "nested_params": []
    },
    {
      "name": "schedulingPriorityOverride",
      "type": "integer",
      "required": false,
      "description": "The scheduling priority for the job. This only affects jobs in job queues with a fair-share policy. Jobs with a higher scheduling priority are scheduled before jobs with a lower scheduling priority. This overrides any scheduling priority in the job definition and works only within a single share identifier. The minimum supported value is 0 and the maximum supported value is 9999.",
      "nested_params": []
    },
    {
      "name": "arrayProperties",
      "type": "dict",
      "required": false,
      "description": "The array properties for the submitted job, such as the size of the array. The array size can be between 2 and 10,000. If you specify array properties for a job, it becomes an array job. For more information, see Array Jobs in the Batch User Guide. size (integer) --- The size of the array job.",
      "nested_params": [
        {
          "name": "size",
          "type": "integer",
          "required": false,
          "description": "The size of the array job.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "dependsOn",
      "type": "list",
      "required": false,
      "description": "A list of dependencies for the job. A job can depend upon a maximum of 20 jobs. You can specify a SEQUENTIAL type dependency without specifying a job ID for array jobs so that each child array job completes sequentially, starting at index 0. You can also specify an N_TO_N type dependency with a job ID for array jobs. In that case, each index child of this job must wait for the corresponding index child of each dependency to complete before it can begin. (dict) --- An object that represents an Batch job dependency. jobId (string) --- The job ID of the Batch job that's associated with this dependency. type (string) --- The type of the job dependency.",
      "nested_params": [
        {
          "name": "jobId",
          "type": "string",
          "required": false,
          "description": "The job ID of the Batch job that's associated with this dependency.",
          "nested_params": []
        },
        {
          "name": "type",
          "type": "string",
          "required": false,
          "description": "The type of the job dependency.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "jobDefinition",
      "type": "string",
      "required": true,
      "description": "The job definition used by this job. This value can be one of definition-name, definition-name:revision, or the Amazon Resource Name (ARN) for the job definition, with or without the revision ( ``arn:aws:batch:region:account:job-definition/definition-name:revision ``, or ``arn:aws:batch:region:account:job-definition/definition-name ``). If the revision is not specified, then the latest active revision is used.",
      "nested_params": []
    },
    {
      "name": "parameters",
      "type": "dict",
      "required": false,
      "description": "Additional parameters passed to the job that replace parameter substitution placeholders that are set in the job definition. Parameters are specified as a key and value pair mapping. Parameters in a SubmitJob request override any corresponding parameter defaults from the job definition. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "containerOverrides",
      "type": "dict",
      "required": true,
      "description": "An object with properties that override the defaults for the job definition that specify the name of a container in the specified job definition and the overrides it should receive. You can override the default command for a container, which is specified in the job definition or the Docker image, with a command override. You can also override existing environment variables on a container or add new environment variables to it with an environment override. vcpus (integer) --- This parameter is deprecated, use resourceRequirements to override the vcpus parameter that's set in the job definition. It's not supported for jobs running on Fargate resources. For jobs that run on Amazon EC2 resources, it overrides the vcpus parameter set in the job definition, but doesn't override any vCPU requirement specified in the resourceRequirements structure in the job definition. To override vCPU requirements that are specified in the resourceRequirements structure in the job definition, resourceRequirements must be specified in the SubmitJob request, with type set to VCPU and value set to the new value. For more information, see Can't override job definition resource requirements in the Batch User Guide. memory (integer) --- This parameter is deprecated, use resourceRequirements to override the memory requirements specified in the job definition. For jobs that run on Amazon EC2 resources, it overrides the memory parameter set in the job definition, but doesn't override any memory requirement that's specified in the resourceRequirements structure in the job definition. To override memory requirements that are specified in the resourceRequirements structure in the job definition, resourceRequirements must be specified in the SubmitJob request, with type set to MEMORY and value set to the new value. command (list) --- The command to send to the container that overrides the default command from the Docker image or the job definition. (string) --- instanceType (string) --- The instance type to use for a multi-node parallel job. environment (list) --- The environment variables to send to the container. You can add new environment variables, which are added to the container at launch, or you can override the existing environment variables from the Docker image or the job definition. (dict) --- A key-value pair object. name (string) --- The name of the key-value pair. For environment variables, this is the name of the environment variable. value (string) --- The value of the key-value pair. For environment variables, this is the value of the environment variable. resourceRequirements (list) --- The type and amount of resources to assign to a container. This overrides the settings in the job definition. The supported resources include GPU, MEMORY, and VCPU. (dict) --- The type and amount of a resource to assign to a container. The quantity of the specified resource to reserve for the container. The values vary based on the type specified. type='GPU' The number of physical GPUs to reserve for the container. Make sure that the number of GPUs reserved for all containers in a job doesn't exceed the number of available GPUs on the compute resource that the job is launched on. The memory hard limit (in MiB) present to the container. This parameter is supported for jobs that are running on Amazon EC2 resources. If your container attempts to exceed the memory specified, the container is terminated. This parameter maps to Memory in the Create a container section of the Docker Remote API and the --memory option to docker run. You must specify at least 4 MiB of memory for a job. This is required but can be specified in several places for multi-node parallel (MNP) jobs. It must be specified for each node at least once. For jobs that are running on Fargate resources, then value is the hard limit (in MiB), and must match one of the supported values and the VCPU values must be one of the values supported for that memory value. value = 512 VCPU = 0.25 value = 1024 VCPU = 0.25 or 0.5 value = 2048 VCPU = 0.25, 0.5, or 1 value = 3072 VCPU = 0.5, or 1 value = 4096 VCPU = 0.5, 1, or 2 value = 5120, 6144, or 7168 VCPU = 1 or 2 value = 8192 VCPU = 1, 2, or 4 value = 9216, 10240, 11264, 12288, 13312, 14336, or 15360 VCPU = 2 or 4 value = 16384 VCPU = 2, 4, or 8 value = 17408, 18432, 19456, 21504, 22528, 23552, 25600, 26624, 27648, 29696, or 30720 VCPU = 4 value = 20480, 24576, or 28672 VCPU = 4 or 8 value = 36864, 45056, 53248, or 61440 VCPU = 8 value = 32768, 40960, 49152, or 57344 VCPU = 8 or 16 value = 65536, 73728, 81920, 90112, 98304, 106496, 114688, or 122880 VCPU = 16 type='VCPU' The number of vCPUs reserved for the container. This parameter maps to CpuShares in the Create a container section of the Docker Remote API and the --cpu-shares option to docker run. Each vCPU is equivalent to 1,024 CPU shares. For Amazon EC2 resources, you must specify at least one vCPU. This is required but can be specified in several places; it must be specified for each node at least once. The default for the Fargate On-Demand vCPU resource count quota is 6 vCPUs. For more information about Fargate quotas, see Fargate quotas in the Amazon Web Services General Reference. For jobs that are running on Fargate resources, then value must match one of the supported values and the MEMORY values must be one of the values supported for that VCPU value. The supported values are 0.25, 0.5, 1, 2, 4, 8, and 16 value = 0.25 MEMORY = 512, 1024, or 2048 value = 0.5 MEMORY = 1024, 2048, 3072, or 4096 value = 1 MEMORY = 2048, 3072, 4096, 5120, 6144, 7168, or 8192 value = 2 MEMORY = 4096, 5120, 6144, 7168, 8192, 9216, 10240, 11264, 12288, 13312, 14336, 15360, or 16384 value = 4 MEMORY = 8192, 9216, 10240, 11264, 12288, 13312, 14336, 15360, 16384, 17408, 18432, 19456, 20480, 21504, 22528, 23552, 24576, 25600, 26624, 27648, 28672, 29696, or 30720 value = 8 MEMORY = 16384, 20480, 24576, 28672, 32768, 36864, 40960, 45056, 49152, 53248, 57344, or 61440 value = 16 MEMORY = 32768, 40960, 49152, 57344, 65536, 73728, 81920, 90112, 98304, 106496, 114688, or 122880 The type of resource to assign to a container. The supported resources include GPU, MEMORY, and VCPU.",
      "nested_params": [
        {
          "name": "vcpus",
          "type": "integer",
          "required": false,
          "description": "This parameter is deprecated, use resourceRequirements to override the vcpus parameter that's set in the job definition. It's not supported for jobs running on Fargate resources. For jobs that run on Amazon EC2 resources, it overrides the vcpus parameter set in the job definition, but doesn't override any vCPU requirement specified in the resourceRequirements structure in the job definition. To override vCPU requirements that are specified in the resourceRequirements structure in the job definition, resourceRequirements must be specified in the SubmitJob request, with type set to VCPU and value set to the new value. For more information, see Can't override job definition resource requirements in the Batch User Guide.",
          "nested_params": []
        },
        {
          "name": "memory",
          "type": "integer",
          "required": false,
          "description": "This parameter is deprecated, use resourceRequirements to override the memory requirements specified in the job definition. It's not supported for jobs running on Fargate resources. For jobs that run on Amazon EC2 resources, it overrides the memory parameter set in the job definition, but doesn't override any memory requirement that's specified in the resourceRequirements structure in the job definition. To override memory requirements that are specified in the resourceRequirements structure in the job definition, resourceRequirements must be specified in the SubmitJob request, with type set to MEMORY and value set to the new value. For more information, see Can't override job definition resource requirements in the Batch User Guide.",
          "nested_params": []
        },
        {
          "name": "command",
          "type": "list",
          "required": false,
          "description": "The command to send to the container that overrides the default command from the Docker image or the job definition.",
          "nested_params": []
        },
        {
          "name": "instanceType",
          "type": "string",
          "required": false,
          "description": "The instance type to use for a multi-node parallel job.",
          "nested_params": []
        },
        {
          "name": "environment",
          "type": "list",
          "required": false,
          "description": "The environment variables to send to the container. You can add new environment variables, which are added to the container at launch, or you can override the existing environment variables from the Docker image or the job definition.",
          "nested_params": [
            {
              "name": "name",
              "type": "string",
              "required": false,
              "description": "The name of the key-value pair. For environment variables, this is the name of the environment variable.",
              "nested_params": []
            },
            {
              "name": "value",
              "type": "string",
              "required": false,
              "description": "The value of the key-value pair. For environment variables, this is the value of the environment variable.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "resourceRequirements",
          "type": "list",
          "required": false,
          "description": "The type and amount of resources to assign to a container. This overrides the settings in the job definition. The supported resources include GPU, MEMORY, and VCPU.",
          "nested_params": [
            {
              "name": "value",
              "type": "string",
              "required": false,
              "description": "The quantity of the specified resource to reserve for the container. The values vary based on the type specified. The number of physical GPUs to reserve for the container. Make sure that the number of GPUs reserved for all containers in a job doesn't exceed the number of available GPUs on the compute resource that the job is launched on. The memory hard limit (in MiB) present to the container. This parameter is supported for jobs that are running on Amazon EC2 resources. If your container attempts to exceed the memory specified, the container is terminated. This parameter maps to Memory in the Create a container section of the Docker Remote API and the --memory option to docker run. You must specify at least 4 MiB of memory for a job. This is required but can be specified in several places for multi-node parallel (MNP) jobs. It must be specified for each node at least once. For jobs that are running on Fargate resources, then value is the hard limit (in MiB), and must match one of the supported values and the VCPU values must be one of the values supported for that memory value. VCPU = 0.25 VCPU = 0.25 or 0.5 VCPU = 0.25, 0.5, or 1 VCPU = 0.5, or 1 VCPU = 0.5, 1, or 2 VCPU = 1 or 2 VCPU = 1, 2, or 4 VCPU = 2 or 4 VCPU = 2, 4, or 8 VCPU = 4 VCPU = 4 or 8 VCPU = 8 VCPU = 8 or 16 VCPU = 16 The number of vCPUs reserved for the container. This parameter maps to CpuShares in the Create a container section of the Docker Remote API and the --cpu-shares option to docker run. Each vCPU is equivalent to 1,024 CPU shares. For Amazon EC2 resources, you must specify at least one vCPU. This is required but can be specified in several places; it must be specified for each node at least once. The default for the Fargate On-Demand vCPU resource count quota is 6 vCPUs. For more information about Fargate quotas, see Fargate quotas in the Amazon Web Services General Reference. For jobs that are running on Fargate resources, then value must match one of the supported values and the MEMORY values must be one of the values supported for that VCPU value. The supported values are 0.25, 0.5, 1, 2, 4, 8, and 16 MEMORY = 512, 1024, or 2048 MEMORY = 1024, 2048, 3072, or 4096 MEMORY = 2048, 3072, 4096, 5120, 6144, 7168, or 8192 MEMORY = 4096, 5120, 6144, 7168, 8192, 9216, 10240, 11264, 12288, 13312, 14336, 15360, or 16384 MEMORY = 8192, 9216, 10240, 11264, 12288, 13312, 14336, 15360, 16384, 17408, 18432, 19456, 20480, 21504, 22528, 23552, 24576, 25600, 26624, 27648, 28672, 29696, or 30720 MEMORY = 16384, 20480, 24576, 28672, 32768, 36864, 40960, 45056, 49152, 53248, 57344, or 61440 MEMORY = 32768, 40960, 49152, 57344, 65536, 73728, 81920, 90112, 98304, 106496, 114688, or 122880",
              "nested_params": []
            },
            {
              "name": "type",
              "type": "string",
              "required": false,
              "description": "The type of resource to assign to a container. The supported resources include GPU, MEMORY, and VCPU.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "nodeOverrides",
      "type": "dict",
      "required": true,
      "description": "A list of node overrides in JSON format that specify the node range to target and the container overrides for that node range. numNodes (integer) --- The number of nodes to use with a multi-node parallel job. This value overrides the number of nodes that are specified in the job definition. To use this override, you must meet the following conditions: There must be at least one node range in your job definition that has an open upper boundary, such as : or n:. The lower boundary of the node range that's specified in the job definition must be fewer than the number of nodes specified in the override. The main node index that's specified in the job definition must be fewer than the number of nodes specified in the override. nodePropertyOverrides (list) --- The node property overrides for the job. (dict) --- The object that represents any node overrides to a job definition that's used in a SubmitJob API operation. The range of nodes, using node index values, that's used to override. A range of 0:3 indicates nodes with index values of 0 through 3. If the starting range value is omitted ( :n), then 0 is used to start the range. If the ending range value is omitted ( n:), then the highest possible node index is used to end the range. containerOverrides (dict) --- The overrides that are sent to a node range. vcpus (integer) --- This parameter is deprecated, use resourceRequirements to override the vcpus parameter that's set in the job definition. It's not supported for jobs running on Fargate resources. For jobs that run on Amazon EC2 resources, it overrides the vcpus parameter set in the job definition, but doesn't override any vCPU requirement specified in the resourceRequirements structure in the job definition. To override vCPU requirements that are specified in the resourceRequirements structure in the job definition, resourceRequirements must be specified in the SubmitJob request, with type set to VCPU and value set to the new value. For more information, see Can't override job definition resource requirements in the Batch User Guide. memory (integer) --- This parameter is deprecated, use resourceRequirements to override the memory requirements specified in the job definition. For jobs that run on Amazon EC2 resources, it overrides the memory parameter set in the job definition, but doesn't override any memory requirement that's specified in the resourceRequirements structure in the job definition. To override memory requirements that are specified in the resourceRequirements structure in the job definition, resourceRequirements must be specified in the SubmitJob request, with type set to MEMORY and value set to the new value. command (list) --- The command to send to the container that overrides the default command from the Docker image or the job definition. (string) --- instanceType (string) --- The instance type to use for a multi-node parallel job. environment (list) --- The environment variables to send to the container. You can add new environment variables, which are added to the container at launch, or you can override the existing environment variables from the Docker image or the job definition. (dict) --- A key-value pair object. name (string) --- The name of the key-value pair. For environment variables, this is the name of the environment variable. value (string) --- The value of the key-value pair. For environment variables, this is the value of the environment variable. resourceRequirements (list) --- The type and amount of resources to assign to a container. This overrides the settings in the job definition. The supported resources include GPU, MEMORY, and VCPU. (dict) --- The type and amount of a resource to assign to a container. The quantity of the specified resource to reserve for the container. The values vary based on the type specified. type='GPU' The number of physical GPUs to reserve for the container. Make sure that the number of GPUs reserved for all containers in a job doesn't exceed the number of available GPUs on the compute resource that the job is launched on. The memory hard limit (in MiB) present to the container. This parameter is supported for jobs that are running on Amazon EC2 resources. If your container attempts to exceed the memory specified, the container is terminated. This parameter maps to Memory in the Create a container section of the Docker Remote API and the --memory option to docker run. You must specify at least 4 MiB of memory for a job. This is required but can be specified in several places for multi-node parallel (MNP) jobs. It must be specified for each node at least once. For jobs that are running on Fargate resources, then value is the hard limit (in MiB), and must match one of the supported values and the VCPU values must be one of the values supported for that memory value. value = 512 VCPU = 0.25 value = 1024 VCPU = 0.25 or 0.5 value = 2048 VCPU = 0.25, 0.5, or 1 value = 3072 VCPU = 0.5, or 1 value = 4096 VCPU = 0.5, 1, or 2 value = 5120, 6144, or 7168 VCPU = 1 or 2 value = 8192 VCPU = 1, 2, or 4 value = 9216, 10240, 11264, 12288, 13312, 14336, or 15360 VCPU = 2 or 4 value = 16384 VCPU = 2, 4, or 8 value = 17408, 18432, 19456, 21504, 22528, 23552, 25600, 26624, 27648, 29696, or 30720 VCPU = 4 value = 20480, 24576, or 28672 VCPU = 4 or 8 value = 36864, 45056, 53248, or 61440 VCPU = 8 value = 32768, 40960, 49152, or 57344 VCPU = 8 or 16 value = 65536, 73728, 81920, 90112, 98304, 106496, 114688, or 122880 VCPU = 16 type='VCPU' The number of vCPUs reserved for the container. This parameter maps to CpuShares in the Create a container section of the Docker Remote API and the --cpu-shares option to docker run. Each vCPU is equivalent to 1,024 CPU shares. For Amazon EC2 resources, you must specify at least one vCPU. This is required but can be specified in several places; it must be specified for each node at least once. The default for the Fargate On-Demand vCPU resource count quota is 6 vCPUs. For more information about Fargate quotas, see Fargate quotas in the Amazon Web Services General Reference. For jobs that are running on Fargate resources, then value must match one of the supported values and the MEMORY values must be one of the values supported for that VCPU value. The supported values are 0.25, 0.5, 1, 2, 4, 8, and 16 value = 0.25 MEMORY = 512, 1024, or 2048 value = 0.5 MEMORY = 1024, 2048, 3072, or 4096 value = 1 MEMORY = 2048, 3072, 4096, 5120, 6144, 7168, or 8192 value = 2 MEMORY = 4096, 5120, 6144, 7168, 8192, 9216, 10240, 11264, 12288, 13312, 14336, 15360, or 16384 value = 4 MEMORY = 8192, 9216, 10240, 11264, 12288, 13312, 14336, 15360, 16384, 17408, 18432, 19456, 20480, 21504, 22528, 23552, 24576, 25600, 26624, 27648, 28672, 29696, or 30720 value = 8 MEMORY = 16384, 20480, 24576, 28672, 32768, 36864, 40960, 45056, 49152, 53248, 57344, or 61440 value = 16 MEMORY = 32768, 40960, 49152, 57344, 65536, 73728, 81920, 90112, 98304, 106496, 114688, or 122880 The type of resource to assign to a container. ecsPropertiesOverride (dict) --- An object that contains the properties that you want to replace for the existing Amazon ECS resources of a job. taskProperties (list) --- The overrides for the Amazon ECS task definition of a job. (dict) --- An object that contains overrides for the task definition of a job. containers (list) --- The overrides for the container definition of a job. (dict) --- The overrides that should be sent to a container. For information about using Batch overrides when you connect event sources to targets, see BatchContainerOverrides. (string) --- environment (list) --- The environment variables to send to the container. name (string) --- A pointer to the container that you want to override. The container's name provides a unique identifier for the container being used. instanceTypes (list) --- An object that contains the instance types that you want to replace for the existing resources of a job. (string) --- eksPropertiesOverride (dict) --- An object that contains the properties that you want to replace for the existing Amazon EKS resources of a job. podProperties (dict) --- The overrides for the Kubernetes pod resources of a job. containers (list) --- The overrides for the container that's used on the Amazon EKS pod. (dict) --- Object representing any Kubernetes overrides to a job definition that's used in a SubmitJob API operation. The name must match a unique container name that you wish to override. image (string) --- The override of the Docker image that's used to start the container. (string) --- args (list) --- The arguments to the entrypoint to send to the container that overrides the default arguments from the Docker image or the job definition. For more information, see Dockerfile reference: CMD and Define a command an arguments for a pod in the Kubernetes documentation. (string) --- env (list) --- The environment variables to send to the container. You can add new environment variables, which are added to the container at launch. Or, you can override the existing environment variables from the Docker image or the job definition. (dict) --- An environment variable. The name of the environment variable. value (string) --- The value of the environment variable. resources (dict) --- The type and amount of resources to assign to a container. These override the settings in the job definition. The supported resources include memory, cpu, and nvidia.com/gpu. For more information, see Resource management for pods and containers in the Kubernetes documentation. limits (dict) --- The type and quantity of the resources to reserve for the container. The values vary based on the name that's specified. Resources can be requested using either the limits or the requests objects. memory The memory hard limit (in MiB) for the container, using whole integers, with a 'Mi' suffix. memory can be specified in limits, requests, or both. If memory is specified in both places, then the value that's specified in limits must be equal to the value that's specified in requests. The number of CPUs that's reserved for the container. Values must be an even multiple of 0.25. cpu can be specified in limits, requests, or both. If cpu is specified in both places, then the value that's specified in limits must be at least as large as the value that's specified in requests. nvidia.com/gpu The number of GPUs that's reserved for the container. Values must be a whole integer. (string) --- (string) --- requests (dict) --- The type and quantity of the resources to request for the container. Resources can be requested by using either the limits or the requests objects. If memory is specified in both, then the value that's specified in limits must be equal to the value that's specified in requests. The number of CPUs that are reserved for the container. If cpu is specified in both, then the value that's specified in limits must be at least as large as the value that's specified in requests. nvidia.com/gpu The number of GPUs that are reserved for the container. nvidia.com/gpu can be specified in limits, requests, or both. If nvidia.com/gpu is specified in both, then the value that's specified in limits must be equal to the value that's specified in requests. (string) --- (string) --- initContainers (list) --- The overrides for the initContainers defined in the Amazon EKS pod. These containers run before application containers, always run to completion, and must complete successfully before the next container starts. These containers are registered with the Amazon EKS Connector agent and persists the registration information in the Kubernetes backend data store. For more information, see Init Containers in the Kubernetes documentation. (string) --- (string) --- metadata (dict) --- Metadata about the overrides for the container that's used on the Amazon EKS pod. labels (dict) --- Key-value pairs used to identify, sort, and organize cube resources. Can contain up to 63 uppercase letters, lowercase letters, numbers, hyphens (-), and underscores (_). Labels can be added or modified at any time. Each resource can have multiple labels, but each key must be unique for a given object. (string) --- (string) --- annotations (dict) --- Key-value pairs used to attach arbitrary, non-identifying metadata to Kubernetes objects. Valid annotation keys have two segments: an optional prefix and a name, separated by a slash (/). The prefix is optional and must be 253 characters or less. If specified, the prefix must be a DNS subdomain-\u0088\u0092 a series of DNS labels separated by dots (.), and it must end with a slash (/). The name segment is required and must be 63 characters or less. It can include alphanumeric characters ([a-z0-9A-Z]), dashes (-), underscores (_), and dots (.), but must begin and end with an alphanumeric character. Annotations can be added or modified at any time. Each resource can have multiple annotations. (string) --- (string) --- namespace (string) --- The namespace of the Amazon EKS cluster. In Kubernetes, namespaces provide a mechanism for isolating groups of resources within a single cluster. Names of resources need to be unique within a namespace, but not across namespaces. Batch places Batch Job pods in this namespace. If this field is provided, the value can't be empty or null. It must meet the following requirements: 1-63 characters long Can't be set to default Can't start with kube Must match the following regular expression: ^[a-z0-9]([-a-z0-9]*[a-z0-9])?$ For more information, see Namespaces in the Kubernetes documentation. This namespace can be different from the kubernetesNamespace set in the compute environment's EksConfiguration, but must have identical role-based access control (RBAC) roles as the compute environment's kubernetesNamespace. For multi-node parallel jobs, the same value must be provided across all the node ranges. consumableResourcePropertiesOverride (dict) --- An object that contains overrides for the consumable resources of a job. consumableResourceList (list) --- The list of consumable resources required by a job. (dict) --- Information about a consumable resource required to run a job. consumableResource (string) --- The name or ARN of the consumable resource. quantity (integer) --- The quantity of the consumable resource that is needed.",
      "nested_params": [
        {
          "name": "numNodes",
          "type": "integer",
          "required": false,
          "description": "The number of nodes to use with a multi-node parallel job. This value overrides the number of nodes that are specified in the job definition. To use this override, you must meet the following conditions:",
          "nested_params": []
        },
        {
          "name": "nodePropertyOverrides",
          "type": "list",
          "required": false,
          "description": "The node property overrides for the job.",
          "nested_params": [
            {
              "name": "targetNodes",
              "type": "string",
              "required": false,
              "description": "The range of nodes, using node index values, that's used to override. A range of 0:3 indicates nodes with index values of 0 through 3. If the starting range value is omitted ( :n), then 0 is used to start the range. If the ending range value is omitted ( n:), then the highest possible node index is used to end the range.",
              "nested_params": []
            },
            {
              "name": "containerOverrides",
              "type": "dict",
              "required": false,
              "description": "The overrides that are sent to a node range.",
              "nested_params": [
                {
                  "name": "vcpus",
                  "type": "integer",
                  "required": false,
                  "description": "This parameter is deprecated, use resourceRequirements to override the vcpus parameter that's set in the job definition. It's not supported for jobs running on Fargate resources. For jobs that run on Amazon EC2 resources, it overrides the vcpus parameter set in the job definition, but doesn't override any vCPU requirement specified in the resourceRequirements structure in the job definition. To override vCPU requirements that are specified in the resourceRequirements structure in the job definition, resourceRequirements must be specified in the SubmitJob request, with type set to VCPU and value set to the new value. For more information, see Can't override job definition resource requirements in the Batch User Guide.",
                  "nested_params": []
                },
                {
                  "name": "memory",
                  "type": "integer",
                  "required": false,
                  "description": "This parameter is deprecated, use resourceRequirements to override the memory requirements specified in the job definition. It's not supported for jobs running on Fargate resources. For jobs that run on Amazon EC2 resources, it overrides the memory parameter set in the job definition, but doesn't override any memory requirement that's specified in the resourceRequirements structure in the job definition. To override memory requirements that are specified in the resourceRequirements structure in the job definition, resourceRequirements must be specified in the SubmitJob request, with type set to MEMORY and value set to the new value. For more information, see Can't override job definition resource requirements in the Batch User Guide.",
                  "nested_params": []
                },
                {
                  "name": "command",
                  "type": "list",
                  "required": false,
                  "description": "The command to send to the container that overrides the default command from the Docker image or the job definition.",
                  "nested_params": []
                },
                {
                  "name": "instanceType",
                  "type": "string",
                  "required": false,
                  "description": "The instance type to use for a multi-node parallel job.",
                  "nested_params": []
                },
                {
                  "name": "environment",
                  "type": "list",
                  "required": false,
                  "description": "The environment variables to send to the container. You can add new environment variables, which are added to the container at launch, or you can override the existing environment variables from the Docker image or the job definition.",
                  "nested_params": [
                    {
                      "name": "name",
                      "type": "string",
                      "required": false,
                      "description": "The name of the key-value pair. For environment variables, this is the name of the environment variable.",
                      "nested_params": []
                    },
                    {
                      "name": "value",
                      "type": "string",
                      "required": false,
                      "description": "The value of the key-value pair. For environment variables, this is the value of the environment variable.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "resourceRequirements",
                  "type": "list",
                  "required": false,
                  "description": "The type and amount of resources to assign to a container. This overrides the settings in the job definition. The supported resources include GPU, MEMORY, and VCPU.",
                  "nested_params": [
                    {
                      "name": "value",
                      "type": "string",
                      "required": false,
                      "description": "The quantity of the specified resource to reserve for the container. The values vary based on the type specified. The number of physical GPUs to reserve for the container. Make sure that the number of GPUs reserved for all containers in a job doesn't exceed the number of available GPUs on the compute resource that the job is launched on. The memory hard limit (in MiB) present to the container. This parameter is supported for jobs that are running on Amazon EC2 resources. If your container attempts to exceed the memory specified, the container is terminated. This parameter maps to Memory in the Create a container section of the Docker Remote API and the --memory option to docker run. You must specify at least 4 MiB of memory for a job. This is required but can be specified in several places for multi-node parallel (MNP) jobs. It must be specified for each node at least once. For jobs that are running on Fargate resources, then value is the hard limit (in MiB), and must match one of the supported values and the VCPU values must be one of the values supported for that memory value. VCPU = 0.25 VCPU = 0.25 or 0.5 VCPU = 0.25, 0.5, or 1 VCPU = 0.5, or 1 VCPU = 0.5, 1, or 2 VCPU = 1 or 2 VCPU = 1, 2, or 4 VCPU = 2 or 4 VCPU = 2, 4, or 8 VCPU = 4 VCPU = 4 or 8 VCPU = 8 VCPU = 8 or 16 VCPU = 16 The number of vCPUs reserved for the container. This parameter maps to CpuShares in the Create a container section of the Docker Remote API and the --cpu-shares option to docker run. Each vCPU is equivalent to 1,024 CPU shares. For Amazon EC2 resources, you must specify at least one vCPU. This is required but can be specified in several places; it must be specified for each node at least once. The default for the Fargate On-Demand vCPU resource count quota is 6 vCPUs. For more information about Fargate quotas, see Fargate quotas in the Amazon Web Services General Reference. For jobs that are running on Fargate resources, then value must match one of the supported values and the MEMORY values must be one of the values supported for that VCPU value. The supported values are 0.25, 0.5, 1, 2, 4, 8, and 16 MEMORY = 512, 1024, or 2048 MEMORY = 1024, 2048, 3072, or 4096 MEMORY = 2048, 3072, 4096, 5120, 6144, 7168, or 8192 MEMORY = 4096, 5120, 6144, 7168, 8192, 9216, 10240, 11264, 12288, 13312, 14336, 15360, or 16384 MEMORY = 8192, 9216, 10240, 11264, 12288, 13312, 14336, 15360, 16384, 17408, 18432, 19456, 20480, 21504, 22528, 23552, 24576, 25600, 26624, 27648, 28672, 29696, or 30720 MEMORY = 16384, 20480, 24576, 28672, 32768, 36864, 40960, 45056, 49152, 53248, 57344, or 61440 MEMORY = 32768, 40960, 49152, 57344, 65536, 73728, 81920, 90112, 98304, 106496, 114688, or 122880",
                      "nested_params": []
                    },
                    {
                      "name": "type",
                      "type": "string",
                      "required": false,
                      "description": "The type of resource to assign to a container. The supported resources include GPU, MEMORY, and VCPU.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "ecsPropertiesOverride",
              "type": "dict",
              "required": false,
              "description": "An object that contains the properties that you want to replace for the existing Amazon ECS resources of a job.",
              "nested_params": [
                {
                  "name": "taskProperties",
                  "type": "list",
                  "required": false,
                  "description": "The overrides for the Amazon ECS task definition of a job.",
                  "nested_params": [
                    {
                      "name": "containers",
                      "type": "list",
                      "required": false,
                      "description": "The overrides for the container definition of a job.",
                      "nested_params": [
                        {
                          "name": "command",
                          "type": "list",
                          "required": false,
                          "description": "The command to send to the container that overrides the default command from the Docker image or the job definition.",
                          "nested_params": []
                        },
                        {
                          "name": "environment",
                          "type": "list",
                          "required": false,
                          "description": "The environment variables to send to the container. You can add new environment variables, which are added to the container at launch, or you can override the existing environment variables from the Docker image or the job definition.",
                          "nested_params": [
                            {
                              "name": "name",
                              "type": "string",
                              "required": false,
                              "description": "The name of the key-value pair. For environment variables, this is the name of the environment variable.",
                              "nested_params": []
                            },
                            {
                              "name": "value",
                              "type": "string",
                              "required": false,
                              "description": "The value of the key-value pair. For environment variables, this is the value of the environment variable.",
                              "nested_params": []
                            }
                          ]
                        },
                        {
                          "name": "name",
                          "type": "string",
                          "required": false,
                          "description": "A pointer to the container that you want to override. The container's name provides a unique identifier for the container being used.",
                          "nested_params": []
                        },
                        {
                          "name": "resourceRequirements",
                          "type": "list",
                          "required": false,
                          "description": "The type and amount of resources to assign to a container. This overrides the settings in the job definition. The supported resources include GPU, MEMORY, and VCPU.",
                          "nested_params": [
                            {
                              "name": "value",
                              "type": "string",
                              "required": false,
                              "description": "The quantity of the specified resource to reserve for the container. The values vary based on the type specified. The number of physical GPUs to reserve for the container. Make sure that the number of GPUs reserved for all containers in a job doesn't exceed the number of available GPUs on the compute resource that the job is launched on. The memory hard limit (in MiB) present to the container. This parameter is supported for jobs that are running on Amazon EC2 resources. If your container attempts to exceed the memory specified, the container is terminated. This parameter maps to Memory in the Create a container section of the Docker Remote API and the --memory option to docker run. You must specify at least 4 MiB of memory for a job. This is required but can be specified in several places for multi-node parallel (MNP) jobs. It must be specified for each node at least once. For jobs that are running on Fargate resources, then value is the hard limit (in MiB), and must match one of the supported values and the VCPU values must be one of the values supported for that memory value. VCPU = 0.25 VCPU = 0.25 or 0.5 VCPU = 0.25, 0.5, or 1 VCPU = 0.5, or 1 VCPU = 0.5, 1, or 2 VCPU = 1 or 2 VCPU = 1, 2, or 4 VCPU = 2 or 4 VCPU = 2, 4, or 8 VCPU = 4 VCPU = 4 or 8 VCPU = 8 VCPU = 8 or 16 VCPU = 16 The number of vCPUs reserved for the container. This parameter maps to CpuShares in the Create a container section of the Docker Remote API and the --cpu-shares option to docker run. Each vCPU is equivalent to 1,024 CPU shares. For Amazon EC2 resources, you must specify at least one vCPU. This is required but can be specified in several places; it must be specified for each node at least once. The default for the Fargate On-Demand vCPU resource count quota is 6 vCPUs. For more information about Fargate quotas, see Fargate quotas in the Amazon Web Services General Reference. For jobs that are running on Fargate resources, then value must match one of the supported values and the MEMORY values must be one of the values supported for that VCPU value. The supported values are 0.25, 0.5, 1, 2, 4, 8, and 16 MEMORY = 512, 1024, or 2048 MEMORY = 1024, 2048, 3072, or 4096 MEMORY = 2048, 3072, 4096, 5120, 6144, 7168, or 8192 MEMORY = 4096, 5120, 6144, 7168, 8192, 9216, 10240, 11264, 12288, 13312, 14336, 15360, or 16384 MEMORY = 8192, 9216, 10240, 11264, 12288, 13312, 14336, 15360, 16384, 17408, 18432, 19456, 20480, 21504, 22528, 23552, 24576, 25600, 26624, 27648, 28672, 29696, or 30720 MEMORY = 16384, 20480, 24576, 28672, 32768, 36864, 40960, 45056, 49152, 53248, 57344, or 61440 MEMORY = 32768, 40960, 49152, 57344, 65536, 73728, 81920, 90112, 98304, 106496, 114688, or 122880",
                              "nested_params": []
                            },
                            {
                              "name": "type",
                              "type": "string",
                              "required": false,
                              "description": "The type of resource to assign to a container. The supported resources include GPU, MEMORY, and VCPU.",
                              "nested_params": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "instanceTypes",
              "type": "list",
              "required": false,
              "description": "An object that contains the instance types that you want to replace for the existing resources of a job.",
              "nested_params": []
            },
            {
              "name": "eksPropertiesOverride",
              "type": "dict",
              "required": false,
              "description": "An object that contains the properties that you want to replace for the existing Amazon EKS resources of a job.",
              "nested_params": [
                {
                  "name": "podProperties",
                  "type": "dict",
                  "required": false,
                  "description": "The overrides for the Kubernetes pod resources of a job.",
                  "nested_params": [
                    {
                      "name": "containers",
                      "type": "list",
                      "required": false,
                      "description": "The overrides for the container that's used on the Amazon EKS pod.",
                      "nested_params": [
                        {
                          "name": "name",
                          "type": "string",
                          "required": false,
                          "description": "A pointer to the container that you want to override. The name must match a unique container name that you wish to override.",
                          "nested_params": []
                        },
                        {
                          "name": "image",
                          "type": "string",
                          "required": false,
                          "description": "The override of the Docker image that's used to start the container.",
                          "nested_params": []
                        },
                        {
                          "name": "command",
                          "type": "list",
                          "required": false,
                          "description": "The command to send to the container that overrides the default command from the Docker image or the job definition.",
                          "nested_params": []
                        },
                        {
                          "name": "args",
                          "type": "list",
                          "required": false,
                          "description": "The arguments to the entrypoint to send to the container that overrides the default arguments from the Docker image or the job definition. For more information, see Dockerfile reference: CMD and Define a command an arguments for a pod in the Kubernetes documentation.",
                          "nested_params": []
                        },
                        {
                          "name": "env",
                          "type": "list",
                          "required": false,
                          "description": "The environment variables to send to the container. You can add new environment variables, which are added to the container at launch. Or, you can override the existing environment variables from the Docker image or the job definition.",
                          "nested_params": [
                            {
                              "name": "name",
                              "type": "string",
                              "required": false,
                              "description": "The name of the environment variable.",
                              "nested_params": []
                            },
                            {
                              "name": "value",
                              "type": "string",
                              "required": false,
                              "description": "The value of the environment variable.",
                              "nested_params": []
                            }
                          ]
                        },
                        {
                          "name": "resources",
                          "type": "dict",
                          "required": false,
                          "description": "The type and amount of resources to assign to a container. These override the settings in the job definition. The supported resources include memory, cpu, and nvidia.com/gpu. For more information, see Resource management for pods and containers in the Kubernetes documentation.",
                          "nested_params": [
                            {
                              "name": "limits",
                              "type": "dict",
                              "required": false,
                              "description": "The type and quantity of the resources to reserve for the container. The values vary based on the name that's specified. Resources can be requested using either the limits or the requests objects. The memory hard limit (in MiB) for the container, using whole integers, with a 'Mi' suffix. If your container attempts to exceed the memory specified, the container is terminated. You must specify at least 4 MiB of memory for a job. memory can be specified in limits, requests, or both. If memory is specified in both places, then the value that's specified in limits must be equal to the value that's specified in requests. The number of CPUs that's reserved for the container. Values must be an even multiple of 0.25. cpu can be specified in limits, requests, or both. If cpu is specified in both places, then the value that's specified in limits must be at least as large as the value that's specified in requests. The number of GPUs that's reserved for the container. Values must be a whole integer. If memory is specified in both places, then the value that's specified in limits must be equal to the value that's specified in requests.",
                              "nested_params": []
                            },
                            {
                              "name": "requests",
                              "type": "dict",
                              "required": false,
                              "description": "The type and quantity of the resources to request for the container. The values vary based on the name that's specified. Resources can be requested by using either the limits or the requests objects. The memory hard limit (in MiB) for the container, using whole integers, with a 'Mi' suffix. If your container attempts to exceed the memory specified, the container is terminated. You must specify at least 4 MiB of memory for a job. memory can be specified in limits, requests, or both. If memory is specified in both, then the value that's specified in limits must be equal to the value that's specified in requests. The number of CPUs that are reserved for the container. Values must be an even multiple of 0.25. cpu can be specified in limits, requests, or both. If cpu is specified in both, then the value that's specified in limits must be at least as large as the value that's specified in requests. The number of GPUs that are reserved for the container. Values must be a whole integer. nvidia.com/gpu can be specified in limits, requests, or both. If nvidia.com/gpu is specified in both, then the value that's specified in limits must be equal to the value that's specified in requests.",
                              "nested_params": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "initContainers",
                      "type": "list",
                      "required": false,
                      "description": "The overrides for the initContainers defined in the Amazon EKS pod. These containers run before application containers, always run to completion, and must complete successfully before the next container starts. These containers are registered with the Amazon EKS Connector agent and persists the registration information in the Kubernetes backend data store. For more information, see Init Containers in the Kubernetes documentation.",
                      "nested_params": [
                        {
                          "name": "name",
                          "type": "string",
                          "required": false,
                          "description": "A pointer to the container that you want to override. The name must match a unique container name that you wish to override.",
                          "nested_params": []
                        },
                        {
                          "name": "image",
                          "type": "string",
                          "required": false,
                          "description": "The override of the Docker image that's used to start the container.",
                          "nested_params": []
                        },
                        {
                          "name": "command",
                          "type": "list",
                          "required": false,
                          "description": "The command to send to the container that overrides the default command from the Docker image or the job definition.",
                          "nested_params": []
                        },
                        {
                          "name": "args",
                          "type": "list",
                          "required": false,
                          "description": "The arguments to the entrypoint to send to the container that overrides the default arguments from the Docker image or the job definition. For more information, see Dockerfile reference: CMD and Define a command an arguments for a pod in the Kubernetes documentation.",
                          "nested_params": []
                        },
                        {
                          "name": "env",
                          "type": "list",
                          "required": false,
                          "description": "The environment variables to send to the container. You can add new environment variables, which are added to the container at launch. Or, you can override the existing environment variables from the Docker image or the job definition.",
                          "nested_params": [
                            {
                              "name": "name",
                              "type": "string",
                              "required": false,
                              "description": "The name of the environment variable.",
                              "nested_params": []
                            },
                            {
                              "name": "value",
                              "type": "string",
                              "required": false,
                              "description": "The value of the environment variable.",
                              "nested_params": []
                            }
                          ]
                        },
                        {
                          "name": "resources",
                          "type": "dict",
                          "required": false,
                          "description": "The type and amount of resources to assign to a container. These override the settings in the job definition. The supported resources include memory, cpu, and nvidia.com/gpu. For more information, see Resource management for pods and containers in the Kubernetes documentation.",
                          "nested_params": [
                            {
                              "name": "limits",
                              "type": "dict",
                              "required": false,
                              "description": "The type and quantity of the resources to reserve for the container. The values vary based on the name that's specified. Resources can be requested using either the limits or the requests objects. The memory hard limit (in MiB) for the container, using whole integers, with a 'Mi' suffix. If your container attempts to exceed the memory specified, the container is terminated. You must specify at least 4 MiB of memory for a job. memory can be specified in limits, requests, or both. If memory is specified in both places, then the value that's specified in limits must be equal to the value that's specified in requests. The number of CPUs that's reserved for the container. Values must be an even multiple of 0.25. cpu can be specified in limits, requests, or both. If cpu is specified in both places, then the value that's specified in limits must be at least as large as the value that's specified in requests. The number of GPUs that's reserved for the container. Values must be a whole integer. If memory is specified in both places, then the value that's specified in limits must be equal to the value that's specified in requests.",
                              "nested_params": []
                            },
                            {
                              "name": "requests",
                              "type": "dict",
                              "required": false,
                              "description": "The type and quantity of the resources to request for the container. The values vary based on the name that's specified. Resources can be requested by using either the limits or the requests objects. The memory hard limit (in MiB) for the container, using whole integers, with a 'Mi' suffix. If your container attempts to exceed the memory specified, the container is terminated. You must specify at least 4 MiB of memory for a job. memory can be specified in limits, requests, or both. If memory is specified in both, then the value that's specified in limits must be equal to the value that's specified in requests. The number of CPUs that are reserved for the container. Values must be an even multiple of 0.25. cpu can be specified in limits, requests, or both. If cpu is specified in both, then the value that's specified in limits must be at least as large as the value that's specified in requests. The number of GPUs that are reserved for the container. Values must be a whole integer. nvidia.com/gpu can be specified in limits, requests, or both. If nvidia.com/gpu is specified in both, then the value that's specified in limits must be equal to the value that's specified in requests.",
                              "nested_params": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "metadata",
                      "type": "dict",
                      "required": false,
                      "description": "Metadata about the overrides for the container that's used on the Amazon EKS pod.",
                      "nested_params": [
                        {
                          "name": "labels",
                          "type": "dict",
                          "required": false,
                          "description": "Key-value pairs used to identify, sort, and organize cube resources. Can contain up to 63 uppercase letters, lowercase letters, numbers, hyphens (-), and underscores (_). Labels can be added or modified at any time. Each resource can have multiple labels, but each key must be unique for a given object.",
                          "nested_params": []
                        },
                        {
                          "name": "annotations",
                          "type": "dict",
                          "required": false,
                          "description": "Key-value pairs used to attach arbitrary, non-identifying metadata to Kubernetes objects. Valid annotation keys have two segments: an optional prefix and a name, separated by a slash (/).",
                          "nested_params": []
                        },
                        {
                          "name": "namespace",
                          "type": "string",
                          "required": false,
                          "description": "The namespace of the Amazon EKS cluster. In Kubernetes, namespaces provide a mechanism for isolating groups of resources within a single cluster. Names of resources need to be unique within a namespace, but not across namespaces. Batch places Batch Job pods in this namespace. If this field is provided, the value can't be empty or null. It must meet the following requirements:",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "consumableResourcePropertiesOverride",
              "type": "dict",
              "required": false,
              "description": "An object that contains overrides for the consumable resources of a job.",
              "nested_params": [
                {
                  "name": "consumableResourceList",
                  "type": "list",
                  "required": false,
                  "description": "The list of consumable resources required by a job.",
                  "nested_params": [
                    {
                      "name": "consumableResource",
                      "type": "string",
                      "required": false,
                      "description": "The name or ARN of the consumable resource.",
                      "nested_params": []
                    },
                    {
                      "name": "quantity",
                      "type": "integer",
                      "required": false,
                      "description": "The quantity of the consumable resource that is needed.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "retryStrategy",
      "type": "dict",
      "required": true,
      "description": "The retry strategy to use for failed jobs from this  SubmitJob operation. When a retry strategy is specified here, it overrides the retry strategy defined in the job definition. attempts (integer) --- The number of times to move a job to the RUNNABLE status. You can specify between 1 and 10 attempts. If the value of attempts is greater than one, the job is retried on failure the same number of attempts as the value. evaluateOnExit (list) --- Array of up to 5 objects that specify the conditions where jobs are retried or failed. If this parameter is specified, then the attempts parameter must also be specified. If none of the listed conditions match, then the job is retried. (dict) --- Specifies an array of up to 5 conditions to be met, and an action to take ( RETRY or EXIT) if all conditions are met. If none of the EvaluateOnExit conditions in a RetryStrategy match, then the job is retried. onStatusReason (string) --- Contains a glob pattern to match against the StatusReason returned for a job. The pattern can contain up to 512 characters. It can contain letters, numbers, periods (.), colons (:), and white spaces (including spaces or tabs). It can optionally end with an asterisk (*) so that only the start of the string needs to be an exact match. onReason (string) --- Contains a glob pattern to match against the Reason returned for a job. It can contain letters, numbers, periods (.), colons (:), and white space (including spaces and tabs). onExitCode (string) --- Contains a glob pattern to match against the decimal representation of the ExitCode returned for a job. The pattern can be up to 512 characters long. It can contain only numbers, and can end with an asterisk (*) so that only the start of the string needs to be an exact match. The string can contain up to 512 characters. Specifies the action to take if all of the specified conditions ( onStatusReason, onReason, and onExitCode) are met. The values aren't case sensitive.",
      "nested_params": [
        {
          "name": "attempts",
          "type": "integer",
          "required": false,
          "description": "The number of times to move a job to the RUNNABLE status. You can specify between 1 and 10 attempts. If the value of attempts is greater than one, the job is retried on failure the same number of attempts as the value.",
          "nested_params": []
        },
        {
          "name": "evaluateOnExit",
          "type": "list",
          "required": false,
          "description": "Array of up to 5 objects that specify the conditions where jobs are retried or failed. If this parameter is specified, then the attempts parameter must also be specified. If none of the listed conditions match, then the job is retried.",
          "nested_params": [
            {
              "name": "onStatusReason",
              "type": "string",
              "required": false,
              "description": "Contains a glob pattern to match against the StatusReason returned for a job. The pattern can contain up to 512 characters. It can contain letters, numbers, periods (.), colons (:), and white spaces (including spaces or tabs). It can optionally end with an asterisk (*) so that only the start of the string needs to be an exact match.",
              "nested_params": []
            },
            {
              "name": "onReason",
              "type": "string",
              "required": false,
              "description": "Contains a glob pattern to match against the Reason returned for a job. The pattern can contain up to 512 characters. It can contain letters, numbers, periods (.), colons (:), and white space (including spaces and tabs). It can optionally end with an asterisk (*) so that only the start of the string needs to be an exact match.",
              "nested_params": []
            },
            {
              "name": "onExitCode",
              "type": "string",
              "required": false,
              "description": "Contains a glob pattern to match against the decimal representation of the ExitCode returned for a job. The pattern can be up to 512 characters long. It can contain only numbers, and can end with an asterisk (*) so that only the start of the string needs to be an exact match. The string can contain up to 512 characters.",
              "nested_params": []
            },
            {
              "name": "action",
              "type": "string",
              "required": false,
              "description": "Specifies the action to take if all of the specified conditions ( onStatusReason, onReason, and onExitCode) are met. The values aren't case sensitive.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "propagateTags",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "timeout",
      "type": "dict",
      "required": false,
      "description": "The timeout configuration for this  SubmitJob operation. You can specify a timeout duration after which Batch terminates your jobs if they haven't finished. If a job is terminated due to a timeout, it isn't retried. The minimum value for the timeout is 60 seconds. This configuration overrides any timeout configuration specified in the job definition. For array jobs, child jobs have the same timeout configuration as the parent job. For more information, see Job Timeouts in the Amazon Elastic Container Service Developer Guide. attemptDurationSeconds (integer) --- The job timeout time (in seconds) that's measured from the job attempt's startedAt timestamp. After this time passes, Batch terminates your jobs if they aren't finished. For array jobs, the timeout applies to the child jobs, not to the parent array job. For multi-node parallel (MNP) jobs, the timeout applies to the whole job, not to the individual nodes.",
      "nested_params": [
        {
          "name": "attemptDurationSeconds",
          "type": "integer",
          "required": false,
          "description": "The job timeout time (in seconds) that's measured from the job attempt's startedAt timestamp. After this time passes, Batch terminates your jobs if they aren't finished. The minimum value for the timeout is 60 seconds. For array jobs, the timeout applies to the child jobs, not to the parent array job. For multi-node parallel (MNP) jobs, the timeout applies to the whole job, not to the individual nodes.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "tags",
      "type": "dict",
      "required": false,
      "description": "The tags that you apply to the job request to help you categorize and organize your resources. Each tag consists of a key and an optional value. For more information, see Tagging Amazon Web Services Resources in Amazon Web Services General Reference. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "eksPropertiesOverride",
      "type": "dict",
      "required": true,
      "description": "An object, with properties that override defaults for the job definition, can only be specified for jobs that are run on Amazon EKS resources. podProperties (dict) --- The overrides for the Kubernetes pod resources of a job. containers (list) --- The overrides for the container that's used on the Amazon EKS pod. (dict) --- Object representing any Kubernetes overrides to a job definition that's used in a SubmitJob API operation. name (string) --- A pointer to the container that you want to override. The name must match a unique container name that you wish to override. image (string) --- The override of the Docker image that's used to start the container. command (list) --- The command to send to the container that overrides the default command from the Docker image or the job definition. (string) --- args (list) --- The arguments to the entrypoint to send to the container that overrides the default arguments from the Docker image or the job definition. For more information, see Dockerfile reference: CMD and Define a command an arguments for a pod in the Kubernetes documentation. (string) --- env (list) --- The environment variables to send to the container. You can add new environment variables, which are added to the container at launch. Or, you can override the existing environment variables from the Docker image or the job definition. (dict) --- An environment variable. The name of the environment variable. value (string) --- The value of the environment variable. resources (dict) --- The type and amount of resources to assign to a container. These override the settings in the job definition. The supported resources include memory, cpu, and nvidia.com/gpu. For more information, see Resource management for pods and containers in the Kubernetes documentation. limits (dict) --- The type and quantity of the resources to reserve for the container. The values vary based on the name that's specified. Resources can be requested using either the limits or the requests objects. memory The memory hard limit (in MiB) for the container, using whole integers, with a 'Mi' suffix. If your container attempts to exceed the memory specified, the container is terminated. You must specify at least 4 MiB of memory for a job. memory can be specified in limits, requests, or both. If memory is specified in both places, then the value that's specified in limits must be equal to the value that's specified in requests. The number of CPUs that's reserved for the container. Values must be an even multiple of 0.25. cpu can be specified in limits, requests, or both. If cpu is specified in both places, then the value that's specified in limits must be at least as large as the value that's specified in requests. nvidia.com/gpu The number of GPUs that's reserved for the container. Values must be a whole integer. (string) --- (string) --- requests (dict) --- The type and quantity of the resources to request for the container. Resources can be requested by using either the limits or the requests objects. If memory is specified in both, then the value that's specified in limits must be equal to the value that's specified in requests. The number of CPUs that are reserved for the container. If cpu is specified in both, then the value that's specified in limits must be at least as large as the value that's specified in requests. nvidia.com/gpu The number of GPUs that are reserved for the container. nvidia.com/gpu can be specified in limits, requests, or both. If nvidia.com/gpu is specified in both, then the value that's specified in limits must be equal to the value that's specified in requests. (string) --- (string) --- initContainers (list) --- The overrides for the initContainers defined in the Amazon EKS pod. These containers run before application containers, always run to completion, and must complete successfully before the next container starts. These containers are registered with the Amazon EKS Connector agent and persists the registration information in the Kubernetes backend data store. For more information, see Init Containers in the Kubernetes documentation. (string) --- (string) --- metadata (dict) --- Metadata about the overrides for the container that's used on the Amazon EKS pod. labels (dict) --- Key-value pairs used to identify, sort, and organize cube resources. Can contain up to 63 uppercase letters, lowercase letters, numbers, hyphens (-), and underscores (_). Labels can be added or modified at any time. Each resource can have multiple labels, but each key must be unique for a given object. (string) --- (string) --- annotations (dict) --- Key-value pairs used to attach arbitrary, non-identifying metadata to Kubernetes objects. Valid annotation keys have two segments: an optional prefix and a name, separated by a slash (/). The prefix is optional and must be 253 characters or less. If specified, the prefix must be a DNS subdomain-\u0088\u0092 a series of DNS labels separated by dots (.), and it must end with a slash (/). The name segment is required and must be 63 characters or less. It can include alphanumeric characters ([a-z0-9A-Z]), dashes (-), underscores (_), and dots (.), but must begin and end with an alphanumeric character. Annotations can be added or modified at any time. Each resource can have multiple annotations. (string) --- (string) --- namespace (string) --- The namespace of the Amazon EKS cluster. In Kubernetes, namespaces provide a mechanism for isolating groups of resources within a single cluster. Names of resources need to be unique within a namespace, but not across namespaces. Batch places Batch Job pods in this namespace. If this field is provided, the value can't be empty or null. It must meet the following requirements: 1-63 characters long Can't be set to default Can't start with kube Must match the following regular expression: ^[a-z0-9]([-a-z0-9]*[a-z0-9])?$ For more information, see Namespaces in the Kubernetes documentation. This namespace can be different from the kubernetesNamespace set in the compute environment's EksConfiguration, but must have identical role-based access control (RBAC) roles as the compute environment's kubernetesNamespace. For multi-node parallel jobs, the same value must be provided across all the node ranges.",
      "nested_params": [
        {
          "name": "podProperties",
          "type": "dict",
          "required": false,
          "description": "The overrides for the Kubernetes pod resources of a job.",
          "nested_params": [
            {
              "name": "containers",
              "type": "list",
              "required": false,
              "description": "The overrides for the container that's used on the Amazon EKS pod.",
              "nested_params": [
                {
                  "name": "name",
                  "type": "string",
                  "required": false,
                  "description": "A pointer to the container that you want to override. The name must match a unique container name that you wish to override.",
                  "nested_params": []
                },
                {
                  "name": "image",
                  "type": "string",
                  "required": false,
                  "description": "The override of the Docker image that's used to start the container.",
                  "nested_params": []
                },
                {
                  "name": "command",
                  "type": "list",
                  "required": false,
                  "description": "The command to send to the container that overrides the default command from the Docker image or the job definition.",
                  "nested_params": []
                },
                {
                  "name": "args",
                  "type": "list",
                  "required": false,
                  "description": "The arguments to the entrypoint to send to the container that overrides the default arguments from the Docker image or the job definition. For more information, see Dockerfile reference: CMD and Define a command an arguments for a pod in the Kubernetes documentation.",
                  "nested_params": []
                },
                {
                  "name": "env",
                  "type": "list",
                  "required": false,
                  "description": "The environment variables to send to the container. You can add new environment variables, which are added to the container at launch. Or, you can override the existing environment variables from the Docker image or the job definition.",
                  "nested_params": [
                    {
                      "name": "name",
                      "type": "string",
                      "required": false,
                      "description": "The name of the environment variable.",
                      "nested_params": []
                    },
                    {
                      "name": "value",
                      "type": "string",
                      "required": false,
                      "description": "The value of the environment variable.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "resources",
                  "type": "dict",
                  "required": false,
                  "description": "The type and amount of resources to assign to a container. These override the settings in the job definition. The supported resources include memory, cpu, and nvidia.com/gpu. For more information, see Resource management for pods and containers in the Kubernetes documentation.",
                  "nested_params": [
                    {
                      "name": "limits",
                      "type": "dict",
                      "required": false,
                      "description": "The type and quantity of the resources to reserve for the container. The values vary based on the name that's specified. Resources can be requested using either the limits or the requests objects. The memory hard limit (in MiB) for the container, using whole integers, with a 'Mi' suffix. If your container attempts to exceed the memory specified, the container is terminated. You must specify at least 4 MiB of memory for a job. memory can be specified in limits, requests, or both. If memory is specified in both places, then the value that's specified in limits must be equal to the value that's specified in requests. The number of CPUs that's reserved for the container. Values must be an even multiple of 0.25. cpu can be specified in limits, requests, or both. If cpu is specified in both places, then the value that's specified in limits must be at least as large as the value that's specified in requests. The number of GPUs that's reserved for the container. Values must be a whole integer. If memory is specified in both places, then the value that's specified in limits must be equal to the value that's specified in requests.",
                      "nested_params": []
                    },
                    {
                      "name": "requests",
                      "type": "dict",
                      "required": false,
                      "description": "The type and quantity of the resources to request for the container. The values vary based on the name that's specified. Resources can be requested by using either the limits or the requests objects. The memory hard limit (in MiB) for the container, using whole integers, with a 'Mi' suffix. If your container attempts to exceed the memory specified, the container is terminated. You must specify at least 4 MiB of memory for a job. memory can be specified in limits, requests, or both. If memory is specified in both, then the value that's specified in limits must be equal to the value that's specified in requests. The number of CPUs that are reserved for the container. Values must be an even multiple of 0.25. cpu can be specified in limits, requests, or both. If cpu is specified in both, then the value that's specified in limits must be at least as large as the value that's specified in requests. The number of GPUs that are reserved for the container. Values must be a whole integer. nvidia.com/gpu can be specified in limits, requests, or both. If nvidia.com/gpu is specified in both, then the value that's specified in limits must be equal to the value that's specified in requests.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "initContainers",
              "type": "list",
              "required": false,
              "description": "The overrides for the initContainers defined in the Amazon EKS pod. These containers run before application containers, always run to completion, and must complete successfully before the next container starts. These containers are registered with the Amazon EKS Connector agent and persists the registration information in the Kubernetes backend data store. For more information, see Init Containers in the Kubernetes documentation.",
              "nested_params": [
                {
                  "name": "name",
                  "type": "string",
                  "required": false,
                  "description": "A pointer to the container that you want to override. The name must match a unique container name that you wish to override.",
                  "nested_params": []
                },
                {
                  "name": "image",
                  "type": "string",
                  "required": false,
                  "description": "The override of the Docker image that's used to start the container.",
                  "nested_params": []
                },
                {
                  "name": "command",
                  "type": "list",
                  "required": false,
                  "description": "The command to send to the container that overrides the default command from the Docker image or the job definition.",
                  "nested_params": []
                },
                {
                  "name": "args",
                  "type": "list",
                  "required": false,
                  "description": "The arguments to the entrypoint to send to the container that overrides the default arguments from the Docker image or the job definition. For more information, see Dockerfile reference: CMD and Define a command an arguments for a pod in the Kubernetes documentation.",
                  "nested_params": []
                },
                {
                  "name": "env",
                  "type": "list",
                  "required": false,
                  "description": "The environment variables to send to the container. You can add new environment variables, which are added to the container at launch. Or, you can override the existing environment variables from the Docker image or the job definition.",
                  "nested_params": [
                    {
                      "name": "name",
                      "type": "string",
                      "required": false,
                      "description": "The name of the environment variable.",
                      "nested_params": []
                    },
                    {
                      "name": "value",
                      "type": "string",
                      "required": false,
                      "description": "The value of the environment variable.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "resources",
                  "type": "dict",
                  "required": false,
                  "description": "The type and amount of resources to assign to a container. These override the settings in the job definition. The supported resources include memory, cpu, and nvidia.com/gpu. For more information, see Resource management for pods and containers in the Kubernetes documentation.",
                  "nested_params": [
                    {
                      "name": "limits",
                      "type": "dict",
                      "required": false,
                      "description": "The type and quantity of the resources to reserve for the container. The values vary based on the name that's specified. Resources can be requested using either the limits or the requests objects. The memory hard limit (in MiB) for the container, using whole integers, with a 'Mi' suffix. If your container attempts to exceed the memory specified, the container is terminated. You must specify at least 4 MiB of memory for a job. memory can be specified in limits, requests, or both. If memory is specified in both places, then the value that's specified in limits must be equal to the value that's specified in requests. The number of CPUs that's reserved for the container. Values must be an even multiple of 0.25. cpu can be specified in limits, requests, or both. If cpu is specified in both places, then the value that's specified in limits must be at least as large as the value that's specified in requests. The number of GPUs that's reserved for the container. Values must be a whole integer. If memory is specified in both places, then the value that's specified in limits must be equal to the value that's specified in requests.",
                      "nested_params": []
                    },
                    {
                      "name": "requests",
                      "type": "dict",
                      "required": false,
                      "description": "The type and quantity of the resources to request for the container. The values vary based on the name that's specified. Resources can be requested by using either the limits or the requests objects. The memory hard limit (in MiB) for the container, using whole integers, with a 'Mi' suffix. If your container attempts to exceed the memory specified, the container is terminated. You must specify at least 4 MiB of memory for a job. memory can be specified in limits, requests, or both. If memory is specified in both, then the value that's specified in limits must be equal to the value that's specified in requests. The number of CPUs that are reserved for the container. Values must be an even multiple of 0.25. cpu can be specified in limits, requests, or both. If cpu is specified in both, then the value that's specified in limits must be at least as large as the value that's specified in requests. The number of GPUs that are reserved for the container. Values must be a whole integer. nvidia.com/gpu can be specified in limits, requests, or both. If nvidia.com/gpu is specified in both, then the value that's specified in limits must be equal to the value that's specified in requests.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "metadata",
              "type": "dict",
              "required": false,
              "description": "Metadata about the overrides for the container that's used on the Amazon EKS pod.",
              "nested_params": [
                {
                  "name": "labels",
                  "type": "dict",
                  "required": false,
                  "description": "Key-value pairs used to identify, sort, and organize cube resources. Can contain up to 63 uppercase letters, lowercase letters, numbers, hyphens (-), and underscores (_). Labels can be added or modified at any time. Each resource can have multiple labels, but each key must be unique for a given object.",
                  "nested_params": []
                },
                {
                  "name": "annotations",
                  "type": "dict",
                  "required": false,
                  "description": "Key-value pairs used to attach arbitrary, non-identifying metadata to Kubernetes objects. Valid annotation keys have two segments: an optional prefix and a name, separated by a slash (/).",
                  "nested_params": []
                },
                {
                  "name": "namespace",
                  "type": "string",
                  "required": false,
                  "description": "The namespace of the Amazon EKS cluster. In Kubernetes, namespaces provide a mechanism for isolating groups of resources within a single cluster. Names of resources need to be unique within a namespace, but not across namespaces. Batch places Batch Job pods in this namespace. If this field is provided, the value can't be empty or null. It must meet the following requirements:",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "ecsPropertiesOverride",
      "type": "dict",
      "required": true,
      "description": "An object, with properties that override defaults for the job definition, can only be specified for jobs that are run on Amazon ECS resources. taskProperties (list) --- The overrides for the Amazon ECS task definition of a job. (dict) --- An object that contains overrides for the task definition of a job. containers (list) --- The overrides for the container definition of a job. (dict) --- The overrides that should be sent to a container. For information about using Batch overrides when you connect event sources to targets, see BatchContainerOverrides. command (list) --- The command to send to the container that overrides the default command from the Docker image or the job definition. (string) --- environment (list) --- The environment variables to send to the container. You can add new environment variables, which are added to the container at launch, or you can override the existing environment variables from the Docker image or the job definition. (dict) --- A key-value pair object. name (string) --- The name of the key-value pair. For environment variables, this is the name of the environment variable. value (string) --- The value of the key-value pair. For environment variables, this is the value of the environment variable. name (string) --- A pointer to the container that you want to override. The container's name provides a unique identifier for the container being used. resourceRequirements (list) --- The type and amount of resources to assign to a container. This overrides the settings in the job definition. The supported resources include GPU, MEMORY, and VCPU. (dict) --- The type and amount of a resource to assign to a container. The quantity of the specified resource to reserve for the container. The values vary based on the type specified. type='GPU' The number of physical GPUs to reserve for the container. Make sure that the number of GPUs reserved for all containers in a job doesn't exceed the number of available GPUs on the compute resource that the job is launched on. The memory hard limit (in MiB) present to the container. This parameter is supported for jobs that are running on Amazon EC2 resources. If your container attempts to exceed the memory specified, the container is terminated. This parameter maps to Memory in the Create a container section of the Docker Remote API and the --memory option to docker run. You must specify at least 4 MiB of memory for a job. This is required but can be specified in several places for multi-node parallel (MNP) jobs. It must be specified for each node at least once. For jobs that are running on Fargate resources, then value is the hard limit (in MiB), and must match one of the supported values and the VCPU values must be one of the values supported for that memory value. value = 512 VCPU = 0.25 value = 1024 VCPU = 0.25 or 0.5 value = 2048 VCPU = 0.25, 0.5, or 1 value = 3072 VCPU = 0.5, or 1 value = 4096 VCPU = 0.5, 1, or 2 value = 5120, 6144, or 7168 VCPU = 1 or 2 value = 8192 VCPU = 1, 2, or 4 value = 9216, 10240, 11264, 12288, 13312, 14336, or 15360 VCPU = 2 or 4 value = 16384 VCPU = 2, 4, or 8 value = 17408, 18432, 19456, 21504, 22528, 23552, 25600, 26624, 27648, 29696, or 30720 VCPU = 4 value = 20480, 24576, or 28672 VCPU = 4 or 8 value = 36864, 45056, 53248, or 61440 VCPU = 8 value = 32768, 40960, 49152, or 57344 VCPU = 8 or 16 value = 65536, 73728, 81920, 90112, 98304, 106496, 114688, or 122880 VCPU = 16 type='VCPU' The number of vCPUs reserved for the container. This parameter maps to CpuShares in the Create a container section of the Docker Remote API and the --cpu-shares option to docker run. Each vCPU is equivalent to 1,024 CPU shares. For Amazon EC2 resources, you must specify at least one vCPU. This is required but can be specified in several places; it must be specified for each node at least once. The default for the Fargate On-Demand vCPU resource count quota is 6 vCPUs. For more information about Fargate quotas, see Fargate quotas in the Amazon Web Services General Reference. For jobs that are running on Fargate resources, then value must match one of the supported values and the MEMORY values must be one of the values supported for that VCPU value. The supported values are 0.25, 0.5, 1, 2, 4, 8, and 16 value = 0.25 MEMORY = 512, 1024, or 2048 value = 0.5 MEMORY = 1024, 2048, 3072, or 4096 value = 1 MEMORY = 2048, 3072, 4096, 5120, 6144, 7168, or 8192 value = 2 MEMORY = 4096, 5120, 6144, 7168, 8192, 9216, 10240, 11264, 12288, 13312, 14336, 15360, or 16384 value = 4 MEMORY = 8192, 9216, 10240, 11264, 12288, 13312, 14336, 15360, 16384, 17408, 18432, 19456, 20480, 21504, 22528, 23552, 24576, 25600, 26624, 27648, 28672, 29696, or 30720 value = 8 MEMORY = 16384, 20480, 24576, 28672, 32768, 36864, 40960, 45056, 49152, 53248, 57344, or 61440 value = 16 MEMORY = 32768, 40960, 49152, 57344, 65536, 73728, 81920, 90112, 98304, 106496, 114688, or 122880 The type of resource to assign to a container. The supported resources include GPU, MEMORY, and VCPU.",
      "nested_params": [
        {
          "name": "taskProperties",
          "type": "list",
          "required": false,
          "description": "The overrides for the Amazon ECS task definition of a job.",
          "nested_params": [
            {
              "name": "containers",
              "type": "list",
              "required": false,
              "description": "The overrides for the container definition of a job.",
              "nested_params": [
                {
                  "name": "command",
                  "type": "list",
                  "required": false,
                  "description": "The command to send to the container that overrides the default command from the Docker image or the job definition.",
                  "nested_params": []
                },
                {
                  "name": "environment",
                  "type": "list",
                  "required": false,
                  "description": "The environment variables to send to the container. You can add new environment variables, which are added to the container at launch, or you can override the existing environment variables from the Docker image or the job definition.",
                  "nested_params": [
                    {
                      "name": "name",
                      "type": "string",
                      "required": false,
                      "description": "The name of the key-value pair. For environment variables, this is the name of the environment variable.",
                      "nested_params": []
                    },
                    {
                      "name": "value",
                      "type": "string",
                      "required": false,
                      "description": "The value of the key-value pair. For environment variables, this is the value of the environment variable.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "name",
                  "type": "string",
                  "required": false,
                  "description": "A pointer to the container that you want to override. The container's name provides a unique identifier for the container being used.",
                  "nested_params": []
                },
                {
                  "name": "resourceRequirements",
                  "type": "list",
                  "required": false,
                  "description": "The type and amount of resources to assign to a container. This overrides the settings in the job definition. The supported resources include GPU, MEMORY, and VCPU.",
                  "nested_params": [
                    {
                      "name": "value",
                      "type": "string",
                      "required": false,
                      "description": "The quantity of the specified resource to reserve for the container. The values vary based on the type specified. The number of physical GPUs to reserve for the container. Make sure that the number of GPUs reserved for all containers in a job doesn't exceed the number of available GPUs on the compute resource that the job is launched on. The memory hard limit (in MiB) present to the container. This parameter is supported for jobs that are running on Amazon EC2 resources. If your container attempts to exceed the memory specified, the container is terminated. This parameter maps to Memory in the Create a container section of the Docker Remote API and the --memory option to docker run. You must specify at least 4 MiB of memory for a job. This is required but can be specified in several places for multi-node parallel (MNP) jobs. It must be specified for each node at least once. For jobs that are running on Fargate resources, then value is the hard limit (in MiB), and must match one of the supported values and the VCPU values must be one of the values supported for that memory value. VCPU = 0.25 VCPU = 0.25 or 0.5 VCPU = 0.25, 0.5, or 1 VCPU = 0.5, or 1 VCPU = 0.5, 1, or 2 VCPU = 1 or 2 VCPU = 1, 2, or 4 VCPU = 2 or 4 VCPU = 2, 4, or 8 VCPU = 4 VCPU = 4 or 8 VCPU = 8 VCPU = 8 or 16 VCPU = 16 The number of vCPUs reserved for the container. This parameter maps to CpuShares in the Create a container section of the Docker Remote API and the --cpu-shares option to docker run. Each vCPU is equivalent to 1,024 CPU shares. For Amazon EC2 resources, you must specify at least one vCPU. This is required but can be specified in several places; it must be specified for each node at least once. The default for the Fargate On-Demand vCPU resource count quota is 6 vCPUs. For more information about Fargate quotas, see Fargate quotas in the Amazon Web Services General Reference. For jobs that are running on Fargate resources, then value must match one of the supported values and the MEMORY values must be one of the values supported for that VCPU value. The supported values are 0.25, 0.5, 1, 2, 4, 8, and 16 MEMORY = 512, 1024, or 2048 MEMORY = 1024, 2048, 3072, or 4096 MEMORY = 2048, 3072, 4096, 5120, 6144, 7168, or 8192 MEMORY = 4096, 5120, 6144, 7168, 8192, 9216, 10240, 11264, 12288, 13312, 14336, 15360, or 16384 MEMORY = 8192, 9216, 10240, 11264, 12288, 13312, 14336, 15360, 16384, 17408, 18432, 19456, 20480, 21504, 22528, 23552, 24576, 25600, 26624, 27648, 28672, 29696, or 30720 MEMORY = 16384, 20480, 24576, 28672, 32768, 36864, 40960, 45056, 49152, 53248, 57344, or 61440 MEMORY = 32768, 40960, 49152, 57344, 65536, 73728, 81920, 90112, 98304, 106496, 114688, or 122880",
                      "nested_params": []
                    },
                    {
                      "name": "type",
                      "type": "string",
                      "required": false,
                      "description": "The type of resource to assign to a container. The supported resources include GPU, MEMORY, and VCPU.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "consumableResourcePropertiesOverride",
      "type": "dict",
      "required": false,
      "description": "An object that contains overrides for the consumable resources of a job. consumableResourceList (list) --- The list of consumable resources required by a job. (dict) --- Information about a consumable resource required to run a job. consumableResource (string) --- The name or ARN of the consumable resource. quantity (integer) --- The quantity of the consumable resource that is needed.",
      "nested_params": [
        {
          "name": "consumableResourceList",
          "type": "list",
          "required": false,
          "description": "The list of consumable resources required by a job.",
          "nested_params": [
            {
              "name": "consumableResource",
              "type": "string",
              "required": false,
              "description": "The name or ARN of the consumable resource.",
              "nested_params": []
            },
            {
              "name": "quantity",
              "type": "integer",
              "required": false,
              "description": "The quantity of the consumable resource that is needed.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "jobArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) for the job.",
          "nested_items": []
        },
        {
          "name": "jobName",
          "type": "string",
          "description": "The name of the job.",
          "nested_items": []
        },
        {
          "name": "jobId",
          "type": "string",
          "description": "The unique identifier for the job.",
          "nested_items": []
        }
      ]
    }
  ]
}