{
  "method_name": "add_attachments_to_set",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/support/client/add_attachments_to_set.html",
  "description": "Adds one or more attachments to an attachment set. An attachment set is a temporary container for attachments that you add to a case or case communication. The set is available for 1 hour after it's created. The expiryTime returned in the response is when the set expires.",
  "parameters": [
    {
      "name": "attachmentSetId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "attachments",
      "type": "list",
      "required": true,
      "description": "One or more attachments to add to the set. You can add up to three attachments per set. The size limit is 5 MB per attachment. In the Attachment object, use the data parameter to specify the contents of the attachment file. In the previous request syntax, the value for data appear as blob, which is represented as a base64-encoded string. The value for fileName is the name of the attachment, such as troubleshoot-screenshot.png. (dict) --- An attachment to a case communication. The attachment consists of the file name and the content of the file. Each attachment file size should not exceed 5 MB. File types that are supported include the following: pdf, jpeg,.doc, .log, .text fileName (string) --- The name of the attachment file. data (bytes) --- The content of the attachment file.",
      "nested_params": [
        {
          "name": "fileName",
          "type": "string",
          "required": false,
          "description": "The name of the attachment file.",
          "nested_params": []
        },
        {
          "name": "data",
          "type": "bytes",
          "required": false,
          "description": "The content of the attachment file.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "attachmentSetId",
          "type": "string",
          "description": "The ID of the attachment set. If an attachmentSetId was not specified, a new attachment set is created, and the ID of the set is returned in the response. If an attachmentSetId was specified, the attachments are added to the specified set, if it exists.",
          "nested_items": []
        },
        {
          "name": "expiryTime",
          "type": "string",
          "description": "The time and date when the attachment set expires.",
          "nested_items": []
        }
      ]
    }
  ]
}