{
  "method_name": "create_case",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/support/client/create_case.html",
  "description": "Creates a case in the Amazon Web Services Support Center. This operation is similar to how you create a case in the Amazon Web Services Support Center Create Case page. The Amazon Web Services Support API doesn't support requesting service limit increases. You can submit a service limit increase in the following ways: A successful CreateCase request returns an Amazon Web Services Support case number. You can use the  DescribeCases operation and specify the case number to get existing Amazon Web Services Support cases. After you create a case, use the  AddCommunicationToCase operation to add additional communication or attachments to an existing case. The caseId is separate from the displayId that appears in the Amazon Web Services Support Center. Use the  DescribeCases operation to get the displayId.",
  "parameters": [
    {
      "name": "subject",
      "type": "string",
      "required": true,
      "description": "The title of the support case. The title appears in the Subject field on the Amazon Web Services Support Center Create Case page.",
      "nested_params": []
    },
    {
      "name": "serviceCode",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "severityCode",
      "type": "string",
      "required": false,
      "description": "A value that indicates the urgency of the case. This value determines the response time according to your service level agreement with Amazon Web Services Support. You can use the  DescribeSeverityLevels operation to get the possible values for severityCode. For more information, see  SeverityLevel and Choosing a Severity in the Amazon Web Services Support User Guide.",
      "nested_params": []
    },
    {
      "name": "categoryCode",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "communicationBody",
      "type": "string",
      "required": true,
      "description": "The communication body text that describes the issue. This text appears in the Description field on the Amazon Web Services Support Center Create Case page.",
      "nested_params": []
    },
    {
      "name": "ccEmailAddresses",
      "type": "list",
      "required": false,
      "description": "A list of email addresses that Amazon Web Services Support copies on case correspondence. Amazon Web Services Support identifies the account that creates the case when you specify your Amazon Web Services credentials in an HTTP POST method or use the Amazon Web Services SDKs. (string) ---",
      "nested_params": []
    },
    {
      "name": "language",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "issueType",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "attachmentSetId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "caseId",
          "type": "string",
          "description": "The support case ID requested or returned in the call. The case ID is an alphanumeric string in the following format: case-12345678910-2013-c4c1d2bf33c5cf47",
          "nested_items": []
        }
      ]
    }
  ]
}