{
  "method_name": "describe_trusted_advisor_checks",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/support/client/describe_trusted_advisor_checks.html",
  "description": "Returns information about all available Trusted Advisor checks, including the name, ID, category, description, and metadata. You must specify a language code. The response contains a  TrustedAdvisorCheckDescription object for each check. You must set the Amazon Web Services Region to us-east-1. To call the Trusted Advisor operations in the Amazon Web Services Support API, you must use the US East (N. Virginia) endpoint. Currently, the US West (Oregon) and Europe (Ireland) endpoints don't support the Trusted Advisor operations. For more information, see About the Amazon Web Services Support API in the Amazon Web Services Support User Guide.",
  "parameters": [],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "checks",
          "type": "list",
          "description": "Information about all available Trusted Advisor checks.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "id",
                  "type": "string",
                  "description": "The unique identifier for the Trusted Advisor check.",
                  "nested_items": []
                },
                {
                  "name": "name",
                  "type": "string",
                  "description": "The display name for the Trusted Advisor check.",
                  "nested_items": []
                },
                {
                  "name": "description",
                  "type": "string",
                  "description": "The description of the Trusted Advisor check, which includes the alert criteria and recommended operations (contains HTML markup).",
                  "nested_items": []
                },
                {
                  "name": "category",
                  "type": "string",
                  "description": "The category of the Trusted Advisor check.",
                  "nested_items": []
                },
                {
                  "name": "metadata",
                  "type": "list",
                  "description": "The column headings for the data returned by the Trusted Advisor check. The order of the headings corresponds to the order of the data in the Metadata element of the  TrustedAdvisorResourceDetail for the check. Metadata contains all the data that is shown in the Excel download, even in those cases where the UI shows just summary data.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}