{
  "method_name": "refresh_trusted_advisor_check",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/support/client/refresh_trusted_advisor_check.html",
  "description": "Refreshes the Trusted Advisor check that you specify using the check ID. You can get the check IDs by calling the  DescribeTrustedAdvisorChecks operation. Some checks are refreshed automatically. If you call the RefreshTrustedAdvisorCheck operation to refresh them, you might see the InvalidParameterValue error. The response contains a  TrustedAdvisorCheckRefreshStatus object. To call the Trusted Advisor operations in the Amazon Web Services Support API, you must use the US East (N. Virginia) endpoint. Currently, the US West (Oregon) and Europe (Ireland) endpoints don't support the Trusted Advisor operations. For more information, see About the Amazon Web Services Support API in the Amazon Web Services Support User Guide.",
  "parameters": [
    {
      "name": "checkId",
      "type": "string",
      "required": true,
      "description": "The unique identifier for the Trusted Advisor check to refresh.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "checkId",
              "type": "string",
              "description": "The unique identifier for the Trusted Advisor check.",
              "nested_items": []
            },
            {
              "name": "status",
              "type": "string",
              "description": "The status of the Trusted Advisor check for which a refresh has been requested:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "none - The check is not refreshed or the non-success status exceeds the timeout.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "enqueued - The check refresh requests has entered the refresh queue.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "processing - The check refresh request is picked up by the rule processing engine.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "success - The check is successfully refreshed.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "abandoned - The check refresh has failed.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "millisUntilNextRefreshable",
              "type": "integer",
              "description": "The amount of time, in milliseconds, until the Trusted Advisor check is eligible for refresh.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}