{
  "method_name": "put_snapshot_block",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ebs/client/put_snapshot_block.html",
  "description": "Writes a block of data to a snapshot. If the specified block contains data, the existing data is overwritten. The target snapshot must be in the pending state. Data written to a snapshot must be aligned with 512-KiB sectors.",
  "parameters": [
    {
      "name": "SnapshotId",
      "type": "string",
      "required": true,
      "description": "The ID of the snapshot.",
      "nested_params": []
    },
    {
      "name": "BlockIndex",
      "type": "integer",
      "required": true,
      "description": "The block index of the block in which to write the data. A block index is a logical index in units of 512 KiB blocks. To identify the block index, divide the logical offset of the data in the logical volume by the block size (logical offset of data/ 524288). The logical offset of the data must be 512 KiB aligned.",
      "nested_params": []
    },
    {
      "name": "BlockData",
      "type": "bytes or seekable file-like object",
      "required": true,
      "description": "The data to write to the block. The block data is not signed as part of the Signature Version 4 signing process. As a result, you must generate and provide a Base64-encoded SHA256 checksum for the block data using the x-amz-Checksum header. Also, you must specify the checksum algorithm using the x-amz-Checksum-Algorithm header. The checksum that you provide is part of the Signature Version 4 signing process. It is validated against a checksum generated by Amazon EBS to ensure the validity and authenticity of the data. If the checksums do not correspond, the request fails. For more information, see Using checksums with the EBS direct APIs in the Amazon Elastic Compute Cloud User Guide.",
      "nested_params": []
    },
    {
      "name": "DataLength",
      "type": "integer",
      "required": true,
      "description": "The size of the data to write to the block, in bytes. Currently, the only supported size is 524288 bytes. Valid values: 524288",
      "nested_params": []
    },
    {
      "name": "Progress",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Checksum",
      "type": "string",
      "required": true,
      "description": "A Base64-encoded SHA256 checksum of the data. Only SHA256 checksums are supported.",
      "nested_params": []
    },
    {
      "name": "ChecksumAlgorithm",
      "type": "string",
      "required": true,
      "description": "The algorithm used to generate the checksum. Currently, the only supported algorithm is SHA256.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Checksum",
          "type": "string",
          "description": "The SHA256 checksum generated for the block data by Amazon EBS.",
          "nested_items": []
        },
        {
          "name": "ChecksumAlgorithm",
          "type": "string",
          "description": "The algorithm used by Amazon EBS to generate the checksum.",
          "nested_items": []
        }
      ]
    }
  ]
}