{
  "method_name": "start_snapshot",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ebs/client/start_snapshot.html",
  "description": "Creates a new Amazon EBS snapshot. The new snapshot enters the pending state after the request completes. After creating the snapshot, use PutSnapshotBlock to write blocks of data to the snapshot.",
  "parameters": [
    {
      "name": "VolumeSize",
      "type": "integer",
      "required": true,
      "description": "The size of the volume, in GiB. The maximum size is 65536 GiB (64 TiB).",
      "nested_params": []
    },
    {
      "name": "ParentSnapshotId",
      "type": "string",
      "required": false,
      "description": "The ID of the parent snapshot. If there is no parent snapshot, or if you are creating the first snapshot for an on-premises volume, omit this parameter. You can't specify ParentSnapshotId and Encrypted in the same request. If you specify both parameters, the request fails with ValidationException. The encryption status of the snapshot depends on the values that you specify for Encrypted, KmsKeyArn, and ParentSnapshotId, and whether your Amazon Web Services account is enabled for encryption by default. For more information, see Using encryption in the Amazon Elastic Compute Cloud User Guide.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": false,
      "description": "The tags to apply to the snapshot. (dict) --- Describes a tag. Key (string) --- The key of the tag. Value (string) --- The value of the tag.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key of the tag.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value of the tag.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": false,
      "description": "A unique, case-sensitive identifier that you provide to ensure the idempotency of the request. Idempotency ensures that an API request completes only once. With an idempotent request, if the original request completes successfully. The subsequent retries with the same client token return the result from the original successful request and they have no additional effect. If you do not specify a client token, one is automatically generated by the Amazon Web Services SDK. For more information, see Idempotency for StartSnapshot API in the Amazon Elastic Compute Cloud User Guide. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "Encrypted",
      "type": "boolean",
      "required": false,
      "description": "Indicates whether to encrypt the snapshot. You can't specify Encrypted and ParentSnapshotId in the same request. If you specify both parameters, the request fails with ValidationException. The encryption status of the snapshot depends on the values that you specify for Encrypted, KmsKeyArn, and ParentSnapshotId, and whether your Amazon Web Services account is enabled for encryption by default. For more information, see Using encryption in the Amazon Elastic Compute Cloud User Guide.",
      "nested_params": []
    },
    {
      "name": "KmsKeyArn",
      "type": "string",
      "required": false,
      "description": "The Amazon Resource Name (ARN) of the Key Management Service (KMS) key to be used to encrypt the snapshot. The encryption status of the snapshot depends on the values that you specify for Encrypted, KmsKeyArn, and ParentSnapshotId, and whether your Amazon Web Services account is enabled for encryption by default. For more information, see Using encryption in the Amazon Elastic Compute Cloud User Guide.",
      "nested_params": []
    },
    {
      "name": "Timeout",
      "type": "integer",
      "required": false,
      "description": "The amount of time (in minutes) after which the snapshot is automatically cancelled if: No blocks are written to the snapshot. The snapshot is not completed after writing the last block of data. If no value is specified, the timeout defaults to 60 minutes.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Description",
          "type": "string",
          "description": "The description of the snapshot.",
          "nested_items": []
        },
        {
          "name": "SnapshotId",
          "type": "string",
          "description": "The ID of the snapshot.",
          "nested_items": []
        },
        {
          "name": "OwnerId",
          "type": "string",
          "description": "The Amazon Web Services account ID of the snapshot owner.",
          "nested_items": []
        },
        {
          "name": "Status",
          "type": "string",
          "description": "The status of the snapshot.",
          "nested_items": []
        },
        {
          "name": "StartTime",
          "type": "datetime",
          "description": "The timestamp when the snapshot was created.",
          "nested_items": []
        },
        {
          "name": "VolumeSize",
          "type": "integer",
          "description": "The size of the volume, in GiB.",
          "nested_items": []
        },
        {
          "name": "BlockSize",
          "type": "integer",
          "description": "The size of the blocks in the snapshot, in bytes.",
          "nested_items": []
        },
        {
          "name": "Tags",
          "type": "list",
          "description": "The tags applied to the snapshot. You can specify up to 50 tags per snapshot. For more information, see Tagging your Amazon EC2 resources in the Amazon Elastic Compute Cloud User Guide.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Key",
                  "type": "string",
                  "description": "The key of the tag.",
                  "nested_items": []
                },
                {
                  "name": "Value",
                  "type": "string",
                  "description": "The value of the tag.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "ParentSnapshotId",
          "type": "string",
          "description": "The ID of the parent snapshot.",
          "nested_items": []
        },
        {
          "name": "KmsKeyArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the Key Management Service (KMS) key used to encrypt the snapshot.",
          "nested_items": []
        },
        {
          "name": "SseType",
          "type": "string",
          "description": "Reserved for future use.",
          "nested_items": []
        }
      ]
    }
  ]
}