{
  "method_name": "put_data_catalog_encryption_settings",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/glue/client/put_data_catalog_encryption_settings.html",
  "description": "Sets the security configuration for a specified catalog. After the configuration has been set, the specified encryption is applied to every catalog write thereafter.",
  "parameters": [
    {
      "name": "CatalogId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DataCatalogEncryptionSettings",
      "type": "dict",
      "required": true,
      "description": "The security configuration to set. EncryptionAtRest (dict) --- Specifies the encryption-at-rest configuration for the Data Catalog. The encryption-at-rest mode for encrypting Data Catalog data. SseAwsKmsKeyId (string) --- The ID of the KMS key to use for encryption at rest. CatalogEncryptionServiceRole (string) --- The role that Glue assumes to encrypt and decrypt the Data Catalog objects on the caller's behalf. ConnectionPasswordEncryption (dict) --- When connection password protection is enabled, the Data Catalog uses a customer-provided key to encrypt the password as part of CreateConnection or UpdateConnection and store it in the ENCRYPTED_PASSWORD field in the connection properties. You can enable catalog encryption or only password encryption. When the ReturnConnectionPasswordEncrypted flag is set to 'true', passwords remain encrypted in the responses of GetConnection and GetConnections. This encryption takes effect independently from catalog encryption. AwsKmsKeyId (string) --- An KMS key that is used to encrypt the connection password. If connection password protection is enabled, the caller of CreateConnection and UpdateConnection needs at least kms:Encrypt permission on the specified KMS key, to encrypt passwords before storing them in the Data Catalog. You can set the decrypt permission to enable or restrict access on the password key according to your security requirements.",
      "nested_params": [
        {
          "name": "EncryptionAtRest",
          "type": "dict",
          "required": false,
          "description": "Specifies the encryption-at-rest configuration for the Data Catalog.",
          "nested_params": [
            {
              "name": "CatalogEncryptionMode",
              "type": "string",
              "required": false,
              "description": "The encryption-at-rest mode for encrypting Data Catalog data.",
              "nested_params": []
            },
            {
              "name": "SseAwsKmsKeyId",
              "type": "string",
              "required": false,
              "description": "The ID of the KMS key to use for encryption at rest.",
              "nested_params": []
            },
            {
              "name": "CatalogEncryptionServiceRole",
              "type": "string",
              "required": false,
              "description": "The role that Glue assumes to encrypt and decrypt the Data Catalog objects on the caller's behalf.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ConnectionPasswordEncryption",
          "type": "dict",
          "required": false,
          "description": "When connection password protection is enabled, the Data Catalog uses a customer-provided key to encrypt the password as part of CreateConnection or UpdateConnection and store it in the ENCRYPTED_PASSWORD field in the connection properties. You can enable catalog encryption or only password encryption.",
          "nested_params": [
            {
              "name": "ReturnConnectionPasswordEncrypted",
              "type": "boolean",
              "required": false,
              "description": "When the ReturnConnectionPasswordEncrypted flag is set to 'true', passwords remain encrypted in the responses of GetConnection and GetConnections. This encryption takes effect independently from catalog encryption.",
              "nested_params": []
            },
            {
              "name": "AwsKmsKeyId",
              "type": "string",
              "required": false,
              "description": "An KMS key that is used to encrypt the connection password. If connection password protection is enabled, the caller of CreateConnection and UpdateConnection needs at least kms:Encrypt permission on the specified KMS key, to encrypt passwords before storing them in the Data Catalog. You can set the decrypt permission to enable or restrict access on the password key according to your security requirements.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}