{
  "method_name": "update_crawler",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/glue/client/update_crawler.html",
  "description": "Updates a crawler. If a crawler is running, you must stop it using StopCrawler before updating it.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "Name of the new crawler.",
      "nested_params": []
    },
    {
      "name": "Role",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DatabaseName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Targets",
      "type": "dict",
      "required": true,
      "description": "A list of targets to crawl. S3Targets (list) --- Specifies Amazon Simple Storage Service (Amazon S3) targets. (dict) --- Specifies a data store in Amazon Simple Storage Service (Amazon S3). Path (string) --- The path to the Amazon S3 target. Exclusions (list) --- A list of glob patterns used to exclude from the crawl. For more information, see Catalog Tables with a Crawler. (string) --- ConnectionName (string) --- The name of a connection which allows a job or crawler to access data in Amazon S3 within an Amazon Virtual Private Cloud environment (Amazon VPC). SampleSize (integer) --- Sets the number of files in each leaf folder to be crawled when crawling sample files in a dataset. If not set, all the files are crawled. A valid value is an integer between 1 and 249. EventQueueArn (string) --- A valid Amazon SQS ARN. For example, arn:aws:sqs:region:account:sqs. DlqEventQueueArn (string) --- A valid Amazon dead-letter SQS ARN. For example, arn:aws:sqs:region:account:deadLetterQueue. JdbcTargets (list) --- Specifies JDBC targets. (dict) --- Specifies a JDBC data store to crawl. ConnectionName (string) --- The name of the connection to use to connect to the JDBC target. Path (string) --- The path of the JDBC target. (string) --- EnableAdditionalMetadata (list) --- Specify a value of RAWTYPES or COMMENTS to enable additional metadata in table responses. RAWTYPES provides the native-level datatype. COMMENTS provides comments associated with a column or table in the database. If you do not need additional metadata, keep the field empty. (string) --- MongoDBTargets (list) --- Specifies Amazon DocumentDB or MongoDB targets. (dict) --- Specifies an Amazon DocumentDB or MongoDB data store to crawl. ConnectionName (string) --- The name of the connection to use to connect to the Amazon DocumentDB or MongoDB target. Path (string) --- The path of the Amazon DocumentDB or MongoDB target (database/collection). ScanAll (boolean) --- Indicates whether to scan all the records, or to sample rows from the table. Scanning all the records can take a long time when the table is not a high throughput table. A value of true means to scan all records, while a value of false means to sample the records. If no value is specified, the value defaults to true. DynamoDBTargets (list) --- Specifies Amazon DynamoDB targets. (dict) --- Specifies an Amazon DynamoDB table to crawl. Path (string) --- The name of the DynamoDB table to crawl. scanAll (boolean) --- Indicates whether to scan all the records, or to sample rows from the table. scanRate (float) --- The percentage of the configured read capacity units to use by the Glue crawler. Read capacity units is a term defined by DynamoDB, and is a numeric value that acts as rate limiter for the number of reads that can be performed on that table per second. The valid values are null or a value between 0.1 to 1.5. A null value is used when user does not provide a value, and defaults to 0.5 of the configured Read Capacity Unit (for provisioned tables), or 0.25 of the max configured Read Capacity Unit (for tables using on-demand mode). CatalogTargets (list) --- Specifies Glue Data Catalog targets. (dict) --- Specifies an Glue Data Catalog target. The name of the database to be synchronized. A list of the tables to be synchronized. (string) --- ConnectionName (string) --- The name of the connection for an Amazon S3-backed Data Catalog table to be a target of the crawl when using a Catalog connection type paired with a NETWORK Connection type. DeltaTargets (list) --- Specifies Delta data store targets. (dict) --- Specifies a Delta data store to crawl one or more Delta tables. DeltaTables (list) --- A list of the Amazon S3 paths to the Delta tables. (string) --- ConnectionName (string) --- The name of the connection to use to connect to the Delta table target. WriteManifest (boolean) --- Specifies whether to write the manifest files to the Delta table path. CreateNativeDeltaTable (boolean) --- Specifies whether the crawler will create native tables, to allow integration with query engines that support querying of the Delta transaction log directly. IcebergTargets (list) --- Specifies Apache Iceberg data store targets. (dict) --- Specifies an Apache Iceberg data source where Iceberg tables are stored in Amazon S3. Paths (list) --- One or more Amazon S3 paths that contains Iceberg metadata folders as s3://bucket/prefix. (string) --- ConnectionName (string) --- The name of the connection to use to connect to the Iceberg target. (string) --- MaximumTraversalDepth (integer) --- The maximum depth of Amazon S3 paths that the crawler can traverse to discover the Iceberg metadata folder in your Amazon S3 path. Used to limit the crawler run time. HudiTargets (list) --- Specifies Apache Hudi data store targets. (dict) --- Specifies an Apache Hudi data source. Paths (list) --- An array of Amazon S3 location strings for Hudi, each indicating the root folder with which the metadata files for a Hudi table resides. The Hudi folder may be located in a child folder of the root folder. The crawler will scan all folders underneath a path for a Hudi folder. (string) --- ConnectionName (string) --- The name of the connection to use to connect to the Hudi target. If your Hudi files are stored in buckets that require VPC authorization, you can set their connection properties here. (string) --- MaximumTraversalDepth (integer) --- The maximum depth of Amazon S3 paths that the crawler can traverse to discover the Hudi metadata folder in your Amazon S3 path. Used to limit the crawler run time.",
      "nested_params": [
        {
          "name": "S3Targets",
          "type": "list",
          "required": false,
          "description": "Specifies Amazon Simple Storage Service (Amazon S3) targets.",
          "nested_params": [
            {
              "name": "Path",
              "type": "string",
              "required": false,
              "description": "The path to the Amazon S3 target.",
              "nested_params": []
            },
            {
              "name": "Exclusions",
              "type": "list",
              "required": false,
              "description": "A list of glob patterns used to exclude from the crawl. For more information, see Catalog Tables with a Crawler.",
              "nested_params": []
            },
            {
              "name": "ConnectionName",
              "type": "string",
              "required": false,
              "description": "The name of a connection which allows a job or crawler to access data in Amazon S3 within an Amazon Virtual Private Cloud environment (Amazon VPC).",
              "nested_params": []
            },
            {
              "name": "SampleSize",
              "type": "integer",
              "required": false,
              "description": "Sets the number of files in each leaf folder to be crawled when crawling sample files in a dataset. If not set, all the files are crawled. A valid value is an integer between 1 and 249.",
              "nested_params": []
            },
            {
              "name": "EventQueueArn",
              "type": "string",
              "required": false,
              "description": "A valid Amazon SQS ARN. For example, arn:aws:sqs:region:account:sqs.",
              "nested_params": []
            },
            {
              "name": "DlqEventQueueArn",
              "type": "string",
              "required": false,
              "description": "A valid Amazon dead-letter SQS ARN. For example, arn:aws:sqs:region:account:deadLetterQueue.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "JdbcTargets",
          "type": "list",
          "required": false,
          "description": "Specifies JDBC targets.",
          "nested_params": [
            {
              "name": "ConnectionName",
              "type": "string",
              "required": false,
              "description": "The name of the connection to use to connect to the JDBC target.",
              "nested_params": []
            },
            {
              "name": "Path",
              "type": "string",
              "required": false,
              "description": "The path of the JDBC target.",
              "nested_params": []
            },
            {
              "name": "Exclusions",
              "type": "list",
              "required": false,
              "description": "A list of glob patterns used to exclude from the crawl. For more information, see Catalog Tables with a Crawler.",
              "nested_params": []
            },
            {
              "name": "EnableAdditionalMetadata",
              "type": "list",
              "required": false,
              "description": "Specify a value of RAWTYPES or COMMENTS to enable additional metadata in table responses. RAWTYPES provides the native-level datatype. COMMENTS provides comments associated with a column or table in the database. If you do not need additional metadata, keep the field empty.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "MongoDBTargets",
          "type": "list",
          "required": false,
          "description": "Specifies Amazon DocumentDB or MongoDB targets.",
          "nested_params": [
            {
              "name": "ConnectionName",
              "type": "string",
              "required": false,
              "description": "The name of the connection to use to connect to the Amazon DocumentDB or MongoDB target.",
              "nested_params": []
            },
            {
              "name": "Path",
              "type": "string",
              "required": false,
              "description": "The path of the Amazon DocumentDB or MongoDB target (database/collection).",
              "nested_params": []
            },
            {
              "name": "ScanAll",
              "type": "boolean",
              "required": false,
              "description": "Indicates whether to scan all the records, or to sample rows from the table. Scanning all the records can take a long time when the table is not a high throughput table. A value of true means to scan all records, while a value of false means to sample the records. If no value is specified, the value defaults to true.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "DynamoDBTargets",
          "type": "list",
          "required": false,
          "description": "Specifies Amazon DynamoDB targets.",
          "nested_params": [
            {
              "name": "Path",
              "type": "string",
              "required": false,
              "description": "The name of the DynamoDB table to crawl.",
              "nested_params": []
            },
            {
              "name": "scanAll",
              "type": "boolean",
              "required": false,
              "description": "Indicates whether to scan all the records, or to sample rows from the table. Scanning all the records can take a long time when the table is not a high throughput table. A value of true means to scan all records, while a value of false means to sample the records. If no value is specified, the value defaults to true.",
              "nested_params": []
            },
            {
              "name": "scanRate",
              "type": "float",
              "required": false,
              "description": "The percentage of the configured read capacity units to use by the Glue crawler. Read capacity units is a term defined by DynamoDB, and is a numeric value that acts as rate limiter for the number of reads that can be performed on that table per second. The valid values are null or a value between 0.1 to 1.5. A null value is used when user does not provide a value, and defaults to 0.5 of the configured Read Capacity Unit (for provisioned tables), or 0.25 of the max configured Read Capacity Unit (for tables using on-demand mode).",
              "nested_params": []
            }
          ]
        },
        {
          "name": "CatalogTargets",
          "type": "list",
          "required": false,
          "description": "Specifies Glue Data Catalog targets.",
          "nested_params": [
            {
              "name": "DatabaseName",
              "type": "string",
              "required": false,
              "description": "The name of the database to be synchronized.",
              "nested_params": []
            },
            {
              "name": "Tables",
              "type": "list",
              "required": false,
              "description": "A list of the tables to be synchronized.",
              "nested_params": []
            },
            {
              "name": "ConnectionName",
              "type": "string",
              "required": false,
              "description": "The name of the connection for an Amazon S3-backed Data Catalog table to be a target of the crawl when using a Catalog connection type paired with a NETWORK Connection type.",
              "nested_params": []
            },
            {
              "name": "EventQueueArn",
              "type": "string",
              "required": false,
              "description": "A valid Amazon SQS ARN. For example, arn:aws:sqs:region:account:sqs.",
              "nested_params": []
            },
            {
              "name": "DlqEventQueueArn",
              "type": "string",
              "required": false,
              "description": "A valid Amazon dead-letter SQS ARN. For example, arn:aws:sqs:region:account:deadLetterQueue.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "DeltaTargets",
          "type": "list",
          "required": false,
          "description": "Specifies Delta data store targets.",
          "nested_params": [
            {
              "name": "DeltaTables",
              "type": "list",
              "required": false,
              "description": "A list of the Amazon S3 paths to the Delta tables.",
              "nested_params": []
            },
            {
              "name": "ConnectionName",
              "type": "string",
              "required": false,
              "description": "The name of the connection to use to connect to the Delta table target.",
              "nested_params": []
            },
            {
              "name": "WriteManifest",
              "type": "boolean",
              "required": false,
              "description": "Specifies whether to write the manifest files to the Delta table path.",
              "nested_params": []
            },
            {
              "name": "CreateNativeDeltaTable",
              "type": "boolean",
              "required": false,
              "description": "Specifies whether the crawler will create native tables, to allow integration with query engines that support querying of the Delta transaction log directly.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "IcebergTargets",
          "type": "list",
          "required": false,
          "description": "Specifies Apache Iceberg data store targets.",
          "nested_params": [
            {
              "name": "Paths",
              "type": "list",
              "required": false,
              "description": "One or more Amazon S3 paths that contains Iceberg metadata folders as s3://bucket/prefix.",
              "nested_params": []
            },
            {
              "name": "ConnectionName",
              "type": "string",
              "required": false,
              "description": "The name of the connection to use to connect to the Iceberg target.",
              "nested_params": []
            },
            {
              "name": "Exclusions",
              "type": "list",
              "required": false,
              "description": "A list of glob patterns used to exclude from the crawl. For more information, see Catalog Tables with a Crawler.",
              "nested_params": []
            },
            {
              "name": "MaximumTraversalDepth",
              "type": "integer",
              "required": false,
              "description": "The maximum depth of Amazon S3 paths that the crawler can traverse to discover the Iceberg metadata folder in your Amazon S3 path. Used to limit the crawler run time.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "HudiTargets",
          "type": "list",
          "required": false,
          "description": "Specifies Apache Hudi data store targets.",
          "nested_params": [
            {
              "name": "Paths",
              "type": "list",
              "required": false,
              "description": "An array of Amazon S3 location strings for Hudi, each indicating the root folder with which the metadata files for a Hudi table resides. The Hudi folder may be located in a child folder of the root folder. The crawler will scan all folders underneath a path for a Hudi folder.",
              "nested_params": []
            },
            {
              "name": "ConnectionName",
              "type": "string",
              "required": false,
              "description": "The name of the connection to use to connect to the Hudi target. If your Hudi files are stored in buckets that require VPC authorization, you can set their connection properties here.",
              "nested_params": []
            },
            {
              "name": "Exclusions",
              "type": "list",
              "required": false,
              "description": "A list of glob patterns used to exclude from the crawl. For more information, see Catalog Tables with a Crawler.",
              "nested_params": []
            },
            {
              "name": "MaximumTraversalDepth",
              "type": "integer",
              "required": false,
              "description": "The maximum depth of Amazon S3 paths that the crawler can traverse to discover the Hudi metadata folder in your Amazon S3 path. Used to limit the crawler run time.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "Schedule",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Classifiers",
      "type": "list",
      "required": false,
      "description": "A list of custom classifiers that the user has registered. By default, all built-in classifiers are included in a crawl, but these custom classifiers always override the default classifiers for a given classification. (string) ---",
      "nested_params": []
    },
    {
      "name": "TablePrefix",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "SchemaChangePolicy",
      "type": "dict",
      "required": false,
      "description": "The policy for the crawler's update and deletion behavior. UpdateBehavior (string) --- The update behavior when the crawler finds a changed schema. DeleteBehavior (string) --- The deletion behavior when the crawler finds a deleted object.",
      "nested_params": [
        {
          "name": "UpdateBehavior",
          "type": "string",
          "required": false,
          "description": "The update behavior when the crawler finds a changed schema.",
          "nested_params": []
        },
        {
          "name": "DeleteBehavior",
          "type": "string",
          "required": false,
          "description": "The deletion behavior when the crawler finds a deleted object.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "RecrawlPolicy",
      "type": "dict",
      "required": false,
      "description": "A policy that specifies whether to crawl the entire dataset again, or to crawl only folders that were added since the last crawler run. RecrawlBehavior (string) --- Specifies whether to crawl the entire dataset again or to crawl only folders that were added since the last crawler run. A value of CRAWL_EVERYTHING specifies crawling the entire dataset again. A value of CRAWL_NEW_FOLDERS_ONLY specifies crawling only folders that were added since the last crawler run. A value of CRAWL_EVENT_MODE specifies crawling only the changes identified by Amazon S3 events.",
      "nested_params": [
        {
          "name": "RecrawlBehavior",
          "type": "string",
          "required": false,
          "description": "Specifies whether to crawl the entire dataset again or to crawl only folders that were added since the last crawler run. A value of CRAWL_EVERYTHING specifies crawling the entire dataset again. A value of CRAWL_NEW_FOLDERS_ONLY specifies crawling only folders that were added since the last crawler run. A value of CRAWL_EVENT_MODE specifies crawling only the changes identified by Amazon S3 events.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "LineageConfiguration",
      "type": "dict",
      "required": false,
      "description": "Specifies data lineage configuration settings for the crawler. CrawlerLineageSettings (string) --- Specifies whether data lineage is enabled for the crawler. Valid values are: ENABLE: enables data lineage for the crawler DISABLE: disables data lineage for the crawler.",
      "nested_params": [
        {
          "name": "CrawlerLineageSettings",
          "type": "string",
          "required": false,
          "description": "Specifies whether data lineage is enabled for the crawler. Valid values are:",
          "nested_params": []
        }
      ]
    },
    {
      "name": "LakeFormationConfiguration",
      "type": "dict",
      "required": false,
      "description": "Specifies Lake Formation configuration settings for the crawler. UseLakeFormationCredentials (boolean) --- Specifies whether to use Lake Formation credentials for the crawler instead of the IAM role credentials. AccountId (string) --- Required for cross account crawls. For same account crawls as the target data, this can be left as null.",
      "nested_params": [
        {
          "name": "UseLakeFormationCredentials",
          "type": "boolean",
          "required": false,
          "description": "Specifies whether to use Lake Formation credentials for the crawler instead of the IAM role credentials.",
          "nested_params": []
        },
        {
          "name": "AccountId",
          "type": "string",
          "required": false,
          "description": "Required for cross account crawls. For same account crawls as the target data, this can be left as null.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Configuration",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "CrawlerSecurityConfiguration",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}