{
  "method_name": "update_connectivity_info",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/greengrassv2/client/update_connectivity_info.html",
  "description": "Updates connectivity information for a Greengrass core device. Connectivity information includes endpoints and ports where client devices can connect to an MQTT broker on the core device. When a client device calls the IoT Greengrass discovery API, IoT Greengrass returns connectivity information for all of the core devices where the client device can connect. For more information, see Connect client devices to core devices in the IoT Greengrass Version 2 Developer Guide.",
  "parameters": [
    {
      "name": "thingName",
      "type": "string",
      "required": true,
      "description": "The name of the core device. This is also the name of the IoT thing.",
      "nested_params": []
    },
    {
      "name": "connectivityInfo",
      "type": "list",
      "required": true,
      "description": "The connectivity information for the core device. (dict) --- Contains information about an endpoint and port where client devices can connect to an MQTT broker on a Greengrass core device. id (string) --- An ID for the connectivity information. hostAddress (string) --- The IP address or DNS address where client devices can connect to an MQTT broker on the Greengrass core device. portNumber (integer) --- The port where the MQTT broker operates on the core device. This port is typically 8883, which is the default port for the MQTT broker component that runs on core devices. metadata (string) --- Additional metadata to provide to client devices that connect to this core device.",
      "nested_params": [
        {
          "name": "id",
          "type": "string",
          "required": false,
          "description": "An ID for the connectivity information.",
          "nested_params": []
        },
        {
          "name": "hostAddress",
          "type": "string",
          "required": false,
          "description": "The IP address or DNS address where client devices can connect to an MQTT broker on the Greengrass core device.",
          "nested_params": []
        },
        {
          "name": "portNumber",
          "type": "integer",
          "required": false,
          "description": "The port where the MQTT broker operates on the core device. This port is typically 8883, which is the default port for the MQTT broker component that runs on core devices.",
          "nested_params": []
        },
        {
          "name": "metadata",
          "type": "string",
          "required": false,
          "description": "Additional metadata to provide to client devices that connect to this core device.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "version",
          "type": "string",
          "description": "The new version of the connectivity information for the core device.",
          "nested_items": []
        },
        {
          "name": "message",
          "type": "string",
          "description": "A message about the connectivity information update request.",
          "nested_items": []
        }
      ]
    }
  ]
}