{
  "method_name": "create_global_replication_group",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/elasticache/client/create_global_replication_group.html",
  "description": "Global Datastore offers fully managed, fast, reliable and secure cross-region replication. Using Global Datastore with Valkey or Redis OSS, you can create cross-region read replica clusters for ElastiCache to enable low-latency reads and disaster recovery across regions. For more information, see Replication Across Regions Using Global Datastore.",
  "parameters": [
    {
      "name": "GlobalReplicationGroupIdSuffix",
      "type": "string",
      "required": true,
      "description": "The suffix name of a Global datastore. Amazon ElastiCache automatically applies a prefix to the Global datastore ID when it is created. Each Amazon Region has its own prefix. For instance, a Global datastore ID created in the US-West-1 region will begin with 'dsdfu' along with the suffix name you provide. The suffix, combined with the auto-generated prefix, guarantees uniqueness of the Global datastore name across multiple regions. For a full list of Amazon Regions and their respective Global datastore iD prefixes, see Using the Amazon CLI with Global datastores.",
      "nested_params": []
    },
    {
      "name": "GlobalReplicationGroupDescription",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "PrimaryReplicationGroupId",
      "type": "string",
      "required": true,
      "description": "The name of the primary cluster that accepts writes and will replicate updates to the secondary cluster.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "GlobalReplicationGroup",
          "type": "dict",
          "description": "Consists of a primary cluster that accepts writes and an associated secondary cluster that resides in a different Amazon region. The secondary cluster accepts only reads. The primary cluster automatically replicates updates to the secondary cluster.",
          "nested_items": [
            {
              "name": "GlobalReplicationGroupIdSuffix",
              "type": "",
              "description": "",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}