{
  "method_name": "create_serverless_cache_snapshot",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/elasticache/client/create_serverless_cache_snapshot.html",
  "description": "This API creates a copy of an entire ServerlessCache at a specific moment in time. Available for Valkey, Redis OSS and Serverless Memcached only.",
  "parameters": [
    {
      "name": "ServerlessCacheSnapshotName",
      "type": "string",
      "required": true,
      "description": "The name for the snapshot being created. Must be unique for the customer account. Available for Valkey, Redis OSS and Serverless Memcached only. Must be between 1 and 255 characters.",
      "nested_params": []
    },
    {
      "name": "ServerlessCacheName",
      "type": "string",
      "required": true,
      "description": "The name of an existing serverless cache. The snapshot is created from this cache. Available for Valkey, Redis OSS and Serverless Memcached only.",
      "nested_params": []
    },
    {
      "name": "KmsKeyId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": false,
      "description": "A list of tags to be added to the snapshot resource. A tag is a key-value pair. Available for Valkey, Redis OSS and Serverless Memcached only. (dict) --- A tag that can be added to an ElastiCache cluster or replication group. Tags are composed of a Key/Value pair. You can use tags to categorize and track all your ElastiCache resources, with the exception of global replication group. When you add or remove tags on replication groups, those actions will be replicated to all nodes in the replication group. A tag with a null Value is permitted. Key (string) --- The key for the tag. May not be null. Value (string) --- The tag's value. May be null.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key for the tag. May not be null.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The tag's value. May be null.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ServerlessCacheSnapshot",
          "type": "dict",
          "description": "The state of a serverless cache snapshot at a specific point in time, to the millisecond. Available for Valkey, Redis OSS and Serverless Memcached only.",
          "nested_items": [
            {
              "name": "ServerlessCacheSnapshotName",
              "type": "string",
              "description": "The identifier of a serverless cache snapshot. Available for Valkey, Redis OSS and Serverless Memcached only.",
              "nested_items": []
            },
            {
              "name": "ARN",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of a serverless cache snapshot. Available for Valkey, Redis OSS and Serverless Memcached only.",
              "nested_items": []
            },
            {
              "name": "KmsKeyId",
              "type": "string",
              "description": "The ID of the Amazon Web Services Key Management Service (KMS) key of a serverless cache snapshot. Available for Valkey, Redis OSS and Serverless Memcached only.",
              "nested_items": []
            },
            {
              "name": "SnapshotType",
              "type": "string",
              "description": "The type of snapshot of serverless cache. Available for Valkey, Redis OSS and Serverless Memcached only.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The current status of the serverless cache. Available for Valkey, Redis OSS and Serverless Memcached only.",
              "nested_items": []
            },
            {
              "name": "CreateTime",
              "type": "datetime",
              "description": "The date and time that the source serverless cache's metadata and cache data set was obtained for the snapshot. Available for Valkey, Redis OSS and Serverless Memcached only.",
              "nested_items": []
            },
            {
              "name": "ExpiryTime",
              "type": "datetime",
              "description": "The time that the serverless cache snapshot will expire. Available for Valkey, Redis OSS and Serverless Memcached only.",
              "nested_items": []
            },
            {
              "name": "BytesUsedForCache",
              "type": "string",
              "description": "The total size of a serverless cache snapshot, in bytes. Available for Valkey, Redis OSS and Serverless Memcached only.",
              "nested_items": []
            },
            {
              "name": "ServerlessCacheConfiguration",
              "type": "dict",
              "description": "The configuration of the serverless cache, at the time the snapshot was taken. Available for Valkey, Redis OSS and Serverless Memcached only.",
              "nested_items": [
                {
                  "name": "ServerlessCacheName",
                  "type": "string",
                  "description": "The identifier of a serverless cache.",
                  "nested_items": []
                },
                {
                  "name": "Engine",
                  "type": "string",
                  "description": "The engine that the serverless cache is configured with.",
                  "nested_items": []
                },
                {
                  "name": "MajorEngineVersion",
                  "type": "string",
                  "description": "The engine version number that the serverless cache is configured with.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}