{
  "method_name": "rescore",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kendra-ranking/client/rescore.html",
  "description": "Rescores or re-ranks search results from a search service such as OpenSearch (self managed). You use the semantic search capabilities of Amazon Kendra Intelligent Ranking to improve the search service's results.",
  "parameters": [
    {
      "name": "RescoreExecutionPlanId",
      "type": "string",
      "required": true,
      "description": "The identifier of the rescore execution plan. A rescore execution plan is an Amazon Kendra Intelligent Ranking resource used for provisioning the Rescore API.",
      "nested_params": []
    },
    {
      "name": "SearchQuery",
      "type": "string",
      "required": true,
      "description": "The input query from the search service.",
      "nested_params": []
    },
    {
      "name": "Documents",
      "type": "list",
      "required": true,
      "description": "The list of documents for Amazon Kendra Intelligent Ranking to rescore or rank on. (dict) --- Information about a document from a search service such as OpenSearch (self managed). Amazon Kendra Intelligent Ranking uses this information to rank and score on. The identifier of the document from the search service. GroupId (string) --- The optional group identifier of the document from the search service. Documents with the same group identifier are grouped together and processed as one document within the service. Title (string) --- The title of the search service's document. Body (string) --- The body text of the search service's document. TokenizedTitle (list) --- The title of the search service's document represented as a list of tokens or words. You must choose to provide Title or TokenizedTitle. You cannot provide both. (string) --- TokenizedBody (list) --- The body text of the search service's document represented as a list of tokens or words. You must choose to provide Body or TokenizedBody. (string) --- The original document score or rank from the search service. Amazon Kendra Intelligent Ranking gives the document a new score or rank based on its intelligent search algorithms.",
      "nested_params": [
        {
          "name": "Id",
          "type": "string",
          "required": false,
          "description": "The identifier of the document from the search service.",
          "nested_params": []
        },
        {
          "name": "GroupId",
          "type": "string",
          "required": false,
          "description": "The optional group identifier of the document from the search service. Documents with the same group identifier are grouped together and processed as one document within the service.",
          "nested_params": []
        },
        {
          "name": "Title",
          "type": "string",
          "required": false,
          "description": "The title of the search service's document.",
          "nested_params": []
        },
        {
          "name": "Body",
          "type": "string",
          "required": false,
          "description": "The body text of the search service's document.",
          "nested_params": []
        },
        {
          "name": "TokenizedTitle",
          "type": "list",
          "required": false,
          "description": "The title of the search service's document represented as a list of tokens or words. You must choose to provide Title or TokenizedTitle. You cannot provide both.",
          "nested_params": []
        },
        {
          "name": "TokenizedBody",
          "type": "list",
          "required": false,
          "description": "The body text of the search service's document represented as a list of tokens or words. You must choose to provide Body or TokenizedBody. You cannot provide both.",
          "nested_params": []
        },
        {
          "name": "OriginalScore",
          "type": "float",
          "required": false,
          "description": "The original document score or rank from the search service. Amazon Kendra Intelligent Ranking gives the document a new score or rank based on its intelligent search algorithms.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "RescoreId",
          "type": "string",
          "description": "The identifier associated with the scores that Amazon Kendra Intelligent Ranking gives to the results. Amazon Kendra Intelligent Ranking rescores or re-ranks the results for the search service.",
          "nested_items": []
        },
        {
          "name": "ResultItems",
          "type": "list",
          "description": "A list of result items for documents with new relevancy scores. The results are in descending order.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "DocumentId",
                  "type": "string",
                  "description": "The identifier of the document from the search service.",
                  "nested_items": []
                },
                {
                  "name": "Score",
                  "type": "float",
                  "description": "The relevancy score or rank that Amazon Kendra Intelligent Ranking gives to the result.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}