{
  "method_name": "update_rescore_execution_plan",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kendra-ranking/client/update_rescore_execution_plan.html",
  "description": "Updates a rescore execution plan. A rescore execution plan is an Amazon Kendra Intelligent Ranking resource used for provisioning the Rescore API. You can update the number of capacity units you require for Amazon Kendra Intelligent Ranking to rescore or re-rank a search service's results.",
  "parameters": [
    {
      "name": "Id",
      "type": "string",
      "required": true,
      "description": "The identifier of the rescore execution plan that you want to update.",
      "nested_params": []
    },
    {
      "name": "Name",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "CapacityUnits",
      "type": "dict",
      "required": true,
      "description": "You can set additional capacity units to meet the needs of your rescore execution plan. You are given a single capacity unit by default. If you want to use the default capacity, you don't set additional capacity units. For more information on the default capacity and additional capacity units, see Adjusting capacity. The amount of extra capacity for your rescore execution plan. A single extra capacity unit for a rescore execution plan provides 0.01 rescore requests per second. You can add up to 1000 extra capacity units.",
      "nested_params": [
        {
          "name": "RescoreCapacityUnits",
          "type": "integer",
          "required": false,
          "description": "The amount of extra capacity for your rescore execution plan. A single extra capacity unit for a rescore execution plan provides 0.01 rescore requests per second. You can add up to 1000 extra capacity units.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}