{
  "method_name": "create_organization",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/workmail/client/create_organization.html",
  "description": "Creates a new WorkMail organization. Optionally, you can choose to associate an existing AWS Directory Service directory with your organization. If an AWS Directory Service directory ID is specified, the organization alias must match the directory alias. If you choose not to associate an existing directory with your organization, then we create a new WorkMail directory for you. For more information, see Adding an organization in the WorkMail Administrator Guide. You can associate multiple email domains with an organization, then choose your default email domain from the WorkMail console. You can also associate a domain that is managed in an Amazon Route 53 public hosted zone. For more information, see Adding a domain and Choosing the default domain in the WorkMail Administrator Guide. Optionally, you can use a customer managed key from AWS Key Management Service (AWS KMS) to encrypt email for your organization. If you don't associate an AWS KMS key, WorkMail creates a default, AWS managed key for you.",
  "parameters": [
    {
      "name": "DirectoryId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Alias",
      "type": "string",
      "required": true,
      "description": "The organization alias.",
      "nested_params": []
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": false,
      "description": "The idempotency token associated with the request. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "Domains",
      "type": "list",
      "required": true,
      "description": "The email domains to associate with the organization. (dict) --- The domain to associate with an WorkMail organization. When you configure a domain hosted in Amazon Route 53 (Route 53), all recommended DNS records are added to the organization when you create it. For more information, see Adding a domain in the WorkMail Administrator Guide. The fully qualified domain name. HostedZoneId (string) --- The hosted zone ID for a domain hosted in Route 53. Required when configuring a domain hosted in Route 53.",
      "nested_params": [
        {
          "name": "DomainName",
          "type": "string",
          "required": false,
          "description": "The fully qualified domain name.",
          "nested_params": []
        },
        {
          "name": "HostedZoneId",
          "type": "string",
          "required": false,
          "description": "The hosted zone ID for a domain hosted in Route 53. Required when configuring a domain hosted in Route 53.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "KmsKeyArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "EnableInteroperability",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "OrganizationId",
          "type": "string",
          "description": "The organization ID.",
          "nested_items": []
        }
      ]
    }
  ]
}