{
  "method_name": "create_web_acl",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/wafv2/client/create_web_acl.html",
  "description": "Creates a  WebACL per the specifications provided. A web ACL defines a collection of rules to use to inspect and control web requests. Each rule has a statement that defines what to look for in web requests and an action that WAF applies to requests that match the statement. In the web ACL, you assign a default action to take (allow, block) for any request that does not match any of the rules. The rules in a web ACL can be a combination of the types  Rule,  RuleGroup, and managed rule group. You can associate a web ACL with one or more Amazon Web Services resources to protect. The resource types include Amazon CloudFront distribution, Amazon API Gateway REST API, Application Load Balancer, AppSync GraphQL API, Amazon Cognito user pool, App Runner service, Amplify application, and Amazon Web Services Verified Access instance.",
  "parameters": [],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "Name",
              "type": "string",
              "description": "The name of the web ACL. You cannot change the name of a web ACL after you create it.",
              "nested_items": []
            },
            {
              "name": "Id",
              "type": "string",
              "description": "The unique identifier for the web ACL. This ID is returned in the responses to create and list commands. You provide it to operations like update and delete.",
              "nested_items": []
            },
            {
              "name": "Description",
              "type": "string",
              "description": "A description of the web ACL that helps with identification.",
              "nested_items": []
            },
            {
              "name": "LockToken",
              "type": "string",
              "description": "A token used for optimistic locking. WAF returns a token to your get and list requests, to mark the state of the entity at the time of the request. To make changes to the entity associated with the token, you provide the token to operations like update and delete. WAF uses the token to ensure that no changes have been made to the entity since you last retrieved it. If a change has been made, the update fails with a WAFOptimisticLockException. If this happens, perform another get, and use the new token returned by that operation.",
              "nested_items": []
            },
            {
              "name": "ARN",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the entity.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}