{
  "method_name": "describe_all_managed_products",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/wafv2/client/describe_all_managed_products.html",
  "description": "Provides high-level information for the Amazon Web Services Managed Rules rule groups and Amazon Web Services Marketplace managed rule groups.",
  "parameters": [],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ManagedProducts",
          "type": "list",
          "description": "High-level information for the Amazon Web Services Managed Rules rule groups and Amazon Web Services Marketplace managed rule groups.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "VendorName",
                  "type": "string",
                  "description": "The name of the managed rule group vendor. You use this, along with the rule group name, to identify a rule group.",
                  "nested_items": []
                },
                {
                  "name": "ManagedRuleSetName",
                  "type": "string",
                  "description": "The name of the managed rule group. For example, AWSManagedRulesAnonymousIpList or AWSManagedRulesATPRuleSet.",
                  "nested_items": []
                },
                {
                  "name": "ProductId",
                  "type": "string",
                  "description": "A unique identifier for the rule group. This ID is returned in the responses to create and list commands. You provide it to operations like update and delete.",
                  "nested_items": []
                },
                {
                  "name": "ProductLink",
                  "type": "string",
                  "description": "For Amazon Web Services Marketplace managed rule groups only, the link to the rule group product page.",
                  "nested_items": []
                },
                {
                  "name": "ProductTitle",
                  "type": "string",
                  "description": "The display name for the managed rule group. For example, Anonymous IP list or Account takeover prevention.",
                  "nested_items": []
                },
                {
                  "name": "ProductDescription",
                  "type": "string",
                  "description": "A short description of the managed rule group.",
                  "nested_items": []
                },
                {
                  "name": "SnsTopicArn",
                  "type": "string",
                  "description": "The Amazon resource name (ARN) of the Amazon Simple Notification Service SNS topic that's used to provide notification of changes to the managed rule group. You can subscribe to the SNS topic to receive notifications when the managed rule group is modified, such as for new versions and for version expiration. For more information, see the Amazon Simple Notification Service Developer Guide.",
                  "nested_items": []
                },
                {
                  "name": "IsVersioningSupported",
                  "type": "boolean",
                  "description": "Indicates whether the rule group is versioned.",
                  "nested_items": []
                },
                {
                  "name": "IsAdvancedManagedRuleSet",
                  "type": "boolean",
                  "description": "Indicates whether the rule group provides an advanced set of protections, such as the the Amazon Web Services Managed Rules rule groups that are used for WAF intelligent threat mitigation.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}