{
  "method_name": "get_managed_rule_set",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/wafv2/client/get_managed_rule_set.html",
  "description": "Retrieves the specified managed rule set.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "The name of the managed rule set. You use this, along with the rule set ID, to identify the rule set. This name is assigned to the corresponding managed rule group, which your customers can access and use.",
      "nested_params": []
    },
    {
      "name": "Scope",
      "type": "string",
      "required": true,
      "description": "Specifies whether this is for a global resource type, such as a Amazon CloudFront distribution. For an Amplify application, use CLOUDFRONT. To work with CloudFront, you must also specify the Region US East (N. Virginia) as follows: CLI - Specify the Region when you use the CloudFront scope: --scope=CLOUDFRONT --region=us-east-1. API and SDKs - For all calls, use the Region endpoint us-east-1.",
      "nested_params": []
    },
    {
      "name": "Id",
      "type": "string",
      "required": true,
      "description": "A unique identifier for the managed rule set. The ID is returned in the responses to commands like list. You provide it to operations like get and update.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ManagedRuleSet",
          "type": "dict",
          "description": "The managed rule set that you requested.",
          "nested_items": [
            {
              "name": "Name",
              "type": "string",
              "description": "The name of the managed rule set. You use this, along with the rule set ID, to identify the rule set.",
              "nested_items": []
            },
            {
              "name": "Id",
              "type": "string",
              "description": "A unique identifier for the managed rule set. The ID is returned in the responses to commands like list. You provide it to operations like get and update.",
              "nested_items": []
            },
            {
              "name": "ARN",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the entity.",
              "nested_items": []
            },
            {
              "name": "Description",
              "type": "string",
              "description": "A description of the set that helps with identification.",
              "nested_items": []
            },
            {
              "name": "PublishedVersions",
              "type": "dict",
              "description": "The versions of this managed rule set that are available for use by customers.",
              "nested_items": [
                {
                  "name": "AssociatedRuleGroupArn",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "AssociatedRuleGroupArn",
                          "type": "string",
                          "description": "The Amazon Resource Name (ARN) of the vendor rule group that's used to define the published version of your managed rule group.",
                          "nested_items": []
                        },
                        {
                          "name": "Capacity",
                          "type": "integer",
                          "description": "The web ACL capacity units (WCUs) required for this rule group.",
                          "nested_items": []
                        },
                        {
                          "name": "ForecastedLifetime",
                          "type": "integer",
                          "description": "The amount of time you expect this version of your managed rule group to last, in days.",
                          "nested_items": []
                        },
                        {
                          "name": "PublishTimestamp",
                          "type": "datetime",
                          "description": "The time that you first published this version.",
                          "nested_items": []
                        },
                        {
                          "name": "LastUpdateTimestamp",
                          "type": "datetime",
                          "description": "The last time that you updated this version.",
                          "nested_items": []
                        },
                        {
                          "name": "ExpiryTimestamp",
                          "type": "datetime",
                          "description": "The time that this version is set to expire.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "RecommendedVersion",
              "type": "string",
              "description": "The version that you would like your customers to use.",
              "nested_items": []
            },
            {
              "name": "LabelNamespace",
              "type": "string",
              "description": "The label namespace prefix for the managed rule groups that are offered to customers from this managed rule set. All labels that are added by rules in the managed rule group have this prefix.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "The syntax for the label namespace prefix for a managed rule group is the following: awswaf:managed:<vendor>:<rule group name>:",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "When a rule with a label matches a web request, WAF adds the fully qualified label to the request. A fully qualified label is made up of the label namespace from the rule group or web ACL where the rule is defined and the label from the rule, separated by a colon: <label namespace>:<label from rule>",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "LockToken",
          "type": "string",
          "description": "A token used for optimistic locking. WAF returns a token to your get and list requests, to mark the state of the entity at the time of the request. To make changes to the entity associated with the token, you provide the token to operations like update and delete. WAF uses the token to ensure that no changes have been made to the entity since you last retrieved it. If a change has been made, the update fails with a WAFOptimisticLockException. If this happens, perform another get, and use the new token returned by that operation.",
          "nested_items": []
        }
      ]
    }
  ]
}