{
  "method_name": "create_private_dns_namespace",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/servicediscovery/client/create_private_dns_namespace.html",
  "description": "Creates a private namespace based on DNS, which is visible only inside a specified Amazon VPC. The namespace defines your service naming scheme. For example, if you name your namespace example.com and name your service backend, the resulting DNS name for the service is backend.example.com. Service instances that are registered using a private DNS namespace can be discovered using either a DiscoverInstances request or using DNS. For the current quota on the number of namespaces that you can create using the same Amazon Web Services account, see Cloud Map quotas in the Cloud Map Developer Guide.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "The name that you want to assign to this namespace. When you create a private DNS namespace, Cloud Map automatically creates an Amazon Route 53 private hosted zone that has the same name as the namespace.",
      "nested_params": []
    },
    {
      "name": "CreatorRequestId",
      "type": "string",
      "required": false,
      "description": "A unique string that identifies the request and that allows failed CreatePrivateDnsNamespace requests to be retried without the risk of running the operation twice. CreatorRequestId can be any unique string (for example, a date/timestamp). This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Vpc",
      "type": "string",
      "required": true,
      "description": "The ID of the Amazon VPC that you want to associate the namespace with.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "The tags to add to the namespace. Each tag consists of a key and an optional value that you define. Tags keys can be up to 128 characters in length, and tag values can be up to 256 characters in length. (dict) --- A custom key-value pair that's associated with a resource. The key identifier, or name, of the tag. The string value that's associated with the key of the tag. You can set the value of a tag to an empty string, but you can't set the value of a tag to null.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key identifier, or name, of the tag.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The string value that's associated with the key of the tag. You can set the value of a tag to an empty string, but you can't set the value of a tag to null.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Properties",
      "type": "dict",
      "required": true,
      "description": "Properties for the private DNS namespace. DNS properties for the private DNS namespace. Fields for the Start of Authority (SOA) record for the hosted zone for the private DNS namespace. The time to live (TTL) for purposes of negative caching.",
      "nested_params": [
        {
          "name": "DnsProperties",
          "type": "dict",
          "required": false,
          "description": "DNS properties for the private DNS namespace.",
          "nested_params": [
            {
              "name": "SOA",
              "type": "dict",
              "required": false,
              "description": "Fields for the Start of Authority (SOA) record for the hosted zone for the private DNS namespace.",
              "nested_params": [
                {
                  "name": "TTL",
                  "type": "integer",
                  "required": false,
                  "description": "The time to live (TTL) for purposes of negative caching.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "OperationId",
          "type": "string",
          "description": "A value that you can use to determine whether the request completed successfully. To get the status of the operation, see GetOperation.",
          "nested_items": []
        }
      ]
    }
  ]
}