{
  "method_name": "get_instance",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/servicediscovery/client/get_instance.html",
  "description": "Gets information about a specified instance.",
  "parameters": [
    {
      "name": "ServiceId",
      "type": "string",
      "required": true,
      "description": "The ID of the service that the instance is associated with.",
      "nested_params": []
    },
    {
      "name": "InstanceId",
      "type": "string",
      "required": true,
      "description": "The ID of the instance that you want to get information about.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "Id",
              "type": "string",
              "description": "An identifier that you want to associate with the instance. Note the following:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "If the service that's specified by ServiceId includes settings for an SRV record, the value of InstanceId is automatically included as part of the value for the SRV record. For more information, see DnsRecord > Type.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "You can use this value to update an existing instance.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "To register a new instance, you must specify a value that's unique among instances that you register by using the same service.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "If you specify an existing InstanceId and ServiceId, Cloud Map updates the existing DNS records. If there's also an existing health check, Cloud Map deletes the old health check and creates a new one.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "CreatorRequestId",
              "type": "string",
              "description": "A unique string that identifies the request and that allows failed RegisterInstance requests to be retried without the risk of executing the operation twice. You must use a unique CreatorRequestId string every time you submit a RegisterInstance request if you're registering additional instances for the same namespace and service. CreatorRequestId can be any unique string (for example, a date/time stamp).",
              "nested_items": []
            },
            {
              "name": "Attributes",
              "type": "dict",
              "description": "A string map that contains the following information for the service that you specify in ServiceId:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "The attributes that apply to the records that are defined in the service.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "For each attribute, the applicable value.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}