{
  "method_name": "list_namespaces",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/servicediscovery/client/list_namespaces.html",
  "description": "Lists summary information about the namespaces that were created by the current Amazon Web Services account.",
  "parameters": [
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "For the first ListNamespaces request, omit this value. If the response contains NextToken, submit another ListNamespaces request to get the next group of results. Specify the value of NextToken from the previous response in the next request.",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": true,
      "description": "A complex type that contains specifications for the namespaces that you want to list. If you specify more than one filter, a namespace must match all filters to be returned by ListNamespaces. (dict) --- A complex type that identifies the namespaces that you want to list. You can choose to list public or private namespaces. Specify the namespaces that you want to get using one of the following. TYPE: Gets the namespaces of the specified type. NAME: Gets the namespaces with the specified name. HTTP_NAME: Gets the namespaces with the specified HTTP name. Specify the values that are applicable to the value that you specify for Name. TYPE: Specify HTTP, DNS_PUBLIC, or DNS_PRIVATE. NAME: Specify the name of the namespace, which is found in Namespace.Name. HTTP_NAME: Specify the HTTP name of the namespace, which is found in Namespace.Properties.HttpProperties.HttpName. (string) --- Condition (string) --- Specify the operator that you want to use to determine whether a namespace matches the specified value. Valid values for Condition are one of the following. EQ: When you specify EQ for Condition, you can specify only one value. EQ is supported for TYPE, NAME, and HTTP_NAME. EQ is the default condition and can be omitted. BEGINS_WITH: When you specify BEGINS_WITH for Condition, you can specify only one value. BEGINS_WITH is supported for TYPE, NAME, and HTTP_NAME.",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "Specify the namespaces that you want to get using one of the following.",
          "nested_params": []
        },
        {
          "name": "Values",
          "type": "list",
          "required": false,
          "description": "Specify the values that are applicable to the value that you specify for Name.",
          "nested_params": []
        },
        {
          "name": "Condition",
          "type": "string",
          "required": false,
          "description": "Specify the operator that you want to use to determine whether a namespace matches the specified value. Valid values for Condition are one of the following.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Namespaces",
          "type": "list",
          "description": "An array that contains one NamespaceSummary object for each namespace that matches the specified filter criteria.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Id",
                  "type": "string",
                  "description": "The ID of the namespace.",
                  "nested_items": []
                },
                {
                  "name": "Arn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) that Cloud Map assigns to the namespace when you create it.",
                  "nested_items": []
                },
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The name of the namespace. When you create a namespace, Cloud Map automatically creates a Route 53 hosted zone that has the same name as the namespace.",
                  "nested_items": []
                },
                {
                  "name": "Type",
                  "type": "string",
                  "description": "The type of the namespace, either public or private.",
                  "nested_items": []
                },
                {
                  "name": "Description",
                  "type": "string",
                  "description": "A description for the namespace.",
                  "nested_items": []
                },
                {
                  "name": "ServiceCount",
                  "type": "integer",
                  "description": "The number of services that were created using the namespace.",
                  "nested_items": []
                },
                {
                  "name": "Properties",
                  "type": "dict",
                  "description": "The properties of the namespace.",
                  "nested_items": [
                    {
                      "name": "DnsProperties",
                      "type": "dict",
                      "description": "A complex type that contains the ID for the Route 53 hosted zone that Cloud Map creates when you create a namespace.",
                      "nested_items": [
                        {
                          "name": "HostedZoneId",
                          "type": "string",
                          "description": "The ID for the Route 53 hosted zone that Cloud Map creates when you create a namespace.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "TTL",
                              "type": "integer",
                              "description": "The time to live (TTL) for purposes of negative caching.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "HttpProperties",
                      "type": "dict",
                      "description": "A complex type that contains the name of an HTTP namespace.",
                      "nested_items": [
                        {
                          "name": "HttpName",
                          "type": "string",
                          "description": "The name of an HTTP namespace.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "CreateDate",
                  "type": "datetime",
                  "description": "The date and time that the namespace was created.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "If the response contains NextToken, submit another ListNamespaces request to get the next group of results. Specify the value of NextToken from the previous response in the next request.",
          "nested_items": []
        }
      ]
    }
  ]
}