{
  "method_name": "add_direct_query_data_source",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/opensearch/client/add_direct_query_data_source.html",
  "description": "Adds a new data source in Amazon OpenSearch Service so that you can perform direct queries on external data.",
  "parameters": [
    {
      "name": "DataSourceName",
      "type": "string",
      "required": true,
      "description": "A unique, user-defined label to identify the data source within your OpenSearch Service environment.",
      "nested_params": []
    },
    {
      "name": "DataSourceType",
      "type": "dict",
      "required": true,
      "description": "The supported Amazon Web Services service that you want to use as the source for direct queries in OpenSearch Service. CloudWatchLog (dict) --- Specifies CloudWatch Logs as a type of data source for direct queries. The unique identifier of the IAM role that grants OpenSearch Service permission to access the specified data source. SecurityLake (dict) --- Specifies Security Lake as a type of data source for direct queries. The unique identifier of the IAM role that grants OpenSearch Service permission to access the specified data source.",
      "nested_params": [
        {
          "name": "CloudWatchLog",
          "type": "dict",
          "required": false,
          "description": "Specifies CloudWatch Logs as a type of data source for direct queries.",
          "nested_params": [
            {
              "name": "RoleArn",
              "type": "string",
              "required": false,
              "description": "The unique identifier of the IAM role that grants OpenSearch Service permission to access the specified data source.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "SecurityLake",
          "type": "dict",
          "required": false,
          "description": "Specifies Security Lake as a type of data source for direct queries.",
          "nested_params": [
            {
              "name": "RoleArn",
              "type": "string",
              "required": false,
              "description": "The unique identifier of the IAM role that grants OpenSearch Service permission to access the specified data source.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "OpenSearchArns",
      "type": "list",
      "required": true,
      "description": "A list of Amazon Resource Names (ARNs) for the OpenSearch collections that are associated with the direct query data source. (string) --- The Amazon Resource Name (ARN) of the domain. See Identifiers for IAM Entities in Using Amazon Web Services Identity and Access Management for more information.",
      "nested_params": []
    },
    {
      "name": "TagList",
      "type": "list",
      "required": true,
      "description": "A list of tags attached to a domain. (dict) --- A tag (key-value pair) for an Amazon OpenSearch Service resource. The tag key. Tag keys must be unique for the domain to which they are attached. The value assigned to the corresponding tag key. Tag values can be null and don't have to be unique in a tag set. For example, you can have a key value pair in a tag set of project : Trinity and cost-center : Trinity.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The tag key. Tag keys must be unique for the domain to which they are attached.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value assigned to the corresponding tag key. Tag values can be null and don't have to be unique in a tag set. For example, you can have a key value pair in a tag set of project : Trinity and cost-center : Trinity.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "DataSourceArn",
          "type": "string",
          "description": "The unique, system-generated identifier that represents the data source.",
          "nested_items": []
        }
      ]
    }
  ]
}