{
  "method_name": "start_service_software_update",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/opensearch/client/start_service_software_update.html",
  "description": "Schedules a service software update for an Amazon OpenSearch Service domain. For more information, see Service software updates in Amazon OpenSearch Service.",
  "parameters": [
    {
      "name": "DomainName",
      "type": "string",
      "required": true,
      "description": "The name of the domain that you want to update to the latest service software.",
      "nested_params": []
    },
    {
      "name": "ScheduleAt",
      "type": "string",
      "required": false,
      "description": "When to start the service software update. NOW - Immediately schedules the update to happen in the current hour if there's capacity available. TIMESTAMP - Lets you specify a custom date and time to apply the update. If you specify this value, you must also provide a value for DesiredStartTime. OFF_PEAK_WINDOW - Marks the update to be picked up during an upcoming off-peak window. There's no guarantee that the update will happen during the next immediate window. Depending on capacity, it might happen in subsequent days. Default: NOW if you don't specify a value for DesiredStartTime, and TIMESTAMP if you do.",
      "nested_params": []
    },
    {
      "name": "DesiredStartTime",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ServiceSoftwareOptions",
          "type": "dict",
          "description": "The current status of the OpenSearch Service software update.",
          "nested_items": [
            {
              "name": "CurrentVersion",
              "type": "string",
              "description": "The current service software version present on the domain.",
              "nested_items": []
            },
            {
              "name": "NewVersion",
              "type": "string",
              "description": "The new service software version, if one is available.",
              "nested_items": []
            },
            {
              "name": "UpdateAvailable",
              "type": "boolean",
              "description": "True if you're able to update your service software version. False if you can't update your service software version.",
              "nested_items": []
            },
            {
              "name": "Cancellable",
              "type": "boolean",
              "description": "True if you're able to cancel your service software version update. False if you can't cancel your service software update.",
              "nested_items": []
            },
            {
              "name": "UpdateStatus",
              "type": "string",
              "description": "The status of your service software update.",
              "nested_items": []
            },
            {
              "name": "Description",
              "type": "string",
              "description": "A description of the service software update status.",
              "nested_items": []
            },
            {
              "name": "AutomatedUpdateDate",
              "type": "datetime",
              "description": "The timestamp, in Epoch time, until which you can manually request a service software update. After this date, we automatically update your service software.",
              "nested_items": []
            },
            {
              "name": "OptionalDeployment",
              "type": "boolean",
              "description": "True if a service software is never automatically updated. False if a service software is automatically updated after the automated update date.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}