{
  "method_name": "start_resource_state_update",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/imagebuilder/client/start_resource_state_update.html",
  "description": "Begin asynchronous resource state update for lifecycle changes to the specified image resources.",
  "parameters": [
    {
      "name": "resourceArn",
      "type": "string",
      "required": true,
      "description": "The ARN of the Image Builder resource that is updated. The state update might also impact associated resources.",
      "nested_params": []
    },
    {
      "name": "state",
      "type": "dict",
      "required": true,
      "description": "Indicates the lifecycle action to take for this request. status (string) --- Shows the current lifecycle policy action that was applied to an impacted resource.",
      "nested_params": [
        {
          "name": "status",
          "type": "string",
          "required": false,
          "description": "Shows the current lifecycle policy action that was applied to an impacted resource.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "executionRole",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "includeResources",
      "type": "dict",
      "required": false,
      "description": "A list of image resources to update state for. amis (boolean) --- Specifies whether the lifecycle action should apply to distributed AMIs snapshots (boolean) --- Specifies whether the lifecycle action should apply to snapshots associated with distributed AMIs. containers (boolean) --- Specifies whether the lifecycle action should apply to distributed containers.",
      "nested_params": [
        {
          "name": "amis",
          "type": "boolean",
          "required": false,
          "description": "Specifies whether the lifecycle action should apply to distributed AMIs.",
          "nested_params": []
        },
        {
          "name": "snapshots",
          "type": "boolean",
          "required": false,
          "description": "Specifies whether the lifecycle action should apply to snapshots associated with distributed AMIs.",
          "nested_params": []
        },
        {
          "name": "containers",
          "type": "boolean",
          "required": false,
          "description": "Specifies whether the lifecycle action should apply to distributed containers.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "exclusionRules",
      "type": "dict",
      "required": true,
      "description": "Skip action on the image resource and associated resources if specified exclusion rules are met. amis (dict) --- Defines criteria for AMIs that are excluded from lifecycle actions. isPublic (boolean) --- Configures whether public AMIs are excluded from the lifecycle action. regions (list) --- Configures Amazon Web Services Regions that are excluded from the lifecycle action. (string) --- sharedAccounts (list) --- Specifies Amazon Web Services accounts whose resources are excluded from the lifecycle action. (string) --- lastLaunched (dict) --- Specifies configuration details for Image Builder to exclude the most recent resources from lifecycle actions. The integer number of units for the time period. For example 6 (months). Defines the unit of time that the lifecycle policy uses to calculate elapsed time since the last instance launched from the AMI. For example: days, weeks, months, or years. tagMap (dict) --- Lists tags that should be excluded from lifecycle actions for the AMIs that have them. (string) --- (string) ---",
      "nested_params": [
        {
          "name": "amis",
          "type": "dict",
          "required": false,
          "description": "Defines criteria for AMIs that are excluded from lifecycle actions.",
          "nested_params": [
            {
              "name": "isPublic",
              "type": "boolean",
              "required": false,
              "description": "Configures whether public AMIs are excluded from the lifecycle action.",
              "nested_params": []
            },
            {
              "name": "regions",
              "type": "list",
              "required": false,
              "description": "Configures Amazon Web Services Regions that are excluded from the lifecycle action.",
              "nested_params": []
            },
            {
              "name": "sharedAccounts",
              "type": "list",
              "required": false,
              "description": "Specifies Amazon Web Services accounts whose resources are excluded from the lifecycle action.",
              "nested_params": []
            },
            {
              "name": "lastLaunched",
              "type": "dict",
              "required": false,
              "description": "Specifies configuration details for Image Builder to exclude the most recent resources from lifecycle actions.",
              "nested_params": [
                {
                  "name": "value",
                  "type": "integer",
                  "required": false,
                  "description": "The integer number of units for the time period. For example 6 (months).",
                  "nested_params": []
                },
                {
                  "name": "unit",
                  "type": "string",
                  "required": false,
                  "description": "Defines the unit of time that the lifecycle policy uses to calculate elapsed time since the last instance launched from the AMI. For example: days, weeks, months, or years.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "tagMap",
              "type": "dict",
              "required": false,
              "description": "Lists tags that should be excluded from lifecycle actions for the AMIs that have them.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "updateAt",
      "type": "datetime",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "clientToken",
      "type": "string",
      "required": true,
      "description": "Unique, case-sensitive identifier you provide to ensure idempotency of the request. For more information, see Ensuring idempotency in the Amazon EC2 API Reference. This field is autopopulated if not provided.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "lifecycleExecutionId",
          "type": "string",
          "description": "Identifies the lifecycle runtime instance that started the resource state update.",
          "nested_items": []
        },
        {
          "name": "resourceArn",
          "type": "string",
          "description": "The requested ARN of the Image Builder resource for the asynchronous update.",
          "nested_items": []
        }
      ]
    }
  ]
}