{
  "method_name": "authorize_security_group_ingress",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/authorize_security_group_ingress.html",
  "description": "Adds the specified inbound (ingress) rules to a security group. An inbound rule permits instances to receive traffic from the specified IPv4 or IPv6 address range, the IP address ranges that are specified by a prefix list, or the instances that are associated with a destination security group. For more information, see Security group rules. You must specify exactly one of the following sources: an IPv4 or IPv6 address range, a prefix list, or a security group. You must specify a protocol for each rule (for example, TCP). If the protocol is TCP or UDP, you must also specify a port or port range. If the protocol is ICMP or ICMPv6, you must also specify the ICMP/ICMPv6 type and code. Rule changes are propagated to instances associated with the security group as quickly as possible. However, a small delay might occur. For examples of rules that you can add to security groups for specific access scenarios, see Security group rules for different use cases in the Amazon EC2 User Guide. For more information about security group quotas, see Amazon VPC quotas in the Amazon VPC User Guide.",
  "parameters": [
    {
      "name": "CidrIp",
      "type": "string",
      "required": false,
      "description": "The IPv4 address range, in CIDR format. To specify an IPv6 address range, use IP permissions instead. To specify multiple rules and descriptions for the rules, use IP permissions instead.",
      "nested_params": []
    },
    {
      "name": "FromPort",
      "type": "integer",
      "required": false,
      "description": "If the protocol is TCP or UDP, this is the start of the port range. If the protocol is ICMP, this is the ICMP type or -1 (all ICMP types). To specify multiple rules and descriptions for the rules, use IP permissions instead.",
      "nested_params": []
    },
    {
      "name": "GroupId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "GroupName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "IpPermissions",
      "type": "list",
      "required": false,
      "description": "The permissions for the security group rules. (dict) --- Describes the permissions for a security group rule. IpProtocol (string) --- The IP protocol name ( tcp, udp, icmp, icmpv6) or number (see Protocol Numbers). Use -1 to specify all protocols. When authorizing security group rules, specifying -1 or a protocol number other than tcp, udp, icmp, or icmpv6 allows traffic on all ports, regardless of any port range you specify. For tcp, udp, and icmp, you must specify a port range. For icmpv6, the port range is optional; if you omit the port range, traffic for all types and codes is allowed. FromPort (integer) --- If the protocol is TCP or UDP, this is the start of the port range. If the protocol is ICMP or ICMPv6, this is the ICMP type or -1 (all ICMP types). ToPort (integer) --- If the protocol is TCP or UDP, this is the end of the port range. If the protocol is ICMP or ICMPv6, this is the ICMP code or -1 (all ICMP codes). If the start port is -1 (all ICMP types), then the end port must be -1 (all ICMP codes). UserIdGroupPairs (list) --- The security group and Amazon Web Services account ID pairs. (dict) --- Describes a security group and Amazon Web Services account ID pair. Description (string) --- A description for the security group rule that references this user ID group pair. Constraints: Up to 255 characters in length. Allowed characters are a-z, A-Z, 0-9, spaces, and ._-:/()#,@[]+=;{}!$* UserId (string) --- The ID of an Amazon Web Services account. For a referenced security group in another VPC, the account ID of the referenced security group is returned in the response. If the referenced security group is deleted, this value is not returned. GroupName (string) --- [Default VPC] The name of the security group. For a security group in a nondefault VPC, use the security group ID. For a referenced security group in another VPC, this value is not returned if the referenced security group is deleted. GroupId (string) --- The ID of the security group. VpcId (string) --- The ID of the VPC for the referenced security group, if applicable. VpcPeeringConnectionId (string) --- The ID of the VPC peering connection, if applicable. PeeringStatus (string) --- The status of a VPC peering connection, if applicable. IpRanges (list) --- The IPv4 address ranges. (dict) --- Describes an IPv4 address range. Description (string) --- A description for the security group rule that references this IPv4 address range. Allowed characters are a-z, A-Z, 0-9, spaces, and ._-:/()#,@[]+=&;{}!$* CidrIp (string) --- The IPv4 address range. You can either specify a CIDR block or a source security group, not both. To specify a single IPv4 address, use the /32 prefix length. Ipv6Ranges (list) --- The IPv6 address ranges. (dict) --- Describes an IPv6 address range. Description (string) --- A description for the security group rule that references this IPv6 address range. Allowed characters are a-z, A-Z, 0-9, spaces, and ._-:/()#,@[]+=&;{}!$* CidrIpv6 (string) --- The IPv6 address range. To specify a single IPv6 address, use the /128 prefix length. PrefixListIds (list) --- The prefix list IDs. (dict) --- Describes a prefix list ID. Description (string) --- A description for the security group rule that references this prefix list ID. Allowed characters are a-z, A-Z, 0-9, spaces, and ._-:/()#,@[]+=;{}!$* PrefixListId (string) --- The ID of the prefix.",
      "nested_params": [
        {
          "name": "IpProtocol",
          "type": "string",
          "required": false,
          "description": "The IP protocol name ( tcp, udp, icmp, icmpv6) or number (see Protocol Numbers). Use -1 to specify all protocols. When authorizing security group rules, specifying -1 or a protocol number other than tcp, udp, icmp, or icmpv6 allows traffic on all ports, regardless of any port range you specify. For tcp, udp, and icmp, you must specify a port range. For icmpv6, the port range is optional; if you omit the port range, traffic for all types and codes is allowed.",
          "nested_params": []
        },
        {
          "name": "FromPort",
          "type": "integer",
          "required": false,
          "description": "If the protocol is TCP or UDP, this is the start of the port range. If the protocol is ICMP or ICMPv6, this is the ICMP type or -1 (all ICMP types).",
          "nested_params": []
        },
        {
          "name": "ToPort",
          "type": "integer",
          "required": false,
          "description": "If the protocol is TCP or UDP, this is the end of the port range. If the protocol is ICMP or ICMPv6, this is the ICMP code or -1 (all ICMP codes). If the start port is -1 (all ICMP types), then the end port must be -1 (all ICMP codes).",
          "nested_params": []
        },
        {
          "name": "UserIdGroupPairs",
          "type": "list",
          "required": false,
          "description": "The security group and Amazon Web Services account ID pairs.",
          "nested_params": [
            {
              "name": "Description",
              "type": "string",
              "required": false,
              "description": "A description for the security group rule that references this user ID group pair. Constraints: Up to 255 characters in length. Allowed characters are a-z, A-Z, 0-9, spaces, and ._-:/()#,@[]+=;{}!$*",
              "nested_params": []
            },
            {
              "name": "UserId",
              "type": "string",
              "required": false,
              "description": "The ID of an Amazon Web Services account. For a referenced security group in another VPC, the account ID of the referenced security group is returned in the response. If the referenced security group is deleted, this value is not returned.",
              "nested_params": []
            },
            {
              "name": "GroupName",
              "type": "string",
              "required": false,
              "description": "[Default VPC] The name of the security group. For a security group in a nondefault VPC, use the security group ID. For a referenced security group in another VPC, this value is not returned if the referenced security group is deleted.",
              "nested_params": []
            },
            {
              "name": "GroupId",
              "type": "string",
              "required": false,
              "description": "The ID of the security group.",
              "nested_params": []
            },
            {
              "name": "VpcId",
              "type": "string",
              "required": false,
              "description": "The ID of the VPC for the referenced security group, if applicable.",
              "nested_params": []
            },
            {
              "name": "VpcPeeringConnectionId",
              "type": "string",
              "required": false,
              "description": "The ID of the VPC peering connection, if applicable.",
              "nested_params": []
            },
            {
              "name": "PeeringStatus",
              "type": "string",
              "required": false,
              "description": "The status of a VPC peering connection, if applicable.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "IpRanges",
          "type": "list",
          "required": false,
          "description": "The IPv4 address ranges.",
          "nested_params": [
            {
              "name": "Description",
              "type": "string",
              "required": false,
              "description": "A description for the security group rule that references this IPv4 address range. Constraints: Up to 255 characters in length. Allowed characters are a-z, A-Z, 0-9, spaces, and ._-:/()#,@[]+=&;{}!$*",
              "nested_params": []
            },
            {
              "name": "CidrIp",
              "type": "string",
              "required": false,
              "description": "The IPv4 address range. You can either specify a CIDR block or a source security group, not both. To specify a single IPv4 address, use the /32 prefix length.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Ipv6Ranges",
          "type": "list",
          "required": false,
          "description": "The IPv6 address ranges.",
          "nested_params": [
            {
              "name": "Description",
              "type": "string",
              "required": false,
              "description": "A description for the security group rule that references this IPv6 address range. Constraints: Up to 255 characters in length. Allowed characters are a-z, A-Z, 0-9, spaces, and ._-:/()#,@[]+=&;{}!$*",
              "nested_params": []
            },
            {
              "name": "CidrIpv6",
              "type": "string",
              "required": false,
              "description": "The IPv6 address range. You can either specify a CIDR block or a source security group, not both. To specify a single IPv6 address, use the /128 prefix length.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "PrefixListIds",
          "type": "list",
          "required": false,
          "description": "The prefix list IDs.",
          "nested_params": [
            {
              "name": "Description",
              "type": "string",
              "required": false,
              "description": "A description for the security group rule that references this prefix list ID. Constraints: Up to 255 characters in length. Allowed characters are a-z, A-Z, 0-9, spaces, and ._-:/()#,@[]+=;{}!$*",
              "nested_params": []
            },
            {
              "name": "PrefixListId",
              "type": "string",
              "required": false,
              "description": "The ID of the prefix.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "IpProtocol",
      "type": "string",
      "required": false,
      "description": "The IP protocol name ( tcp, udp, icmp) or number (see Protocol Numbers). To specify all protocols, use -1. To specify icmpv6, use IP permissions instead. If you specify a protocol other than one of the supported values, traffic is allowed on all ports, regardless of any ports that you specify. To specify multiple rules and descriptions for the rules, use IP permissions instead.",
      "nested_params": []
    },
    {
      "name": "SourceSecurityGroupName",
      "type": "string",
      "required": false,
      "description": "[Default VPC] The name of the source security group. The rule grants full ICMP, UDP, and TCP access. To create a rule with a specific protocol and port range, specify a set of IP permissions instead.",
      "nested_params": []
    },
    {
      "name": "SourceSecurityGroupOwnerId",
      "type": "string",
      "required": false,
      "description": "The Amazon Web Services account ID for the source security group, if the source security group is in a different account. The rule grants full ICMP, UDP, and TCP access. To create a rule with a specific protocol and port range, use IP permissions instead.",
      "nested_params": []
    },
    {
      "name": "ToPort",
      "type": "integer",
      "required": false,
      "description": "If the protocol is TCP or UDP, this is the end of the port range. If the protocol is ICMP, this is the ICMP code or -1 (all ICMP codes). If the start port is -1 (all ICMP types), then the end port must be -1 (all ICMP codes). To specify multiple rules and descriptions for the rules, use IP permissions instead.",
      "nested_params": []
    },
    {
      "name": "TagSpecifications",
      "type": "list",
      "required": false,
      "description": "The tags applied to the security group rule. (dict) --- The tags to apply to a resource when the resource is being created. When you specify a tag, you must specify the resource type to tag, otherwise the request will fail. ResourceType (string) --- The type of resource to tag on creation. Tags (list) --- The tags to apply to the resource. (dict) --- Describes a tag. Key (string) --- The key of the tag. Constraints: Tag keys are case-sensitive and accept a maximum of 127 Unicode characters. May not begin with aws:. Value (string) --- The value of the tag. Constraints: Tag values are case-sensitive and accept a maximum of 256 Unicode characters.",
      "nested_params": [
        {
          "name": "ResourceType",
          "type": "string",
          "required": false,
          "description": "The type of resource to tag on creation.",
          "nested_params": []
        },
        {
          "name": "Tags",
          "type": "list",
          "required": false,
          "description": "The tags to apply to the resource.",
          "nested_params": [
            {
              "name": "Key",
              "type": "string",
              "required": false,
              "description": "The key of the tag. Constraints: Tag keys are case-sensitive and accept a maximum of 127 Unicode characters. May not begin with aws:.",
              "nested_params": []
            },
            {
              "name": "Value",
              "type": "string",
              "required": false,
              "description": "The value of the tag. Constraints: Tag values are case-sensitive and accept a maximum of 256 Unicode characters.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Return",
          "type": "boolean",
          "description": "Returns true if the request succeeds; otherwise, returns an error.",
          "nested_items": []
        },
        {
          "name": "SecurityGroupRules",
          "type": "list",
          "description": "Information about the inbound (ingress) security group rules that were added.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "SecurityGroupRuleId",
                  "type": "string",
                  "description": "The ID of the security group rule.",
                  "nested_items": []
                },
                {
                  "name": "GroupId",
                  "type": "string",
                  "description": "The ID of the security group.",
                  "nested_items": []
                },
                {
                  "name": "GroupOwnerId",
                  "type": "string",
                  "description": "The ID of the Amazon Web Services account that owns the security group.",
                  "nested_items": []
                },
                {
                  "name": "IsEgress",
                  "type": "boolean",
                  "description": "Indicates whether the security group rule is an outbound rule.",
                  "nested_items": []
                },
                {
                  "name": "IpProtocol",
                  "type": "string",
                  "description": "The IP protocol name ( tcp, udp, icmp, icmpv6) or number (see Protocol Numbers).",
                  "nested_items": []
                },
                {
                  "name": "FromPort",
                  "type": "integer",
                  "description": "If the protocol is TCP or UDP, this is the start of the port range. If the protocol is ICMP or ICMPv6, this is the ICMP type or -1 (all ICMP types).",
                  "nested_items": []
                },
                {
                  "name": "ToPort",
                  "type": "integer",
                  "description": "If the protocol is TCP or UDP, this is the end of the port range. If the protocol is ICMP or ICMPv6, this is the ICMP code or -1 (all ICMP codes). If the start port is -1 (all ICMP types), then the end port must be -1 (all ICMP codes).",
                  "nested_items": []
                },
                {
                  "name": "CidrIpv4",
                  "type": "string",
                  "description": "The IPv4 CIDR range.",
                  "nested_items": []
                },
                {
                  "name": "CidrIpv6",
                  "type": "string",
                  "description": "The IPv6 CIDR range.",
                  "nested_items": []
                },
                {
                  "name": "PrefixListId",
                  "type": "string",
                  "description": "The ID of the prefix list.",
                  "nested_items": []
                },
                {
                  "name": "ReferencedGroupInfo",
                  "type": "dict",
                  "description": "Describes the security group that is referenced in the rule.",
                  "nested_items": [
                    {
                      "name": "GroupId",
                      "type": "string",
                      "description": "The ID of the security group.",
                      "nested_items": []
                    },
                    {
                      "name": "PeeringStatus",
                      "type": "string",
                      "description": "The status of a VPC peering connection, if applicable.",
                      "nested_items": []
                    },
                    {
                      "name": "UserId",
                      "type": "string",
                      "description": "The Amazon Web Services account ID.",
                      "nested_items": []
                    },
                    {
                      "name": "VpcId",
                      "type": "string",
                      "description": "The ID of the VPC.",
                      "nested_items": []
                    },
                    {
                      "name": "VpcPeeringConnectionId",
                      "type": "string",
                      "description": "The ID of the VPC peering connection (if applicable).",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Description",
                  "type": "string",
                  "description": "The security group rule description.",
                  "nested_items": []
                },
                {
                  "name": "Tags",
                  "type": "list",
                  "description": "The tags applied to the security group rule.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Key",
                          "type": "string",
                          "description": "The key of the tag.",
                          "nested_items": []
                        },
                        {
                          "name": "Value",
                          "type": "string",
                          "description": "The value of the tag.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "SecurityGroupRuleArn",
                  "type": "string",
                  "description": "The ARN of the security group rule.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}