{
  "method_name": "create_restore_image_task",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/create_restore_image_task.html",
  "description": "Starts a task that restores an AMI from an Amazon S3 object that was previously created by using CreateStoreImageTask. To use this API, you must have the required permissions. For more information, see Permissions for storing and restoring AMIs using Amazon S3 in the Amazon EC2 User Guide. For more information, see Store and restore an AMI using Amazon S3 in the Amazon EC2 User Guide.",
  "parameters": [
    {
      "name": "Bucket",
      "type": "string",
      "required": true,
      "description": "The name of the Amazon S3 bucket that contains the stored AMI object.",
      "nested_params": []
    },
    {
      "name": "ObjectKey",
      "type": "string",
      "required": true,
      "description": "The name of the stored AMI object in the bucket.",
      "nested_params": []
    },
    {
      "name": "Name",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "TagSpecifications",
      "type": "list",
      "required": false,
      "description": "The tags to apply to the AMI and snapshots on restoration. You can tag the AMI, the snapshots, or both. To tag the AMI, the value for ResourceType must be image. To tag the snapshots, the value for ResourceType must be snapshot. The same tag is applied to all of the snapshots that are created. (dict) --- The tags to apply to a resource when the resource is being created. When you specify a tag, you must specify the resource type to tag, otherwise the request will fail. ResourceType (string) --- The type of resource to tag on creation. Tags (list) --- The tags to apply to the resource. (dict) --- Describes a tag. Key (string) --- The key of the tag. Constraints: Tag keys are case-sensitive and accept a maximum of 127 Unicode characters. May not begin with aws:. Value (string) --- The value of the tag. Constraints: Tag values are case-sensitive and accept a maximum of 256 Unicode characters.",
      "nested_params": []
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ImageId",
          "type": "string",
          "description": "The AMI ID.",
          "nested_items": []
        }
      ]
    }
  ]
}