{
  "method_name": "describe_snapshots",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/describe_snapshots.html",
  "description": "Describes the specified EBS snapshots available to you or all of the EBS snapshots available to you. The snapshots available to you include public snapshots, private snapshots that you own, and private snapshots owned by other Amazon Web Services accounts for which you have explicit create volume permissions. The create volume permissions fall into the following categories: The list of snapshots returned can be filtered by specifying snapshot IDs, snapshot owners, or Amazon Web Services accounts with create volume permissions. If no options are specified, Amazon EC2 returns all snapshots for which you have create volume permissions. If you specify one or more snapshot IDs, only snapshots that have the specified IDs are returned. If you specify an invalid snapshot ID, an error is returned. If you specify a snapshot ID for which you do not have access, it is not included in the returned results. If you specify one or more snapshot owners using the OwnerIds option, only snapshots from the specified owners and for which you have access are returned. The results can include the Amazon Web Services account IDs of the specified owners, amazon for snapshots owned by Amazon, or self for snapshots that you own. If you specify a list of restorable users, only snapshots with create snapshot permissions for those users are returned. You can specify Amazon Web Services account IDs (if you own the snapshots), self for snapshots for which you own or have explicit permissions, or all for public snapshots. If you are describing a long list of snapshots, we recommend that you paginate the output to make the list more manageable. For more information, see Pagination. To get the state of fast snapshot restores for a snapshot, use  DescribeFastSnapshotRestores. For more information about EBS snapshots, see Amazon EBS snapshots in the Amazon EBS User Guide.",
  "parameters": [
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "OwnerIds",
      "type": "list",
      "required": false,
      "description": "Scopes the results to snapshots with the specified owners. You can specify a combination of Amazon Web Services account IDs, self, and amazon. (string) ---",
      "nested_params": []
    },
    {
      "name": "RestorableByUserIds",
      "type": "list",
      "required": false,
      "description": "The IDs of the Amazon Web Services accounts that can create volumes from the snapshot. (string) ---",
      "nested_params": []
    },
    {
      "name": "SnapshotIds",
      "type": "list",
      "required": false,
      "description": "The snapshot IDs. Default: Describes the snapshots for which you have create volume permissions. (string) ---",
      "nested_params": []
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": false,
      "description": "The filters. description - A description of the snapshot. encrypted - Indicates whether the snapshot is encrypted ( true | false) owner-alias - The owner alias, from an Amazon-maintained list ( amazon). This is not the user-configured Amazon Web Services account alias set using the IAM console. We recommend that you use the related parameter instead of this filter. owner-id - The Amazon Web Services account ID of the owner. progress - The progress of the snapshot, as a percentage (for example, 80%). snapshot-id - The snapshot ID. start-time - The time stamp when the snapshot was initiated. status - The status of the snapshot ( pending | completed | error). storage-tier - The storage tier of the snapshot ( archive | standard). transfer-type - The type of operation used to create the snapshot ( time-based | standard). tag:<key> - The key/value combination of a tag assigned to the resource. Use the tag key in the filter name and the tag value as the filter value. For example, to find all resources that have a tag with the key Owner and the value TeamA, specify tag:Owner for the filter name and TeamA for the filter value. tag-key - The key of a tag assigned to the resource. Use this filter to find all resources assigned a tag with a specific key, regardless of the tag value. volume-id - The ID of the volume the snapshot is for. volume-size - The size of the volume, in GiB. (dict) --- A filter name and value pair that is used to return a more specific list of results from a describe operation. Filters can be used to match a set of resources by specific criteria, such as tags, attributes, or IDs. If you specify multiple filters, the filters are joined with an AND, and the request returns only results that match all of the specified filters. For more information, see List and filter using the CLI and API in the Amazon EC2 User Guide. Name (string) --- The name of the filter. Filter names are case-sensitive. Values (list) --- The filter values. Filter values are case-sensitive. If you specify multiple values for a filter, the values are joined with an OR, and the request returns all results that match any of the specified values. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "NextToken",
          "type": "string",
          "description": "The token to include in another request to get the next page of items. This value is null when there are no more items to return.",
          "nested_items": []
        },
        {
          "name": "Snapshots",
          "type": "list",
          "description": "Information about the snapshots.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "OwnerAlias",
                  "type": "string",
                  "description": "The Amazon Web Services owner alias, from an Amazon-maintained list ( amazon). This is not the user-configured Amazon Web Services account alias set using the IAM console.",
                  "nested_items": []
                },
                {
                  "name": "OutpostArn",
                  "type": "string",
                  "description": "The ARN of the Outpost on which the snapshot is stored. For more information, see Amazon EBS local snapshots on Outposts in the Amazon EBS User Guide.",
                  "nested_items": []
                },
                {
                  "name": "Tags",
                  "type": "list",
                  "description": "Any tags assigned to the snapshot.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Key",
                          "type": "string",
                          "description": "The key of the tag.",
                          "nested_items": []
                        },
                        {
                          "name": "Value",
                          "type": "string",
                          "description": "The value of the tag.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "StorageTier",
                  "type": "string",
                  "description": "The storage tier in which the snapshot is stored. standard indicates that the snapshot is stored in the standard snapshot storage tier and that it is ready for use. archive indicates that the snapshot is currently archived and that it must be restored before it can be used.",
                  "nested_items": []
                },
                {
                  "name": "RestoreExpiryTime",
                  "type": "datetime",
                  "description": "Only for archived snapshots that are temporarily restored. Indicates the date and time when a temporarily restored snapshot will be automatically re-archived.",
                  "nested_items": []
                },
                {
                  "name": "SseType",
                  "type": "string",
                  "description": "Reserved for future use.",
                  "nested_items": []
                },
                {
                  "name": "AvailabilityZone",
                  "type": "string",
                  "description": "The Availability Zone or Local Zone of the snapshot. For example, us-west-1a (Availability Zone) or us-west-2-lax-1a (Local Zone).",
                  "nested_items": []
                },
                {
                  "name": "TransferType",
                  "type": "string",
                  "description": "Indicates whether the snapshot copy was created with a standard or time-based snapshot copy operation. Time-based snapshot copy operations complete within the completion duration specified in the request. Standard snapshot copy operations are completed on a best-effort basis.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "standard - The snapshot copy was created with a standard snapshot copy operation.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "time-based - The snapshot copy was created with a time-based snapshot copy operation.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "CompletionDurationMinutes",
                  "type": "integer",
                  "description": "The completion duration requested for the time-based snapshot copy operation.",
                  "nested_items": []
                },
                {
                  "name": "CompletionTime",
                  "type": "datetime",
                  "description": "The time stamp when the snapshot was completed.",
                  "nested_items": []
                },
                {
                  "name": "FullSnapshotSizeInBytes",
                  "type": "integer",
                  "description": "The full size of the snapshot, in bytes.",
                  "nested_items": []
                },
                {
                  "name": "SnapshotId",
                  "type": "string",
                  "description": "The ID of the snapshot. Each snapshot receives a unique identifier when it is created.",
                  "nested_items": []
                },
                {
                  "name": "VolumeId",
                  "type": "string",
                  "description": "The ID of the volume that was used to create the snapshot. Snapshots created by the  CopySnapshot action have an arbitrary volume ID that should not be used for any purpose.",
                  "nested_items": []
                },
                {
                  "name": "State",
                  "type": "string",
                  "description": "The snapshot state.",
                  "nested_items": []
                },
                {
                  "name": "StateMessage",
                  "type": "string",
                  "description": "Encrypted Amazon EBS snapshots are copied asynchronously. If a snapshot copy operation fails (for example, if the proper KMS permissions are not obtained) this field displays error state details to help you diagnose why the error occurred. This parameter is only returned by  DescribeSnapshots.",
                  "nested_items": []
                },
                {
                  "name": "StartTime",
                  "type": "datetime",
                  "description": "The time stamp when the snapshot was initiated.",
                  "nested_items": []
                },
                {
                  "name": "Progress",
                  "type": "string",
                  "description": "The progress of the snapshot, as a percentage.",
                  "nested_items": []
                },
                {
                  "name": "OwnerId",
                  "type": "string",
                  "description": "The ID of the Amazon Web Services account that owns the EBS snapshot.",
                  "nested_items": []
                },
                {
                  "name": "Description",
                  "type": "string",
                  "description": "The description for the snapshot.",
                  "nested_items": []
                },
                {
                  "name": "VolumeSize",
                  "type": "integer",
                  "description": "The size of the volume, in GiB.",
                  "nested_items": []
                },
                {
                  "name": "Encrypted",
                  "type": "boolean",
                  "description": "Indicates whether the snapshot is encrypted.",
                  "nested_items": []
                },
                {
                  "name": "KmsKeyId",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the KMS key that was used to protect the volume encryption key for the parent volume.",
                  "nested_items": []
                },
                {
                  "name": "DataEncryptionKeyId",
                  "type": "string",
                  "description": "The data encryption key identifier for the snapshot. This value is a unique identifier that corresponds to the data encryption key that was used to encrypt the original volume or snapshot copy. Because data encryption keys are inherited by volumes created from snapshots, and vice versa, if snapshots share the same data encryption key identifier, then they belong to the same volume/snapshot lineage. This parameter is only returned by  DescribeSnapshots.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}