{
  "method_name": "describe_client_vpn_routes",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/describe_client_vpn_routes.html",
  "description": "Describes the routes for the specified Client VPN endpoint.",
  "parameters": [
    {
      "name": "ClientVpnEndpointId",
      "type": "string",
      "required": true,
      "description": "The ID of the Client VPN endpoint.",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": false,
      "description": "One or more filters. Filter names and values are case-sensitive. destination-cidr - The CIDR of the route destination. origin - How the route was associated with the Client VPN endpoint ( associate | add-route). target-subnet - The ID of the subnet through which traffic is routed. (dict) --- A filter name and value pair that is used to return a more specific list of results from a describe operation. Filters can be used to match a set of resources by specific criteria, such as tags, attributes, or IDs. If you specify multiple filters, the filters are joined with an AND, and the request returns only results that match all of the specified filters. For more information, see List and filter using the CLI and API in the Amazon EC2 User Guide. Name (string) --- The name of the filter. Filter names are case-sensitive. Values (list) --- The filter values. Filter values are case-sensitive. If you specify multiple values for a filter, the values are joined with an OR, and the request returns all results that match any of the specified values. (string) ---",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Routes",
          "type": "list",
          "description": "Information about the Client VPN endpoint routes.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ClientVpnEndpointId",
                  "type": "string",
                  "description": "The ID of the Client VPN endpoint with which the route is associated.",
                  "nested_items": []
                },
                {
                  "name": "DestinationCidr",
                  "type": "string",
                  "description": "The IPv4 address range, in CIDR notation, of the route destination.",
                  "nested_items": []
                },
                {
                  "name": "TargetSubnet",
                  "type": "string",
                  "description": "The ID of the subnet through which traffic is routed.",
                  "nested_items": []
                },
                {
                  "name": "Type",
                  "type": "string",
                  "description": "The route type.",
                  "nested_items": []
                },
                {
                  "name": "Origin",
                  "type": "string",
                  "description": "Indicates how the route was associated with the Client VPN endpoint. associate indicates that the route was automatically added when the target network was associated with the Client VPN endpoint. add-route indicates that the route was manually added using the CreateClientVpnRoute action.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Code",
                      "type": "string",
                      "description": "The state of the Client VPN endpoint route.",
                      "nested_items": []
                    },
                    {
                      "name": "Message",
                      "type": "string",
                      "description": "A message about the status of the Client VPN endpoint route, if applicable.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Description",
                  "type": "string",
                  "description": "A brief description of the route.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The token to use to retrieve the next page of results. This value is null when there are no more results to return.",
          "nested_items": []
        }
      ]
    }
  ]
}