{
  "method_name": "modify_capacity_reservation",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/modify_capacity_reservation.html",
  "description": "Modifies a Capacity Reservation's capacity, instance eligibility, and the conditions under which it is to be released. You can't modify a Capacity Reservation's instance type, EBS optimization, platform, instance store settings, Availability Zone, or tenancy. If you need to modify any of these attributes, we recommend that you cancel the Capacity Reservation, and then create a new one with the required attributes. For more information, see Modify an active Capacity Reservation. The allowed modifications depend on the state of the Capacity Reservation:",
  "parameters": [
    {
      "name": "CapacityReservationId",
      "type": "string",
      "required": true,
      "description": "The ID of the Capacity Reservation.",
      "nested_params": []
    },
    {
      "name": "InstanceCount",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "EndDate",
      "type": "datetime",
      "required": false,
      "description": "The date and time at which the Capacity Reservation expires. When a Capacity Reservation expires, the reserved capacity is released and you can no longer launch instances into it. The Capacity Reservation's state changes to expired when it reaches its end date and time. The Capacity Reservation is cancelled within an hour from the specified time. For example, if you specify 5/31/2019, 13:30:55, the Capacity Reservation is guaranteed to end between 13:30:55 and 14:30:55 on 5/31/2019. You must provide an EndDate value if EndDateType is limited. Omit EndDate if EndDateType is unlimited.",
      "nested_params": []
    },
    {
      "name": "EndDateType",
      "type": "string",
      "required": false,
      "description": "Indicates the way in which the Capacity Reservation ends. A Capacity Reservation can have one of the following end types: unlimited - The Capacity Reservation remains active until you explicitly cancel it. Do not provide an EndDate value if EndDateType is unlimited. limited - The Capacity Reservation expires automatically at a specified date and time. You must provide an EndDate value if EndDateType is limited.",
      "nested_params": []
    },
    {
      "name": "Accept",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "AdditionalInfo",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "InstanceMatchCriteria",
      "type": "string",
      "required": false,
      "description": "The matching criteria (instance eligibility) that you want to use in the modified Capacity Reservation. If you change the instance eligibility of an existing Capacity Reservation from targeted to open, any running instances that match the attributes of the Capacity Reservation, have the CapacityReservationPreference set to open, and are not yet running in the Capacity Reservation, will automatically use the modified Capacity Reservation. To modify the instance eligibility, the Capacity Reservation must be completely idle (zero usage).",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Return",
          "type": "boolean",
          "description": "Returns true if the request succeeds; otherwise, it returns an error.",
          "nested_items": []
        }
      ]
    }
  ]
}