{
  "method_name": "modify_default_credit_specification",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/modify_default_credit_specification.html",
  "description": "Modifies the default credit option for CPU usage of burstable performance instances. The default credit option is set at the account level per Amazon Web Services Region, and is specified per instance family. All new burstable performance instances in the account launch using the default credit option. ModifyDefaultCreditSpecification is an asynchronous operation, which works at an Amazon Web Services Region level and modifies the credit option for each Availability Zone. All zones in a Region are updated within five minutes. But if instances are launched during this operation, they might not get the new credit option until the zone is updated. To verify whether the update has occurred, you can call GetDefaultCreditSpecification and check DefaultCreditSpecification for updates. For more information, see Burstable performance instances in the Amazon EC2 User Guide.",
  "parameters": [
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "InstanceFamily",
      "type": "string",
      "required": true,
      "description": "The instance family.",
      "nested_params": []
    },
    {
      "name": "CpuCredits",
      "type": "string",
      "required": true,
      "description": "The credit option for CPU usage of the instance family. Valid Values: standard | unlimited.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "InstanceFamilyCreditSpecification",
          "type": "dict",
          "description": "The default credit option for CPU usage of the instance family.",
          "nested_items": [
            {
              "name": "InstanceFamily",
              "type": "string",
              "description": "The instance family.",
              "nested_items": []
            },
            {
              "name": "CpuCredits",
              "type": "string",
              "description": "The default credit option for CPU usage of the instance family. Valid values are standard and unlimited.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}