{
  "method_name": "create_regex_match_set",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/waf-regional/client/create_regex_match_set.html",
  "description": "Creates a  RegexMatchSet. You then use  UpdateRegexMatchSet to identify the part of a web request that you want AWS WAF to inspect, such as the values of the User-Agent header or the query string. For example, you can create a RegexMatchSet that contains a RegexMatchTuple that looks for any requests with User-Agent headers that match a RegexPatternSet with pattern B[a@]dB[o0]t. You can then configure AWS WAF to reject those requests. To create and configure a RegexMatchSet, perform the following steps: For more information about how to use the AWS WAF API to allow or block HTTP requests, see the AWS WAF Developer Guide.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "A friendly name or description of the  RegexMatchSet. You can't change Name after you create a RegexMatchSet.",
      "nested_params": []
    },
    {
      "name": "ChangeToken",
      "type": "string",
      "required": true,
      "description": "The value returned by the most recent call to  GetChangeToken.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "RegexMatchSet",
          "type": "dict",
          "description": "A  RegexMatchSet that contains no RegexMatchTuple objects.",
          "nested_items": [
            {
              "name": "RegexMatchSetId",
              "type": "string",
              "description": "The RegexMatchSetId for a RegexMatchSet. You use RegexMatchSetId to get information about a RegexMatchSet (see  GetRegexMatchSet), update a RegexMatchSet (see  UpdateRegexMatchSet), insert a RegexMatchSet into a Rule or delete one from a Rule (see  UpdateRule), and delete a RegexMatchSet from AWS WAF (see  DeleteRegexMatchSet).",
              "nested_items": []
            },
            {
              "name": "Name",
              "type": "string",
              "description": "A friendly name or description of the  RegexMatchSet. You can't change Name after you create a RegexMatchSet.",
              "nested_items": []
            },
            {
              "name": "RegexMatchTuples",
              "type": "list",
              "description": "Contains an array of  RegexMatchTuple objects. Each RegexMatchTuple object contains:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "The part of a web request that you want AWS WAF to inspect, such as a query string or the value of the User-Agent header.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "a regular expression",
                  "description": "The identifier of the pattern (a regular expression) that you want AWS WAF to look for. For more information, see  RegexPatternSet.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Whether to perform any conversions on the request, such as converting it to lowercase, before inspecting it for the specified string.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "ChangeToken",
          "type": "string",
          "description": "The ChangeToken that you used to submit the CreateRegexMatchSet request. You can also use this value to query the status of the request. For more information, see  GetChangeTokenStatus.",
          "nested_items": []
        }
      ]
    }
  ]
}