{
  "method_name": "create_web_acl_migration_stack",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/waf-regional/client/create_web_acl_migration_stack.html",
  "description": "Creates an AWS CloudFormation WAFV2 template for the specified web ACL in the specified Amazon S3 bucket. Then, in CloudFormation, you create a stack from the template, to create the web ACL and its resources in AWS WAFV2. Use this to migrate your AWS WAF Classic web ACL to the latest version of AWS WAF. This is part of a larger migration procedure for web ACLs from AWS WAF Classic to the latest version of AWS WAF. For the full procedure, including caveats and manual steps to complete the migration and switch over to the new web ACL, see Migrating your AWS WAF Classic resources to AWS WAF in the AWS WAF Developer Guide.",
  "parameters": [
    {
      "name": "WebACLId",
      "type": "string",
      "required": true,
      "description": "The UUID of the WAF Classic web ACL that you want to migrate to WAF v2.",
      "nested_params": []
    },
    {
      "name": "S3BucketName",
      "type": "string",
      "required": true,
      "description": "The name of the Amazon S3 bucket to store the CloudFormation template in. The S3 bucket must be configured as follows for the migration: The bucket name must start with aws-waf-migration-. For example, aws-waf-migration-my-web-acl. The bucket must be in the Region where you are deploying the template. For example, for a web ACL in us-west-2, you must use an Amazon S3 bucket in us-west-2 and you must deploy the template stack to us-west-2. The bucket policies must permit the migration process to write data. For listings of the bucket policies, see the Examples section.",
      "nested_params": []
    },
    {
      "name": "IgnoreUnsupportedType",
      "type": "boolean",
      "required": true,
      "description": "Indicates whether to exclude entities that can't be migrated or to stop the migration. Set this to true to ignore unsupported entities in the web ACL during the migration. Otherwise, if AWS WAF encounters unsupported entities, it stops the process and throws an exception.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "S3ObjectUrl",
          "type": "string",
          "description": "The URL of the template created in Amazon S3.",
          "nested_items": []
        }
      ]
    }
  ]
}