{
  "method_name": "create_byte_match_set",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/waf-regional/client/create_byte_match_set.html",
  "description": "Creates a ByteMatchSet. You then use  UpdateByteMatchSet to identify the part of a web request that you want AWS WAF to inspect, such as the values of the User-Agent header or the query string. For example, you can create a ByteMatchSet that matches any requests with User-Agent headers that contain the string BadBot. You can then configure AWS WAF to reject those requests. To create and configure a ByteMatchSet, perform the following steps: For more information about how to use the AWS WAF API to allow or block HTTP requests, see the AWS WAF Developer Guide.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "A friendly name or description of the  ByteMatchSet. You can't change Name after you create a ByteMatchSet.",
      "nested_params": []
    },
    {
      "name": "ChangeToken",
      "type": "string",
      "required": true,
      "description": "The value returned by the most recent call to  GetChangeToken.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ByteMatchSet",
          "type": "dict",
          "description": "A  ByteMatchSet that contains no ByteMatchTuple objects.",
          "nested_items": [
            {
              "name": "ByteMatchSetId",
              "type": "string",
              "description": "The ByteMatchSetId for a ByteMatchSet. You use ByteMatchSetId to get information about a ByteMatchSet (see  GetByteMatchSet), update a ByteMatchSet (see  UpdateByteMatchSet), insert a ByteMatchSet into a Rule or delete one from a Rule (see  UpdateRule), and delete a ByteMatchSet from AWS WAF (see  DeleteByteMatchSet).",
              "nested_items": []
            },
            {
              "name": "Name",
              "type": "string",
              "description": "A friendly name or description of the  ByteMatchSet. You can't change Name after you create a ByteMatchSet.",
              "nested_items": []
            },
            {
              "name": "ByteMatchTuples",
              "type": "list",
              "description": "Specifies the bytes (typically a string that corresponds with ASCII characters) that you want AWS WAF to search for in web requests, the location in requests that you want AWS WAF to search, and other settings.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "FieldToMatch",
                      "type": "dict",
                      "description": "The part of a web request that you want AWS WAF to search, such as a specified header or a query string. For more information, see  FieldToMatch.",
                      "nested_items": [
                        {
                          "name": "Type",
                          "type": "string",
                          "description": "The part of the web request that you want AWS WAF to search for a specified string. Parts of a request that you can search include the following:",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "",
                              "description": "HEADER: A specified request header, for example, the value of the User-Agent or Referer header. If you choose HEADER for the type, specify the name of the header in Data.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "METHOD: The HTTP method, which indicated the type of operation that the request is asking the origin to perform. Amazon CloudFront supports the following methods: DELETE, GET, HEAD, OPTIONS, PATCH, POST, and PUT.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "QUERY_STRING: A query string, which is the part of a URL that appears after a ? character, if any.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "URI: The part of a web request that identifies a resource, for example, /images/daily-ad.jpg.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "BODY: The part of a request that contains any additional data that you want to send to your web server as the HTTP request body, such as data from a form. The request body immediately follows the request headers. Note that only the first 8192 bytes of the request body are forwarded to AWS WAF for inspection. To allow or block requests based on the length of the body, you can create a size constraint set. For more information, see  CreateSizeConstraintSet.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "SINGLE_QUERY_ARG: The parameter in the query string that you will inspect, such as UserName or SalesRegion. The maximum length for SINGLE_QUERY_ARG is 30 characters.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "ALL_QUERY_ARGS: Similar to SINGLE_QUERY_ARG, but rather than inspecting a single parameter, AWS WAF will inspect all parameters within the query for the value or regex pattern that you specify in TargetString.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "Data",
                          "type": "string",
                          "description": "When the value of Type is HEADER, enter the name of the header that you want AWS WAF to search, for example, User-Agent or Referer. The name of the header is not case sensitive.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "TargetString",
                      "type": "bytes",
                      "description": "The value that you want AWS WAF to search for. AWS WAF searches for the specified string in the part of web requests that you specified in FieldToMatch. The maximum length of the value is 50 bytes.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "HEADER: The value that you want AWS WAF to search for in the request header that you specified in  FieldToMatch, for example, the value of the User-Agent or Referer header.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "METHOD: The HTTP method, which indicates the type of operation specified in the request. CloudFront supports the following methods: DELETE, GET, HEAD, OPTIONS, PATCH, POST, and PUT.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "QUERY_STRING: The value that you want AWS WAF to search for in the query string, which is the part of a URL that appears after a ? character.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "URI: The value that you want AWS WAF to search for in the part of a URL that identifies a resource, for example, /images/daily-ad.jpg.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "BODY: The part of a request that contains any additional data that you want to send to your web server as the HTTP request body, such as data from a form. The request body immediately follows the request headers. Note that only the first 8192 bytes of the request body are forwarded to AWS WAF for inspection. To allow or block requests based on the length of the body, you can create a size constraint set. For more information, see  CreateSizeConstraintSet.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "SINGLE_QUERY_ARG: The parameter in the query string that you will inspect, such as UserName or SalesRegion. The maximum length for SINGLE_QUERY_ARG is 30 characters.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "ALL_QUERY_ARGS: Similar to SINGLE_QUERY_ARG, but instead of inspecting a single parameter, AWS WAF inspects all parameters within the query string for the value or regex pattern that you specify in TargetString.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "TextTransformation",
                      "type": "string",
                      "description": "Text transformations eliminate some of the unusual formatting that attackers use in web requests in an effort to bypass AWS WAF. If you specify a transformation, AWS WAF performs the transformation on FieldToMatch before inspecting it for a match.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "Delete the following characters: ' --\u0098 ^",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "Delete spaces before the following characters: / (",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "Replace the following characters with a space: , ;",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "Replace multiple spaces with one space.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "A-Z",
                          "description": "Convert uppercase letters (A-Z) to lowercase (a-z)",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "PositionalConstraint",
                      "type": "string",
                      "description": "Within the portion of a web request that you want to search (for example, in the query string, if any), specify where you want AWS WAF to search. Valid values include the following:",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "TargetString exactly matches the value of the specified part of the web request, such as the value of a header.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "_",
                          "description": "TargetString is at the beginning of the specified part of the web request and is followed by a character other than an alphanumeric character or underscore (_), for example, BadBot;.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "_",
                          "description": "TargetString is at the end of the specified part of the web request and is preceded by a character other than an alphanumeric character or underscore (_), for example, ;BadBot.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "_",
                          "description": "TargetString is in the middle of the specified part of the web request and is preceded and followed by characters other than alphanumeric characters or underscore (_), for example, -BadBot;.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "ChangeToken",
          "type": "string",
          "description": "The ChangeToken that you used to submit the CreateByteMatchSet request. You can also use this value to query the status of the request. For more information, see  GetChangeTokenStatus.",
          "nested_items": []
        }
      ]
    }
  ]
}