{
  "method_name": "create_geo_match_set",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/waf-regional/client/create_geo_match_set.html",
  "description": "Creates an  GeoMatchSet, which you use to specify which web requests you want to allow or block based on the country that the requests originate from. For example, if you're receiving a lot of requests from one or more countries and you want to block the requests, you can create an GeoMatchSet that contains those countries and then configure AWS WAF to block the requests. To create and configure a GeoMatchSet, perform the following steps: For more information about how to use the AWS WAF API to allow or block HTTP requests, see the AWS WAF Developer Guide.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "A friendly name or description of the  GeoMatchSet. You can't change Name after you create the GeoMatchSet.",
      "nested_params": []
    },
    {
      "name": "ChangeToken",
      "type": "string",
      "required": true,
      "description": "The value returned by the most recent call to  GetChangeToken.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "GeoMatchSet",
          "type": "dict",
          "description": "The  GeoMatchSet returned in the CreateGeoMatchSet response. The GeoMatchSet contains no GeoMatchConstraints.",
          "nested_items": [
            {
              "name": "GeoMatchSetId",
              "type": "string",
              "description": "The GeoMatchSetId for an GeoMatchSet. You use GeoMatchSetId to get information about a GeoMatchSet (see  GeoMatchSet), update a GeoMatchSet (see  UpdateGeoMatchSet), insert a GeoMatchSet into a Rule or delete one from a Rule (see  UpdateRule), and delete a GeoMatchSet from AWS WAF (see  DeleteGeoMatchSet).",
              "nested_items": []
            },
            {
              "name": "Name",
              "type": "string",
              "description": "A friendly name or description of the  GeoMatchSet. You can't change the name of an GeoMatchSet after you create it.",
              "nested_items": []
            },
            {
              "name": "GeoMatchConstraints",
              "type": "list",
              "description": "An array of  GeoMatchConstraint objects, which contain the country that you want AWS WAF to search for.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Type",
                      "type": "string",
                      "description": "The type of geographical area you want AWS WAF to search for. Currently Country is the only valid value.",
                      "nested_items": []
                    },
                    {
                      "name": "Value",
                      "type": "string",
                      "description": "The country that you want AWS WAF to search for.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "ChangeToken",
          "type": "string",
          "description": "The ChangeToken that you used to submit the CreateGeoMatchSet request. You can also use this value to query the status of the request. For more information, see  GetChangeTokenStatus.",
          "nested_items": []
        }
      ]
    }
  ]
}