{
  "method_name": "list_logging_configurations",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/waf-regional/client/list_logging_configurations.html",
  "description": "Returns an array of  LoggingConfiguration objects.",
  "parameters": [
    {
      "name": "NextMarker",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Limit",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "LoggingConfigurations",
          "type": "list",
          "description": "An array of  LoggingConfiguration objects.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ResourceArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the web ACL that you want to associate with LogDestinationConfigs.",
                  "nested_items": []
                },
                {
                  "name": "LogDestinationConfigs",
                  "type": "list",
                  "description": "An array of Amazon Kinesis Data Firehose ARNs.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "RedactedFields",
                  "type": "list",
                  "description": "The parts of the request that you want redacted from the logs. For example, if you redact the cookie field, the cookie field in the firehose will be xxx.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Type",
                          "type": "string",
                          "description": "The part of the web request that you want AWS WAF to search for a specified string. Parts of a request that you can search include the following:",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "",
                              "description": "HEADER: A specified request header, for example, the value of the User-Agent or Referer header. If you choose HEADER for the type, specify the name of the header in Data.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "METHOD: The HTTP method, which indicated the type of operation that the request is asking the origin to perform. Amazon CloudFront supports the following methods: DELETE, GET, HEAD, OPTIONS, PATCH, POST, and PUT.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "QUERY_STRING: A query string, which is the part of a URL that appears after a ? character, if any.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "URI: The part of a web request that identifies a resource, for example, /images/daily-ad.jpg.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "BODY: The part of a request that contains any additional data that you want to send to your web server as the HTTP request body, such as data from a form. The request body immediately follows the request headers. Note that only the first 8192 bytes of the request body are forwarded to AWS WAF for inspection. To allow or block requests based on the length of the body, you can create a size constraint set. For more information, see  CreateSizeConstraintSet.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "SINGLE_QUERY_ARG: The parameter in the query string that you will inspect, such as UserName or SalesRegion. The maximum length for SINGLE_QUERY_ARG is 30 characters.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "ALL_QUERY_ARGS: Similar to SINGLE_QUERY_ARG, but rather than inspecting a single parameter, AWS WAF will inspect all parameters within the query for the value or regex pattern that you specify in TargetString.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "Data",
                          "type": "string",
                          "description": "When the value of Type is HEADER, enter the name of the header that you want AWS WAF to search, for example, User-Agent or Referer. The name of the header is not case sensitive.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextMarker",
          "type": "string",
          "description": "If you have more LoggingConfigurations than the number that you specified for Limit in the request, the response includes a NextMarker value. To list more LoggingConfigurations, submit another ListLoggingConfigurations request, and specify the NextMarker value from the response in the NextMarker value in the next request.",
          "nested_items": []
        }
      ]
    }
  ]
}