{
  "method_name": "update_geo_match_set",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/waf-regional/client/update_geo_match_set.html",
  "description": "Inserts or deletes  GeoMatchConstraint objects in an GeoMatchSet. For each GeoMatchConstraint object, you specify the following values: To create and configure an GeoMatchSet, perform the following steps: When you update an GeoMatchSet, you specify the country that you want to add and/or the country that you want to delete. If you want to change a country, you delete the existing country and add the new one. For more information about how to use the AWS WAF API to allow or block HTTP requests, see the AWS WAF Developer Guide.",
  "parameters": [
    {
      "name": "GeoMatchSetId",
      "type": "string",
      "required": true,
      "description": "The GeoMatchSetId of the  GeoMatchSet that you want to update. GeoMatchSetId is returned by  CreateGeoMatchSet and by  ListGeoMatchSets.",
      "nested_params": []
    },
    {
      "name": "ChangeToken",
      "type": "string",
      "required": true,
      "description": "The value returned by the most recent call to  GetChangeToken.",
      "nested_params": []
    },
    {
      "name": "Updates",
      "type": "list",
      "required": true,
      "description": "An array of GeoMatchSetUpdate objects that you want to insert into or delete from an  GeoMatchSet. For more information, see the applicable data types: GeoMatchSetUpdate: Contains Action and GeoMatchConstraint GeoMatchConstraint: Contains Type and Value You can have only one Type and Value per GeoMatchConstraint. To add multiple countries, include multiple GeoMatchSetUpdate objects in your request. (dict) --- Specifies the type of update to perform to an  GeoMatchSet with  UpdateGeoMatchSet. Specifies whether to insert or delete a country with  UpdateGeoMatchSet. The country from which web requests originate that you want AWS WAF to search for. The type of geographical area you want AWS WAF to search for. Currently Country is the only valid value. The country that you want AWS WAF to search for.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ChangeToken",
          "type": "string",
          "description": "The ChangeToken that you used to submit the UpdateGeoMatchSet request. You can also use this value to query the status of the request. For more information, see  GetChangeTokenStatus.",
          "nested_items": []
        }
      ]
    }
  ]
}