{
  "method_name": "poll_for_third_party_jobs",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/codepipeline/client/poll_for_third_party_jobs.html",
  "description": "Determines whether there are any third party jobs for a job worker to act on. Used for partner actions only.",
  "parameters": [
    {
      "name": "actionTypeId",
      "type": "dict",
      "required": true,
      "description": "Represents information about an action type. A category defines what kind of action can be taken in the stage, and constrains the provider type for the action. Valid categories are limited to one of the following values. Source Build Test Deploy Invoke Approval Compute The creator of the action being called. There are three valid values for the Owner field in the action category section within your pipeline structure: AWS, ThirdParty, and Custom. For more information, see Valid Action Types and Providers in CodePipeline. The provider of the service being called by the action. Valid providers are determined by the action category. For example, an action in the Deploy category type might have a provider of CodeDeploy, which would be specified as CodeDeploy. A string that describes the action version.",
      "nested_params": [
        {
          "name": "category",
          "type": "string",
          "required": false,
          "description": "A category defines what kind of action can be taken in the stage, and constrains the provider type for the action. Valid categories are limited to one of the following values.",
          "nested_params": []
        },
        {
          "name": "owner",
          "type": "string",
          "required": false,
          "description": "The creator of the action being called. There are three valid values for the Owner field in the action category section within your pipeline structure: AWS, ThirdParty, and Custom. For more information, see Valid Action Types and Providers in CodePipeline.",
          "nested_params": []
        },
        {
          "name": "provider",
          "type": "string",
          "required": false,
          "description": "The provider of the service being called by the action. Valid providers are determined by the action category. For example, an action in the Deploy category type might have a provider of CodeDeploy, which would be specified as CodeDeploy. For more information, see Valid Action Types and Providers in CodePipeline.",
          "nested_params": []
        },
        {
          "name": "version",
          "type": "string",
          "required": false,
          "description": "A string that describes the action version.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "maxBatchSize",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "jobs",
          "type": "list",
          "description": "Information about the jobs to take action on.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "clientId",
                  "type": "string",
                  "description": "The clientToken portion of the clientId and clientToken pair used to verify that the calling entity is allowed access to the job and its details.",
                  "nested_items": []
                },
                {
                  "name": "jobId",
                  "type": "string",
                  "description": "The identifier used to identify the job in CodePipeline.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}