{
  "method_name": "start_pipeline_execution",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/codepipeline/client/start_pipeline_execution.html",
  "description": "Starts the specified pipeline. Specifically, it begins processing the latest commit to the source location specified as part of the pipeline.",
  "parameters": [
    {
      "name": "name",
      "type": "string",
      "required": true,
      "description": "The name of the pipeline to start.",
      "nested_params": []
    },
    {
      "name": "variables",
      "type": "list",
      "required": true,
      "description": "A list that overrides pipeline variables for a pipeline execution that's being started. Variable names must match [A-Za-z0-9@\\-_]+, and the values can be anything except an empty string. (dict) --- A pipeline-level variable used for a pipeline execution. The name of a pipeline-level variable. The value of a pipeline-level variable.",
      "nested_params": [
        {
          "name": "name",
          "type": "string",
          "required": false,
          "description": "The name of a pipeline-level variable.",
          "nested_params": []
        },
        {
          "name": "value",
          "type": "string",
          "required": false,
          "description": "The value of a pipeline-level variable.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "clientRequestToken",
      "type": "string",
      "required": false,
      "description": "The system-generated unique ID used to identify a unique execution request. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "sourceRevisions",
      "type": "list",
      "required": true,
      "description": "A list that allows you to specify, or override, the source revision for a pipeline execution that's being started. A source revision is the version with all the changes to your application code, or source artifact, for the pipeline execution. (dict) --- A list that allows you to specify, or override, the source revision for a pipeline execution that's being started. The name of the action where the override will be applied. The type of source revision, based on the source provider. For example, the revision type for the CodeCommit action provider is the commit ID. The source revision, or version of your source artifact, with the changes that you want to run in the pipeline execution.",
      "nested_params": [
        {
          "name": "actionName",
          "type": "string",
          "required": false,
          "description": "The name of the action where the override will be applied.",
          "nested_params": []
        },
        {
          "name": "revisionType",
          "type": "string",
          "required": false,
          "description": "The type of source revision, based on the source provider. For example, the revision type for the CodeCommit action provider is the commit ID.",
          "nested_params": []
        },
        {
          "name": "revisionValue",
          "type": "string",
          "required": false,
          "description": "The source revision, or version of your source artifact, with the changes that you want to run in the pipeline execution.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "pipelineExecutionId",
          "type": "string",
          "description": "The unique system-generated ID of the pipeline execution that was started.",
          "nested_items": []
        }
      ]
    }
  ]
}