{
  "method_name": "put_rum_metrics_destination",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/rum/client/put_rum_metrics_destination.html",
  "description": "Creates or updates a destination to receive extended metrics from CloudWatch RUM. You can send extended metrics to CloudWatch or to a CloudWatch Evidently experiment. For more information about extended metrics, see BatchCreateRumMetricDefinitions.",
  "parameters": [
    {
      "name": "AppMonitorName",
      "type": "string",
      "required": true,
      "description": "The name of the CloudWatch RUM app monitor that will send the metrics.",
      "nested_params": []
    },
    {
      "name": "Destination",
      "type": "string",
      "required": true,
      "description": "Defines the destination to send the metrics to. Valid values are CloudWatch and Evidently. If you specify Evidently, you must also specify the ARN of the CloudWatchEvidently experiment that is to be the destination and an IAM role that has permission to write to the experiment.",
      "nested_params": []
    },
    {
      "name": "DestinationArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "IamRoleArn",
      "type": "string",
      "required": false,
      "description": "This parameter is required if Destination is Evidently. If Destination is CloudWatch, don't use this parameter. This parameter specifies the ARN of an IAM role that RUM will assume to write to the Evidently experiment that you are sending metrics to. This role must have permission to write to that experiment. If you specify this parameter, you must be signed on to a role that has PassRole permissions attached to it, to allow the role to be passed. The CloudWatchAmazonCloudWatchRUMFullAccess policy doesn't include PassRole permissions.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}