{
  "method_name": "create_allow_list",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/macie2/client/create_allow_list.html",
  "description": "Creates and defines the settings for an allow list.",
  "parameters": [
    {
      "name": "clientToken",
      "type": "string",
      "required": true,
      "description": "A unique, case-sensitive token that you provide to ensure the idempotency of the request. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "criteria",
      "type": "dict",
      "required": true,
      "description": "The criteria that specify the text or text pattern to ignore. The criteria can be the location and name of an S3 object that lists specific text to ignore (s3WordsList), or a regular expression (regex) that defines a text pattern to ignore. regex (string) --- The regular expression (regex) that defines the text pattern to ignore. The expression can contain as many as 512 characters. s3WordsList (dict) --- The location and name of the S3 object that lists specific text to ignore. The full name of the S3 bucket that contains the object. The full name (key) of the object.",
      "nested_params": [
        {
          "name": "regex",
          "type": "string",
          "required": false,
          "description": "The regular expression (regex) that defines the text pattern to ignore. The expression can contain as many as 512 characters.",
          "nested_params": []
        },
        {
          "name": "s3WordsList",
          "type": "dict",
          "required": false,
          "description": "The location and name of the S3 object that lists specific text to ignore.",
          "nested_params": [
            {
              "name": "bucketName",
              "type": "string",
              "required": false,
              "description": "The full name of the S3 bucket that contains the object.",
              "nested_params": []
            },
            {
              "name": "objectKey",
              "type": "string",
              "required": false,
              "description": "The full name (key) of the object.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "name",
      "type": "string",
      "required": true,
      "description": "A custom name for the allow list. The name can contain as many as 128 characters.",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "dict",
      "required": false,
      "description": "A map of key-value pairs that specifies the tags to associate with the allow list. An allow list can have a maximum of 50 tags. Each tag consists of a tag key and an associated tag value. The maximum length of a tag key is 128 characters. The maximum length of a tag value is 256 characters. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "arn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the allow list.",
          "nested_items": []
        },
        {
          "name": "id",
          "type": "string",
          "description": "The unique identifier for the allow list.",
          "nested_items": []
        }
      ]
    }
  ]
}