{
  "method_name": "get_usage_statistics",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/macie2/client/get_usage_statistics.html",
  "description": "quotas and aggregated usage data for one or more accounts.",
  "parameters": [
    {
      "name": "filterBy",
      "type": "list",
      "required": false,
      "description": "An array of objects, one for each condition to use to filter the query results. If you specify more than one condition, Amazon Macie uses an AND operator to join the conditions. (dict) --- Specifies a condition for filtering the results of a query for quota and usage data for one or more Amazon Macie accounts. comparator (string) --- The operator to use in the condition. If the value for the key property is accountId, this value must be CONTAINS. If the value for the key property is any other supported field, this value can be EQ, GT, GTE, LT, LTE, or NE. key (string) --- The field to use in the condition. values (list) --- An array that lists values to use in the condition, based on the value for the field specified by the key property. If the value for the key property is accountId, this array can specify multiple values. Otherwise, this array can specify only one value. Valid values for each supported field are: accountId - The unique identifier for an Amazon Web Services account. freeTrialStartDate - The date and time, in UTC and extended ISO 8601 format, when the Amazon Macie free trial started for an account. serviceLimit - A Boolean (true or false) value that indicates whether an account has reached its monthly quota. total - A string that represents the current estimated cost for an account. (string) ---",
      "nested_params": [
        {
          "name": "comparator",
          "type": "string",
          "required": false,
          "description": "The operator to use in the condition. If the value for the key property is accountId, this value must be CONTAINS. If the value for the key property is any other supported field, this value can be EQ, GT, GTE, LT, LTE, or NE.",
          "nested_params": []
        },
        {
          "name": "key",
          "type": "string",
          "required": false,
          "description": "The field to use in the condition.",
          "nested_params": []
        },
        {
          "name": "values",
          "type": "list",
          "required": false,
          "description": "An array that lists values to use in the condition, based on the value for the field specified by the key property. If the value for the key property is accountId, this array can specify multiple values. Otherwise, this array can specify only one value. Valid values for each supported field are:",
          "nested_params": []
        }
      ]
    },
    {
      "name": "maxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "nextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "sortBy",
      "type": "dict",
      "required": false,
      "description": "The criteria to use to sort the query results. key (string) --- The field to sort the results by. orderBy (string) --- The sort order to apply to the results, based on the value for the field specified by the key property. Valid values are: ASC, sort the results in ascending order; and, DESC, sort the results in descending order.",
      "nested_params": [
        {
          "name": "key",
          "type": "string",
          "required": false,
          "description": "The field to sort the results by.",
          "nested_params": []
        },
        {
          "name": "orderBy",
          "type": "string",
          "required": false,
          "description": "The sort order to apply to the results, based on the value for the field specified by the key property. Valid values are: ASC, sort the results in ascending order; and, DESC, sort the results in descending order.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "timeRange",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "nextToken",
          "type": "string",
          "description": "The string to use in a subsequent request to get the next page of results in a paginated response. This value is null if there are no additional pages.",
          "nested_items": []
        },
        {
          "name": "records",
          "type": "list",
          "description": "An array of objects that contains the results of the query. Each object contains the data for an account that matches the filter criteria specified in the request.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "accountId",
                  "type": "string",
                  "description": "The unique identifier for the Amazon Web Services account that the data applies to.",
                  "nested_items": []
                },
                {
                  "name": "automatedDiscoveryFreeTrialStartDate",
                  "type": "datetime",
                  "description": "The date and time, in UTC and extended ISO 8601 format, when the free trial of automated sensitive data discovery started for the account. This value is null if automated sensitive data discovery hasn't been enabled for the account.",
                  "nested_items": []
                },
                {
                  "name": "freeTrialStartDate",
                  "type": "datetime",
                  "description": "The date and time, in UTC and extended ISO 8601 format, when the Amazon Macie free trial started for the account.",
                  "nested_items": []
                },
                {
                  "name": "usage",
                  "type": "list",
                  "description": "An array of objects that contains usage data and quotas for the account. Each object contains the data for a specific usage metric and the corresponding quota.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "currency",
                          "type": "string",
                          "description": "The type of currency that the value for the metric (estimatedCost) is reported in.",
                          "nested_items": []
                        },
                        {
                          "name": "estimatedCost",
                          "type": "string",
                          "description": "The estimated value for the metric.",
                          "nested_items": []
                        },
                        {
                          "name": "serviceLimit",
                          "type": "dict",
                          "description": "The current value for the quota that corresponds to the metric specified by the type field.",
                          "nested_items": [
                            {
                              "name": "isServiceLimited",
                              "type": "boolean",
                              "description": "Specifies whether the account has met the quota that corresponds to the metric specified by the UsageByAccount.type field in the response.",
                              "nested_items": []
                            },
                            {
                              "name": "unit",
                              "type": "string",
                              "description": "The unit of measurement for the value specified by the value field.",
                              "nested_items": []
                            },
                            {
                              "name": "value",
                              "type": "integer",
                              "description": "The value for the metric specified by the UsageByAccount.type field in the response.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "type",
                          "type": "string",
                          "description": "The name of the metric. Possible values are: AUTOMATED_OBJECT_MONITORING, to monitor S3 objects for automated sensitive data discovery; AUTOMATED_SENSITIVE_DATA_DISCOVERY, to analyze S3 objects for automated sensitive data discovery; DATA_INVENTORY_EVALUATION, to monitor S3 buckets; and, SENSITIVE_DATA_DISCOVERY, to run classification jobs.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "timeRange",
          "type": "string",
          "description": "The inclusive time period that the usage data applies to. Possible values are: MONTH_TO_DATE, for the current calendar month to date; and, PAST_30_DAYS, for the preceding 30 days.",
          "nested_items": []
        }
      ]
    }
  ]
}