{
  "method_name": "list_resource_profile_detections",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/macie2/client/list_resource_profile_detections.html",
  "description": "Retrieves information about the types and amount of sensitive data that Amazon Macie found in an S3 bucket.",
  "parameters": [
    {
      "name": "maxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "nextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "resourceArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the S3 bucket that the request applies to.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "detections",
          "type": "list",
          "description": "An array of objects, one for each type of sensitive data that Amazon Macie found in the bucket. Each object reports the number of occurrences of the specified type and provides information about the custom data identifier or managed data identifier that detected the data.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "arn",
                  "type": "string",
                  "description": "If the sensitive data was detected by a custom data identifier, the Amazon Resource Name (ARN) of the custom data identifier that detected the data. Otherwise, this value is null.",
                  "nested_items": []
                },
                {
                  "name": "count",
                  "type": "integer",
                  "description": "The total number of occurrences of the sensitive data.",
                  "nested_items": []
                },
                {
                  "name": "id",
                  "type": "string",
                  "description": "The unique identifier for the custom data identifier or managed data identifier that detected the sensitive data. For additional details about a specified managed data identifier, see Using managed data identifiers in the Amazon Macie User Guide.",
                  "nested_items": []
                },
                {
                  "name": "name",
                  "type": "string",
                  "description": "The name of the custom data identifier or managed data identifier that detected the sensitive data. For a managed data identifier, this value is the same as the unique identifier (id).",
                  "nested_items": []
                },
                {
                  "name": "suppressed",
                  "type": "boolean",
                  "description": "Specifies whether occurrences of this type of sensitive data are excluded (true) or included (false) in the bucket's sensitivity score, if the score is calculated by Amazon Macie.",
                  "nested_items": []
                },
                {
                  "name": "type",
                  "type": "string",
                  "description": "The type of data identifier that detected the sensitive data. Possible values are: CUSTOM, for a custom data identifier; and, MANAGED, for a managed data identifier.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "nextToken",
          "type": "string",
          "description": "The string to use in a subsequent request to get the next page of results in a paginated response. This value is null if there are no additional pages.",
          "nested_items": []
        }
      ]
    }
  ]
}