{
  "method_name": "update_classification_scope",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/macie2/client/update_classification_scope.html",
  "description": "Updates the classification scope settings for an account.",
  "parameters": [
    {
      "name": "id",
      "type": "string",
      "required": true,
      "description": "The unique identifier for the Amazon Macie resource that the request applies to.",
      "nested_params": []
    },
    {
      "name": "s3",
      "type": "dict",
      "required": true,
      "description": "The S3 buckets to add or remove from the exclusion list defined by the classification scope. The names of the S3 buckets to add or remove from the list. Depending on the value specified for the update operation (ClassificationScopeUpdateOperation), an array of strings that: lists the names of buckets to add or remove from the list, or specifies a new set of bucket names that overwrites all existing names in the list. Each string must be the full name of an existing S3 bucket. Values are case sensitive. (string) --- The name of an S3 bucket. Specifies how to apply the changes to the exclusion list. Valid values are: ADD - Append the specified bucket names to the current list. REMOVE - Remove the specified bucket names from the current list. REPLACE - Overwrite the current list with the specified list of bucket names. If you specify this value, Amazon Macie removes all existing names from the list and adds all the specified names to the list.",
      "nested_params": [
        {
          "name": "excludes",
          "type": "dict",
          "required": false,
          "description": "The names of the S3 buckets to add or remove from the list.",
          "nested_params": [
            {
              "name": "bucketNames",
              "type": "list",
              "required": false,
              "description": "Depending on the value specified for the update operation (ClassificationScopeUpdateOperation), an array of strings that: lists the names of buckets to add or remove from the list, or specifies a new set of bucket names that overwrites all existing names in the list. Each string must be the full name of an existing S3 bucket. Values are case sensitive.",
              "nested_params": []
            },
            {
              "name": "operation",
              "type": "string",
              "required": false,
              "description": "Specifies how to apply the changes to the exclusion list. Valid values are:",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}