{
  "method_name": "update_resource_profile_detections",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/macie2/client/update_resource_profile_detections.html",
  "description": "Updates the sensitivity scoring settings for an S3 bucket.",
  "parameters": [
    {
      "name": "resourceArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the S3 bucket that the request applies to.",
      "nested_params": []
    },
    {
      "name": "suppressDataIdentifiers",
      "type": "list",
      "required": false,
      "description": "An array of objects, one for each custom data identifier or managed data identifier that detected a type of sensitive data to exclude from the bucket's score. To include all sensitive data types in the score, don't specify any values for this array. (dict) --- Specifies a custom data identifier or managed data identifier that detected a type of sensitive data to exclude from an S3 bucket's sensitivity score. id (string) --- The unique identifier for the custom data identifier or managed data identifier that detected the type of sensitive data to exclude from the score. type (string) --- The type of data identifier that detected the sensitive data. Possible values are: CUSTOM, for a custom data identifier; and, MANAGED, for a managed data identifier.",
      "nested_params": [
        {
          "name": "id",
          "type": "string",
          "required": false,
          "description": "The unique identifier for the custom data identifier or managed data identifier that detected the type of sensitive data to exclude from the score.",
          "nested_params": []
        },
        {
          "name": "type",
          "type": "string",
          "required": false,
          "description": "The type of data identifier that detected the sensitive data. Possible values are: CUSTOM, for a custom data identifier; and, MANAGED, for a managed data identifier.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}