{
  "method_name": "update_sensitivity_inspection_template",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/macie2/client/update_sensitivity_inspection_template.html",
  "description": "Updates the settings for the sensitivity inspection template for an account.",
  "parameters": [
    {
      "name": "description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "excludes",
      "type": "dict",
      "required": false,
      "description": "The managed data identifiers to explicitly exclude (not use) when performing automated sensitive data discovery. To exclude an allow list or custom data identifier that's currently included by the template, update the values for the SensitivityInspectionTemplateIncludes.allowListIds and SensitivityInspectionTemplateIncludes.customDataIdentifierIds properties, respectively. managedDataIdentifierIds (list) --- An array of unique identifiers, one for each managed data identifier to exclude. To retrieve a list of valid values, use the ListManagedDataIdentifiers operation. (string) ---",
      "nested_params": [
        {
          "name": "managedDataIdentifierIds",
          "type": "list",
          "required": false,
          "description": "An array of unique identifiers, one for each managed data identifier to exclude. To retrieve a list of valid values, use the ListManagedDataIdentifiers operation.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "id",
      "type": "string",
      "required": true,
      "description": "The unique identifier for the Amazon Macie resource that the request applies to.",
      "nested_params": []
    },
    {
      "name": "includes",
      "type": "dict",
      "required": false,
      "description": "The allow lists, custom data identifiers, and managed data identifiers to explicitly include (use) when performing automated sensitive data discovery. allowListIds (list) --- An array of unique identifiers, one for each allow list to include. (string) --- customDataIdentifierIds (list) --- An array of unique identifiers, one for each custom data identifier to include. (string) --- managedDataIdentifierIds (list) --- An array of unique identifiers, one for each managed data identifier to include. Amazon Macie uses these managed data identifiers in addition to managed data identifiers that are subsequently released and recommended for automated sensitive data discovery. To retrieve a list of valid values for the managed data identifiers that are currently available, use the ListManagedDataIdentifiers operation. (string) ---",
      "nested_params": [
        {
          "name": "allowListIds",
          "type": "list",
          "required": false,
          "description": "An array of unique identifiers, one for each allow list to include.",
          "nested_params": []
        },
        {
          "name": "customDataIdentifierIds",
          "type": "list",
          "required": false,
          "description": "An array of unique identifiers, one for each custom data identifier to include.",
          "nested_params": []
        },
        {
          "name": "managedDataIdentifierIds",
          "type": "list",
          "required": false,
          "description": "An array of unique identifiers, one for each managed data identifier to include. Amazon Macie uses these managed data identifiers in addition to managed data identifiers that are subsequently released and recommended for automated sensitive data discovery. To retrieve a list of valid values for the managed data identifiers that are currently available, use the ListManagedDataIdentifiers operation.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}