{
  "method_name": "update_findings_filter",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/macie2/client/update_findings_filter.html",
  "description": "Updates the criteria and other settings for a findings filter.",
  "parameters": [
    {
      "name": "action",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "clientToken",
      "type": "string",
      "required": false,
      "description": "A unique, case-sensitive token that you provide to ensure the idempotency of the request. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "description",
      "type": "string",
      "required": false,
      "description": "A custom description of the filter. The description can contain as many as 512 characters. We strongly recommend that you avoid including any sensitive data in the description of a filter. Other users of your account might be able to see this description, depending on the actions that they're allowed to perform in Amazon Macie.",
      "nested_params": []
    },
    {
      "name": "findingCriteria",
      "type": "dict",
      "required": false,
      "description": "The criteria to use to filter findings. criterion (dict) --- A condition that specifies the property, operator, and one or more values to use to filter the results. (string) --- (dict) --- Specifies the operator to use in a property-based condition that filters the results of a query for findings. For detailed information and examples of each operator, see Fundamentals of filtering findings in the Amazon Macie User Guide. eq (list) --- The value for the property matches (equals) the specified value. If you specify multiple values, Macie uses OR logic to join the values. (string) --- eqExactMatch (list) --- The value for the property exclusively matches (equals an exact match for) all the specified values. If you specify multiple values, Amazon Macie uses AND logic to join the values. You can use this operator with the following properties: customDataIdentifiers.detections.arn, customDataIdentifiers.detections.name, resourcesAffected.s3Bucket.tags.key, resourcesAffected.s3Bucket.tags.value, resourcesAffected.s3Object.tags.key, resourcesAffected.s3Object.tags.value, sensitiveData.category, and sensitiveData.detections.type. (string) --- gt (integer) --- The value for the property is greater than the specified value. gte (integer) --- The value for the property is greater than or equal to the specified value. lt (integer) --- The value for the property is less than the specified value. lte (integer) --- The value for the property is less than or equal to the specified value. neq (list) --- The value for the property doesn't match (doesn't equal) the specified value. (string) ---",
      "nested_params": [
        {
          "name": "criterion",
          "type": "dict",
          "required": false,
          "description": "A condition that specifies the property, operator, and one or more values to use to filter the results.",
          "nested_params": [
            {
              "name": "eq",
              "type": "list",
              "required": false,
              "description": "The value for the property matches (equals) the specified value. If you specify multiple values, Macie uses OR logic to join the values.",
              "nested_params": []
            },
            {
              "name": "eqExactMatch",
              "type": "list",
              "required": false,
              "description": "The value for the property exclusively matches (equals an exact match for) all the specified values. If you specify multiple values, Amazon Macie uses AND logic to join the values. You can use this operator with the following properties: customDataIdentifiers.detections.arn, customDataIdentifiers.detections.name, resourcesAffected.s3Bucket.tags.key, resourcesAffected.s3Bucket.tags.value, resourcesAffected.s3Object.tags.key, resourcesAffected.s3Object.tags.value, sensitiveData.category, and sensitiveData.detections.type.",
              "nested_params": []
            },
            {
              "name": "gt",
              "type": "integer",
              "required": false,
              "description": "The value for the property is greater than the specified value.",
              "nested_params": []
            },
            {
              "name": "gte",
              "type": "integer",
              "required": false,
              "description": "The value for the property is greater than or equal to the specified value.",
              "nested_params": []
            },
            {
              "name": "lt",
              "type": "integer",
              "required": false,
              "description": "The value for the property is less than the specified value.",
              "nested_params": []
            },
            {
              "name": "lte",
              "type": "integer",
              "required": false,
              "description": "The value for the property is less than or equal to the specified value.",
              "nested_params": []
            },
            {
              "name": "neq",
              "type": "list",
              "required": false,
              "description": "The value for the property doesn't match (doesn't equal) the specified value. If you specify multiple values, Macie uses OR logic to join the values.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "id",
      "type": "string",
      "required": true,
      "description": "The unique identifier for the Amazon Macie resource that the request applies to.",
      "nested_params": []
    },
    {
      "name": "name",
      "type": "string",
      "required": false,
      "description": "A custom name for the filter. The name must contain at least 3 characters and can contain as many as 64 characters. We strongly recommend that you avoid including any sensitive data in the name of a filter. Other users of your account might be able to see this name, depending on the actions that they're allowed to perform in Amazon Macie.",
      "nested_params": []
    },
    {
      "name": "position",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "arn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the filter that was updated.",
          "nested_items": []
        },
        {
          "name": "id",
          "type": "string",
          "description": "The unique identifier for the filter that was updated.",
          "nested_items": []
        }
      ]
    }
  ]
}