{
  "method_name": "update_reveal_configuration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/macie2/client/update_reveal_configuration.html",
  "description": "Updates the status and configuration settings for retrieving occurrences of sensitive data reported by findings.",
  "parameters": [
    {
      "name": "configuration",
      "type": "dict",
      "required": true,
      "description": "The KMS key to use to encrypt the sensitive data, and the status of the configuration for the Amazon Macie account. kmsKeyId (string) --- The Amazon Resource Name (ARN), ID, or alias of the KMS key to use to encrypt sensitive data that's retrieved. The key must be an existing, customer managed, symmetric encryption key that's enabled in the same Amazon Web Services Region as the Amazon Macie account. If this value specifies an alias, it must include the following prefix: alias/. If this value specifies a key that's owned by another Amazon Web Services account, it must specify the ARN of the key or the ARN of the key's alias. The status of the configuration for the Amazon Macie account. In a response, possible values are: ENABLED, the configuration is currently enabled for the account; and, DISABLED, the configuration is currently disabled for the account. In a request, valid values are: ENABLED, enable the configuration for the account; and, DISABLED, disable the configuration for the account.",
      "nested_params": [
        {
          "name": "kmsKeyId",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN), ID, or alias of the KMS key to use to encrypt sensitive data that's retrieved. The key must be an existing, customer managed, symmetric encryption key that's enabled in the same Amazon Web Services Region as the Amazon Macie account. If this value specifies an alias, it must include the following prefix: alias/. If this value specifies a key that's owned by another Amazon Web Services account, it must specify the ARN of the key or the ARN of the key's alias.",
          "nested_params": []
        },
        {
          "name": "status",
          "type": "string",
          "required": false,
          "description": "The status of the configuration for the Amazon Macie account. In a response, possible values are: ENABLED, the configuration is currently enabled for the account; and, DISABLED, the configuration is currently disabled for the account. In a request, valid values are: ENABLED, enable the configuration for the account; and, DISABLED, disable the configuration for the account.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "retrievalConfiguration",
      "type": "dict",
      "required": true,
      "description": "The access method and settings to use when retrieving the sensitive data. The access method to use when retrieving sensitive data from affected S3 objects. Valid values are: ASSUME_ROLE, assume an IAM role that is in the affected Amazon Web Services account and delegates access to Amazon Macie; and, CALLER_CREDENTIALS, use the credentials of the IAM user who requests the sensitive data. If you specify ASSUME_ROLE, also specify the name of an existing IAM role for Macie to assume (roleName). roleName (string) --- The name of the IAM role that is in the affected Amazon Web Services account and Amazon Macie is allowed to assume when retrieving sensitive data from affected S3 objects for the account. The trust and permissions policies for the role must meet all requirements for Macie to assume the role.",
      "nested_params": [
        {
          "name": "retrievalMode",
          "type": "string",
          "required": false,
          "description": "The access method to use when retrieving sensitive data from affected S3 objects. Valid values are: ASSUME_ROLE, assume an IAM role that is in the affected Amazon Web Services account and delegates access to Amazon Macie; and, CALLER_CREDENTIALS, use the credentials of the IAM user who requests the sensitive data. If you specify ASSUME_ROLE, also specify the name of an existing IAM role for Macie to assume (roleName).",
          "nested_params": []
        },
        {
          "name": "roleName",
          "type": "string",
          "required": false,
          "description": "The name of the IAM role that is in the affected Amazon Web Services account and Amazon Macie is allowed to assume when retrieving sensitive data from affected S3 objects for the account. The trust and permissions policies for the role must meet all requirements for Macie to assume the role.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "configuration",
          "type": "dict",
          "description": "The KMS key to use to encrypt the sensitive data, and the status of the configuration for the Amazon Macie account.",
          "nested_items": [
            {
              "name": "kmsKeyId",
              "type": "string",
              "description": "The Amazon Resource Name (ARN), ID, or alias of the KMS key to use to encrypt sensitive data that's retrieved. The key must be an existing, customer managed, symmetric encryption key that's enabled in the same Amazon Web Services Region as the Amazon Macie account.",
              "nested_items": []
            },
            {
              "name": "status",
              "type": "string",
              "description": "The status of the configuration for the Amazon Macie account. In a response, possible values are: ENABLED, the configuration is currently enabled for the account; and, DISABLED, the configuration is currently disabled for the account. In a request, valid values are: ENABLED, enable the configuration for the account; and, DISABLED, disable the configuration for the account.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "retrievalConfiguration",
          "type": "dict",
          "description": "The access method and settings to use when retrieving the sensitive data.",
          "nested_items": [
            {
              "name": "externalId",
              "type": "string",
              "description": "The external ID to specify in the trust policy for the IAM role to assume when retrieving sensitive data from affected S3 objects (roleName). This value is null if the value for retrievalMode is CALLER_CREDENTIALS.",
              "nested_items": []
            },
            {
              "name": "retrievalMode",
              "type": "string",
              "description": "The access method that's used to retrieve sensitive data from affected S3 objects. Valid values are: ASSUME_ROLE, assume an IAM role that is in the affected Amazon Web Services account and delegates access to Amazon Macie (roleName); and, CALLER_CREDENTIALS, use the credentials of the IAM user who requests the sensitive data.",
              "nested_items": []
            },
            {
              "name": "roleName",
              "type": "string",
              "description": "The name of the IAM role that is in the affected Amazon Web Services account and Amazon Macie is allowed to assume when retrieving sensitive data from affected S3 objects for the account. This value is null if the value for retrievalMode is CALLER_CREDENTIALS.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}