{
  "method_name": "create_stack_set",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudformation/client/create_stack_set.html",
  "description": "Creates a stack set.",
  "parameters": [
    {
      "name": "StackSetName",
      "type": "string",
      "required": true,
      "description": "The name to associate with the stack set. The name must be unique in the Region where you create your stack set.",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "TemplateBody",
      "type": "string",
      "required": false,
      "description": "The structure that contains the template body, with a minimum length of 1 byte and a maximum length of 51,200 bytes. Conditional: You must specify either the TemplateBody or the TemplateURL parameter, but not both.",
      "nested_params": []
    },
    {
      "name": "TemplateURL",
      "type": "string",
      "required": false,
      "description": "The URL of a file that contains the template body. The URL must point to a template (maximum size: 1 MB) that's located in an Amazon S3 bucket or a Systems Manager document. The location for an Amazon S3 bucket must start with https://. Conditional: You must specify either the TemplateBody or the TemplateURL parameter, but not both.",
      "nested_params": []
    },
    {
      "name": "StackId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Parameters",
      "type": "list",
      "required": false,
      "description": "The input parameters for the stack set template. (dict) --- The Parameter data type. ParameterKey (string) --- The key associated with the parameter. If you don't specify a key and value for a particular parameter, CloudFormation uses the default value that's specified in your template. ParameterValue (string) --- The input value associated with the parameter. UsePreviousValue (boolean) --- During a stack update, use the existing parameter value that the stack is using for a given parameter key. If you specify true, do not specify a parameter value. ResolvedValue (string) --- Read-only. The value that corresponds to a Systems Manager parameter key. This field is returned only for Systems Manager parameter types in the template. For more information, see Specify existing resources at runtime with CloudFormation-supplied parameter types in the CloudFormation User Guide.",
      "nested_params": [
        {
          "name": "ParameterKey",
          "type": "string",
          "required": false,
          "description": "The key associated with the parameter. If you don't specify a key and value for a particular parameter, CloudFormation uses the default value that's specified in your template.",
          "nested_params": []
        },
        {
          "name": "ParameterValue",
          "type": "string",
          "required": false,
          "description": "The input value associated with the parameter.",
          "nested_params": []
        },
        {
          "name": "UsePreviousValue",
          "type": "boolean",
          "required": false,
          "description": "During a stack update, use the existing parameter value that the stack is using for a given parameter key. If you specify true, do not specify a parameter value.",
          "nested_params": []
        },
        {
          "name": "ResolvedValue",
          "type": "string",
          "required": false,
          "description": "Read-only. The value that corresponds to a Systems Manager parameter key. This field is returned only for Systems Manager parameter types in the template. For more information, see Specify existing resources at runtime with CloudFormation-supplied parameter types in the CloudFormation User Guide.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Capabilities",
      "type": "list",
      "required": false,
      "description": "In some cases, you must explicitly acknowledge that your stack set template contains certain capabilities in order for CloudFormation to create the stack set and related stack instances. CAPABILITY_IAM and CAPABILITY_NAMED_IAM Some stack templates might include resources that can affect permissions in your Amazon Web Services account; for example, by creating new IAM users. For those stack sets, you must explicitly acknowledge this by specifying one of these capabilities. The following IAM resources require you to specify either the CAPABILITY_IAM or CAPABILITY_NAMED_IAM capability. If you have IAM resources, you can specify either capability. If you have IAM resources with custom names, you must specify CAPABILITY_NAMED_IAM. If you don't specify either of these capabilities, CloudFormation returns an InsufficientCapabilities error. If your stack template contains these resources, we recommend that you review all permissions associated with them and edit their permissions if necessary. AWS::IAM::AccessKey AWS::IAM::Group AWS::IAM::InstanceProfile AWS::IAM::Policy AWS::IAM::Role AWS::IAM::User AWS::IAM::UserToGroupAddition For more information, see Acknowledging IAM resources in CloudFormation templates. CAPABILITY_AUTO_EXPAND Some templates reference macros. If your stack set template references one or more macros, you must create the stack set directly from the processed template, without first reviewing the resulting changes in a change set. To create the stack set directly, you must acknowledge this capability. For more information, see Perform custom processing on CloudFormation templates with template macros. (string) ---",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "The key-value pairs to associate with this stack set and the stacks created from it. CloudFormation also propagates these tags to supported resources that are created in the stacks. A maximum number of 50 tags can be specified. If you specify tags as part of a CreateStackSet action, CloudFormation checks to see if you have the required IAM permission to tag resources. If you don't, the entire CreateStackSet action fails with an access denied error, and the stack set is not created. (dict) --- The Tag type enables you to specify a key-value pair that can be used to store information about an CloudFormation stack. Required. A string used to identify this tag. You can specify a maximum of 128 characters for a tag key. Tags owned by Amazon Web Services have the reserved prefix: aws:. A string containing the value for this tag. You can specify a maximum of 256 characters for a tag value.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "Required. A string used to identify this tag. You can specify a maximum of 128 characters for a tag key. Tags owned by Amazon Web Services have the reserved prefix: aws:.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "Required. A string containing the value for this tag. You can specify a maximum of 256 characters for a tag value.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "AdministrationRoleARN",
      "type": "string",
      "required": false,
      "description": "The Amazon Resource Name (ARN) of the IAM role to use to create this stack set. Specify an IAM role only if you are using customized administrator roles to control which users or groups can manage specific stack sets within the same administrator account. For more information, see Grant self-managed permissions in the CloudFormation User Guide. Valid only if the permissions model is SELF_MANAGED.",
      "nested_params": []
    },
    {
      "name": "ExecutionRoleName",
      "type": "string",
      "required": false,
      "description": "The name of the IAM execution role to use to create the stack set. If you do not specify an execution role, CloudFormation uses the AWSCloudFormationStackSetExecutionRole role for the stack set operation. Specify an IAM role only if you are using customized execution roles to control which stack resources users and groups can include in their stack sets. Valid only if the permissions model is SELF_MANAGED.",
      "nested_params": []
    },
    {
      "name": "PermissionModel",
      "type": "string",
      "required": false,
      "description": "Describes how the IAM roles required for stack set operations are created. By default, SELF-MANAGED is specified. With self-managed permissions, you must create the administrator and execution roles required to deploy to target accounts. For more information, see Grant self-managed permissions. With service-managed permissions, StackSets automatically creates the IAM roles required to deploy to accounts managed by Organizations. For more information, see Activate trusted access for stack sets with Organizations.",
      "nested_params": []
    },
    {
      "name": "AutoDeployment",
      "type": "dict",
      "required": false,
      "description": "Describes whether StackSets automatically deploys to Organizations accounts that are added to the target organization or organizational unit (OU). For more information, see Manage automatic deployments for CloudFormation StackSets that use service-managed permissions in the CloudFormation User Guide. Required if the permissions model is SERVICE_MANAGED. (Not used with self-managed permissions.) Enabled (boolean) --- If set to true, StackSets automatically deploys additional stack instances to Organizations accounts that are added to a target organization or organizational unit (OU) in the specified Regions. If an account is removed from a target organization or OU, StackSets deletes stack instances from the account in the specified Regions. RetainStacksOnAccountRemoval (boolean) --- If set to true, stack resources are retained when an account is removed from a target organization or OU. If set to false, stack resources are deleted. Specify only if Enabled is set to True.",
      "nested_params": [
        {
          "name": "Enabled",
          "type": "boolean",
          "required": false,
          "description": "If set to true, StackSets automatically deploys additional stack instances to Organizations accounts that are added to a target organization or organizational unit (OU) in the specified Regions. If an account is removed from a target organization or OU, StackSets deletes stack instances from the account in the specified Regions.",
          "nested_params": []
        },
        {
          "name": "RetainStacksOnAccountRemoval",
          "type": "boolean",
          "required": false,
          "description": "If set to true, stack resources are retained when an account is removed from a target organization or OU. If set to false, stack resources are deleted. Specify only if Enabled is set to True.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "CallAs",
      "type": "string",
      "required": false,
      "description": "Specifies whether you are acting as an account administrator in the organization's management account or as a delegated administrator in a member account. By default, SELF is specified. Use SELF for stack sets with self-managed permissions. To create a stack set with service-managed permissions while signed in to the management account, specify SELF. To create a stack set with service-managed permissions while signed in to a delegated administrator account, specify DELEGATED_ADMIN. Your Amazon Web Services account must be registered as a delegated admin in the management account. For more information, see Register a delegated administrator in the CloudFormation User Guide. Stack sets with service-managed permissions are created in the management account, including stack sets that are created by delegated administrators. Valid only if the permissions model is SERVICE_MANAGED.",
      "nested_params": []
    },
    {
      "name": "ClientRequestToken",
      "type": "string",
      "required": false,
      "description": "A unique identifier for this CreateStackSet request. Specify this token if you plan to retry requests so that CloudFormation knows that you're not attempting to create another stack set with the same name. You might retry CreateStackSet requests to ensure that CloudFormation successfully received them. If you don't specify an operation ID, the SDK generates one automatically. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "ManagedExecution",
      "type": "dict",
      "required": false,
      "description": "Describes whether StackSets performs non-conflicting operations concurrently and queues conflicting operations. Active (boolean) --- When true, StackSets performs non-conflicting operations concurrently and queues conflicting operations. After conflicting operations finish, StackSets starts queued operations in request order. When false (default), StackSets performs one operation at a time in request order.",
      "nested_params": [
        {
          "name": "Active",
          "type": "boolean",
          "required": false,
          "description": "When true, StackSets performs non-conflicting operations concurrently and queues conflicting operations. After conflicting operations finish, StackSets starts queued operations in request order. When false (default), StackSets performs one operation at a time in request order.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "StackSetId",
          "type": "string",
          "description": "The ID of the stack set that you're creating.",
          "nested_items": []
        }
      ]
    }
  ]
}