{
  "method_name": "describe_stack_set",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudformation/client/describe_stack_set.html",
  "description": "Returns the description of the specified StackSet.",
  "parameters": [
    {
      "name": "StackSetName",
      "type": "string",
      "required": true,
      "description": "The name or unique ID of the stack set whose description you want.",
      "nested_params": []
    },
    {
      "name": "CallAs",
      "type": "string",
      "required": false,
      "description": "[Service-managed permissions] Specifies whether you are acting as an account administrator in the organization's management account or as a delegated administrator in a member account. By default, SELF is specified. Use SELF for stack sets with self-managed permissions. If you are signed in to the management account, specify SELF. If you are signed in to a delegated administrator account, specify DELEGATED_ADMIN. Your Amazon Web Services account must be registered as a delegated administrator in the management account. For more information, see Register a delegated administrator in the CloudFormation User Guide.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "StackSetName",
              "type": "string",
              "description": "The name that's associated with the stack set.",
              "nested_items": []
            },
            {
              "name": "StackSetId",
              "type": "string",
              "description": "The ID of the stack set.",
              "nested_items": []
            },
            {
              "name": "Description",
              "type": "string",
              "description": "A description of the stack set that you specify when the stack set is created or updated.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The status of the stack set.",
              "nested_items": []
            },
            {
              "name": "TemplateBody",
              "type": "string",
              "description": "The structure that contains the body of the template that was used to create or update the stack set.",
              "nested_items": []
            },
            {
              "name": "Parameters",
              "type": "list",
              "description": "A list of input parameters for a stack set.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "ParameterKey",
                      "type": "string",
                      "description": "The key associated with the parameter. If you don't specify a key and value for a particular parameter, CloudFormation uses the default value that's specified in your template.",
                      "nested_items": []
                    },
                    {
                      "name": "ParameterValue",
                      "type": "string",
                      "description": "The input value associated with the parameter.",
                      "nested_items": []
                    },
                    {
                      "name": "UsePreviousValue",
                      "type": "boolean",
                      "description": "During a stack update, use the existing parameter value that the stack is using for a given parameter key. If you specify true, do not specify a parameter value.",
                      "nested_items": []
                    },
                    {
                      "name": "ResolvedValue",
                      "type": "string",
                      "description": "Read-only. The value that corresponds to a Systems Manager parameter key. This field is returned only for Systems Manager parameter types in the template. For more information, see Specify existing resources at runtime with CloudFormation-supplied parameter types in the CloudFormation User Guide.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "Capabilities",
              "type": "list",
              "description": "The capabilities that are allowed in the stack set. Some stack set templates might include resources that can affect permissions in your Amazon Web Services account--\u0094for example, by creating new Identity and Access Management (IAM) users. For more information, see Acknowledging IAM resources in CloudFormation templates.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Tags",
              "type": "list",
              "description": "A list of tags that specify information about the stack set. A maximum number of 50 tags can be specified.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Key",
                      "type": "string",
                      "description": "Required. A string used to identify this tag. You can specify a maximum of 128 characters for a tag key. Tags owned by Amazon Web Services have the reserved prefix: aws:.",
                      "nested_items": []
                    },
                    {
                      "name": "Value",
                      "type": "string",
                      "description": "Required. A string containing the value for this tag. You can specify a maximum of 256 characters for a tag value.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "StackSetARN",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the stack set.",
              "nested_items": []
            },
            {
              "name": "AdministrationRoleARN",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the IAM role used to create or update the stack set.",
              "nested_items": []
            },
            {
              "name": "ExecutionRoleName",
              "type": "string",
              "description": "The name of the IAM execution role used to create or update the stack set.",
              "nested_items": []
            },
            {
              "name": "StackSetDriftDetectionDetails",
              "type": "dict",
              "description": "Detailed information about the drift status of the stack set.",
              "nested_items": [
                {
                  "name": "DriftStatus",
                  "type": "string",
                  "description": "Status of the stack set's actual configuration compared to its expected template and parameter configuration. A stack set is considered to have drifted if one or more of its stack instances have drifted from their expected template and parameter configuration.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "DRIFTED: One or more of the stack instances belonging to the stack set stack differs from the expected template and parameter configuration. A stack instance is considered to have drifted if one or more of the resources in the associated stack have drifted.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "NOT_CHECKED: CloudFormation hasn't checked the stack set for drift.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "IN_SYNC: All of the stack instances belonging to the stack set stack match from the expected template and parameter configuration.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "DriftDetectionStatus",
                  "type": "string",
                  "description": "The status of the stack set drift detection operation.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "COMPLETED: The drift detection operation completed without failing on any stack instances.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "FAILED: The drift detection operation exceeded the specified failure tolerance.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "PARTIAL_SUCCESS: The drift detection operation completed without exceeding the failure tolerance for the operation.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "IN_PROGRESS: The drift detection operation is currently being performed.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "STOPPED: The user has canceled the drift detection operation.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "LastDriftCheckTimestamp",
                  "type": "datetime",
                  "description": "Most recent time when CloudFormation performed a drift detection operation on the stack set. This value will be NULL for any stack set on which drift detection hasn't yet been performed.",
                  "nested_items": []
                },
                {
                  "name": "TotalStackInstancesCount",
                  "type": "integer",
                  "description": "The total number of stack instances belonging to this stack set.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "Stack instances that match the stack set configuration.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Stack instances that have drifted from the stack set configuration.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Stack instances where the drift detection operation has failed.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Stack instances currently being checked for drift.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "DriftedStackInstancesCount",
                  "type": "integer",
                  "description": "The number of stack instances that have drifted from the expected template and parameter configuration of the stack set. A stack instance is considered to have drifted if one or more of the resources in the associated stack don't match their expected configuration.",
                  "nested_items": []
                },
                {
                  "name": "InSyncStackInstancesCount",
                  "type": "integer",
                  "description": "The number of stack instances which match the expected template and parameter configuration of the stack set.",
                  "nested_items": []
                },
                {
                  "name": "InProgressStackInstancesCount",
                  "type": "integer",
                  "description": "The number of stack instances that are currently being checked for drift.",
                  "nested_items": []
                },
                {
                  "name": "FailedStackInstancesCount",
                  "type": "integer",
                  "description": "The number of stack instances for which the drift detection operation failed.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "AutoDeployment",
              "type": "dict",
              "description": "[Service-managed permissions] Describes whether StackSets automatically deploys to Organizations accounts that are added to a target organization or organizational unit (OU).",
              "nested_items": [
                {
                  "name": "Enabled",
                  "type": "boolean",
                  "description": "If set to true, StackSets automatically deploys additional stack instances to Organizations accounts that are added to a target organization or organizational unit (OU) in the specified Regions. If an account is removed from a target organization or OU, StackSets deletes stack instances from the account in the specified Regions.",
                  "nested_items": []
                },
                {
                  "name": "RetainStacksOnAccountRemoval",
                  "type": "boolean",
                  "description": "If set to true, stack resources are retained when an account is removed from a target organization or OU. If set to false, stack resources are deleted. Specify only if Enabled is set to True.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "PermissionModel",
              "type": "string",
              "description": "Describes how the IAM roles required for stack set operations are created.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "With self-managed permissions, you must create the administrator and execution roles required to deploy to target accounts. For more information, see Grant self-managed permissions.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "With service-managed permissions, StackSets automatically creates the IAM roles required to deploy to accounts managed by Organizations. For more information, see Activate trusted access for stack sets with Organizations.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "OrganizationalUnitIds",
              "type": "list",
              "description": "[Service-managed permissions] The organization root ID or organizational unit (OU) IDs that you specified for DeploymentTargets.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "ManagedExecution",
              "type": "dict",
              "description": "Describes whether StackSets performs non-conflicting operations concurrently and queues conflicting operations.",
              "nested_items": [
                {
                  "name": "Active",
                  "type": "boolean",
                  "description": "When true, StackSets performs non-conflicting operations concurrently and queues conflicting operations. After conflicting operations finish, StackSets starts queued operations in request order.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Regions",
              "type": "list",
              "description": "Returns a list of all Amazon Web Services Regions the given StackSet has stack instances deployed in. The Amazon Web Services Regions list output is in no particular order.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}