{
  "method_name": "describe_type",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudformation/client/describe_type.html",
  "description": "Returns detailed information about an extension that has been registered. If you specify a VersionId, DescribeType returns information about that specific extension version. Otherwise, it returns information about the default extension version.",
  "parameters": [
    {
      "name": "Type",
      "type": "string",
      "required": false,
      "description": "The kind of extension. Conditional: You must specify either TypeName and Type, or Arn.",
      "nested_params": []
    },
    {
      "name": "TypeName",
      "type": "string",
      "required": false,
      "description": "The name of the extension. Conditional: You must specify either TypeName and Type, or Arn.",
      "nested_params": []
    },
    {
      "name": "Arn",
      "type": "string",
      "required": false,
      "description": "The Amazon Resource Name (ARN) of the extension. Conditional: You must specify either TypeName and Type, or Arn.",
      "nested_params": []
    },
    {
      "name": "VersionId",
      "type": "string",
      "required": false,
      "description": "The ID of a specific version of the extension. The version ID is the value at the end of the Amazon Resource Name (ARN) assigned to the extension version when it is registered. If you specify a VersionId, DescribeType returns information about that specific extension version. Otherwise, it returns information about the default extension version.",
      "nested_params": []
    },
    {
      "name": "PublisherId",
      "type": "string",
      "required": false,
      "description": "The publisher ID of the extension publisher. Extensions provided by Amazon Web Services are not assigned a publisher ID.",
      "nested_params": []
    },
    {
      "name": "PublicVersionNumber",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Arn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the extension.",
          "nested_items": []
        },
        {
          "name": "Type",
          "type": "string",
          "description": "The kind of extension.",
          "nested_items": []
        },
        {
          "name": "TypeName",
          "type": "string",
          "description": "The name of the extension.",
          "nested_items": []
        },
        {
          "name": "DefaultVersionId",
          "type": "string",
          "description": "The ID of the default version of the extension. The default version is used when the extension version isn't specified.",
          "nested_items": []
        },
        {
          "name": "IsDefaultVersion",
          "type": "boolean",
          "description": "Whether the specified extension version is set as the default version.",
          "nested_items": []
        },
        {
          "name": "TypeTestsStatus",
          "type": "string",
          "description": "The contract test status of the registered extension version. To return the extension test status of a specific extension version, you must specify VersionId.",
          "nested_items": [
            {
              "name": "",
              "type": "CLI",
              "description": "PASSED: The extension has passed all its contract tests. An extension must have a test status of PASSED before it can be published. For more information, see Publishing extensions to make them available for public use in the CloudFormation Command Line Interface (CLI) User Guide.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "FAILED: The extension has failed one or more contract tests.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "IN_PROGRESS: Contract tests are currently being performed on the extension.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "NOT_TESTED: Contract tests haven't been performed on the extension.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "TypeTestsStatusDescription",
          "type": "string",
          "description": "The description of the test status. To return the extension test status of a specific extension version, you must specify VersionId.",
          "nested_items": []
        },
        {
          "name": "Description",
          "type": "string",
          "description": "The description of the extension.",
          "nested_items": []
        },
        {
          "name": "Schema",
          "type": "string",
          "description": "The schema that defines the extension.",
          "nested_items": []
        },
        {
          "name": "ProvisioningType",
          "type": "string",
          "description": "For resource type extensions, the provisioning behavior of the resource type. CloudFormation determines the provisioning type during registration, based on the types of handlers in the schema handler package submitted.",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "FULLY_MUTABLE: The resource type includes an update handler to process updates to the type during stack update operations.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "IMMUTABLE: The resource type doesn't include an update handler, so the type can't be updated and must instead be replaced during stack update operations.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "NON_PROVISIONABLE: The resource type doesn't include all the following handlers, and therefore can't actually be provisioned.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "create.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "read.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "delete.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "DeprecatedStatus",
          "type": "string",
          "description": "The deprecation status of the extension version.",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "LIVE: The extension is activated or registered and can be used in CloudFormation operations, dependent on its provisioning behavior and visibility scope.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "DEPRECATED: The extension has been deactivated or deregistered and can no longer be used in CloudFormation operations.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "LoggingConfig",
          "type": "dict",
          "description": "Contains logging configuration information for private extensions. This applies only to private extensions you have registered in your account. For public extensions, both those provided by Amazon Web Services and published by third parties, CloudFormation returns null. For more information, see RegisterType.",
          "nested_items": [
            {
              "name": "LogRoleArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the role that CloudFormation should assume when sending log entries to CloudWatch Logs.",
              "nested_items": []
            },
            {
              "name": "LogGroupName",
              "type": "string",
              "description": "The Amazon CloudWatch Logs group to which CloudFormation sends error logging information when invoking the extension's handlers.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "RequiredActivatedTypes",
          "type": "list",
          "description": "For extensions that are modules, the public third-party extensions that must be activated in your account in order for the module itself to be activated.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "TypeNameAlias",
                  "type": "string",
                  "description": "An alias assigned to the public extension, in this account and Region. If you specify an alias for the extension, CloudFormation treats the alias as the extension type name within this account and Region. You must use the alias to refer to the extension in your templates, API calls, and CloudFormation console.",
                  "nested_items": []
                },
                {
                  "name": "OriginalTypeName",
                  "type": "string",
                  "description": "The type name of the public extension.",
                  "nested_items": []
                },
                {
                  "name": "PublisherId",
                  "type": "string",
                  "description": "The publisher ID of the extension publisher.",
                  "nested_items": []
                },
                {
                  "name": "SupportedMajorVersions",
                  "type": "list",
                  "description": "A list of the major versions of the extension type that the macro supports.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "integer",
                      "description": "(integer) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "ExecutionRoleArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the IAM execution role used to register the extension. This applies only to private extensions you have registered in your account. For more information, see RegisterType.",
          "nested_items": []
        },
        {
          "name": "Visibility",
          "type": "string",
          "description": "The scope at which the extension is visible and usable in CloudFormation operations.",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "PRIVATE: The extension is only visible and usable within the account in which it is registered. CloudFormation marks any extensions you register as PRIVATE.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "PUBLIC: The extension is publicly visible and usable within any Amazon Web Services account.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "SourceUrl",
          "type": "string",
          "description": "The URL of the source code for the extension.",
          "nested_items": []
        },
        {
          "name": "DocumentationUrl",
          "type": "string",
          "description": "The URL of a page providing detailed documentation for this extension.",
          "nested_items": []
        },
        {
          "name": "LastUpdated",
          "type": "datetime",
          "description": "When the specified extension version was registered. This applies only to:",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "Private extensions you have registered in your account. For more information, see RegisterType.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "Public extensions you have activated in your account with auto-update specified. For more information, see ActivateType.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "TimeCreated",
          "type": "datetime",
          "description": "When the specified private extension version was registered or activated in your account.",
          "nested_items": []
        },
        {
          "name": "ConfigurationSchema",
          "type": "string",
          "description": "A JSON string that represent the current configuration data for the extension in this account and Region.",
          "nested_items": []
        },
        {
          "name": "PublisherId",
          "type": "string",
          "description": "The publisher ID of the extension publisher.",
          "nested_items": []
        },
        {
          "name": "OriginalTypeName",
          "type": "string",
          "description": "For public extensions that have been activated for this account and Region, the type name of the public extension.",
          "nested_items": []
        },
        {
          "name": "OriginalTypeArn",
          "type": "string",
          "description": "For public extensions that have been activated for this account and Region, the Amazon Resource Name (ARN) of the public extension.",
          "nested_items": []
        },
        {
          "name": "PublicVersionNumber",
          "type": "string",
          "description": "The version number of a public third-party extension.",
          "nested_items": []
        },
        {
          "name": "LatestPublicVersion",
          "type": "string",
          "description": "The latest version of a public extension that is available for use.",
          "nested_items": []
        },
        {
          "name": "IsActivated",
          "type": "boolean",
          "description": "Whether the extension is activated in the account and Region.",
          "nested_items": []
        },
        {
          "name": "AutoUpdate",
          "type": "boolean",
          "description": "Whether CloudFormation automatically updates the extension in this account and Region when a new minor version is published by the extension publisher. Major versions released by the publisher must be manually updated. For more information, see Automatically use new versions of extensions in the CloudFormation User Guide.",
          "nested_items": []
        }
      ]
    }
  ]
}