{
  "method_name": "describe_stack_drift_detection_status",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudformation/client/describe_stack_drift_detection_status.html",
  "description": "Returns information about a stack drift detection operation. A stack drift detection operation detects whether a stack's actual configuration differs, or has drifted, from its expected configuration, as defined in the stack template and any values specified as template parameters. A stack is considered to have drifted if one or more of its resources have drifted. For more information about stack and resource drift, see Detect unmanaged configuration changes to stacks and resources with drift detection. Use  DetectStackDrift to initiate a stack drift detection operation. DetectStackDrift returns a StackDriftDetectionId you can use to monitor the progress of the operation using DescribeStackDriftDetectionStatus. Once the drift detection operation has completed, use  DescribeStackResourceDrifts to return drift information about the stack and its resources.",
  "parameters": [
    {
      "name": "StackDriftDetectionId",
      "type": "string",
      "required": true,
      "description": "The ID of the drift detection results of this operation. CloudFormation generates new results, with a new drift detection ID, each time this operation is run. However, the number of drift results CloudFormation retains for any given stack, and for how long, may vary.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "StackId",
          "type": "string",
          "description": "The ID of the stack.",
          "nested_items": []
        },
        {
          "name": "StackDriftDetectionId",
          "type": "string",
          "description": "The ID of the drift detection results of this operation.",
          "nested_items": []
        },
        {
          "name": "StackDriftStatus",
          "type": "string",
          "description": "Status of the stack's actual configuration compared to its expected configuration.",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "DRIFTED: The stack differs from its expected template configuration. A stack is considered to have drifted if one or more of its resources have drifted.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "NOT_CHECKED: CloudFormation hasn't checked if the stack differs from its expected template configuration.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "IN_SYNC: The stack's actual configuration matches its expected template configuration.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "UNKNOWN: This value is reserved for future use.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "DetectionStatus",
          "type": "string",
          "description": "The status of the stack drift detection operation.",
          "nested_items": [
            {
              "name": "",
              "type": "Resources that donâ\u0080\u0099t currently support stack detection remain unchecked.",
              "description": "DETECTION_COMPLETE: The stack drift detection operation has successfully completed for all resources in the stack that support drift detection. (Resources that don't currently support stack detection remain unchecked.) If you specified logical resource IDs for CloudFormation to use as a filter for the stack drift detection operation, only the resources with those logical IDs are checked for drift.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "DETECTION_FAILED: The stack drift detection operation has failed for at least one resource in the stack. Results will be available for resources on which CloudFormation successfully completed drift detection.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "DETECTION_IN_PROGRESS: The stack drift detection operation is currently in progress.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "DetectionStatusReason",
          "type": "string",
          "description": "The reason the stack drift detection operation has its current status.",
          "nested_items": []
        },
        {
          "name": "DriftedStackResourceCount",
          "type": "integer",
          "description": "Total number of stack resources that have drifted. This is NULL until the drift detection operation reaches a status of DETECTION_COMPLETE. This value will be 0 for stacks whose drift status is IN_SYNC.",
          "nested_items": []
        },
        {
          "name": "Timestamp",
          "type": "datetime",
          "description": "Time at which the stack drift detection operation was initiated.",
          "nested_items": []
        }
      ]
    }
  ]
}