{
  "method_name": "estimate_template_cost",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudformation/client/estimate_template_cost.html",
  "description": "Returns the estimated monthly cost of a template. The return value is an Amazon Web Services Simple Monthly Calculator URL with a query string that describes the resources required to run the template.",
  "parameters": [
    {
      "name": "TemplateBody",
      "type": "string",
      "required": false,
      "description": "Structure containing the template body with a minimum length of 1 byte and a maximum length of 51,200 bytes. Conditional: You must pass TemplateBody or TemplateURL. If both are passed, only TemplateBody is used.",
      "nested_params": []
    },
    {
      "name": "TemplateURL",
      "type": "string",
      "required": false,
      "description": "The URL of a file containing the template body. The URL must point to a template that's located in an Amazon S3 bucket or a Systems Manager document. The location for an Amazon S3 bucket must start with https://. Conditional: You must pass TemplateURL or TemplateBody. If both are passed, only TemplateBody is used.",
      "nested_params": []
    },
    {
      "name": "Parameters",
      "type": "list",
      "required": false,
      "description": "A list of Parameter structures that specify input parameters. (dict) --- The Parameter data type. ParameterKey (string) --- The key associated with the parameter. If you don't specify a key and value for a particular parameter, CloudFormation uses the default value that's specified in your template. ParameterValue (string) --- The input value associated with the parameter. UsePreviousValue (boolean) --- During a stack update, use the existing parameter value that the stack is using for a given parameter key. If you specify true, do not specify a parameter value. ResolvedValue (string) --- Read-only. The value that corresponds to a Systems Manager parameter key. This field is returned only for Systems Manager parameter types in the template. For more information, see Specify existing resources at runtime with CloudFormation-supplied parameter types in the CloudFormation User Guide.",
      "nested_params": [
        {
          "name": "ParameterKey",
          "type": "string",
          "required": false,
          "description": "The key associated with the parameter. If you don't specify a key and value for a particular parameter, CloudFormation uses the default value that's specified in your template.",
          "nested_params": []
        },
        {
          "name": "ParameterValue",
          "type": "string",
          "required": false,
          "description": "The input value associated with the parameter.",
          "nested_params": []
        },
        {
          "name": "UsePreviousValue",
          "type": "boolean",
          "required": false,
          "description": "During a stack update, use the existing parameter value that the stack is using for a given parameter key. If you specify true, do not specify a parameter value.",
          "nested_params": []
        },
        {
          "name": "ResolvedValue",
          "type": "string",
          "required": false,
          "description": "Read-only. The value that corresponds to a Systems Manager parameter key. This field is returned only for Systems Manager parameter types in the template. For more information, see Specify existing resources at runtime with CloudFormation-supplied parameter types in the CloudFormation User Guide.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Url",
          "type": "string",
          "description": "An Amazon Web Services Simple Monthly Calculator URL with a query string that describes the resources required to run the template.",
          "nested_items": []
        }
      ]
    }
  ]
}