{
  "method_name": "get_template",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudformation/client/get_template.html",
  "description": "Returns the template body for a specified stack. You can get the template for running or deleted stacks. For deleted stacks, GetTemplate returns the template for up to 90 days after the stack has been deleted.",
  "parameters": [
    {
      "name": "StackName",
      "type": "string",
      "required": false,
      "description": "The name or the unique stack ID that's associated with the stack, which aren't always interchangeable: Running stacks: You can specify either the stack's name or its unique stack ID. Deleted stacks: You must specify the unique stack ID.",
      "nested_params": []
    },
    {
      "name": "ChangeSetName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "TemplateStage",
      "type": "string",
      "required": false,
      "description": "For templates that include transforms, the stage of the template that CloudFormation returns. To get the user-submitted template, specify Original. To get the template after CloudFormation has processed all transforms, specify Processed. If the template doesn't include transforms, Original and Processed return the same template. By default, CloudFormation specifies Processed.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "TemplateBody",
          "type": "dict",
          "description": "Structure containing the template body.",
          "nested_items": []
        },
        {
          "name": "StagesAvailable",
          "type": "list",
          "description": "The stage of the template that you can retrieve. For stacks, the Original and Processed templates are always available. For change sets, the Original template is always available. After CloudFormation finishes creating the change set, the Processed template becomes available.",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}