{
  "method_name": "get_template_summary",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudformation/client/get_template_summary.html",
  "description": "Returns information about a new or existing template. The GetTemplateSummary action is useful for viewing parameter information, such as default parameter values and parameter types, before you create or update a stack or stack set. You can use the GetTemplateSummary action when you submit a template, or you can get template information for a stack set, or a running or deleted stack. For deleted stacks, GetTemplateSummary returns the template information for up to 90 days after the stack has been deleted. If the template doesn't exist, a ValidationError is returned.",
  "parameters": [
    {
      "name": "TemplateBody",
      "type": "string",
      "required": false,
      "description": "Structure containing the template body with a minimum length of 1 byte and a maximum length of 51,200 bytes. Conditional: You must specify only one of the following parameters: StackName, StackSetName, TemplateBody, or TemplateURL.",
      "nested_params": []
    },
    {
      "name": "TemplateURL",
      "type": "string",
      "required": false,
      "description": "The URL of a file containing the template body. The URL must point to a template (max size: 1 MB) that's located in an Amazon S3 bucket or a Systems Manager document. The location for an Amazon S3 bucket must start with https://. Conditional: You must specify only one of the following parameters: StackName, StackSetName, TemplateBody, or TemplateURL.",
      "nested_params": []
    },
    {
      "name": "StackName",
      "type": "string",
      "required": false,
      "description": "The name or the stack ID that's associated with the stack, which aren't always interchangeable. For running stacks, you can specify either the stack's name or its unique stack ID. For deleted stack, you must specify the unique stack ID. Conditional: You must specify only one of the following parameters: StackName, StackSetName, TemplateBody, or TemplateURL.",
      "nested_params": []
    },
    {
      "name": "StackSetName",
      "type": "string",
      "required": false,
      "description": "The name or unique ID of the stack set from which the stack was created. Conditional: You must specify only one of the following parameters: StackName, StackSetName, TemplateBody, or TemplateURL.",
      "nested_params": []
    },
    {
      "name": "CallAs",
      "type": "string",
      "required": false,
      "description": "[Service-managed permissions] Specifies whether you are acting as an account administrator in the organization's management account or as a delegated administrator in a member account. By default, SELF is specified. Use SELF for stack sets with self-managed permissions. If you are signed in to the management account, specify SELF. If you are signed in to a delegated administrator account, specify DELEGATED_ADMIN. Your Amazon Web Services account must be registered as a delegated administrator in the management account. For more information, see Register a delegated administrator in the CloudFormation User Guide.",
      "nested_params": []
    },
    {
      "name": "TemplateSummaryConfig",
      "type": "dict",
      "required": false,
      "description": "Specifies options for the GetTemplateSummary API action. TreatUnrecognizedResourceTypesAsWarnings (boolean) --- If set to True, any unrecognized resource types generate warnings and not an error. Any unrecognized resource types are returned in the Warnings output parameter.",
      "nested_params": [
        {
          "name": "TreatUnrecognizedResourceTypesAsWarnings",
          "type": "boolean",
          "required": false,
          "description": "If set to True, any unrecognized resource types generate warnings and not an error. Any unrecognized resource types are returned in the Warnings output parameter.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Parameters",
          "type": "list",
          "description": "A list of parameter declarations that describe various properties for each parameter.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ParameterKey",
                  "type": "string",
                  "description": "The name that's associated with the parameter.",
                  "nested_items": []
                },
                {
                  "name": "DefaultValue",
                  "type": "string",
                  "description": "The default value of the parameter.",
                  "nested_items": []
                },
                {
                  "name": "ParameterType",
                  "type": "string",
                  "description": "The type of parameter.",
                  "nested_items": []
                },
                {
                  "name": "NoEcho",
                  "type": "boolean",
                  "description": "Flag that indicates whether the parameter value is shown as plain text in logs and in the Amazon Web Services Management Console.",
                  "nested_items": []
                },
                {
                  "name": "Description",
                  "type": "string",
                  "description": "The description that's associate with the parameter.",
                  "nested_items": []
                },
                {
                  "name": "ParameterConstraints",
                  "type": "dict",
                  "description": "The criteria that CloudFormation uses to validate parameter values.",
                  "nested_items": [
                    {
                      "name": "AllowedValues",
                      "type": "list",
                      "description": "A list of values that are permitted for a parameter.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Description",
          "type": "string",
          "description": "The value that's defined in the Description property of the template.",
          "nested_items": []
        },
        {
          "name": "Capabilities",
          "type": "list",
          "description": "The capabilities found within the template. If your template contains IAM resources, you must specify the CAPABILITY_IAM or CAPABILITY_NAMED_IAM value for this parameter when you use the  CreateStack or  UpdateStack actions with your template; otherwise, those actions return an InsufficientCapabilities error.",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": []
            }
          ]
        },
        {
          "name": "CapabilitiesReason",
          "type": "string",
          "description": "The list of resources that generated the values in the Capabilities response element.",
          "nested_items": []
        },
        {
          "name": "ResourceTypes",
          "type": "list",
          "description": "A list of all the template resource types that are defined in the template, such as AWS::EC2::Instance, AWS::Dynamo::Table, and Custom::MyCustomInstance.",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": []
            }
          ]
        },
        {
          "name": "Version",
          "type": "string",
          "description": "The Amazon Web Services template format version, which identifies the capabilities of the template.",
          "nested_items": []
        },
        {
          "name": "Metadata",
          "type": "string",
          "description": "The value that's defined for the Metadata property of the template.",
          "nested_items": []
        },
        {
          "name": "DeclaredTransforms",
          "type": "list",
          "description": "A list of the transforms that are declared in the template.",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": []
            }
          ]
        },
        {
          "name": "ResourceIdentifierSummaries",
          "type": "list",
          "description": "A list of resource identifier summaries that describe the target resources of an import operation and the properties you can provide during the import to identify the target resources. For example, BucketName is a possible identifier property for an AWS::S3::Bucket resource.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ResourceType",
                  "type": "string",
                  "description": "The template resource type of the target resources, such as AWS::S3::Bucket.",
                  "nested_items": []
                },
                {
                  "name": "LogicalResourceIds",
                  "type": "list",
                  "description": "The logical IDs of the target resources of the specified ResourceType, as defined in the import template.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "ResourceIdentifiers",
                  "type": "list",
                  "description": "The resource properties you can provide during the import to identify your target resources. For example, BucketName is a possible identifier property for AWS::S3::Bucket resources.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "UnrecognizedResourceTypes",
              "type": "list",
              "description": "A list of all of the unrecognized resource types. This is only returned if the TemplateSummaryConfig parameter has the TreatUnrecognizedResourceTypesAsWarning configuration set to True.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}