{
  "method_name": "list_types",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudformation/client/list_types.html",
  "description": "Returns summary information about extension that have been registered with CloudFormation.",
  "parameters": [
    {
      "name": "Visibility",
      "type": "string",
      "required": false,
      "description": "The scope at which the extensions are visible and usable in CloudFormation operations. Valid values include: PRIVATE: Extensions that are visible and usable within this account and Region. This includes: Private extensions you have registered in this account and Region. Public extensions that you have activated in this account and Region. PUBLIC: Extensions that are publicly visible and available to be activated within any Amazon Web Services account. This includes extensions from Amazon Web Services, in addition to third-party publishers. The default is PRIVATE.",
      "nested_params": []
    },
    {
      "name": "ProvisioningType",
      "type": "string",
      "required": false,
      "description": "For resource types, the provisioning behavior of the resource type. CloudFormation determines the provisioning type during registration, based on the types of handlers in the schema handler package submitted. Valid values include: FULLY_MUTABLE: The resource type includes an update handler to process updates to the type during stack update operations. IMMUTABLE: The resource type doesn't include an update handler, so the type can't be updated and must instead be replaced during stack update operations. NON_PROVISIONABLE: The resource type doesn't include create, read, and delete handlers, and therefore can't actually be provisioned. The default is FULLY_MUTABLE.",
      "nested_params": []
    },
    {
      "name": "DeprecatedStatus",
      "type": "string",
      "required": false,
      "description": "The deprecation status of the extension that you want to get summary information about. Valid values include: LIVE: The extension is registered for use in CloudFormation operations. DEPRECATED: The extension has been deregistered and can no longer be used in CloudFormation operations.",
      "nested_params": []
    },
    {
      "name": "Type",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "dict",
      "required": false,
      "description": "Filter criteria to use in determining which extensions to return. Filters must be compatible with Visibility to return valid results. For example, specifying AWS_TYPES for Category and PRIVATE for Visibility returns an empty list of types, but specifying PUBLIC for Visibility returns the desired list. Category (string) --- The category of extensions to return. REGISTERED: Private extensions that have been registered for this account and Region. ACTIVATED: Public extensions that have been activated for this account and Region. THIRD_PARTY: Extensions available for use from publishers other than Amazon. This includes: Private extensions registered in the account. Public extensions from publishers other than Amazon, whether activated or not. AWS_TYPES: Extensions available for use from Amazon. PublisherId (string) --- The id of the publisher of the extension. Extensions published by Amazon aren't assigned a publisher ID. Use the AWS_TYPES category to specify a list of types published by Amazon. TypeNamePrefix (string) --- A prefix to use as a filter for results.",
      "nested_params": [
        {
          "name": "Category",
          "type": "string",
          "required": false,
          "description": "The category of extensions to return.",
          "nested_params": []
        },
        {
          "name": "PublisherId",
          "type": "string",
          "required": false,
          "description": "The id of the publisher of the extension. Extensions published by Amazon aren't assigned a publisher ID. Use the AWS_TYPES category to specify a list of types published by Amazon.",
          "nested_params": []
        },
        {
          "name": "TypeNamePrefix",
          "type": "string",
          "required": false,
          "description": "A prefix to use as a filter for results.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "TypeSummaries",
          "type": "list",
          "description": "A list of TypeSummary structures that contain information about the specified extensions.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Type",
                  "type": "string",
                  "description": "The kind of extension.",
                  "nested_items": []
                },
                {
                  "name": "TypeName",
                  "type": "string",
                  "description": "The name of the extension.",
                  "nested_items": []
                },
                {
                  "name": "DefaultVersionId",
                  "type": "string",
                  "description": "The ID of the default version of the extension. The default version is used when the extension version isn't specified.",
                  "nested_items": []
                },
                {
                  "name": "TypeArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the extension.",
                  "nested_items": []
                },
                {
                  "name": "LastUpdated",
                  "type": "datetime",
                  "description": "When the specified extension version was registered. This applies only to:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "Private extensions you have registered in your account. For more information, see RegisterType.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Public extensions you have activated in your account with auto-update specified. For more information, see ActivateType.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Description",
                  "type": "string",
                  "description": "The description of the extension.",
                  "nested_items": []
                },
                {
                  "name": "PublisherId",
                  "type": "string",
                  "description": "The ID of the extension publisher, if the extension is published by a third party. Extensions published by Amazon don't return a publisher ID.",
                  "nested_items": []
                },
                {
                  "name": "OriginalTypeName",
                  "type": "string",
                  "description": "For public extensions that have been activated for this account and Region, the type name of the public extension.",
                  "nested_items": []
                },
                {
                  "name": "PublicVersionNumber",
                  "type": "string",
                  "description": "For public extensions that have been activated for this account and Region, the version of the public extension to be used for CloudFormation operations in this account and Region.",
                  "nested_items": []
                },
                {
                  "name": "LatestPublicVersion",
                  "type": "string",
                  "description": "For public extensions that have been activated for this account and Region, the latest version of the public extension that is available. For any extensions other than activated third-party extensions, CloudFormation returns null.",
                  "nested_items": []
                },
                {
                  "name": "PublisherIdentity",
                  "type": "string",
                  "description": "The service used to verify the publisher identity.",
                  "nested_items": []
                },
                {
                  "name": "PublisherName",
                  "type": "string",
                  "description": "The publisher name, as defined in the public profile for that publisher in the service used to verify the publisher identity.",
                  "nested_items": []
                },
                {
                  "name": "IsActivated",
                  "type": "boolean",
                  "description": "Whether the extension is activated for this account and Region.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "If the request doesn't return all the remaining results, NextToken is set to a token. To retrieve the next set of results, call this action again and assign that token to the request object's NextToken parameter. If the request returns all results, NextToken is set to null.",
          "nested_items": []
        }
      ]
    }
  ]
}