{
  "method_name": "list_stack_sets",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudformation/client/list_stack_sets.html",
  "description": "Returns summary information about stack sets that are associated with the user.",
  "parameters": [
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Status",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "CallAs",
      "type": "string",
      "required": false,
      "description": "[Service-managed permissions] Specifies whether you are acting as an account administrator in the management account or as a delegated administrator in a member account. By default, SELF is specified. Use SELF for stack sets with self-managed permissions. If you are signed in to the management account, specify SELF. If you are signed in to a delegated administrator account, specify DELEGATED_ADMIN. Your Amazon Web Services account must be registered as a delegated administrator in the management account. For more information, see Register a delegated administrator in the CloudFormation User Guide.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Summaries",
          "type": "list",
          "description": "A list of StackSetSummary structures that contain information about the user's stack sets.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "StackSetName",
                  "type": "string",
                  "description": "The name of the stack set.",
                  "nested_items": []
                },
                {
                  "name": "StackSetId",
                  "type": "string",
                  "description": "The ID of the stack set.",
                  "nested_items": []
                },
                {
                  "name": "Description",
                  "type": "string",
                  "description": "A description of the stack set that you specify when the stack set is created or updated.",
                  "nested_items": []
                },
                {
                  "name": "Status",
                  "type": "string",
                  "description": "The status of the stack set.",
                  "nested_items": []
                },
                {
                  "name": "AutoDeployment",
                  "type": "dict",
                  "description": "[Service-managed permissions] Describes whether StackSets automatically deploys to Organizations accounts that are added to a target organizational unit (OU).",
                  "nested_items": [
                    {
                      "name": "Enabled",
                      "type": "boolean",
                      "description": "If set to true, StackSets automatically deploys additional stack instances to Organizations accounts that are added to a target organization or organizational unit (OU) in the specified Regions. If an account is removed from a target organization or OU, StackSets deletes stack instances from the account in the specified Regions.",
                      "nested_items": []
                    },
                    {
                      "name": "RetainStacksOnAccountRemoval",
                      "type": "boolean",
                      "description": "If set to true, stack resources are retained when an account is removed from a target organization or OU. If set to false, stack resources are deleted. Specify only if Enabled is set to True.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "PermissionModel",
                  "type": "string",
                  "description": "Describes how the IAM roles required for stack set operations are created.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "With self-managed permissions, you must create the administrator and execution roles required to deploy to target accounts. For more information, see Grant self-managed permissions.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "With service-managed permissions, StackSets automatically creates the IAM roles required to deploy to accounts managed by Organizations. For more information, see Activate trusted access for stack sets with Organizations.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "DriftStatus",
                  "type": "string",
                  "description": "Status of the stack set's actual configuration compared to its expected template and parameter configuration. A stack set is considered to have drifted if one or more of its stack instances have drifted from their expected template and parameter configuration.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "DRIFTED: One or more of the stack instances belonging to the stack set stack differs from the expected template and parameter configuration. A stack instance is considered to have drifted if one or more of the resources in the associated stack have drifted.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "NOT_CHECKED: CloudFormation hasn't checked the stack set for drift.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "IN_SYNC: All the stack instances belonging to the stack set stack match from the expected template and parameter configuration.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "UNKNOWN: This value is reserved for future use.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "LastDriftCheckTimestamp",
                  "type": "datetime",
                  "description": "Most recent time when CloudFormation performed a drift detection operation on the stack set. This value will be NULL for any stack set on which drift detection hasn't yet been performed.",
                  "nested_items": []
                },
                {
                  "name": "ManagedExecution",
                  "type": "dict",
                  "description": "Describes whether StackSets performs non-conflicting operations concurrently and queues conflicting operations.",
                  "nested_items": [
                    {
                      "name": "Active",
                      "type": "boolean",
                      "description": "When true, StackSets performs non-conflicting operations concurrently and queues conflicting operations. After conflicting operations finish, StackSets starts queued operations in request order.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "If the request doesn't return all of the remaining results, NextToken is set to a token. To retrieve the next set of results, call ListStackInstances again and assign that token to the request object's NextToken parameter. If the request returns all results, NextToken is set to null.",
          "nested_items": []
        }
      ]
    }
  ]
}