{
  "method_name": "list_stack_instance_resource_drifts",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudformation/client/list_stack_instance_resource_drifts.html",
  "description": "Returns drift information for resources in a stack instance.",
  "parameters": [
    {
      "name": "StackSetName",
      "type": "string",
      "required": true,
      "description": "The name or unique ID of the stack set that you want to list drifted resources for.",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "StackInstanceResourceDriftStatuses",
      "type": "list",
      "required": false,
      "description": "The resource drift status of the stack instance. DELETED: The resource differs from its expected template configuration in that the resource has been deleted. MODIFIED: One or more resource properties differ from their expected template values. IN_SYNC: The resource's actual configuration matches its expected template configuration. NOT_CHECKED: CloudFormation doesn't currently return this value. (string) ---",
      "nested_params": []
    },
    {
      "name": "StackInstanceAccount",
      "type": "string",
      "required": true,
      "description": "The name of the Amazon Web Services account that you want to list resource drifts for.",
      "nested_params": []
    },
    {
      "name": "StackInstanceRegion",
      "type": "string",
      "required": true,
      "description": "The name of the Region where you want to list resource drifts.",
      "nested_params": []
    },
    {
      "name": "OperationId",
      "type": "string",
      "required": true,
      "description": "The unique ID of the drift operation.",
      "nested_params": []
    },
    {
      "name": "CallAs",
      "type": "string",
      "required": false,
      "description": "[Service-managed permissions] Specifies whether you are acting as an account administrator in the organization's management account or as a delegated administrator in a member account. By default, SELF is specified. Use SELF for stack sets with self-managed permissions. If you are signed in to the management account, specify SELF. If you are signed in to a delegated administrator account, specify DELEGATED_ADMIN. Your Amazon Web Services account must be registered as a delegated administrator in the management account. For more information, see Register a delegated administrator in the CloudFormation User Guide.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Summaries",
          "type": "list",
          "description": "A list of StackInstanceResourceDriftsSummary structures that contain information about the specified stack instances.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "StackId",
                  "type": "string",
                  "description": "The ID of the stack instance.",
                  "nested_items": []
                },
                {
                  "name": "LogicalResourceId",
                  "type": "string",
                  "description": "The logical name of the resource specified in the template.",
                  "nested_items": []
                },
                {
                  "name": "PhysicalResourceId",
                  "type": "string",
                  "description": "The name or unique identifier that corresponds to a physical instance ID of a resource supported by CloudFormation.",
                  "nested_items": []
                },
                {
                  "name": "PhysicalResourceIdContext",
                  "type": "list",
                  "description": "Context information that enables CloudFormation to uniquely identify a resource. CloudFormation uses context key-value pairs in cases where a resource's logical and physical IDs aren't enough to uniquely identify that resource. Each context key-value pair specifies a unique resource that contains the targeted resource.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Key",
                          "type": "string",
                          "description": "The resource context key.",
                          "nested_items": []
                        },
                        {
                          "name": "Value",
                          "type": "string",
                          "description": "The resource context value.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "ResourceType",
                  "type": "string",
                  "description": "Type of resource. For more information, see Amazon Web Services resource and property types reference in the CloudFormation User Guide.",
                  "nested_items": []
                },
                {
                  "name": "PropertyDifferences",
                  "type": "list",
                  "description": "Status of the actual configuration of the resource compared to its expected configuration. These will be present only for resources whose StackInstanceResourceDriftStatus is MODIFIED.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "PropertyPath",
                          "type": "string",
                          "description": "The fully-qualified path to the resource property.",
                          "nested_items": []
                        },
                        {
                          "name": "ExpectedValue",
                          "type": "string",
                          "description": "The expected property value of the resource property, as defined in the stack template and any values specified as template parameters.",
                          "nested_items": []
                        },
                        {
                          "name": "ActualValue",
                          "type": "string",
                          "description": "The actual property value of the resource property.",
                          "nested_items": []
                        },
                        {
                          "name": "DifferenceType",
                          "type": "string",
                          "description": "The type of property difference.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "",
                              "description": "ADD: A value has been added to a resource property that's an array or list data type.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "REMOVE: The property has been removed from the current resource configuration.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "as defined in the stack template and any values specified as template parameters",
                              "description": "NOT_EQUAL: The current property value differs from its expected value (as defined in the stack template and any values specified as template parameters).",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "StackResourceDriftStatus",
                  "type": "string",
                  "description": "The drift status of the resource in a stack instance.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "DELETED: The resource differs from its expected template configuration in that the resource has been deleted.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "MODIFIED: One or more resource properties differ from their expected template values.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "IN_SYNC: The resource's actual configuration matches its expected template configuration.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "NOT_CHECKED: CloudFormation doesn't currently return this value.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Timestamp",
                  "type": "datetime",
                  "description": "Time at which the stack instance drift detection operation was initiated.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "If the previous paginated request didn't return all of the remaining results, the response object's NextToken parameter value is set to a token. To retrieve the next set of results, call this action again and assign that token to the request object's NextToken parameter. If there are no remaining results, the previous response object's NextToken parameter is set to null.",
          "nested_items": []
        }
      ]
    }
  ]
}