{
  "method_name": "publish_type",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudformation/client/publish_type.html",
  "description": "Publishes the specified extension to the CloudFormation registry as a public extension in this Region. Public extensions are available for use by all CloudFormation users. For more information about publishing extensions, see Publishing extensions to make them available for public use in the CloudFormation Command Line Interface (CLI) User Guide. To publish an extension, you must be registered as a publisher with CloudFormation. For more information, see RegisterPublisher.",
  "parameters": [
    {
      "name": "Type",
      "type": "string",
      "required": false,
      "description": "The type of the extension. Conditional: You must specify Arn, or TypeName and Type.",
      "nested_params": []
    },
    {
      "name": "Arn",
      "type": "string",
      "required": false,
      "description": "The Amazon Resource Name (ARN) of the extension. Conditional: You must specify Arn, or TypeName and Type.",
      "nested_params": []
    },
    {
      "name": "TypeName",
      "type": "string",
      "required": false,
      "description": "The name of the extension. Conditional: You must specify Arn, or TypeName and Type.",
      "nested_params": []
    },
    {
      "name": "PublicVersionNumber",
      "type": "string",
      "required": false,
      "description": "The version number to assign to this version of the extension. Use the following format, and adhere to semantic versioning when assigning a version number to your extension: MAJOR.MINOR.PATCH For more information, see Semantic Versioning 2.0.0. If you don't specify a version number, CloudFormation increments the version number by one minor version release. You cannot specify a version number the first time you publish a type. CloudFormation automatically sets the first version number to be 1.0.0.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "PublicTypeArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) assigned to the public extension upon publication.",
          "nested_items": []
        }
      ]
    }
  ]
}