{
  "method_name": "set_type_configuration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudformation/client/set_type_configuration.html",
  "description": "Specifies the configuration data for a registered CloudFormation extension, in the given account and Region. To view the current configuration data for an extension, refer to the ConfigurationSchema element of DescribeType. For more information, see Edit configuration data for extensions in your account in the CloudFormation User Guide.",
  "parameters": [
    {
      "name": "TypeArn",
      "type": "string",
      "required": false,
      "description": "The Amazon Resource Name (ARN) for the extension, in this account and Region. For public extensions, this will be the ARN assigned when you call the ActivateType API operation in this account and Region. For private extensions, this will be the ARN assigned when you call the RegisterType API operation in this account and Region. Do not include the extension versions suffix at the end of the ARN. You can set the configuration for an extension, but not for a specific extension version.",
      "nested_params": []
    },
    {
      "name": "Configuration",
      "type": "string",
      "required": true,
      "description": "The configuration data for the extension, in this account and Region. The configuration data must be formatted as JSON, and validate against the schema returned in the ConfigurationSchema response element of DescribeType. For more information, see Defining the account-level configuration of an extension in the CloudFormation Command Line Interface (CLI) User Guide.",
      "nested_params": []
    },
    {
      "name": "ConfigurationAlias",
      "type": "string",
      "required": false,
      "description": "An alias by which to refer to this extension configuration data. Conditional: Specifying a configuration alias is required when setting a configuration for a resource type extension.",
      "nested_params": []
    },
    {
      "name": "TypeName",
      "type": "string",
      "required": false,
      "description": "The name of the extension. Conditional: You must specify ConfigurationArn, or Type and TypeName.",
      "nested_params": []
    },
    {
      "name": "Type",
      "type": "string",
      "required": false,
      "description": "The type of extension. Conditional: You must specify ConfigurationArn, or Type and TypeName.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ConfigurationArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) for the configuration data, in this account and Region.",
          "nested_items": []
        }
      ]
    }
  ]
}