{
  "method_name": "create_access_key",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iam/client/create_access_key.html",
  "description": "Creates a new Amazon Web Services secret access key and corresponding Amazon Web Services access key ID for the specified user. The default status for new keys is Active. If you do not specify a user name, IAM determines the user name implicitly based on the Amazon Web Services access key ID signing the request. This operation works for access keys under the Amazon Web Services account. Consequently, you can use this operation to manage Amazon Web Services account root user credentials. This is true even if the Amazon Web Services account has no associated users. For information about quotas on the number of keys you can create, see IAM and STS quotas in the IAM User Guide.",
  "parameters": [
    {
      "name": "UserName",
      "type": "string",
      "required": false,
      "description": "The name of the IAM user that the new key will belong to. This parameter allows (through its regex pattern) a string of characters consisting of upper and lowercase alphanumeric characters with no spaces. You can also include any of the following characters: _+=,.@-",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "AccessKey",
          "type": "dict",
          "description": "A structure with details about the access key.",
          "nested_items": [
            {
              "name": "UserName",
              "type": "string",
              "description": "The name of the IAM user that the access key is associated with.",
              "nested_items": []
            },
            {
              "name": "AccessKeyId",
              "type": "string",
              "description": "The ID for this access key.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The status of the access key. Active means that the key is valid for API calls, while Inactive means it is not.",
              "nested_items": []
            },
            {
              "name": "SecretAccessKey",
              "type": "string",
              "description": "The secret key used to sign requests.",
              "nested_items": []
            },
            {
              "name": "CreateDate",
              "type": "datetime",
              "description": "The date when the access key was created.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}