{
  "method_name": "create_service_specific_credential",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iam/client/create_service_specific_credential.html",
  "description": "Generates a set of credentials consisting of a user name and password that can be used to access the service specified in the request. These credentials are generated by IAM, and can be used only for the specified service. You can have a maximum of two sets of service-specific credentials for each supported service per user. You can create service-specific credentials for CodeCommit and Amazon Keyspaces (for Apache Cassandra). You can reset the password to a new service-generated value by calling  ResetServiceSpecificCredential. For more information about service-specific credentials, see Using IAM with CodeCommit: Git credentials, SSH keys, and Amazon Web Services access keys in the IAM User Guide.",
  "parameters": [
    {
      "name": "UserName",
      "type": "string",
      "required": true,
      "description": "The name of the IAM user that is to be associated with the credentials. The new service-specific credentials have the same permissions as the associated user except that they can be used only to access the specified service. This parameter allows (through its regex pattern) a string of characters consisting of upper and lowercase alphanumeric characters with no spaces. You can also include any of the following characters: _+=,.@-",
      "nested_params": []
    },
    {
      "name": "ServiceName",
      "type": "string",
      "required": true,
      "description": "The name of the Amazon Web Services service that is to be associated with the credentials. The service you specify here is the only service that can be accessed using these credentials.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ServiceSpecificCredential",
          "type": "dict",
          "description": "A structure that contains information about the newly created service-specific credential.",
          "nested_items": [
            {
              "name": "CreateDate",
              "type": "datetime",
              "description": "The date and time, in ISO 8601 date-time format, when the service-specific credential were created.",
              "nested_items": []
            },
            {
              "name": "ServiceName",
              "type": "string",
              "description": "The name of the service associated with the service-specific credential.",
              "nested_items": []
            },
            {
              "name": "ServiceUserName",
              "type": "string",
              "description": "The generated user name for the service-specific credential. This value is generated by combining the IAM user's name combined with the ID number of the Amazon Web Services account, as in jane-at-123456789012, for example. This value cannot be configured by the user.",
              "nested_items": []
            },
            {
              "name": "ServicePassword",
              "type": "string",
              "description": "The generated password for the service-specific credential.",
              "nested_items": []
            },
            {
              "name": "ServiceSpecificCredentialId",
              "type": "string",
              "description": "The unique identifier for the service-specific credential.",
              "nested_items": []
            },
            {
              "name": "UserName",
              "type": "string",
              "description": "The name of the IAM user associated with the service-specific credential.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The status of the service-specific credential. Active means that the key is valid for API calls, while Inactive means it is not.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}