{
  "method_name": "get_ssh_public_key",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iam/client/get_ssh_public_key.html",
  "description": "Retrieves the specified SSH public key, including metadata about the key. The SSH public key retrieved by this operation is used only for authenticating the associated IAM user to an CodeCommit repository. For more information about using SSH keys to authenticate to an CodeCommit repository, see Set up CodeCommit for SSH connections in the CodeCommit User Guide.",
  "parameters": [
    {
      "name": "UserName",
      "type": "string",
      "required": true,
      "description": "The name of the IAM user associated with the SSH public key. This parameter allows (through its regex pattern) a string of characters consisting of upper and lowercase alphanumeric characters with no spaces. You can also include any of the following characters: _+=,.@-",
      "nested_params": []
    },
    {
      "name": "SSHPublicKeyId",
      "type": "string",
      "required": true,
      "description": "The unique identifier for the SSH public key. This parameter allows (through its regex pattern) a string of characters that can consist of any upper or lowercased letter or digit.",
      "nested_params": []
    },
    {
      "name": "Encoding",
      "type": "string",
      "required": true,
      "description": "Specifies the public key encoding format to use in the response. To retrieve the public key in ssh-rsa format, use SSH. To retrieve the public key in PEM format, use PEM.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "SSHPublicKey",
          "type": "dict",
          "description": "A structure containing details about the SSH public key.",
          "nested_items": [
            {
              "name": "UserName",
              "type": "string",
              "description": "The name of the IAM user associated with the SSH public key.",
              "nested_items": []
            },
            {
              "name": "SSHPublicKeyId",
              "type": "string",
              "description": "The unique identifier for the SSH public key.",
              "nested_items": []
            },
            {
              "name": "Fingerprint",
              "type": "string",
              "description": "The MD5 message digest of the SSH public key.",
              "nested_items": []
            },
            {
              "name": "SSHPublicKeyBody",
              "type": "string",
              "description": "The SSH public key.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The status of the SSH public key. Active means that the key can be used for authentication with an CodeCommit repository. Inactive means that the key cannot be used.",
              "nested_items": []
            },
            {
              "name": "UploadDate",
              "type": "datetime",
              "description": "The date and time, in ISO 8601 date-time format, when the SSH public key was uploaded.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}