{
  "method_name": "get_policy_version",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iam/client/get_policy_version.html",
  "description": "Retrieves information about the specified version of the specified managed policy, including the policy document. To list the available versions for a policy, use  ListPolicyVersions. This operation retrieves information about managed policies. To retrieve information about an inline policy that is embedded in a user, group, or role, use  GetUserPolicy,  GetGroupPolicy, or  GetRolePolicy. For more information about the types of policies, see Managed policies and inline policies in the IAM User Guide. For more information about managed policy versions, see Versioning for managed policies in the IAM User Guide.",
  "parameters": [
    {
      "name": "PolicyArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the managed policy that you want information about. For more information about ARNs, see Amazon Resource Names (ARNs) in the Amazon Web Services General Reference.",
      "nested_params": []
    },
    {
      "name": "VersionId",
      "type": "string",
      "required": true,
      "description": "Identifies the policy version to retrieve. This parameter allows (through its regex pattern) a string of characters that consists of the lowercase letter --\u0098v' followed by one or two digits, and optionally followed by a period --\u0098.' and a string of letters and digits.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "PolicyVersion",
          "type": "dict",
          "description": "A structure containing details about the policy version.",
          "nested_items": [
            {
              "name": "Document",
              "type": "string",
              "description": "The policy document.",
              "nested_items": []
            },
            {
              "name": "VersionId",
              "type": "string",
              "description": "The identifier for the policy version.",
              "nested_items": []
            },
            {
              "name": "IsDefaultVersion",
              "type": "boolean",
              "description": "Specifies whether the policy version is set as the policy's default version.",
              "nested_items": []
            },
            {
              "name": "CreateDate",
              "type": "datetime",
              "description": "The date and time, in ISO 8601 date-time format, when the policy version was created.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}