{
  "method_name": "list_role_tags",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iam/client/list_role_tags.html",
  "description": "Lists the tags that are attached to the specified role. The returned list of tags is sorted by tag key. For more information about tagging, see Tagging IAM resources in the IAM User Guide.",
  "parameters": [
    {
      "name": "RoleName",
      "type": "string",
      "required": true,
      "description": "The name of the IAM role for which you want to see the list of tags. This parameter accepts (through its regex pattern) a string of characters that consist of upper and lowercase alphanumeric characters with no spaces. You can also include any of the following characters: _+=,.@-",
      "nested_params": []
    },
    {
      "name": "Marker",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxItems",
      "type": "integer",
      "required": false,
      "description": "Use this only when paginating results to indicate the maximum number of items you want in the response. If additional items exist beyond the maximum you specify, the IsTruncated response element is true. If you do not include this parameter, the number of items defaults to 100. Note that IAM might return fewer results, even when there are more results available. In that case, the IsTruncated response element returns true, and Marker contains a value to include in the subsequent call that tells the service where to continue from.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Tags",
          "type": "list",
          "description": "The list of tags that are currently attached to the role. Each tag consists of a key name and an associated value. If no tags are attached to the specified resource, the response contains an empty list.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Key",
                  "type": "string",
                  "description": "The key name that can be used to look up or retrieve the associated value. For example, Department or Cost Center are common choices.",
                  "nested_items": []
                },
                {
                  "name": "Value",
                  "type": "string",
                  "description": "The value associated with this tag. For example, tags with a key name of Department could have values such as Human Resources, Accounting, and Support. Tags with a key name of Cost Center might have values that consist of the number associated with the different cost centers in your company. Typically, many resources have tags with the same key name but with different values.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "IsTruncated",
          "type": "boolean",
          "description": "A flag that indicates whether there are more items to return. If your results were truncated, you can make a subsequent pagination request using the Marker request parameter to retrieve more items. Note that IAM might return fewer than the MaxItems number of results even when there are more results available. We recommend that you check IsTruncated after every call to ensure that you receive all your results.",
          "nested_items": []
        },
        {
          "name": "Marker",
          "type": "string",
          "description": "When IsTruncated is true, this element is present and contains the value to use for the Marker parameter in a subsequent pagination request.",
          "nested_items": []
        }
      ]
    }
  ]
}