{
  "method_name": "list_domain_deliverability_campaigns",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/pinpoint-email/client/list_domain_deliverability_campaigns.html",
  "description": "Retrieve deliverability data for all the campaigns that used a specific domain to send email during a specified time range. This data is available for a domain only if you enabled the Deliverability dashboard ( PutDeliverabilityDashboardOption operation) for the domain.",
  "parameters": [
    {
      "name": "StartDate",
      "type": "datetime",
      "required": true,
      "description": "The first day, in Unix time format, that you want to obtain deliverability data for.",
      "nested_params": []
    },
    {
      "name": "EndDate",
      "type": "datetime",
      "required": true,
      "description": "The last day, in Unix time format, that you want to obtain deliverability data for. This value has to be less than or equal to 30 days after the value of the StartDate parameter.",
      "nested_params": []
    },
    {
      "name": "SubscribedDomain",
      "type": "string",
      "required": true,
      "description": "The domain to obtain deliverability data for.",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "PageSize",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "DomainDeliverabilityCampaigns",
          "type": "list",
          "description": "An array of responses, one for each campaign that used the domain to send email during the specified time range.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "CampaignId",
                  "type": "string",
                  "description": "The unique identifier for the campaign. Amazon Pinpoint automatically generates and assigns this identifier to a campaign. This value is not the same as the campaign identifier that Amazon Pinpoint assigns to campaigns that you create and manage by using the Amazon Pinpoint API or the Amazon Pinpoint console.",
                  "nested_items": []
                },
                {
                  "name": "ImageUrl",
                  "type": "string",
                  "description": "The URL of an image that contains a snapshot of the email message that was sent.",
                  "nested_items": []
                },
                {
                  "name": "Subject",
                  "type": "string",
                  "description": "The subject line, or title, of the email message.",
                  "nested_items": []
                },
                {
                  "name": "FromAddress",
                  "type": "string",
                  "description": "The verified email address that the email message was sent from.",
                  "nested_items": []
                },
                {
                  "name": "SendingIps",
                  "type": "list",
                  "description": "The IP addresses that were used to send the email message.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "FirstSeenDateTime",
                  "type": "datetime",
                  "description": "The first time, in Unix time format, when the email message was delivered to any recipient's inbox. This value can help you determine how long it took for a campaign to deliver an email message.",
                  "nested_items": []
                },
                {
                  "name": "LastSeenDateTime",
                  "type": "datetime",
                  "description": "The last time, in Unix time format, when the email message was delivered to any recipient's inbox. This value can help you determine how long it took for a campaign to deliver an email message.",
                  "nested_items": []
                },
                {
                  "name": "InboxCount",
                  "type": "integer",
                  "description": "The number of email messages that were delivered to recipients' inboxes.",
                  "nested_items": []
                },
                {
                  "name": "SpamCount",
                  "type": "integer",
                  "description": "The number of email messages that were delivered to recipients' spam or junk mail folders.",
                  "nested_items": []
                },
                {
                  "name": "ReadRate",
                  "type": "float",
                  "description": "The percentage of email messages that were opened by recipients. Due to technical limitations, this value only includes recipients who opened the message by using an email client that supports images.",
                  "nested_items": []
                },
                {
                  "name": "DeleteRate",
                  "type": "float",
                  "description": "The percentage of email messages that were deleted by recipients, without being opened first. Due to technical limitations, this value only includes recipients who opened the message by using an email client that supports images.",
                  "nested_items": []
                },
                {
                  "name": "ReadDeleteRate",
                  "type": "float",
                  "description": "The percentage of email messages that were opened and then deleted by recipients. Due to technical limitations, this value only includes recipients who opened the message by using an email client that supports images.",
                  "nested_items": []
                },
                {
                  "name": "ProjectedVolume",
                  "type": "integer",
                  "description": "The projected number of recipients that the email message was sent to.",
                  "nested_items": []
                },
                {
                  "name": "Esps",
                  "type": "list",
                  "description": "The major email providers who handled the email message.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "A token that's returned from a previous call to the ListDomainDeliverabilityCampaigns operation. This token indicates the position of the campaign in the list of campaigns.",
          "nested_items": []
        }
      ]
    }
  ]
}