{
  "method_name": "put_deliverability_dashboard_option",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/pinpoint-email/client/put_deliverability_dashboard_option.html",
  "description": "Enable or disable the Deliverability dashboard for your Amazon Pinpoint account. When you enable the Deliverability dashboard, you gain access to reputation, deliverability, and other metrics for the domains that you use to send email using Amazon Pinpoint. You also gain the ability to perform predictive inbox placement tests. When you use the Deliverability dashboard, you pay a monthly subscription charge, in addition to any other fees that you accrue by using Amazon Pinpoint. For more information about the features and cost of a Deliverability dashboard subscription, see Amazon Pinpoint Pricing.",
  "parameters": [
    {
      "name": "DashboardEnabled",
      "type": "boolean",
      "required": true,
      "description": "Specifies whether to enable the Deliverability dashboard for your Amazon Pinpoint account. To enable the dashboard, set this value to true.",
      "nested_params": []
    },
    {
      "name": "SubscribedDomains",
      "type": "list",
      "required": false,
      "description": "An array of objects, one for each verified domain that you use to send email and enabled the Deliverability dashboard for. (dict) --- An object that contains information about the Deliverability dashboard subscription for a verified domain that you use to send email and currently has an active Deliverability dashboard subscription. If a Deliverability dashboard subscription is active for a domain, you gain access to reputation, inbox placement, and other metrics for the domain. Domain (string) --- A verified domain that's associated with your AWS account and currently has an active Deliverability dashboard subscription. SubscriptionStartDate (datetime) --- The date, in Unix time format, when you enabled the Deliverability dashboard for the domain. InboxPlacementTrackingOption (dict) --- An object that contains information about the inbox placement data settings for the domain. Global (boolean) --- Specifies whether inbox placement data is being tracked for the domain. TrackedIsps (list) --- An array of strings, one for each major email provider that the inbox placement data applies to. (string) --- The name of an email provider.",
      "nested_params": [
        {
          "name": "Domain",
          "type": "string",
          "required": false,
          "description": "A verified domain that's associated with your AWS account and currently has an active Deliverability dashboard subscription.",
          "nested_params": []
        },
        {
          "name": "SubscriptionStartDate",
          "type": "datetime",
          "required": false,
          "description": "The date, in Unix time format, when you enabled the Deliverability dashboard for the domain.",
          "nested_params": []
        },
        {
          "name": "InboxPlacementTrackingOption",
          "type": "dict",
          "required": false,
          "description": "An object that contains information about the inbox placement data settings for the domain.",
          "nested_params": [
            {
              "name": "Global",
              "type": "boolean",
              "required": false,
              "description": "Specifies whether inbox placement data is being tracked for the domain.",
              "nested_params": []
            },
            {
              "name": "TrackedIsps",
              "type": "list",
              "required": false,
              "description": "An array of strings, one for each major email provider that the inbox placement data applies to.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}