{
  "method_name": "send_email",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/pinpoint-email/client/send_email.html",
  "description": "Sends an email message. You can use the Amazon Pinpoint Email API to send two types of messages:",
  "parameters": [
    {
      "name": "FromEmailAddress",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Destination",
      "type": "dict",
      "required": true,
      "description": "An object that contains the recipients of the email message. ToAddresses (list) --- An array that contains the email addresses of the 'To' recipients for the email. (string) --- CcAddresses (list) --- An array that contains the email addresses of the 'CC' (carbon copy) recipients for the email. (string) --- BccAddresses (list) --- An array that contains the email addresses of the 'BCC' (blind carbon copy) recipients for the email. (string) ---",
      "nested_params": [
        {
          "name": "ToAddresses",
          "type": "list",
          "required": false,
          "description": "An array that contains the email addresses of the 'To' recipients for the email.",
          "nested_params": []
        },
        {
          "name": "CcAddresses",
          "type": "list",
          "required": false,
          "description": "An array that contains the email addresses of the 'CC' (carbon copy) recipients for the email.",
          "nested_params": []
        },
        {
          "name": "BccAddresses",
          "type": "list",
          "required": false,
          "description": "An array that contains the email addresses of the 'BCC' (blind carbon copy) recipients for the email.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ReplyToAddresses",
      "type": "list",
      "required": false,
      "description": "The 'Reply-to' email addresses for the message. When the recipient replies to the message, each Reply-to address receives the reply. (string) ---",
      "nested_params": []
    },
    {
      "name": "FeedbackForwardingEmailAddress",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Content",
      "type": "dict",
      "required": true,
      "description": "An object that contains the body of the message. You can send either a Simple message or a Raw message. Simple (dict) --- The simple email message. The message consists of a subject and a message body. The subject line of the email. The subject line can only contain 7-bit ASCII characters. However, you can specify non-ASCII characters in the subject line by using encoded-word syntax, as described in RFC 2047. The content of the message itself. Charset (string) --- The character set for the content. Because of the constraints of the SMTP protocol, Amazon Pinpoint uses 7-bit ASCII by default. If the text includes characters outside of the ASCII range, you have to specify a character set. For example, you could specify UTF-8, ISO-8859-1, or Shift_JIS. The body of the message. You can specify an HTML version of the message, a text-only version of the message, or both. Text (dict) --- An object that represents the version of the message that is displayed in email clients that don't support HTML, or clients where the recipient has disabled HTML rendering. Html (dict) --- An object that represents the version of the message that is displayed in email clients that support HTML. HTML messages can include formatted text, hyperlinks, images, and more. Raw (dict) --- The raw email message. The message has to meet the following criteria: The message has to contain a header and a body, separated by one blank line. All of the required header fields must be present in the message. Each part of a multipart MIME message must be formatted properly. If you include attachments, they must be in a file format that Amazon Pinpoint supports. The entire message must be Base64 encoded. If any of the MIME parts in your message contain content that is outside of the 7-bit ASCII character range, you should encode that content to ensure that recipients' email clients render the message properly. The length of any single line of text in the message can't exceed 1,000 characters. This restriction is defined in RFC 5321. The raw email message. Attachments must be in a file format that Amazon Pinpoint supports. Template (dict) --- The template to use for the email message. TemplateArn (string) --- The Amazon Resource Name (ARN) of the template. TemplateData (string) --- An object that defines the values to use for message variables in the template. This object is a set of key-value pairs. Each key defines a message variable in the template. The corresponding value defines the value to use for that variable.",
      "nested_params": [
        {
          "name": "Simple",
          "type": "dict",
          "required": false,
          "description": "The simple email message. The message consists of a subject and a message body.",
          "nested_params": [
            {
              "name": "Subject",
              "type": "dict",
              "required": false,
              "description": "The subject line of the email. The subject line can only contain 7-bit ASCII characters. However, you can specify non-ASCII characters in the subject line by using encoded-word syntax, as described in RFC 2047.",
              "nested_params": [
                {
                  "name": "Data",
                  "type": "string",
                  "required": false,
                  "description": "The content of the message itself.",
                  "nested_params": []
                },
                {
                  "name": "Charset",
                  "type": "string",
                  "required": false,
                  "description": "The character set for the content. Because of the constraints of the SMTP protocol, Amazon Pinpoint uses 7-bit ASCII by default. If the text includes characters outside of the ASCII range, you have to specify a character set. For example, you could specify UTF-8, ISO-8859-1, or Shift_JIS.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Body",
              "type": "dict",
              "required": false,
              "description": "The body of the message. You can specify an HTML version of the message, a text-only version of the message, or both.",
              "nested_params": [
                {
                  "name": "Text",
                  "type": "dict",
                  "required": false,
                  "description": "An object that represents the version of the message that is displayed in email clients that don't support HTML, or clients where the recipient has disabled HTML rendering.",
                  "nested_params": [
                    {
                      "name": "Data",
                      "type": "string",
                      "required": false,
                      "description": "The content of the message itself.",
                      "nested_params": []
                    },
                    {
                      "name": "Charset",
                      "type": "string",
                      "required": false,
                      "description": "The character set for the content. Because of the constraints of the SMTP protocol, Amazon Pinpoint uses 7-bit ASCII by default. If the text includes characters outside of the ASCII range, you have to specify a character set. For example, you could specify UTF-8, ISO-8859-1, or Shift_JIS.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "Html",
                  "type": "dict",
                  "required": false,
                  "description": "An object that represents the version of the message that is displayed in email clients that support HTML. HTML messages can include formatted text, hyperlinks, images, and more.",
                  "nested_params": [
                    {
                      "name": "Data",
                      "type": "string",
                      "required": false,
                      "description": "The content of the message itself.",
                      "nested_params": []
                    },
                    {
                      "name": "Charset",
                      "type": "string",
                      "required": false,
                      "description": "The character set for the content. Because of the constraints of the SMTP protocol, Amazon Pinpoint uses 7-bit ASCII by default. If the text includes characters outside of the ASCII range, you have to specify a character set. For example, you could specify UTF-8, ISO-8859-1, or Shift_JIS.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Raw",
          "type": "dict",
          "required": false,
          "description": "The raw email message. The message has to meet the following criteria:",
          "nested_params": []
        },
        {
          "name": "Template",
          "type": "dict",
          "required": false,
          "description": "The template to use for the email message.",
          "nested_params": [
            {
              "name": "TemplateArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of the template.",
              "nested_params": []
            },
            {
              "name": "TemplateData",
              "type": "string",
              "required": false,
              "description": "An object that defines the values to use for message variables in the template. This object is a set of key-value pairs. Each key defines a message variable in the template. The corresponding value defines the value to use for that variable.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "EmailTags",
      "type": "list",
      "required": true,
      "description": "A list of tags, in the form of name/value pairs, to apply to an email that you send using the SendEmail operation. Tags correspond to characteristics of the email that you define, so that you can publish email sending events. (dict) --- Contains the name and value of a tag that you apply to an email. You can use message tags when you publish email sending events. The name of the message tag. The message tag name has to meet the following criteria: It can only contain ASCII letters (a---z, A---Z), numbers (0---9), underscores (_), or dashes (-). It can contain no more than 256 characters. The value of the message tag. The message tag value has to meet the following criteria: It can only contain ASCII letters (a---z, A---Z), numbers (0---9), underscores (_), or dashes (-). It can contain no more than 256 characters.",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name of the message tag. The message tag name has to meet the following criteria:",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value of the message tag. The message tag value has to meet the following criteria:",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ConfigurationSetName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "MessageId",
          "type": "string",
          "description": "A unique identifier for the message that is generated when Amazon Pinpoint accepts the message.",
          "nested_items": []
        }
      ]
    }
  ]
}