{
  "method_name": "get_ice_server_config",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kinesis-video-signaling/client/get_ice_server_config.html",
  "description": "Gets the Interactive Connectivity Establishment (ICE) server configuration information, including URIs, username, and password which can be used to configure the WebRTC connection. The ICE component uses this configuration information to setup the WebRTC connection, including authenticating with the Traversal Using Relays around NAT (TURN) relay server. TURN is a protocol that is used to improve the connectivity of peer-to-peer applications. By providing a cloud-based relay service, TURN ensures that a connection can be established even when one or more peers are incapable of a direct peer-to-peer connection. For more information, see A REST API For Access To TURN Services. You can invoke this API to establish a fallback mechanism in case either of the peers is unable to establish a direct peer-to-peer connection over a signaling channel. You must specify either a signaling channel ARN or the client ID in order to invoke this API.",
  "parameters": [
    {
      "name": "ChannelARN",
      "type": "string",
      "required": true,
      "description": "The ARN of the signaling channel to be used for the peer-to-peer connection between configured peers.",
      "nested_params": []
    },
    {
      "name": "ClientId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Service",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Username",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "IceServerList",
          "type": "list",
          "description": "The list of ICE server information objects.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Uris",
                  "type": "list",
                  "description": "An array of URIs, in the form specified in the I-D.petithuguenin-behave-turn-uris spec. These URIs provide the different addresses and/or protocols that can be used to reach the TURN server.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Username",
                  "type": "string",
                  "description": "A username to login to the ICE server.",
                  "nested_items": []
                },
                {
                  "name": "Password",
                  "type": "string",
                  "description": "A password to login to the ICE server.",
                  "nested_items": []
                },
                {
                  "name": "Ttl",
                  "type": "integer",
                  "description": "The period of time, in seconds, during which the username and password are valid.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}