{
  "method_name": "get_key_rotation_status",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kms/client/get_key_rotation_status.html",
  "description": "Provides detailed information about the rotation status for a KMS key, including whether automatic rotation of the key material is enabled for the specified KMS key, the rotation period, and the next scheduled rotation date. Automatic key rotation is supported only on symmetric encryption KMS keys. You cannot enable automatic rotation of asymmetric KMS keys, HMAC KMS keys, KMS keys with imported key material, or KMS keys in a custom key store. To enable or disable automatic rotation of a set of related multi-Region keys, set the property on the primary key.. You can enable (  EnableKeyRotation) and disable automatic rotation (  DisableKeyRotation) of the key material in customer managed KMS keys. Key material rotation of Amazon Web Services managed KMS keys is not configurable. KMS always rotates the key material in Amazon Web Services managed KMS keys every year. The key rotation status for Amazon Web Services managed KMS keys is always true. You can perform on-demand (  RotateKeyOnDemand) rotation of the key material in customer managed KMS keys, regardless of whether or not automatic key rotation is enabled. You can use GetKeyRotationStatus to identify the date and time that an in progress on-demand rotation was initiated. You can use  ListKeyRotations to view the details of completed rotations. The KMS key that you use for this operation must be in a compatible key state. For details, see Key states of KMS keys in the Key Management Service Developer Guide. Cross-account use: Yes. To perform this operation on a KMS key in a different Amazon Web Services account, specify the key ARN in the value of the KeyId parameter. Required permissions: kms:GetKeyRotationStatus (key policy) Eventual consistency: The KMS API follows an eventual consistency model. For more information, see KMS eventual consistency.",
  "parameters": [],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "KeyRotationEnabled",
          "type": "boolean",
          "description": "A Boolean value that specifies whether key rotation is enabled.",
          "nested_items": []
        },
        {
          "name": "KeyId",
          "type": "string",
          "description": "Identifies the specified symmetric encryption KMS key.",
          "nested_items": []
        },
        {
          "name": "RotationPeriodInDays",
          "type": "integer",
          "description": "The number of days between each automatic rotation. The default value is 365 days.",
          "nested_items": []
        },
        {
          "name": "NextRotationDate",
          "type": "datetime",
          "description": "The next date that KMS will automatically rotate the key material.",
          "nested_items": []
        },
        {
          "name": "OnDemandRotationStartDate",
          "type": "datetime",
          "description": "Identifies the date and time that an in progress on-demand rotation was initiated.",
          "nested_items": []
        }
      ]
    }
  ]
}