{
  "method_name": "replicate_key",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kms/client/replicate_key.html",
  "description": "Replicates a multi-Region key into the specified Region. This operation creates a multi-Region replica key based on a multi-Region primary key in a different Region of the same Amazon Web Services partition. You can create multiple replicas of a primary key, but each must be in a different Region. To create a multi-Region primary key, use the  CreateKey operation. This operation supports multi-Region keys, an KMS feature that lets you create multiple interoperable KMS keys in different Amazon Web Services Regions. Because these KMS keys have the same key ID, key material, and other metadata, you can use them interchangeably to encrypt data in one Amazon Web Services Region and decrypt it in a different Amazon Web Services Region without re-encrypting the data or making a cross-Region call. For more information about multi-Region keys, see Multi-Region keys in KMS in the Key Management Service Developer Guide. A replica key is a fully-functional KMS key that can be used independently of its primary and peer replica keys. A primary key and its replica keys share properties that make them interoperable. They have the same key ID and key material. They also have the same key spec, key usage, key material origin, and automatic key rotation status. KMS automatically synchronizes these shared properties among related multi-Region keys. All other properties of a replica key can differ, including its key policy, tags, aliases, and Key states of KMS keys. KMS pricing and quotas for KMS keys apply to each primary key and replica key. When this operation completes, the new replica key has a transient key state of Creating. This key state changes to Enabled (or PendingImport) after a few seconds when the process of creating the new replica key is complete. While the key state is Creating, you can manage key, but you cannot yet use it in cryptographic operations. If you are creating and using the replica key programmatically, retry on KMSInvalidStateException or call DescribeKey to check its KeyState value before using it. For details about the Creating key state, see Key states of KMS keys in the Key Management Service Developer Guide. You cannot create more than one replica of a primary key in any Region. If the Region already includes a replica of the key you're trying to replicate, ReplicateKey returns an AlreadyExistsException error. If the key state of the existing replica is PendingDeletion, you can cancel the scheduled key deletion (  CancelKeyDeletion) or wait for the key to be deleted. The new replica key you create will have the same shared properties as the original replica key. The CloudTrail log of a ReplicateKey operation records a ReplicateKey operation in the primary key's Region and a  CreateKey operation in the replica key's Region. If you replicate a multi-Region primary key with imported key material, the replica key is created with no key material. You must import the same key material that you imported into the primary key. For details, see Importing key material into multi-Region keys in the Key Management Service Developer Guide. To convert a replica key to a primary key, use the  UpdatePrimaryRegion operation. Cross-account use: No. You cannot use this operation to create a replica key in a different Amazon Web Services account. Required permissions: Eventual consistency: The KMS API follows an eventual consistency model. For more information, see KMS eventual consistency.",
  "parameters": [
    {
      "name": "KeyId",
      "type": "string",
      "required": true,
      "description": "Identifies the multi-Region primary key that is being replicated. To determine whether a KMS key is a multi-Region primary key, use the  DescribeKey operation to check the value of the MultiRegionKeyType property. Specify the key ID or key ARN of a multi-Region primary key. For example: Key ID: mrk-1234abcd12ab34cd56ef1234567890ab Key ARN: arn:aws:kms:us-east-2:111122223333:key/mrk-1234abcd12ab34cd56ef1234567890ab To get the key ID and key ARN for a KMS key, use  ListKeys or  DescribeKey.",
      "nested_params": []
    },
    {
      "name": "ReplicaRegion",
      "type": "string",
      "required": true,
      "description": "The Region ID of the Amazon Web Services Region for this replica key. Enter the Region ID, such as us-east-1 or ap-southeast-2. For a list of Amazon Web Services Regions in which KMS is supported, see KMS service endpoints in the Amazon Web Services General Reference. The replica must be in a different Amazon Web Services Region than its primary key and other replicas of that primary key, but in the same Amazon Web Services partition. KMS must be available in the replica Region. If the Region is not enabled by default, the Amazon Web Services account must be enabled in the Region. For information about Amazon Web Services partitions, see Amazon Resource Names (ARNs) in the Amazon Web Services General Reference. For information about enabling and disabling Regions, see Enabling a Region and Disabling a Region in the Amazon Web Services General Reference.",
      "nested_params": []
    },
    {
      "name": "Policy",
      "type": "string",
      "required": false,
      "description": "The key policy to attach to the KMS key. This parameter is optional. If you do not provide a key policy, KMS attaches the default key policy to the KMS key. The key policy is not a shared property of multi-Region keys. You can specify the same key policy or a different key policy for each key in a set of related multi-Region keys. KMS does not synchronize this property. If you provide a key policy, it must meet the following criteria: The key policy must allow the calling principal to make a subsequent PutKeyPolicy request on the KMS key. This reduces the risk that the KMS key becomes unmanageable. For more information, see Default key policy in the Key Management Service Developer Guide. (To omit this condition, set BypassPolicyLockoutSafetyCheck to true.) Each statement in the key policy must contain one or more principals. The principals in the key policy must exist and be visible to KMS. When you create a new Amazon Web Services principal, you might need to enforce a delay before including the new principal in a key policy because the new principal might not be immediately visible to KMS. For more information, see Changes that I make are not always immediately visible in the Amazon Web Services Identity and Access Management User Guide. A key policy document can include only the following characters: Printable ASCII characters from the space character ( \\u0020) through the end of the ASCII character range. Printable characters in the Basic Latin and Latin-1 Supplement character set (through \\u00FF). The tab ( \\u0009), line feed ( \\u000A), and carriage return ( \\u000D) special characters For information about key policies, see Key policies in KMS in the Key Management Service Developer Guide. For help writing and formatting a JSON policy document, see the IAM JSON Policy Reference in the Identity and Access Management User Guide .",
      "nested_params": []
    },
    {
      "name": "BypassPolicyLockoutSafetyCheck",
      "type": "boolean",
      "required": false,
      "description": "the key policy lockout safety check. The default value is false. Use this parameter only when you intend to prevent the principal that is making the request from making a subsequent PutKeyPolicy request on the KMS key.",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "A description of the KMS key. The default value is an empty string (no description). The description is not a shared property of multi-Region keys. You can specify the same description or a different description for each key in a set of related multi-Region keys. KMS does not synchronize this property.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "Assigns one or more tags to the replica key. Use this parameter to tag the KMS key when it is created. To tag an existing KMS key, use the  TagResource operation. To use this parameter, you must have kms:TagResource permission in an IAM policy. Tags are not a shared property of multi-Region keys. You can specify the same tags or different tags for each key in a set of related multi-Region keys. KMS does not synchronize this property. Each tag consists of a tag key and a tag value. Both the tag key and the tag value are required, but the tag value can be an empty (null) string. You cannot have more than one tag on a KMS key with the same tag key. If you specify an existing tag key with a different tag value, KMS replaces the current tag value with the specified one. When you add tags to an Amazon Web Services resource, Amazon Web Services generates a cost allocation report with usage and costs aggregated by tags. Tags can also be used to control access to a KMS key. For details, see Tagging Keys. (dict) --- A key-value pair. A tag consists of a tag key and a tag value. Tag keys and tag values are both required, but tag values can be empty (null) strings. For information about the rules that apply to tag keys and tag values, see User-Defined Tag Restrictions in the Amazon Web Services Billing and Cost Management User Guide. The key of the tag. The value of the tag.",
      "nested_params": [
        {
          "name": "TagKey",
          "type": "string",
          "required": false,
          "description": "The key of the tag.",
          "nested_params": []
        },
        {
          "name": "TagValue",
          "type": "string",
          "required": false,
          "description": "The value of the tag.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ReplicaKeyMetadata",
          "type": "dict",
          "description": "Displays details about the new replica key, including its Amazon Resource Name ( key ARN) and Key states of KMS keys. It also includes the ARN and Amazon Web Services Region of its primary key and other replica keys.",
          "nested_items": [
            {
              "name": "AWSAccountId",
              "type": "string",
              "description": "The twelve-digit account ID of the Amazon Web Services account that owns the KMS key.",
              "nested_items": []
            },
            {
              "name": "KeyId",
              "type": "string",
              "description": "The globally unique identifier for the KMS key.",
              "nested_items": []
            },
            {
              "name": "Arn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the KMS key. For examples, see Key Management Service (KMS) in the Example ARNs section of the Amazon Web Services General Reference.",
              "nested_items": []
            },
            {
              "name": "CreationDate",
              "type": "datetime",
              "description": "The date and time when the KMS key was created.",
              "nested_items": []
            },
            {
              "name": "Enabled",
              "type": "boolean",
              "description": "Specifies whether the KMS key is enabled. When KeyState is Enabled this value is true, otherwise it is false.",
              "nested_items": []
            },
            {
              "name": "Description",
              "type": "string",
              "description": "The description of the KMS key.",
              "nested_items": []
            },
            {
              "name": "KeyUsage",
              "type": "string",
              "description": "The cryptographic operations for which you can use the KMS key.",
              "nested_items": []
            },
            {
              "name": "KeyState",
              "type": "string",
              "description": "The current status of the KMS key.",
              "nested_items": []
            },
            {
              "name": "DeletionDate",
              "type": "datetime",
              "description": "The date and time after which KMS deletes this KMS key. This value is present only when the KMS key is scheduled for deletion, that is, when its KeyState is PendingDeletion.",
              "nested_items": []
            },
            {
              "name": "ValidTo",
              "type": "datetime",
              "description": "The time at which the imported key material expires. When the key material expires, KMS deletes the key material and the KMS key becomes unusable. This value is present only for KMS keys whose Origin is EXTERNAL and whose ExpirationModel is KEY_MATERIAL_EXPIRES, otherwise this value is omitted.",
              "nested_items": []
            },
            {
              "name": "Origin",
              "type": "string",
              "description": "The source of the key material for the KMS key. When this value is AWS_KMS, KMS created the key material. When this value is EXTERNAL, the key material was imported or the KMS key doesn't have any key material. When this value is AWS_CLOUDHSM, the key material was created in the CloudHSM cluster associated with a custom key store.",
              "nested_items": []
            },
            {
              "name": "CustomKeyStoreId",
              "type": "string",
              "description": "A unique identifier for the custom key store that contains the KMS key. This field is present only when the KMS key is created in a custom key store.",
              "nested_items": []
            },
            {
              "name": "CloudHsmClusterId",
              "type": "string",
              "description": "The cluster ID of the CloudHSM cluster that contains the key material for the KMS key. When you create a KMS key in an CloudHSM custom key store, KMS creates the key material for the KMS key in the associated CloudHSM cluster. This field is present only when the KMS key is created in an CloudHSM key store.",
              "nested_items": []
            },
            {
              "name": "ExpirationModel",
              "type": "string",
              "description": "Specifies whether the KMS key's key material expires. This value is present only when Origin is EXTERNAL, otherwise this value is omitted.",
              "nested_items": []
            },
            {
              "name": "KeyManager",
              "type": "string",
              "description": "The manager of the KMS key. KMS keys in your Amazon Web Services account are either customer managed or Amazon Web Services managed. For more information about the difference, see KMS keys in the Key Management Service Developer Guide.",
              "nested_items": []
            },
            {
              "name": "CustomerMasterKeySpec",
              "type": "string",
              "description": "Instead, use the KeySpec field.",
              "nested_items": []
            },
            {
              "name": "KeySpec",
              "type": "string",
              "description": "Describes the type of key material in the KMS key.",
              "nested_items": []
            },
            {
              "name": "EncryptionAlgorithms",
              "type": "list",
              "description": "The encryption algorithms that the KMS key supports. You cannot use the KMS key with other encryption algorithms within KMS.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "SigningAlgorithms",
              "type": "list",
              "description": "The signing algorithms that the KMS key supports. You cannot use the KMS key with other signing algorithms within KMS.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "KeyAgreementAlgorithms",
              "type": "list",
              "description": "The key agreement algorithm used to derive a shared secret.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "MultiRegion",
              "type": "boolean",
              "description": "Indicates whether the KMS key is a multi-Region ( True) or regional ( False) key. This value is True for multi-Region primary and replica keys and False for regional KMS keys.",
              "nested_items": []
            },
            {
              "name": "MultiRegionConfiguration",
              "type": "dict",
              "description": "Lists the primary and replica keys in same multi-Region key. This field is present only when the value of the MultiRegion field is True.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "MultiRegionKeyType indicates whether the KMS key is a PRIMARY or REPLICA key.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "PrimaryKey displays the key ARN and Region of the primary key. This field displays the current KMS key if it is the primary key.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "ReplicaKeys displays the key ARNs and Regions of all replica keys. This field includes the current KMS key if it is a replica key.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "PendingDeletionWindowInDays",
              "type": "integer",
              "description": "The waiting period before the primary key in a multi-Region key is deleted. This waiting period begins when the last of its replica keys is deleted. This value is present only when the KeyState of the KMS key is PendingReplicaDeletion. That indicates that the KMS key is the primary key in a multi-Region key, it is scheduled for deletion, and it still has existing replica keys.",
              "nested_items": []
            },
            {
              "name": "MacAlgorithms",
              "type": "list",
              "description": "The message authentication code (MAC) algorithm that the HMAC KMS key supports.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "XksKeyConfiguration",
              "type": "dict",
              "description": "Information about the external key that is associated with a KMS key in an external key store.",
              "nested_items": [
                {
                  "name": "Id",
                  "type": "string",
                  "description": "The ID of the external key in its external key manager. This is the ID that the external key store proxy uses to identify the external key.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "ReplicaPolicy",
          "type": "string",
          "description": "The key policy of the new replica key. The value is a key policy document in JSON format.",
          "nested_items": []
        },
        {
          "name": "ReplicaTags",
          "type": "list",
          "description": "The tags on the new replica key. The value is a list of tag key and tag value pairs.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "TagKey",
                  "type": "string",
                  "description": "The key of the tag.",
                  "nested_items": []
                },
                {
                  "name": "TagValue",
                  "type": "string",
                  "description": "The value of the tag.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}