{
  "method_name": "revoke_grant",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kms/client/revoke_grant.html",
  "description": "Deletes the specified grant. You revoke a grant to terminate the permissions that the grant allows. For more information, see Retiring and revoking grants in the Key Management Service Developer Guide . When you create, retire, or revoke a grant, there might be a brief delay, usually less than five minutes, until the grant is available throughout KMS. This state is known as eventual consistency. For details, see Eventual consistency in the Key Management Service Developer Guide . For detailed information about grants, including grant terminology, see Grants in KMS in the Key Management Service Developer Guide . For examples of working with grants in several programming languages, see Programming grants. Cross-account use: Yes. To perform this operation on a KMS key in a different Amazon Web Services account, specify the key ARN in the value of the KeyId parameter. Required permissions: kms:RevokeGrant (key policy). Eventual consistency: The KMS API follows an eventual consistency model. For more information, see KMS eventual consistency.",
  "parameters": [
    {
      "name": "KeyId",
      "type": "string",
      "required": true,
      "description": "A unique identifier for the KMS key associated with the grant. To get the key ID and key ARN for a KMS key, use  ListKeys or  DescribeKey. Specify the key ID or key ARN of the KMS key. To specify a KMS key in a different Amazon Web Services account, you must use the key ARN. For example: Key ID: 1234abcd-12ab-34cd-56ef-1234567890ab Key ARN: arn:aws:kms:us-east-2:111122223333:key/1234abcd-12ab-34cd-56ef-1234567890ab To get the key ID and key ARN for a KMS key, use  ListKeys or  DescribeKey.",
      "nested_params": []
    },
    {
      "name": "GrantId",
      "type": "string",
      "required": true,
      "description": "Identifies the grant to revoke. To get the grant ID, use  CreateGrant,  ListGrants, or  ListRetirableGrants.",
      "nested_params": []
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "Checks if your request will succeed. DryRun is an optional parameter. To learn more about how to use this parameter, see Testing your KMS API calls in the Key Management Service Developer Guide.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}