{
  "method_name": "set_platform_application_attributes",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sns/client/set_platform_application_attributes.html",
  "description": "Sets the attributes of the platform application object for the supported push notification services, such as APNS and GCM (Firebase Cloud Messaging). For more information, see Using Amazon SNS Mobile Push Notifications. For information on configuring attributes for message delivery status, see Using Amazon SNS Application Attributes for Message Delivery Status.",
  "parameters": [
    {
      "name": "PlatformApplicationArn",
      "type": "string",
      "required": true,
      "description": "PlatformApplicationArn for SetPlatformApplicationAttributes action.",
      "nested_params": []
    },
    {
      "name": "Attributes",
      "type": "dict",
      "required": true,
      "description": "A map of the platform application attributes. Attributes in this map include the following: PlatformCredential --- The credential received from the notification service. For ADM, ``PlatformCredential``is client secret. For Apple Services using certificate credentials, PlatformCredential is private key. For Apple Services using token credentials, PlatformCredential is signing key. For GCM (Firebase Cloud Messaging) using key credentials, there is no PlatformPrincipal. The PlatformCredential is API key. For GCM (Firebase Cloud Messaging) using token credentials, there is no PlatformPrincipal. The PlatformCredential is a JSON formatted private key file. When using the Amazon Web Services CLI, the file must be in string format and special characters must be ignored. To format the file correctly, Amazon SNS recommends using the following command: SERVICE_JSON=`jq @json <<< cat service.json`. PlatformPrincipal --- The principal received from the notification service. For ADM, ``PlatformPrincipal``is client id. For Apple Services using certificate credentials, PlatformPrincipal is SSL certificate. For Apple Services using token credentials, PlatformPrincipal is signing key ID. For GCM (Firebase Cloud Messaging), there is no PlatformPrincipal. EventEndpointCreated --- Topic ARN to which EndpointCreated event notifications are sent. EventEndpointDeleted --- Topic ARN to which EndpointDeleted event notifications are sent. EventEndpointUpdated --- Topic ARN to which EndpointUpdate event notifications are sent. EventDeliveryFailure --- Topic ARN to which DeliveryFailure event notifications are sent upon Direct Publish delivery failure (permanent) to one of the application's endpoints. SuccessFeedbackRoleArn --- IAM role ARN used to give Amazon SNS write access to use CloudWatch Logs on your behalf. FailureFeedbackRoleArn --- IAM role ARN used to give Amazon SNS write access to use CloudWatch Logs on your behalf. SuccessFeedbackSampleRate --- Sample rate percentage (0-100) of successfully delivered messages. The following attributes only apply to APNs token-based authentication: ApplePlatformTeamID --- The identifier that's assigned to your Apple developer account team. ApplePlatformBundleID --- The bundle identifier that's assigned to your iOS app. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}