{
  "method_name": "update_account",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/apigateway/client/update_account.html",
  "description": "Changes information about the current Account resource.",
  "parameters": [
    {
      "name": "patchOperations",
      "type": "list",
      "required": false,
      "description": "For more information about supported patch operations, see Patch Operations. (dict) --- For more information about supported patch operations, see Patch Operations. op (string) --- An update operation to be performed with this PATCH request. The valid value can be add, remove, replace or copy. Not all valid operations are supported for a given resource. Support of the operations depends on specific operational contexts. Attempts to apply an unsupported operation on a resource will return an error message.. path (string) --- The op operation's target, as identified by a JSON Pointer value that references a location within the targeted resource. For example, if the target resource has an updateable property of {'name':'value'}, the path for this property is /name. If the name property value is a JSON object (e.g., {'name': {'child/name': 'child-value'}}), the path for the child/name property will be /name/child~1name. Any slash ('/') character appearing in path names must be escaped with '~1', as shown in the example above. Each op operation can have only one path associated with it. value (string) --- The new target value of the update operation. It is applicable for the add or replace operation. When using AWS CLI to update a property of a JSON value, enclose the JSON object with a pair of single quotes in a Linux shell, e.g., --\u0098{'a': --¦}'. from (string) --- The copy update operation's source as identified by a JSON-Pointer value referencing the location within the targeted resource to copy the value from. For example, to promote a canary deployment, you copy the canary deployment ID to the affiliated deployment ID by calling a PATCH request on a Stage resource with 'op':'copy', 'from':'/canarySettings/deploymentId' and 'path':'/deploymentId'.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "cloudwatchRoleArn",
          "type": "string",
          "description": "The ARN of an Amazon CloudWatch role for the current Account.",
          "nested_items": []
        },
        {
          "name": "throttleSettings",
          "type": "dict",
          "description": "Specifies the API request limits configured for the current Account.",
          "nested_items": [
            {
              "name": "burstLimit",
              "type": "integer",
              "description": "The API target request burst rate limit. This allows more requests through for a period of time than the target rate limit.",
              "nested_items": []
            },
            {
              "name": "rateLimit",
              "type": "float",
              "description": "The API target request rate limit.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "features",
          "type": "list",
          "description": "A list of features supported for the account. When usage plans are enabled, the features list will include an entry of \"UsagePlans\".",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": []
            }
          ]
        },
        {
          "name": "apiKeyVersion",
          "type": "string",
          "description": "The version of the API keys used for the account.",
          "nested_items": []
        }
      ]
    }
  ]
}