{
  "method_name": "describe_service_integration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/devops-guru/client/describe_service_integration.html",
  "description": "Returns the integration status of services that are integrated with DevOps Guru. The one service that can be integrated with DevOps Guru is Amazon Web Services Systems Manager, which can be used to create an OpsItem for each generated insight.",
  "parameters": [],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ServiceIntegration",
          "type": "dict",
          "description": "Information about the integration of DevOps Guru with another Amazon Web Services service, such as Amazon Web Services Systems Manager.",
          "nested_items": [
            {
              "name": "OpsCenter",
              "type": "dict",
              "description": "Information about whether DevOps Guru is configured to create an OpsItem in Amazon Web Services Systems Manager OpsCenter for each created insight.",
              "nested_items": [
                {
                  "name": "OptInStatus",
                  "type": "string",
                  "description": "Specifies if DevOps Guru is enabled to create an Amazon Web Services Systems Manager OpsItem for each created insight.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "LogsAnomalyDetection",
              "type": "dict",
              "description": "Information about whether DevOps Guru is configured to perform log anomaly detection on Amazon CloudWatch log groups.",
              "nested_items": [
                {
                  "name": "OptInStatus",
                  "type": "string",
                  "description": "Specifies if DevOps Guru is configured to perform log anomaly detection on CloudWatch log groups.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "KMSServerSideEncryption",
              "type": "dict",
              "description": "Information about whether DevOps Guru is configured to encrypt server-side data using KMS.",
              "nested_items": [
                {
                  "name": "KMSKeyId",
                  "type": "string",
                  "description": "Describes the specified KMS key.",
                  "nested_items": []
                },
                {
                  "name": "OptInStatus",
                  "type": "string",
                  "description": "Specifies if DevOps Guru is enabled for customer managed keys.",
                  "nested_items": []
                },
                {
                  "name": "Type",
                  "type": "string",
                  "description": "The type of KMS key used. Customer managed keys are the KMS keys that you create. Amazon Web Services owned keys are keys that are owned and managed by DevOps Guru.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}