{
  "method_name": "get_cost_estimation",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/devops-guru/client/get_cost_estimation.html",
  "description": "Returns an estimate of the monthly cost for DevOps Guru to analyze your Amazon Web Services resources. For more information, see Estimate your Amazon DevOps Guru costs and Amazon DevOps Guru pricing.",
  "parameters": [
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ResourceCollection",
          "type": "dict",
          "description": "The collection of the Amazon Web Services resources used to create your monthly DevOps Guru cost estimate.",
          "nested_items": [
            {
              "name": "CloudFormation",
              "type": "dict",
              "description": "An object that specifies the CloudFormation stack that defines the Amazon Web Services resources used to create a monthly estimate for DevOps Guru.",
              "nested_items": [
                {
                  "name": "StackNames",
                  "type": "list",
                  "description": "An array of CloudFormation stack names. Its size is fixed at 1 item.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "Tags",
              "type": "list",
              "description": "The Amazon Web Services tags used to filter the resource collection that is used for a cost estimate.",
              "nested_items": [
                {
                  "name": "",
                  "type": "for example, CostCenter, Environment, Project, or Secret",
                  "description": "A tag key (for example, CostCenter, Environment, Project, or Secret). Tag keys are case-sensitive.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "for example, 111122223333, Production, or a team name",
                  "description": "An optional field known as a tag value (for example, 111122223333, Production, or a team name). Omitting the tag value is the same as using an empty string. Like tag keys, tag values are case-sensitive.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "Status",
          "type": "string",
          "description": "The status of creating this cost estimate. If it's still in progress, the status ONGOING is returned. If it is finished, the status COMPLETED is returned.",
          "nested_items": []
        },
        {
          "name": "Costs",
          "type": "list",
          "description": "An array of ResourceCost objects that each contains details about the monthly cost estimate to analyze one of your Amazon Web Services resources.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Type",
                  "type": "string",
                  "description": "The type of the Amazon Web Services resource.",
                  "nested_items": []
                },
                {
                  "name": "State",
                  "type": "string",
                  "description": "The state of the resource. The resource is ACTIVE if it produces metrics, events, or logs within an hour, otherwise it is INACTIVE. You pay for the number of active Amazon Web Services resource hours analyzed for each resource. Inactive resources are not charged.",
                  "nested_items": []
                },
                {
                  "name": "Count",
                  "type": "integer",
                  "description": "The number of active resources analyzed for this service to create a monthly cost estimate.",
                  "nested_items": []
                },
                {
                  "name": "UnitCost",
                  "type": "float",
                  "description": "The price per hour to analyze the resources in the service. For more information, see Estimate your Amazon DevOps Guru costs and Amazon DevOps Guru pricing.",
                  "nested_items": []
                },
                {
                  "name": "Cost",
                  "type": "float",
                  "description": "The total estimated monthly cost to analyze the active resources for this resource.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "TimeRange",
          "type": "dict",
          "description": "The start and end time of the cost estimation.",
          "nested_items": [
            {
              "name": "StartTime",
              "type": "datetime",
              "description": "The start time of the cost estimation.",
              "nested_items": []
            },
            {
              "name": "EndTime",
              "type": "datetime",
              "description": "The end time of the cost estimation.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "TotalCost",
          "type": "float",
          "description": "The estimated monthly cost to analyze the Amazon Web Services resources. This value is the sum of the estimated costs to analyze each resource in the Costs object in this response.",
          "nested_items": []
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The pagination token to use to retrieve the next page of results for this operation. If there are no more pages, this value is null.",
          "nested_items": []
        }
      ]
    }
  ]
}