{
  "method_name": "create_location_efs",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/datasync/client/create_location_efs.html",
  "description": "Creates a transfer location for an Amazon EFS file system. DataSync can use this location as a source or destination for transferring data. Before you begin, make sure that you understand how DataSync accesses Amazon EFS file systems.",
  "parameters": [
    {
      "name": "Subdirectory",
      "type": "string",
      "required": false,
      "description": "Specifies a mount path for your Amazon EFS file system. This is where DataSync reads or writes data on your file system (depending on if this is a source or destination location). By default, DataSync uses the root directory (or access point if you provide one by using AccessPointArn). You can also include subdirectories using forward slashes (for example, /path/to/folder).",
      "nested_params": []
    },
    {
      "name": "EfsFilesystemArn",
      "type": "string",
      "required": true,
      "description": "Specifies the ARN for your Amazon EFS file system.",
      "nested_params": []
    },
    {
      "name": "Ec2Config",
      "type": "dict",
      "required": true,
      "description": "Specifies the subnet and security groups DataSync uses to connect to one of your Amazon EFS file system's mount targets. Specifies the ARN of a subnet where DataSync creates the network interfaces for managing traffic during your transfer. The subnet must be located: In the same virtual private cloud (VPC) as the Amazon EFS file system. In the same Availability Zone as at least one mount target for the Amazon EFS file system. Specifies the Amazon Resource Names (ARNs) of the security groups associated with an Amazon EFS file system's mount target. (string) ---",
      "nested_params": [
        {
          "name": "SubnetArn",
          "type": "string",
          "required": false,
          "description": "Specifies the ARN of a subnet where DataSync creates the network interfaces for managing traffic during your transfer. The subnet must be located:",
          "nested_params": []
        },
        {
          "name": "SecurityGroupArns",
          "type": "list",
          "required": false,
          "description": "Specifies the Amazon Resource Names (ARNs) of the security groups associated with an Amazon EFS file system's mount target.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "Specifies the key-value pair that represents a tag that you want to add to the resource. The value can be an empty string. This value helps you manage, filter, and search for your resources. We recommend that you create a name tag for your location. (dict) --- A key-value pair representing a single tag that's been applied to an Amazon Web Services resource. The key for an Amazon Web Services resource tag. Value (string) --- The value for an Amazon Web Services resource tag.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key for an Amazon Web Services resource tag.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value for an Amazon Web Services resource tag.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "AccessPointArn",
      "type": "string",
      "required": false,
      "description": "Specifies the Amazon Resource Name (ARN) of the access point that DataSync uses to mount your Amazon EFS file system. For more information, see Accessing restricted file systems.",
      "nested_params": []
    },
    {
      "name": "FileSystemAccessRoleArn",
      "type": "string",
      "required": false,
      "description": "Specifies an Identity and Access Management (IAM) role that allows DataSync to access your Amazon EFS file system. For information on creating this role, see Creating a DataSync IAM role for file system access.",
      "nested_params": []
    },
    {
      "name": "InTransitEncryption",
      "type": "string",
      "required": false,
      "description": "Specifies whether you want DataSync to use Transport Layer Security (TLS) 1.2 encryption when it transfers data to or from your Amazon EFS file system. If you specify an access point using AccessPointArn or an IAM role using FileSystemAccessRoleArn, you must set this parameter to TLS1_2.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "LocationArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the Amazon EFS file system location that you create.",
          "nested_items": []
        }
      ]
    }
  ]
}