{
  "method_name": "describe_task",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/datasync/client/describe_task.html",
  "description": "Provides information about a task, which defines where and how DataSync transfers your data.",
  "parameters": [
    {
      "name": "TaskArn",
      "type": "string",
      "required": true,
      "description": "Specifies the Amazon Resource Name (ARN) of the transfer task that you want information about.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "TaskArn",
          "type": "string",
          "description": "The ARN of your task.",
          "nested_items": []
        },
        {
          "name": "Status",
          "type": "string",
          "description": "The status of your task. For information about what each status means, see Task statuses.",
          "nested_items": []
        },
        {
          "name": "Name",
          "type": "string",
          "description": "The name of your task.",
          "nested_items": []
        },
        {
          "name": "CurrentTaskExecutionArn",
          "type": "string",
          "description": "The ARN of the most recent task execution.",
          "nested_items": []
        },
        {
          "name": "SourceLocationArn",
          "type": "string",
          "description": "The ARN of your transfer's source location.",
          "nested_items": []
        },
        {
          "name": "DestinationLocationArn",
          "type": "string",
          "description": "The ARN of your transfer's destination location.",
          "nested_items": []
        },
        {
          "name": "CloudWatchLogGroupArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of an Amazon CloudWatch log group for monitoring your task.",
          "nested_items": []
        },
        {
          "name": "SourceNetworkInterfaceArns",
          "type": "list",
          "description": "The ARNs of the network interfaces that DataSync created for your source location.",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": []
            }
          ]
        },
        {
          "name": "DestinationNetworkInterfaceArns",
          "type": "list",
          "description": "The ARNs of the network interfaces that DataSync created for your destination location.",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": []
            }
          ]
        },
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "VerifyMode",
              "type": "string",
              "description": "Specifies if and how DataSync checks the integrity of your data at the end of your transfer.",
              "nested_items": [
                {
                  "name": "",
                  "type": "recommended",
                  "description": "DataSync calculates the checksum of transferred data (including metadata) at the source location. At the end of the transfer, DataSync then compares this checksum to the checksum calculated on that data at the destination.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "OverwriteMode",
              "type": "string",
              "description": "Specifies whether DataSync should modify or preserve data at the destination location.",
              "nested_items": [
                {
                  "name": "",
                  "type": "default",
                  "description": "DataSync modifies data in the destination location when source data (including metadata) has changed. If DataSync overwrites objects, you might incur additional charges for certain Amazon S3 storage classes (for example, for retrieval or early deletion). For more information, see Storage class considerations with Amazon S3 transfers.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "NEVER - DataSync doesn't overwrite data in the destination location even if the source data has changed. You can use this option to protect against overwriting changes made to files or objects in the destination.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Atime",
              "type": "string",
              "description": "Specifies whether to preserve metadata indicating the last time a file was read or written to.",
              "nested_items": [
                {
                  "name": "",
                  "type": "default",
                  "description": "DataSync attempts to preserve the original Atime attribute on all source files (that is, the version before the PREPARING steps of the task execution). This option is recommended.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "NONE - Ignores Atime.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Mtime",
              "type": "string",
              "description": "Specifies whether to preserve metadata indicating the last time that a file was written to before the PREPARING step of your task execution. This option is required when you need to run the a task more than once.",
              "nested_items": [
                {
                  "name": "",
                  "type": "default",
                  "description": "Preserves original Mtime, which is recommended.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "NONE - Ignores Mtime.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Uid",
              "type": "string",
              "description": "Specifies the POSIX user ID (UID) of the file's owner.",
              "nested_items": [
                {
                  "name": "",
                  "type": "default",
                  "description": "Preserves the integer value of UID and group ID (GID), which is recommended.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "NONE - Ignores UID and GID.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Gid",
              "type": "string",
              "description": "Specifies the POSIX group ID (GID) of the file's owners.",
              "nested_items": [
                {
                  "name": "",
                  "type": "default",
                  "description": "Preserves the integer value of user ID (UID) and GID, which is recommended.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "NONE - Ignores UID and GID.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "PreserveDeletedFiles",
              "type": "string",
              "description": "Specifies whether files in the destination location that don't exist in the source should be preserved. This option can affect your Amazon S3 storage cost. If your task deletes objects, you might incur minimum storage duration charges for certain storage classes. For detailed information, see Considerations when working with Amazon S3 storage classes in DataSync.",
              "nested_items": [
                {
                  "name": "",
                  "type": "default",
                  "description": "Ignores such destination files, which is recommended.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "REMOVE - Deletes destination files that aren't present in the source.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "PreserveDevices",
              "type": "string",
              "description": "Specifies whether DataSync should preserve the metadata of block and character devices in the source location and recreate the files with that device name and metadata on the destination. DataSync copies only the name and metadata of such devices.",
              "nested_items": [
                {
                  "name": "",
                  "type": "default",
                  "description": "Ignores special devices (recommended).",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "PRESERVE - Preserves character and block device metadata. This option currently isn't supported for Amazon EFS.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "PosixPermissions",
              "type": "string",
              "description": "Specifies which users or groups can access a file for a specific purpose such as reading, writing, or execution of the file.",
              "nested_items": [
                {
                  "name": "",
                  "type": "default",
                  "description": "Preserves POSIX-style permissions, which is recommended.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "NONE - Ignores POSIX-style permissions.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "BytesPerSecond",
              "type": "integer",
              "description": "Limits the bandwidth used by a DataSync task. For example, if you want DataSync to use a maximum of 1 MB, set this value to 1048576 ( =1024*1024).",
              "nested_items": []
            },
            {
              "name": "TaskQueueing",
              "type": "string",
              "description": "Specifies whether your transfer tasks should be put into a queue during certain scenarios when running multiple tasks. This is ENABLED by default.",
              "nested_items": []
            },
            {
              "name": "LogLevel",
              "type": "string",
              "description": "Specifies the type of logs that DataSync publishes to a Amazon CloudWatch Logs log group. To specify the log group, see CloudWatchLogGroupArn.",
              "nested_items": [
                {
                  "name": "",
                  "type": "such as transfer errors",
                  "description": "BASIC - Publishes logs with only basic information (such as transfer errors).",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "TRANSFER - Publishes logs for all files or objects that your DataSync task transfers and performs data-integrity checks on.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "OFF - No logs are published.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "TransferMode",
              "type": "string",
              "description": "Specifies whether DataSync transfers only the data (including metadata) that differs between locations following an initial copy or transfers all data every time you run the task. If you're planning on recurring transfers, you might only want to transfer what's changed since your previous task execution.",
              "nested_items": [
                {
                  "name": "",
                  "type": "default",
                  "description": "After your initial full transfer, DataSync copies only the data and metadata that differs between the source and destination location.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "ALL - DataSync copies everything in the source to the destination without comparing differences between the locations.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "SecurityDescriptorCopyFlags",
              "type": "string",
              "description": "Specifies which components of the SMB security descriptor are copied from source to destination objects.",
              "nested_items": [
                {
                  "name": "",
                  "type": "default",
                  "description": "For each copied object, DataSync copies the following metadata:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "The object owner.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "DACLs",
                      "description": "NTFS discretionary access control lists (DACLs), which determine whether to grant access to an object. DataSync won't copy NTFS system access control lists (SACLs) with this option.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "",
                  "type": "DACLs",
                  "description": "OWNER_DACL_SACL - For each copied object, DataSync copies the following metadata:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "The object owner.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "DACLs",
                      "description": "NTFS discretionary access control lists (DACLs), which determine whether to grant access to an object.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "depending on the type of location in your transfer",
                      "description": "SACLs, which are used by administrators to log attempts to access a secured object. Copying SACLs requires granting additional permissions to the Windows user that DataSync uses to access your SMB location. For information about choosing a user with the right permissions, see required permissions for SMB, FSx for Windows File Server, or FSx for ONTAP (depending on the type of location in your transfer).",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "",
                  "type": "",
                  "description": "NONE - None of the SMB security descriptor components are copied. Destination objects are owned by the user that was provided for accessing the destination location. DACLs and SACLs are set based on the destination server's configuration.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "ObjectTags",
              "type": "string",
              "description": "Specifies whether you want DataSync to PRESERVE object tags (default behavior) when transferring between object storage systems. If you want your DataSync task to ignore object tags, specify the NONE value.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "Excludes",
          "type": "list",
          "description": "The exclude filters that define the files, objects, and folders in your source location that you don't want DataSync to transfer. For more information and examples, see Specifying what DataSync transfers by using filters.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "FilterType",
                  "type": "string",
                  "description": "The type of filter rule to apply. DataSync only supports the SIMPLE_PATTERN rule type.",
                  "nested_items": []
                },
                {
                  "name": "Value",
                  "type": "string",
                  "description": "A single filter string that consists of the patterns to include or exclude. The patterns are delimited by '|' (that is, a pipe), for example: /folder1|/folder2",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "ScheduleExpression",
              "type": "string",
              "description": "Specifies your task schedule by using a cron or rate expression.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "Specifies whether to enable or disable your task schedule. Your schedule is enabled by default, but there can be situations where you need to disable it. For example, you might need to pause a recurring transfer to fix an issue with your task or perform maintenance on your storage system.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "ErrorCode",
          "type": "string",
          "description": "If there's an issue with your task, you can use the error code to help you troubleshoot the problem. For more information, see Troubleshooting issues with DataSync transfers.",
          "nested_items": []
        },
        {
          "name": "ErrorDetail",
          "type": "string",
          "description": "If there's an issue with your task, you can use the error details to help you troubleshoot the problem. For more information, see Troubleshooting issues with DataSync transfers.",
          "nested_items": []
        },
        {
          "name": "CreationTime",
          "type": "datetime",
          "description": "The time that the task was created.",
          "nested_items": []
        },
        {
          "name": "Includes",
          "type": "list",
          "description": "The include filters that define the files, objects, and folders in your source location that you want DataSync to transfer. For more information and examples, see Specifying what DataSync transfers by using filters.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "FilterType",
                  "type": "string",
                  "description": "The type of filter rule to apply. DataSync only supports the SIMPLE_PATTERN rule type.",
                  "nested_items": []
                },
                {
                  "name": "Value",
                  "type": "string",
                  "description": "A single filter string that consists of the patterns to include or exclude. The patterns are delimited by '|' (that is, a pipe), for example: /folder1|/folder2",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "ManifestConfig",
          "type": "dict",
          "description": "The configuration of the manifest that lists the files or objects that you want DataSync to transfer. For more information, see Specifying what DataSync transfers by using a manifest.",
          "nested_items": [
            {
              "name": "Action",
              "type": "string",
              "description": "Specifies what DataSync uses the manifest for.",
              "nested_items": []
            },
            {
              "name": "Format",
              "type": "string",
              "description": "Specifies the file format of your manifest. For more information, see Creating a manifest.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "ManifestObjectPath",
                      "type": "string",
                      "description": "Specifies the Amazon S3 object key of your manifest. This can include a prefix (for example, prefix/my-manifest.csv).",
                      "nested_items": []
                    },
                    {
                      "name": "BucketAccessRoleArn",
                      "type": "string",
                      "description": "Specifies the Identity and Access Management (IAM) role that allows DataSync to access your manifest. For more information, see Providing DataSync access to your manifest.",
                      "nested_items": []
                    },
                    {
                      "name": "S3BucketArn",
                      "type": "string",
                      "description": "Specifies the Amazon Resource Name (ARN) of the S3 bucket where you're hosting your manifest.",
                      "nested_items": []
                    },
                    {
                      "name": "ManifestObjectVersionId",
                      "type": "string",
                      "description": "Specifies the object version ID of the manifest that you want DataSync to use. If you don't set this, DataSync uses the latest version of the object.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "TaskReportConfig",
          "type": "dict",
          "description": "The configuration of your task report, which provides detailed information about your DataSync transfer. For more information, see Monitoring your DataSync transfers with task reports.",
          "nested_items": [
            {
              "name": "Destination",
              "type": "dict",
              "description": "Specifies the Amazon S3 bucket where DataSync uploads your task report. For more information, see Task reports.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Subdirectory",
                      "type": "string",
                      "description": "Specifies a bucket prefix for your report.",
                      "nested_items": []
                    },
                    {
                      "name": "S3BucketArn",
                      "type": "string",
                      "description": "Specifies the ARN of the S3 bucket where DataSync uploads your report.",
                      "nested_items": []
                    },
                    {
                      "name": "BucketAccessRoleArn",
                      "type": "string",
                      "description": "Specifies the Amazon Resource Name (ARN) of the IAM policy that allows DataSync to upload a task report to your S3 bucket. For more information, see Allowing DataSync to upload a task report to an Amazon S3 bucket.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "OutputType",
              "type": "string",
              "description": "Specifies the type of task report that you want:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "SUMMARY_ONLY: Provides necessary details about your task, including the number of files, objects, and directories transferred and transfer duration.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "STANDARD: Provides complete details about your task, including a full list of files, objects, and directories that were transferred, skipped, verified, and more.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "ReportLevel",
              "type": "string",
              "description": "Specifies whether you want your task report to include only what went wrong with your transfer or a list of what succeeded and didn't.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "ERRORS_ONLY: A report shows what DataSync was unable to transfer, skip, verify, and delete.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "SUCCESSES_AND_ERRORS: A report shows what DataSync was able and unable to transfer, skip, verify, and delete.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "ObjectVersionIds",
              "type": "string",
              "description": "Specifies whether your task report includes the new version of each object transferred into an S3 bucket. This only applies if you enable versioning on your bucket. Keep in mind that setting this to INCLUDE can increase the duration of your task execution.",
              "nested_items": []
            },
            {
              "name": "Overrides",
              "type": "dict",
              "description": "Customizes the reporting level for aspects of your task report. For example, your report might generally only include errors, but you could specify that you want a list of successes and errors just for the files that DataSync attempted to delete in your destination location.",
              "nested_items": [
                {
                  "name": "Transferred",
                  "type": "dict",
                  "description": "Specifies the level of reporting for the files, objects, and directories that DataSync attempted to transfer.",
                  "nested_items": [
                    {
                      "name": "ReportLevel",
                      "type": "string",
                      "description": "Specifies whether your task report includes errors only or successes and errors.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "ReportLevel",
                      "type": "string",
                      "description": "Specifies whether your task report includes errors only or successes and errors.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "ReportLevel",
                      "type": "string",
                      "description": "Specifies whether your task report includes errors only or successes and errors.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "ReportLevel",
                      "type": "string",
                      "description": "Specifies whether your task report includes errors only or successes and errors.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "ScheduleDetails",
          "type": "dict",
          "description": "The details about your task schedule.",
          "nested_items": [
            {
              "name": "StatusUpdateTime",
              "type": "datetime",
              "description": "Indicates the last time the status of your task schedule changed. For example, if DataSync automatically disables your schedule because of a repeated error, you can see when the schedule was disabled.",
              "nested_items": []
            },
            {
              "name": "DisabledReason",
              "type": "string",
              "description": "Provides a reason if the task schedule is disabled.",
              "nested_items": []
            },
            {
              "name": "DisabledBy",
              "type": "string",
              "description": "Indicates how your task schedule was disabled.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "USER - Your schedule was manually disabled by using the UpdateTask operation or DataSync console.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "SERVICE - Your schedule was automatically disabled by DataSync because the task failed repeatedly with the same error.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "TaskMode",
          "type": "string",
          "description": "The task mode that you're using. For more information, see Choosing a task mode for your data transfer.",
          "nested_items": []
        }
      ]
    }
  ]
}