{
  "method_name": "list_locations",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/datasync/client/list_locations.html",
  "description": "Returns a list of source and destination locations. If you have more locations than are returned in a response (that is, the response returns only a truncated list of your agents), the response contains a token that you can specify in your next request to fetch the next page of locations.",
  "parameters": [
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": true,
      "description": "You can use API filters to narrow down the list of resources returned by ListLocations. For example, to retrieve all tasks on a specific source location, you can use ListLocations with filter name LocationType S3 and Operator Equals. (dict) --- Narrow down the list of resources returned by ListLocations. For example, to see all your Amazon S3 locations, create a filter using \"Name\": \"LocationType\", \"Operator\": \"Equals\", and \"Values\": \"S3\". For more information, see filtering resources. The name of the filter being used. Each API call supports a list of filters that are available for it (for example, LocationType for ListLocations). The values that you want to filter for. For example, you might want to display only Amazon S3 locations. (string) --- The operator that is used to compare filter values (for example, Equals or Contains).",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name of the filter being used. Each API call supports a list of filters that are available for it (for example, LocationType for ListLocations).",
          "nested_params": []
        },
        {
          "name": "Values",
          "type": "list",
          "required": false,
          "description": "The values that you want to filter for. For example, you might want to display only Amazon S3 locations.",
          "nested_params": []
        },
        {
          "name": "Operator",
          "type": "string",
          "required": false,
          "description": "The operator that is used to compare filter values (for example, Equals or Contains).",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Locations",
          "type": "list",
          "description": "An array that contains a list of locations.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "LocationArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the location. For Network File System (NFS) or Amazon EFS, the location is the export path. For Amazon S3, the location is the prefix path that you want to mount and use as the root of the location.",
                  "nested_items": []
                },
                {
                  "name": "LocationUri",
                  "type": "string",
                  "description": "Represents a list of URIs of a location. LocationUri returns an array that contains a list of locations when the ListLocations operation is called.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "An opaque string that indicates the position at which to begin returning the next list of locations.",
          "nested_items": []
        }
      ]
    }
  ]
}