{
  "method_name": "update_location_s3",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/datasync/client/update_location_s3.html",
  "description": "Modifies the following configuration parameters of the Amazon S3 transfer location that you're using with DataSync.",
  "parameters": [
    {
      "name": "LocationArn",
      "type": "string",
      "required": true,
      "description": "Specifies the Amazon Resource Name (ARN) of the Amazon S3 transfer location that you're updating.",
      "nested_params": []
    },
    {
      "name": "Subdirectory",
      "type": "string",
      "required": false,
      "description": "Specifies a prefix in the S3 bucket that DataSync reads from or writes to (depending on whether the bucket is a source or destination location).",
      "nested_params": []
    },
    {
      "name": "S3StorageClass",
      "type": "string",
      "required": false,
      "description": "Specifies the storage class that you want your objects to use when Amazon S3 is a transfer destination. For buckets in Amazon Web Services Regions, the storage class defaults to STANDARD. For buckets on Outposts, the storage class defaults to OUTPOSTS. For more information, see Storage class considerations with Amazon S3 transfers.",
      "nested_params": []
    },
    {
      "name": "S3Config",
      "type": "dict",
      "required": true,
      "description": "Specifies the Amazon Resource Name (ARN) of the Identity and Access Management (IAM) role that DataSync uses to access your S3 bucket. For more information, see Providing DataSync access to S3 buckets. Specifies the ARN of the IAM role that DataSync uses to access your S3 bucket.",
      "nested_params": [
        {
          "name": "BucketAccessRoleArn",
          "type": "string",
          "required": false,
          "description": "Specifies the ARN of the IAM role that DataSync uses to access your S3 bucket.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}