{
  "method_name": "update_location_efs",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/datasync/client/update_location_efs.html",
  "description": "Modifies the following configuration parameters of the Amazon EFS transfer location that you're using with DataSync. For more information, see Configuring DataSync transfers with Amazon EFS.",
  "parameters": [
    {
      "name": "LocationArn",
      "type": "string",
      "required": true,
      "description": "Specifies the Amazon Resource Name (ARN) of the Amazon EFS transfer location that you're updating.",
      "nested_params": []
    },
    {
      "name": "Subdirectory",
      "type": "string",
      "required": false,
      "description": "Specifies a mount path for your Amazon EFS file system. This is where DataSync reads or writes data on your file system (depending on if this is a source or destination location). By default, DataSync uses the root directory (or access point if you provide one by using AccessPointArn). You can also include subdirectories using forward slashes (for example, /path/to/folder).",
      "nested_params": []
    },
    {
      "name": "AccessPointArn",
      "type": "string",
      "required": false,
      "description": "Specifies the Amazon Resource Name (ARN) of the access point that DataSync uses to mount your Amazon EFS file system. For more information, see Accessing restricted Amazon EFS file systems.",
      "nested_params": []
    },
    {
      "name": "FileSystemAccessRoleArn",
      "type": "string",
      "required": false,
      "description": "Specifies an Identity and Access Management (IAM) role that allows DataSync to access your Amazon EFS file system. For information on creating this role, see Creating a DataSync IAM role for Amazon EFS file system access.",
      "nested_params": []
    },
    {
      "name": "InTransitEncryption",
      "type": "string",
      "required": false,
      "description": "Specifies whether you want DataSync to use Transport Layer Security (TLS) 1.2 encryption when it transfers data to or from your Amazon EFS file system. If you specify an access point using AccessPointArn or an IAM role using FileSystemAccessRoleArn, you must set this parameter to TLS1_2.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}