{
  "method_name": "create_proposal",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/managedblockchain/client/create_proposal.html",
  "description": "Creates a proposal for a change to the network that other members of the network can vote on, for example, a proposal to add a new member to the network. Any member can create a proposal. Applies only to Hyperledger Fabric.",
  "parameters": [
    {
      "name": "ClientRequestToken",
      "type": "string",
      "required": true,
      "description": "A unique, case-sensitive identifier that you provide to ensure the idempotency of the operation. An idempotent operation completes no more than one time. This identifier is required only if you make a service request directly using an HTTP client. It is generated automatically if you use an Amazon Web Services SDK or the CLI. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "NetworkId",
      "type": "string",
      "required": true,
      "description": "The unique identifier of the network for which the proposal is made.",
      "nested_params": []
    },
    {
      "name": "MemberId",
      "type": "string",
      "required": true,
      "description": "The unique identifier of the member that is creating the proposal. This identifier is especially useful for identifying the member making the proposal when multiple members exist in a single Amazon Web Services account.",
      "nested_params": []
    },
    {
      "name": "Actions",
      "type": "dict",
      "required": true,
      "description": "The type of actions proposed, such as inviting a member or removing a member. The types of Actions in a proposal are mutually exclusive. For example, a proposal with Invitations actions cannot also contain Removals actions. Invitations (list) --- The actions to perform for an APPROVED proposal to invite an Amazon Web Services account to create a member and join the network. (dict) --- An action to invite a specific Amazon Web Services account to create a member and join the network. The InviteAction is carried out when a Proposal is APPROVED. Applies only to Hyperledger Fabric. The Amazon Web Services account ID to invite. Removals (list) --- The actions to perform for an APPROVED proposal to remove a member from the network, which deletes the member and all associated member resources from the network. (dict) --- An action to remove a member from a Managed Blockchain network as the result of a removal proposal that is APPROVED. The member and all associated resources are deleted from the network. The unique identifier of the member to remove.",
      "nested_params": [
        {
          "name": "Invitations",
          "type": "list",
          "required": false,
          "description": "The actions to perform for an APPROVED proposal to invite an Amazon Web Services account to create a member and join the network.",
          "nested_params": [
            {
              "name": "Principal",
              "type": "string",
              "required": false,
              "description": "The Amazon Web Services account ID to invite.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Removals",
          "type": "list",
          "required": false,
          "description": "The actions to perform for an APPROVED proposal to remove a member from the network, which deletes the member and all associated member resources from the network.",
          "nested_params": [
            {
              "name": "MemberId",
              "type": "string",
              "required": false,
              "description": "The unique identifier of the member to remove.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "dict",
      "required": false,
      "description": "Tags to assign to the proposal. Each tag consists of a key and an optional value. You can specify multiple key-value pairs in a single request with an overall maximum of 50 tags allowed per resource. For more information about tags, see Tagging Resources in the Amazon Managed Blockchain Ethereum Developer Guide, or Tagging Resources in the Amazon Managed Blockchain Hyperledger Fabric Developer Guide. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ProposalId",
          "type": "string",
          "description": "The unique identifier of the proposal.",
          "nested_items": []
        }
      ]
    }
  ]
}