{
  "method_name": "create_member",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/managedblockchain/client/create_member.html",
  "description": "Creates a member within a Managed Blockchain network. Applies only to Hyperledger Fabric.",
  "parameters": [
    {
      "name": "ClientRequestToken",
      "type": "string",
      "required": true,
      "description": "A unique, case-sensitive identifier that you provide to ensure the idempotency of the operation. An idempotent operation completes no more than one time. This identifier is required only if you make a service request directly using an HTTP client. It is generated automatically if you use an Amazon Web Services SDK or the CLI. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "InvitationId",
      "type": "string",
      "required": true,
      "description": "The unique identifier of the invitation that is sent to the member to join the network.",
      "nested_params": []
    },
    {
      "name": "NetworkId",
      "type": "string",
      "required": true,
      "description": "The unique identifier of the network in which the member is created.",
      "nested_params": []
    },
    {
      "name": "MemberConfiguration",
      "type": "dict",
      "required": true,
      "description": "Member configuration parameters. The name of the member. Description (string) --- An optional description of the member. Configuration properties of the blockchain framework relevant to the member. Fabric (dict) --- Attributes of Hyperledger Fabric for a member on a Managed Blockchain network that uses Hyperledger Fabric. The user name for the member's initial administrative user. The password for the member's initial administrative user. The AdminPassword must be at least 8 characters long and no more than 32 characters. It must contain at least one uppercase letter, one lowercase letter, and one digit. It cannot have a single quotation mark (--\u0098), a double quotation marks ('), a forward slash(/), a backward slash(), @, or a space. LogPublishingConfiguration (dict) --- Configuration properties for logging events associated with a member of a Managed Blockchain network. Fabric (dict) --- Configuration properties for logging events associated with a member of a Managed Blockchain network using the Hyperledger Fabric framework. CaLogs (dict) --- Configuration properties for logging events associated with a member's Certificate Authority (CA). CA logs help you determine when a member in your account joins the network, or when new peers register with a member CA. Cloudwatch (dict) --- Parameters for publishing logs to Amazon CloudWatch Logs. Enabled (boolean) --- Indicates whether logging is enabled. Tags (dict) --- Tags assigned to the member. Tags consist of a key and optional value. When specifying tags during creation, you can specify multiple key-value pairs in a single request, with an overall maximum of 50 tags added to each resource. For more information about tags, see Tagging Resources in the Amazon Managed Blockchain Ethereum Developer Guide, or Tagging Resources in the Amazon Managed Blockchain Hyperledger Fabric Developer Guide. (string) --- (string) --- KmsKeyArn (string) --- The Amazon Resource Name (ARN) of the customer managed key in Key Management Service (KMS) to use for encryption at rest in the member. This parameter is inherited by any nodes that this member creates. For more information, see Encryption at Rest in the Amazon Managed Blockchain Hyperledger Fabric Developer Guide. Use one of the following options to specify this parameter: Undefined or empty string - By default, use an KMS key that is owned and managed by Amazon Web Services on your behalf. A valid symmetric customer managed KMS key - Use the specified KMS key in your account that you create, own, and manage. Amazon Managed Blockchain doesn't support asymmetric keys. For more information, see Using symmetric and asymmetric keys in the Key Management Service Developer Guide. The following is an example of a KMS key ARN: arn:aws:kms:us-east-2:111122223333:key/1234abcd-12ab-34cd-56ef-1234567890ab.",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name of the member.",
          "nested_params": []
        },
        {
          "name": "Description",
          "type": "string",
          "required": false,
          "description": "An optional description of the member.",
          "nested_params": []
        },
        {
          "name": "FrameworkConfiguration",
          "type": "dict",
          "required": false,
          "description": "Configuration properties of the blockchain framework relevant to the member.",
          "nested_params": [
            {
              "name": "Fabric",
              "type": "dict",
              "required": false,
              "description": "Attributes of Hyperledger Fabric for a member on a Managed Blockchain network that uses Hyperledger Fabric.",
              "nested_params": [
                {
                  "name": "AdminUsername",
                  "type": "string",
                  "required": false,
                  "description": "The user name for the member's initial administrative user.",
                  "nested_params": []
                },
                {
                  "name": "AdminPassword",
                  "type": "string",
                  "required": false,
                  "description": "The password for the member's initial administrative user. The AdminPassword must be at least 8 characters long and no more than 32 characters. It must contain at least one uppercase letter, one lowercase letter, and one digit. It cannot have a single quotation mark (--\u0098), a double quotation marks ('), a forward slash(/), a backward slash(), @, or a space.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "LogPublishingConfiguration",
          "type": "dict",
          "required": false,
          "description": "Configuration properties for logging events associated with a member of a Managed Blockchain network.",
          "nested_params": [
            {
              "name": "Fabric",
              "type": "dict",
              "required": false,
              "description": "Configuration properties for logging events associated with a member of a Managed Blockchain network using the Hyperledger Fabric framework.",
              "nested_params": [
                {
                  "name": "CaLogs",
                  "type": "dict",
                  "required": false,
                  "description": "Configuration properties for logging events associated with a member's Certificate Authority (CA). CA logs help you determine when a member in your account joins the network, or when new peers register with a member CA.",
                  "nested_params": [
                    {
                      "name": "Cloudwatch",
                      "type": "dict",
                      "required": false,
                      "description": "Parameters for publishing logs to Amazon CloudWatch Logs.",
                      "nested_params": [
                        {
                          "name": "Enabled",
                          "type": "boolean",
                          "required": false,
                          "description": "Indicates whether logging is enabled.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Tags",
          "type": "dict",
          "required": false,
          "description": "Tags assigned to the member. Tags consist of a key and optional value. When specifying tags during creation, you can specify multiple key-value pairs in a single request, with an overall maximum of 50 tags added to each resource. For more information about tags, see Tagging Resources in the Amazon Managed Blockchain Ethereum Developer Guide, or Tagging Resources in the Amazon Managed Blockchain Hyperledger Fabric Developer Guide.",
          "nested_params": []
        },
        {
          "name": "KmsKeyArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the customer managed key in Key Management Service (KMS) to use for encryption at rest in the member. This parameter is inherited by any nodes that this member creates. For more information, see Encryption at Rest in the Amazon Managed Blockchain Hyperledger Fabric Developer Guide. Use one of the following options to specify this parameter:",
          "nested_params": [
            {
              "name": "Undefined or empty string",
              "type": "",
              "required": false,
              "description": "",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "MemberId",
          "type": "string",
          "description": "The unique identifier of the member.",
          "nested_items": []
        }
      ]
    }
  ]
}