{
  "method_name": "update_node",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/managedblockchain/client/update_node.html",
  "description": "Updates a node configuration with new parameters. Applies only to Hyperledger Fabric.",
  "parameters": [
    {
      "name": "NetworkId",
      "type": "string",
      "required": true,
      "description": "The unique identifier of the network that the node is on.",
      "nested_params": []
    },
    {
      "name": "MemberId",
      "type": "string",
      "required": false,
      "description": "The unique identifier of the member that owns the node. Applies only to Hyperledger Fabric.",
      "nested_params": []
    },
    {
      "name": "NodeId",
      "type": "string",
      "required": true,
      "description": "The unique identifier of the node.",
      "nested_params": []
    },
    {
      "name": "LogPublishingConfiguration",
      "type": "dict",
      "required": false,
      "description": "Configuration properties for publishing to Amazon CloudWatch Logs. Fabric (dict) --- Configuration properties for logging events associated with a node that is owned by a member of a Managed Blockchain network using the Hyperledger Fabric framework. ChaincodeLogs (dict) --- Configuration properties for logging events associated with chaincode execution on a peer node. Chaincode logs contain the results of instantiating, invoking, and querying the chaincode. A peer can run multiple instances of chaincode. When enabled, a log stream is created for all chaincodes, with an individual log stream for each chaincode. Cloudwatch (dict) --- Parameters for publishing logs to Amazon CloudWatch Logs. Enabled (boolean) --- Indicates whether logging is enabled. PeerLogs (dict) --- Configuration properties for a peer node log. Peer node logs contain messages generated when your client submits transaction proposals to peer nodes, requests to join channels, enrolls an admin peer, and lists the chaincode instances on a peer node. Enabled (boolean) --- Indicates whether logging is enabled.",
      "nested_params": [
        {
          "name": "Fabric",
          "type": "dict",
          "required": false,
          "description": "Configuration properties for logging events associated with a node that is owned by a member of a Managed Blockchain network using the Hyperledger Fabric framework.",
          "nested_params": [
            {
              "name": "ChaincodeLogs",
              "type": "dict",
              "required": false,
              "description": "Configuration properties for logging events associated with chaincode execution on a peer node. Chaincode logs contain the results of instantiating, invoking, and querying the chaincode. A peer can run multiple instances of chaincode. When enabled, a log stream is created for all chaincodes, with an individual log stream for each chaincode.",
              "nested_params": [
                {
                  "name": "Cloudwatch",
                  "type": "dict",
                  "required": false,
                  "description": "Parameters for publishing logs to Amazon CloudWatch Logs.",
                  "nested_params": [
                    {
                      "name": "Enabled",
                      "type": "boolean",
                      "required": false,
                      "description": "Indicates whether logging is enabled.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "PeerLogs",
              "type": "dict",
              "required": false,
              "description": "Configuration properties for a peer node log. Peer node logs contain messages generated when your client submits transaction proposals to peer nodes, requests to join channels, enrolls an admin peer, and lists the chaincode instances on a peer node.",
              "nested_params": [
                {
                  "name": "Cloudwatch",
                  "type": "dict",
                  "required": false,
                  "description": "Parameters for publishing logs to Amazon CloudWatch Logs.",
                  "nested_params": [
                    {
                      "name": "Enabled",
                      "type": "boolean",
                      "required": false,
                      "description": "Indicates whether logging is enabled.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}