{
  "method_name": "classify_document",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/comprehend/client/classify_document.html",
  "description": "Creates a classification request to analyze a single document in real-time. ClassifyDocument supports the following model types: If the system detects errors while processing a page in the input document, the API response includes an Errors field that describes the errors. If the system detects a document-level error in your input document, the API returns an InvalidRequestException error response. For details about this exception, see Errors in semi-structured documents in the Comprehend Developer Guide.",
  "parameters": [
    {
      "name": "Text",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "EndpointArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Number (ARN) of the endpoint. For prompt safety classification, Amazon Comprehend provides the endpoint ARN. For more information about prompt safety classifiers, see Prompt safety classification in the Amazon Comprehend Developer Guide For custom classification, you create an endpoint for your custom model. For more information, see Using Amazon Comprehend endpoints.",
      "nested_params": []
    },
    {
      "name": "Bytes",
      "type": "bytes",
      "required": false,
      "description": "Use the Bytes parameter to input a text, PDF, Word or image file. When you classify a document using a custom model, you can also use the Bytes parameter to input an Amazon Textract DetectDocumentText or AnalyzeDocument output file. To classify a document using the prompt safety classifier, use the Text parameter for input. Provide the input document as a sequence of base64-encoded bytes. If your code uses an Amazon Web Services SDK to classify documents, the SDK may encode the document file bytes for you. The maximum length of this field depends on the input document type. For details, see Inputs for real-time custom analysis in the Comprehend Developer Guide. If you use the Bytes parameter, do not use the Text parameter.",
      "nested_params": []
    },
    {
      "name": "DocumentReaderConfig",
      "type": "dict",
      "required": true,
      "description": "Provides configuration parameters to override the default actions for extracting text from PDF documents and image files. This field defines the Amazon Textract API operation that Amazon Comprehend uses to extract text from PDF files and image files. Enter one of the following values: TEXTRACT_DETECT_DOCUMENT_TEXT - The Amazon Comprehend service uses the DetectDocumentText API operation. TEXTRACT_ANALYZE_DOCUMENT - The Amazon Comprehend service uses the AnalyzeDocument API operation. DocumentReadMode (string) --- Determines the text extraction actions for PDF files. Enter one of the following values: SERVICE_DEFAULT - use the Amazon Comprehend service defaults for PDF files. FORCE_DOCUMENT_READ_ACTION - Amazon Comprehend uses the Textract API specified by DocumentReadAction for all PDF files, including digital PDF files. FeatureTypes (list) --- Specifies the type of Amazon Textract features to apply. If you chose TEXTRACT_ANALYZE_DOCUMENT as the read action, you must specify one or both of the following values: TABLES - Returns additional information about any tables that are detected in the input document. FORMS - Returns additional information about any forms that are detected in the input document. (string) --- TABLES or FORMS.",
      "nested_params": [
        {
          "name": "DocumentReadAction",
          "type": "string",
          "required": false,
          "description": "This field defines the Amazon Textract API operation that Amazon Comprehend uses to extract text from PDF files and image files. Enter one of the following values:",
          "nested_params": []
        },
        {
          "name": "DocumentReadMode",
          "type": "string",
          "required": false,
          "description": "Determines the text extraction actions for PDF files. Enter one of the following values:",
          "nested_params": []
        },
        {
          "name": "FeatureTypes",
          "type": "list",
          "required": false,
          "description": "Specifies the type of Amazon Textract features to apply. If you chose TEXTRACT_ANALYZE_DOCUMENT as the read action, you must specify one or both of the following values:",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Classes",
          "type": "list",
          "description": "The classes used by the document being analyzed. These are used for models trained in multi-class mode. Individual classes are mutually exclusive and each document is expected to have only a single class assigned to it. For example, an animal can be a dog or a cat, but not both at the same time.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The name of the class.",
                  "nested_items": []
                },
                {
                  "name": "Score",
                  "type": "float",
                  "description": "The confidence score that Amazon Comprehend has this class correctly attributed.",
                  "nested_items": []
                },
                {
                  "name": "Page",
                  "type": "integer",
                  "description": "Page number in the input document. This field is present in the response only if your request includes the Byte parameter.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "Labels",
          "type": "list",
          "description": "The labels used in the document being analyzed. These are used for multi-label trained models. Individual labels represent different categories that are related in some manner and are not mutually exclusive. For example, a movie can be just an action movie, or it can be an action movie, a science fiction movie, and a comedy, all at the same time.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The name of the label.",
                  "nested_items": []
                },
                {
                  "name": "Score",
                  "type": "float",
                  "description": "The confidence score that Amazon Comprehend has this label correctly attributed.",
                  "nested_items": []
                },
                {
                  "name": "Page",
                  "type": "integer",
                  "description": "Page number where the label occurs. This field is present in the response only if your request includes the Byte parameter.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "DocumentMetadata",
          "type": "dict",
          "description": "Extraction information about the document. This field is present in the response only if your request includes the Byte parameter.",
          "nested_items": [
            {
              "name": "Pages",
              "type": "integer",
              "description": "Number of pages in the document.",
              "nested_items": []
            },
            {
              "name": "ExtractedCharacters",
              "type": "list",
              "description": "List of pages in the document, with the number of characters extracted from each page.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Page",
                      "type": "integer",
                      "description": "Page number.",
                      "nested_items": []
                    },
                    {
                      "name": "Count",
                      "type": "integer",
                      "description": "Number of characters extracted from each page.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "DocumentType",
          "type": "list",
          "description": "The document type for each page in the input document. This field is present in the response only if your request includes the Byte parameter.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Page",
                  "type": "integer",
                  "description": "Page number.",
                  "nested_items": []
                },
                {
                  "name": "Type",
                  "type": "string",
                  "description": "Document type.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "Errors",
          "type": "list",
          "description": "Page-level errors that the system detected while processing the input document. The field is empty if the system encountered no errors.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "TEXTRACT_BAD_PAGE - Amazon Textract cannot read the page. For more information about page limits in Amazon Textract, see Page Quotas in Amazon Textract.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "TEXTRACT_PROVISIONED_THROUGHPUT_EXCEEDED - The number of requests exceeded your throughput limit. For more information about throughput quotas in Amazon Textract, see Default quotas in Amazon Textract.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "10,000 characters maximum",
                  "description": "PAGE_CHARACTERS_EXCEEDED - Too many text characters on the page (10,000 characters maximum).",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "PAGE_SIZE_EXCEEDED - The maximum page size is 10 MB.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "INTERNAL_SERVER_ERROR - The request encountered a service issue. Try the API request again.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "Warnings",
          "type": "list",
          "description": "Warnings detected while processing the input document. The response includes a warning if there is a mismatch between the input document type and the model type associated with the endpoint that you specified. The response can also include warnings for individual pages that have a mismatch.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "The document to classify is plain text, but the classifier is a native document model.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "The document to classify is semi-structured, but the classifier is a plain-text model.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}