{
  "method_name": "describe_entity_recognizer",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/comprehend/client/describe_entity_recognizer.html",
  "description": "Provides details about an entity recognizer including status, S3 buckets containing training data, recognizer metadata, metrics, and so on.",
  "parameters": [
    {
      "name": "EntityRecognizerArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) that identifies the entity recognizer.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "EntityRecognizerProperties",
          "type": "dict",
          "description": "Describes information associated with an entity recognizer.",
          "nested_items": [
            {
              "name": "EntityRecognizerArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) that identifies the entity recognizer.",
              "nested_items": []
            },
            {
              "name": "LanguageCode",
              "type": "string",
              "description": "The language of the input documents. All documents must be in the same language. Only English ('en') is currently supported.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "Provides the status of the entity recognizer.",
              "nested_items": []
            },
            {
              "name": "Message",
              "type": "string",
              "description": "A description of the status of the recognizer.",
              "nested_items": []
            },
            {
              "name": "SubmitTime",
              "type": "datetime",
              "description": "The time that the recognizer was submitted for processing.",
              "nested_items": []
            },
            {
              "name": "EndTime",
              "type": "datetime",
              "description": "The time that the recognizer creation completed.",
              "nested_items": []
            },
            {
              "name": "TrainingStartTime",
              "type": "datetime",
              "description": "The time that training of the entity recognizer started.",
              "nested_items": []
            },
            {
              "name": "TrainingEndTime",
              "type": "datetime",
              "description": "The time that training of the entity recognizer was completed.",
              "nested_items": []
            },
            {
              "name": "InputDataConfig",
              "type": "dict",
              "description": "The input data properties of an entity recognizer.",
              "nested_items": [
                {
                  "name": "DataFormat",
                  "type": "string",
                  "description": "The format of your training data:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "COMPREHEND_CSV: A CSV file that supplements your training documents. The CSV file contains information about the custom entities that your trained model will detect. The required format of the file depends on whether you are providing annotations or an entity list. If you use this value, you must provide your CSV file by using either the Annotations or EntityList parameters. You must provide your training documents by using the Documents parameter.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "AUGMENTED_MANIFEST: A labeled dataset that is produced by Amazon SageMaker Ground Truth. This file is in JSON lines format. Each line is a complete JSON object that contains a training document and its labels. Each label annotates a named entity in the training document. If you use this value, you must provide the AugmentedManifests parameter in your request.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "EntityTypes",
                  "type": "list",
                  "description": "The entity types in the labeled training data that Amazon Comprehend uses to train the custom entity recognizer. Any entity types that you don't specify are ignored.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Type",
                          "type": "string",
                          "description": "An entity type within a labeled training dataset that Amazon Comprehend uses to train a custom entity recognizer.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "Documents",
                  "type": "dict",
                  "description": "The S3 location of the folder that contains the training documents for your custom entity recognizer.",
                  "nested_items": [
                    {
                      "name": "S3Uri",
                      "type": "string",
                      "description": "Specifies the Amazon S3 location where the training documents for an entity recognizer are located. The URI must be in the same Region as the API endpoint that you are calling.",
                      "nested_items": []
                    },
                    {
                      "name": "TestS3Uri",
                      "type": "string",
                      "description": "Specifies the Amazon S3 location where the test documents for an entity recognizer are located. The URI must be in the same Amazon Web Services Region as the API endpoint that you are calling.",
                      "nested_items": []
                    },
                    {
                      "name": "InputFormat",
                      "type": "string",
                      "description": "Specifies how the text in an input file should be processed. This is optional, and the default is ONE_DOC_PER_LINE. ONE_DOC_PER_FILE - Each file is considered a separate document. Use this option when you are processing large documents, such as newspaper articles or scientific papers. ONE_DOC_PER_LINE - Each line in a file is considered a separate document. Use this option when you are processing many short documents, such as text messages.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Annotations",
                  "type": "dict",
                  "description": "The S3 location of the CSV file that annotates your training documents.",
                  "nested_items": [
                    {
                      "name": "S3Uri",
                      "type": "string",
                      "description": "Specifies the Amazon S3 location where the annotations for an entity recognizer are located. The URI must be in the same Region as the API endpoint that you are calling.",
                      "nested_items": []
                    },
                    {
                      "name": "TestS3Uri",
                      "type": "string",
                      "description": "Specifies the Amazon S3 location where the test annotations for an entity recognizer are located. The URI must be in the same Region as the API endpoint that you are calling.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "EntityList",
                  "type": "dict",
                  "description": "The S3 location of the CSV file that has the entity list for your custom entity recognizer.",
                  "nested_items": [
                    {
                      "name": "S3Uri",
                      "type": "string",
                      "description": "Specifies the Amazon S3 location where the entity list is located. The URI must be in the same Region as the API endpoint that you are calling.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "AugmentedManifests",
                  "type": "list",
                  "description": "A list of augmented manifest files that provide training data for your custom model. An augmented manifest file is a labeled dataset that is produced by Amazon SageMaker Ground Truth.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "S3Uri",
                          "type": "string",
                          "description": "The Amazon S3 location of the augmented manifest file.",
                          "nested_items": []
                        },
                        {
                          "name": "Split",
                          "type": "string",
                          "description": "The purpose of the data you've provided in the augmented manifest. You can either train or test this data. If you don't specify, the default is train.",
                          "nested_items": []
                        },
                        {
                          "name": "AttributeNames",
                          "type": "list",
                          "description": "The JSON attribute that contains the annotations for your training documents. The number of attribute names that you specify depends on whether your augmented manifest file is the output of a single labeling job or a chained labeling job.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "AnnotationDataS3Uri",
                          "type": "string",
                          "description": "The S3 prefix to the annotation files that are referred in the augmented manifest file.",
                          "nested_items": []
                        },
                        {
                          "name": "SourceDocumentsS3Uri",
                          "type": "string",
                          "description": "The S3 prefix to the source files (PDFs) that are referred to in the augmented manifest file.",
                          "nested_items": []
                        },
                        {
                          "name": "DocumentType",
                          "type": "string",
                          "description": "The type of augmented manifest. PlainTextDocument or SemiStructuredDocument. If you don't specify, the default is PlainTextDocument.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "",
                              "description": "PLAIN_TEXT_DOCUMENT A document type that represents any unicode text that is encoded in UTF-8.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "SEMI_STRUCTURED_DOCUMENT A document type with positional and structural context, like a PDF. For training with Amazon Comprehend, only PDFs are supported. For inference, Amazon Comprehend support PDFs, DOCX and TXT.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "RecognizerMetadata",
              "type": "dict",
              "description": "Provides information about an entity recognizer.",
              "nested_items": [
                {
                  "name": "NumberOfTrainedDocuments",
                  "type": "integer",
                  "description": "The number of documents in the input data that were used to train the entity recognizer. Typically this is 80 to 90 percent of the input documents.",
                  "nested_items": []
                },
                {
                  "name": "NumberOfTestDocuments",
                  "type": "integer",
                  "description": "The number of documents in the input data that were used to test the entity recognizer. Typically this is 10 to 20 percent of the input documents.",
                  "nested_items": []
                },
                {
                  "name": "EvaluationMetrics",
                  "type": "dict",
                  "description": "Detailed information about the accuracy of an entity recognizer.",
                  "nested_items": [
                    {
                      "name": "Precision",
                      "type": "float",
                      "description": "A measure of the usefulness of the recognizer results in the test data. High precision means that the recognizer returned substantially more relevant results than irrelevant ones.",
                      "nested_items": []
                    },
                    {
                      "name": "Recall",
                      "type": "float",
                      "description": "A measure of how complete the recognizer results are for the test data. High recall means that the recognizer returned most of the relevant results.",
                      "nested_items": []
                    },
                    {
                      "name": "F1Score",
                      "type": "float",
                      "description": "A measure of how accurate the recognizer results are for the test data. It is derived from the Precision and Recall values. The F1Score is the harmonic average of the two scores. For plain text entity recognizer models, the range is 0 to 100, where 100 is the best score. For PDF/Word entity recognizer models, the range is 0 to 1, where 1 is the best score.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "EntityTypes",
                  "type": "list",
                  "description": "Entity types from the metadata of an entity recognizer.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Type",
                          "type": "string",
                          "description": "Type of entity from the list of entity types in the metadata of an entity recognizer.",
                          "nested_items": []
                        },
                        {
                          "name": "EvaluationMetrics",
                          "type": "dict",
                          "description": "Detailed information about the accuracy of the entity recognizer for a specific item on the list of entity types.",
                          "nested_items": [
                            {
                              "name": "Precision",
                              "type": "float",
                              "description": "A measure of the usefulness of the recognizer results for a specific entity type in the test data. High precision means that the recognizer returned substantially more relevant results than irrelevant ones.",
                              "nested_items": []
                            },
                            {
                              "name": "Recall",
                              "type": "float",
                              "description": "A measure of how complete the recognizer results are for a specific entity type in the test data. High recall means that the recognizer returned most of the relevant results.",
                              "nested_items": []
                            },
                            {
                              "name": "F1Score",
                              "type": "float",
                              "description": "A measure of how accurate the recognizer results are for a specific entity type in the test data. It is derived from the Precision and Recall values. The F1Score is the harmonic average of the two scores. The highest score is 1, and the worst score is 0.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "NumberOfTrainMentions",
                          "type": "integer",
                          "description": "Indicates the number of times the given entity type was seen in the training data.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "DataAccessRoleArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the IAM role that grants Amazon Comprehend read access to your input data.",
              "nested_items": []
            },
            {
              "name": "VolumeKmsKeyId",
              "type": "string",
              "description": "ID for the Amazon Web Services Key Management Service (KMS) key that Amazon Comprehend uses to encrypt data on the storage volume attached to the ML compute instance(s) that process the analysis job. The VolumeKmsKeyId can be either of the following formats:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "KMS Key ID: \"1234abcd-12ab-34cd-56ef-1234567890ab\"",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "ARN",
                  "description": "Amazon Resource Name (ARN) of a KMS Key: \"arn:aws:kms:us-west-2:111122223333:key/1234abcd-12ab-34cd-56ef-1234567890ab\"",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "VpcConfig",
              "type": "dict",
              "description": "Configuration parameters for a private Virtual Private Cloud (VPC) containing the resources you are using for your custom entity recognizer. For more information, see Amazon VPC.",
              "nested_items": [
                {
                  "name": "SecurityGroupIds",
                  "type": "list",
                  "description": "The ID number for a security group on an instance of your private VPC. Security groups on your VPC function serve as a virtual firewall to control inbound and outbound traffic and provides security for the resources that you'll be accessing on the VPC. This ID number is preceded by 'sg-', for instance: 'sg-03b388029b0a285ea'. For more information, see Security Groups for your VPC.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Subnets",
                  "type": "list",
                  "description": "The ID for each subnet being used in your private VPC. This subnet is a subset of the a range of IPv4 addresses used by the VPC and is specific to a given availability zone in the VPC's Region. This ID number is preceded by 'subnet-', for instance: 'subnet-04ccf456919e69055'. For more information, see VPCs and Subnets.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "ModelKmsKeyId",
              "type": "string",
              "description": "ID for the KMS key that Amazon Comprehend uses to encrypt trained custom models. The ModelKmsKeyId can be either of the following formats:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "KMS Key ID: \"1234abcd-12ab-34cd-56ef-1234567890ab\"",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "ARN",
                  "description": "Amazon Resource Name (ARN) of a KMS Key: \"arn:aws:kms:us-west-2:111122223333:key/1234abcd-12ab-34cd-56ef-1234567890ab\"",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "VersionName",
              "type": "string",
              "description": "The version name you assigned to the entity recognizer.",
              "nested_items": []
            },
            {
              "name": "SourceModelArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the source model. This model was imported from a different Amazon Web Services account to create the entity recognizer model in your Amazon Web Services account.",
              "nested_items": []
            },
            {
              "name": "FlywheelArn",
              "type": "string",
              "description": "The Amazon Resource Number (ARN) of the flywheel.",
              "nested_items": []
            },
            {
              "name": "OutputDataConfig",
              "type": "dict",
              "description": "Output data configuration.",
              "nested_items": [
                {
                  "name": "FlywheelStatsS3Prefix",
                  "type": "string",
                  "description": "The Amazon S3 prefix for the data lake location of the flywheel statistics.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}