{
  "method_name": "create_activation",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ssm/client/create_activation.html",
  "description": "Generates an activation code and activation ID you can use to register your on-premises servers, edge devices, or virtual machine (VM) with Amazon Web Services Systems Manager. Registering these machines with Systems Manager makes it possible to manage them using Systems Manager tools. You use the activation code and ID when installing SSM Agent on machines in your hybrid environment. For more information about requirements for managing on-premises machines using Systems Manager, see Using Amazon Web Services Systems Manager in hybrid and multicloud environments in the Amazon Web Services Systems Manager User Guide.",
  "parameters": [
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "A user-defined description of the resource that you want to register with Systems Manager.",
      "nested_params": []
    },
    {
      "name": "DefaultInstanceName",
      "type": "string",
      "required": false,
      "description": "The name of the registered, managed node as it will appear in the Amazon Web Services Systems Manager console or when you use the Amazon Web Services command line tools to list Systems Manager resources.",
      "nested_params": []
    },
    {
      "name": "IamRole",
      "type": "string",
      "required": true,
      "description": "The name of the Identity and Access Management (IAM) role that you want to assign to the managed node. This IAM role must provide AssumeRole permissions for the Amazon Web Services Systems Manager service principal ssm.amazonaws.com. For more information, see Create the IAM service role required for Systems Manager in a hybrid and multicloud environments in the Amazon Web Services Systems Manager User Guide.",
      "nested_params": []
    },
    {
      "name": "RegistrationLimit",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ExpirationDate",
      "type": "datetime",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "Optional metadata that you assign to a resource. Tags enable you to categorize a resource in different ways, such as by purpose, owner, or environment. For example, you might want to tag an activation to identify which servers or virtual machines (VMs) in your on-premises environment you intend to activate. In this case, you could specify the following key-value pairs: Key=OS,Value=Windows Key=Environment,Value=Production You can't add tags to or delete tags from an existing activation. You can tag your on-premises servers, edge devices, and VMs after they connect to Systems Manager for the first time and are assigned a managed node ID. This means they are listed in the Amazon Web Services Systems Manager console with an ID that is prefixed with 'mi-'. For information about how to add tags to your managed nodes, see  AddTagsToResource. For information about how to remove tags from your managed nodes, see  RemoveTagsFromResource. (dict) --- Metadata that you assign to your Amazon Web Services resources. Tags enable you to categorize your resources in different ways, for example, by purpose, owner, or environment. In Amazon Web Services Systems Manager, you can apply tags to Systems Manager documents (SSM documents), managed nodes, maintenance windows, parameters, patch baselines, OpsItems, and OpsMetadata. The name of the tag. The value of the tag.",
      "nested_params": []
    },
    {
      "name": "RegistrationMetadata",
      "type": "list",
      "required": true,
      "description": "Reserved for internal use. (dict) --- Reserved for internal use. Reserved for internal use.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "Reserved for internal use.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "Reserved for internal use.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ActivationId",
          "type": "string",
          "description": "The ID number generated by the system when it processed the activation. The activation ID functions like a user name.",
          "nested_items": []
        },
        {
          "name": "ActivationCode",
          "type": "string",
          "description": "The code the system generates when it processes the activation. The activation code functions like a password to validate the activation ID.",
          "nested_items": []
        }
      ]
    }
  ]
}