{
  "method_name": "get_calendar_state",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ssm/client/get_calendar_state.html",
  "description": "Gets the state of a Amazon Web Services Systems Manager change calendar at the current time or a specified time. If you specify a time, GetCalendarState returns the state of the calendar at that specific time, and returns the next time that the change calendar state will transition. If you don't specify a time, GetCalendarState uses the current time. Change Calendar entries have two possible states: OPEN or CLOSED. If you specify more than one calendar in a request, the command returns the status of OPEN only if all calendars in the request are open. If one or more calendars in the request are closed, the status returned is CLOSED. For more information about Change Calendar, a tool in Amazon Web Services Systems Manager, see Amazon Web Services Systems Manager Change Calendar in the Amazon Web Services Systems Manager User Guide.",
  "parameters": [
    {
      "name": "CalendarNames",
      "type": "list",
      "required": true,
      "description": "The names of Amazon Resource Names (ARNs) of the Systems Manager documents (SSM documents) that represent the calendar entries for which you want to get the state. (string) ---",
      "nested_params": []
    },
    {
      "name": "AtTime",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "State",
          "type": "string",
          "description": "The state of the calendar. An OPEN calendar indicates that actions are allowed to proceed, and a CLOSED calendar indicates that actions aren't allowed to proceed.",
          "nested_items": []
        },
        {
          "name": "AtTime",
          "type": "string",
          "description": "The time, as an ISO 8601 string, that you specified in your command. If you don't specify a time, GetCalendarState uses the current time.",
          "nested_items": []
        },
        {
          "name": "NextTransitionTime",
          "type": "string",
          "description": "The time, as an ISO 8601 string, that the calendar state will change. If the current calendar state is OPEN, NextTransitionTime indicates when the calendar state changes to CLOSED, and vice-versa.",
          "nested_items": []
        }
      ]
    }
  ]
}