{
  "method_name": "get_parameters_by_path",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ssm/client/get_parameters_by_path.html",
  "description": "Retrieve information about one or more parameters under a specified level in a hierarchy. Request results are returned on a best-effort basis. If you specify MaxResults in the request, the response includes information up to the limit specified. The number of items returned, however, can be between zero and the value of MaxResults. If the service reaches an internal limit while processing the results, it stops the operation and returns the matching values up to that point and a NextToken. You can specify the NextToken in a subsequent call to get the next set of results.",
  "parameters": [
    {
      "name": "Path",
      "type": "string",
      "required": true,
      "description": "The hierarchy for the parameter. Hierarchies start with a forward slash (/). The hierarchy is the parameter name except the last part of the parameter. For the API call to succeed, the last part of the parameter name can't be in the path. A parameter name hierarchy can have a maximum of 15 levels. Here is an example of a hierarchy: /Finance/Prod/IAD/WinServ2016/license33",
      "nested_params": []
    },
    {
      "name": "Recursive",
      "type": "boolean",
      "required": false,
      "description": "Retrieve all parameters within a hierarchy.",
      "nested_params": []
    },
    {
      "name": "ParameterFilters",
      "type": "list",
      "required": true,
      "description": "Filters to limit the request results. (dict) --- One or more filters. Use a filter to return a more specific list of results. The name of the filter. The ParameterStringFilter object is used by the  DescribeParameters and  GetParametersByPath API operations. However, not all of the pattern values listed for Key can be used with both operations. For DescribeParameters, all of the listed patterns are valid except Label. For GetParametersByPath, the following patterns listed for Key aren't valid: tag, DataType, Name, Path, and Tier. For examples of Amazon Web Services CLI commands demonstrating valid parameter filter constructions, see Searching for Systems Manager parameters in the Amazon Web Services Systems Manager User Guide. Option (string) --- For all filters used with  DescribeParameters, valid options include Equals and BeginsWith. The Name filter additionally supports the Contains option. (Exception: For filters using the key Path, valid options include Recursive and OneLevel.) For filters used with  GetParametersByPath, valid options include Equals and BeginsWith. (Exception: For filters using Label as the Key name, the only valid option is Equals.) Values (list) --- The value you want to search for. (string) ---",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The name of the filter. The ParameterStringFilter object is used by the  DescribeParameters and  GetParametersByPath API operations. However, not all of the pattern values listed for Key can be used with both operations. For DescribeParameters, all of the listed patterns are valid except Label. For GetParametersByPath, the following patterns listed for Key aren't valid: tag, DataType, Name, Path, and Tier. For examples of Amazon Web Services CLI commands demonstrating valid parameter filter constructions, see Searching for Systems Manager parameters in the Amazon Web Services Systems Manager User Guide.",
          "nested_params": []
        },
        {
          "name": "Option",
          "type": "string",
          "required": false,
          "description": "For all filters used with  DescribeParameters, valid options include Equals and BeginsWith. The Name filter additionally supports the Contains option. (Exception: For filters using the key Path, valid options include Recursive and OneLevel.) For filters used with  GetParametersByPath, valid options include Equals and BeginsWith. (Exception: For filters using Label as the Key name, the only valid option is Equals.)",
          "nested_params": []
        },
        {
          "name": "Values",
          "type": "list",
          "required": false,
          "description": "The value you want to search for.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "WithDecryption",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Parameters",
          "type": "list",
          "description": "A list of parameters found in the specified hierarchy.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The name of the parameter.",
                  "nested_items": []
                },
                {
                  "name": "Type",
                  "type": "string",
                  "description": "The type of parameter. Valid values include the following: String, StringList, and SecureString.",
                  "nested_items": []
                },
                {
                  "name": "Value",
                  "type": "string",
                  "description": "The parameter value.",
                  "nested_items": []
                },
                {
                  "name": "Version",
                  "type": "integer",
                  "description": "The parameter version.",
                  "nested_items": []
                },
                {
                  "name": "Selector",
                  "type": "string",
                  "description": "Either the version number or the label used to retrieve the parameter value. Specify selectors by using one of the following formats:",
                  "nested_items": []
                },
                {
                  "name": "SourceResult",
                  "type": "string",
                  "description": "Applies to parameters that reference information in other Amazon Web Services services. SourceResult is the raw result or response from the source.",
                  "nested_items": []
                },
                {
                  "name": "LastModifiedDate",
                  "type": "datetime",
                  "description": "Date the parameter was last changed or updated and the parameter version was created.",
                  "nested_items": []
                },
                {
                  "name": "ARN",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the parameter.",
                  "nested_items": []
                },
                {
                  "name": "DataType",
                  "type": "string",
                  "description": "The data type of the parameter, such as text or aws:ec2:image. The default is text.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The token for the next set of items to return. Use this token to get the next set of results.",
          "nested_items": []
        }
      ]
    }
  ]
}