{
  "method_name": "get_command_invocation",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ssm/client/get_command_invocation.html",
  "description": "Returns detailed information about command execution for an invocation or plugin. The Run Command API follows an eventual consistency model, due to the distributed nature of the system supporting the API. This means that the result of an API command you run that affects your resources might not be immediately visible to all subsequent commands you run. You should keep this in mind when you carry out an API command that immediately follows a previous API command. GetCommandInvocation only gives the execution status of a plugin in a document. To get the command execution status on a specific managed node, use  ListCommandInvocations. To get the command execution status across managed nodes, use  ListCommands.",
  "parameters": [
    {
      "name": "CommandId",
      "type": "string",
      "required": true,
      "description": "(Required) The parent command ID of the invocation plugin.",
      "nested_params": []
    },
    {
      "name": "InstanceId",
      "type": "string",
      "required": true,
      "description": "(Required) The ID of the managed node targeted by the command. A managed node can be an Amazon Elastic Compute Cloud (Amazon EC2) instance, edge device, and on-premises server or VM in your hybrid environment that is configured for Amazon Web Services Systems Manager.",
      "nested_params": []
    },
    {
      "name": "PluginName",
      "type": "string",
      "required": false,
      "description": "The name of the step for which you want detailed results. If the document contains only one step, you can omit the name and details for that step. If the document contains more than one step, you must specify the name of the step for which you want to view details. Be sure to specify the name of the step, not the name of a plugin like aws:RunShellScript. To find the PluginName, check the document content and find the name of the step you want details for. Alternatively, use  ListCommandInvocations with the CommandId and Details parameters. The PluginName is the Name attribute of the CommandPlugin object in the CommandPlugins list.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "CommandId",
          "type": "string",
          "description": "The parent command ID of the invocation plugin.",
          "nested_items": []
        },
        {
          "name": "InstanceId",
          "type": "string",
          "description": "The ID of the managed node targeted by the command. A managed node can be an Amazon Elastic Compute Cloud (Amazon EC2) instance, edge device, or on-premises server or VM in your hybrid environment that is configured for Amazon Web Services Systems Manager.",
          "nested_items": []
        },
        {
          "name": "Comment",
          "type": "string",
          "description": "The comment text for the command.",
          "nested_items": []
        },
        {
          "name": "DocumentName",
          "type": "string",
          "description": "The name of the document that was run. For example, AWS-RunShellScript.",
          "nested_items": []
        },
        {
          "name": "DocumentVersion",
          "type": "string",
          "description": "The Systems Manager document (SSM document) version used in the request.",
          "nested_items": []
        },
        {
          "name": "PluginName",
          "type": "string",
          "description": "The name of the plugin, or step name, for which details are reported. For example, aws:RunShellScript is a plugin.",
          "nested_items": []
        },
        {
          "name": "ResponseCode",
          "type": "integer",
          "description": "The error level response code for the plugin script. If the response code is -1, then the command hasn't started running on the managed node, or it wasn't received by the node.",
          "nested_items": []
        },
        {
          "name": "ExecutionStartDateTime",
          "type": "string",
          "description": "The date and time the plugin started running. Date and time are written in ISO 8601 format. For example, June 7, 2017 is represented as 2017-06-7. The following sample Amazon Web Services CLI command uses the InvokedBefore filter.",
          "nested_items": []
        },
        {
          "name": "ExecutionElapsedTime",
          "type": "string",
          "description": "Duration since ExecutionStartDateTime.",
          "nested_items": []
        },
        {
          "name": "ExecutionEndDateTime",
          "type": "string",
          "description": "The date and time the plugin finished running. Date and time are written in ISO 8601 format. For example, June 7, 2017 is represented as 2017-06-7. The following sample Amazon Web Services CLI command uses the InvokedAfter filter.",
          "nested_items": []
        },
        {
          "name": "Status",
          "type": "string",
          "description": "The status of this invocation plugin. This status can be different than StatusDetails.",
          "nested_items": []
        },
        {
          "name": "StatusDetails",
          "type": "string",
          "description": "A detailed status of the command execution for an invocation. StatusDetails includes more information than Status because it includes states resulting from error and concurrency control parameters. StatusDetails can show different results than Status. For more information about these statuses, see Understanding command statuses in the Amazon Web Services Systems Manager User Guide. StatusDetails can be one of the following values:",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "Pending: The command hasn't been sent to the managed node.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "In Progress: The command has been sent to the managed node but hasn't reached a terminal state.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "Delayed: The system attempted to send the command to the target, but the target wasn't available. The managed node might not be available because of network issues, because the node was stopped, or for similar reasons. The system will try to send the command again.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "Success: The command or plugin ran successfully. This is a terminal state.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "Delivery Timed Out: The command wasn't delivered to the managed node before the delivery timeout expired. Delivery timeouts don't count against the parent command's MaxErrors limit, but they do contribute to whether the parent command status is Success or Incomplete. This is a terminal state.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "Execution Timed Out: The command started to run on the managed node, but the execution wasn't complete before the timeout expired. Execution timeouts count against the MaxErrors limit of the parent command. This is a terminal state.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "Failed: The command wasn't run successfully on the managed node. For a plugin, this indicates that the result code wasn't zero. For a command invocation, this indicates that the result code for one or more plugins wasn't zero. Invocation failures count against the MaxErrors limit of the parent command. This is a terminal state.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "Cancelled: The command was terminated before it was completed. This is a terminal state.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "Undeliverable: The command can't be delivered to the managed node. The node might not exist or might not be responding. Undeliverable invocations don't count against the parent command's MaxErrors limit and don't contribute to whether the parent command status is Success or Incomplete. This is a terminal state.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "Terminated: The parent command exceeded its MaxErrors limit and subsequent command invocations were canceled by the system. This is a terminal state.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "StandardOutputContent",
          "type": "string",
          "description": "The first 24,000 characters written by the plugin to stdout. If the command hasn't finished running, if ExecutionStatus is neither Succeeded nor Failed, then this string is empty.",
          "nested_items": []
        },
        {
          "name": "StandardOutputUrl",
          "type": "string",
          "description": "The URL for the complete text written by the plugin to stdout in Amazon Simple Storage Service (Amazon S3). If an S3 bucket wasn't specified, then this string is empty.",
          "nested_items": []
        },
        {
          "name": "StandardErrorContent",
          "type": "string",
          "description": "The first 8,000 characters written by the plugin to stderr. If the command hasn't finished running, then this string is empty.",
          "nested_items": []
        },
        {
          "name": "StandardErrorUrl",
          "type": "string",
          "description": "The URL for the complete text written by the plugin to stderr. If the command hasn't finished running, then this string is empty.",
          "nested_items": []
        },
        {
          "name": "CloudWatchOutputConfig",
          "type": "dict",
          "description": "Amazon CloudWatch Logs information where Systems Manager sent the command output.",
          "nested_items": [
            {
              "name": "CloudWatchLogGroupName",
              "type": "string",
              "description": "The name of the CloudWatch Logs log group where you want to send command output. If you don't specify a group name, Amazon Web Services Systems Manager automatically creates a log group for you. The log group uses the following naming format:",
              "nested_items": []
            },
            {
              "name": "CloudWatchOutputEnabled",
              "type": "boolean",
              "description": "Enables Systems Manager to send command output to CloudWatch Logs.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}