{
  "method_name": "update_resource_policy",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/lexv2-models/client/update_resource_policy.html",
  "description": "Replaces the existing resource policy for a bot or bot alias with a new one. If the policy doesn't exist, Amazon Lex returns an exception.",
  "parameters": [
    {
      "name": "resourceArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the bot or bot alias that the resource policy is attached to.",
      "nested_params": []
    },
    {
      "name": "policy",
      "type": "string",
      "required": true,
      "description": "A resource policy to add to the resource. The policy is a JSON structure that contains one or more statements that define the policy. The policy must follow the IAM syntax. For more information about the contents of a JSON policy document, see IAM JSON policy reference. If the policy isn't valid, Amazon Lex returns a validation exception.",
      "nested_params": []
    },
    {
      "name": "expectedRevisionId",
      "type": "string",
      "required": false,
      "description": "The identifier of the revision of the policy to update. If this revision ID doesn't match the current revision ID, Amazon Lex throws an exception. If you don't specify a revision, Amazon Lex overwrites the contents of the policy with the new values.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "resourceArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the bot or bot alias that the resource policy is attached to.",
          "nested_items": []
        },
        {
          "name": "revisionId",
          "type": "string",
          "description": "The current revision of the resource policy. Use the revision ID to make sure that you are updating the most current version of a resource policy when you add a policy statement to a resource, delete a resource, or update a resource.",
          "nested_items": []
        }
      ]
    }
  ]
}