{
  "method_name": "describe_configuration_set",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ses/client/describe_configuration_set.html",
  "description": "Returns the details of the specified configuration set. For information about using configuration sets, see the Amazon SES Developer Guide. You can execute this operation no more than once per second.",
  "parameters": [
    {
      "name": "ConfigurationSetName",
      "type": "string",
      "required": true,
      "description": "The name of the configuration set to describe.",
      "nested_params": []
    },
    {
      "name": "ConfigurationSetAttributeNames",
      "type": "list",
      "required": false,
      "description": "A list of configuration set attributes to return. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ConfigurationSet",
          "type": "dict",
          "description": "The configuration set object associated with the specified configuration set.",
          "nested_items": [
            {
              "name": "Name",
              "type": "string",
              "description": "The name of the configuration set. The name must meet the following requirements:",
              "nested_items": [
                {
                  "name": "",
                  "type": "a-z, A-Z",
                  "description": "Contain only letters (a-z, A-Z), numbers (0-9), underscores (_), or dashes (-).",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Contain 64 characters or fewer.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "EventDestinations",
          "type": "list",
          "description": "A list of event destinations associated with the configuration set.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The name of the event destination. The name must meet the following requirements:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "a-z, A-Z",
                      "description": "Contain only ASCII letters (a-z, A-Z), numbers (0-9), underscores (_), or dashes (-).",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Contain 64 characters or fewer.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Enabled",
                  "type": "boolean",
                  "description": "Sets whether Amazon SES publishes events to this destination when you send an email with the associated configuration set. Set to true to enable publishing to this destination; set to false to prevent publishing to this destination. The default value is false.",
                  "nested_items": []
                },
                {
                  "name": "MatchingEventTypes",
                  "type": "list",
                  "description": "The type of email sending events to publish to the event destination.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "send - The call was successful and Amazon SES is attempting to deliver the email.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "reject - Amazon SES determined that the email contained a virus and rejected it.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "bounce - The recipient's mail server permanently rejected the email. This corresponds to a hard bounce.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "complaint - The recipient marked the email as spam.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "delivery - Amazon SES successfully delivered the email to the recipient's mail server.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "open - The recipient received the email and opened it in their email client.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "click - The recipient clicked one or more links in the email.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "renderingFailure - Amazon SES did not send the email because of a template rendering issue.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "KinesisFirehoseDestination",
                  "type": "dict",
                  "description": "An object that contains the delivery stream ARN and the IAM role ARN associated with an Amazon Kinesis Firehose event destination.",
                  "nested_items": [
                    {
                      "name": "IAMRoleARN",
                      "type": "string",
                      "description": "The ARN of the IAM role under which Amazon SES publishes email sending events to the Amazon Kinesis Firehose stream.",
                      "nested_items": []
                    },
                    {
                      "name": "DeliveryStreamARN",
                      "type": "string",
                      "description": "The ARN of the Amazon Kinesis Firehose stream that email sending events should be published to.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "CloudWatchDestination",
                  "type": "dict",
                  "description": "An object that contains the names, default values, and sources of the dimensions associated with an Amazon CloudWatch event destination.",
                  "nested_items": [
                    {
                      "name": "DimensionConfigurations",
                      "type": "list",
                      "description": "A list of dimensions upon which to categorize your emails when you publish email sending events to Amazon CloudWatch.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "DimensionName",
                              "type": "string",
                              "description": "The name of an Amazon CloudWatch dimension associated with an email sending metric. The name must meet the following requirements:",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "a-z, A-Z",
                                  "description": "Contain only ASCII letters (a-z, A-Z), numbers (0-9), underscores (_), dashes (-), or colons (:).",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "Contain 256 characters or fewer.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "DimensionValueSource",
                              "type": "string",
                              "description": "The place where Amazon SES finds the value of a dimension to publish to Amazon CloudWatch. To use the message tags that you specify using an X-SES-MESSAGE-TAGS header or a parameter to the SendEmail/ SendRawEmail API, specify messageTag. To use your own email headers, specify emailHeader. To put a custom tag on any link included in your email, specify linkTag.",
                              "nested_items": []
                            },
                            {
                              "name": "DefaultDimensionValue",
                              "type": "string",
                              "description": "The default value of the dimension that is published to Amazon CloudWatch if you do not provide the value of the dimension when you send an email. The default value must meet the following requirements:",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "a-z, A-Z",
                                  "description": "Contain only ASCII letters (a-z, A-Z), numbers (0-9), underscores (_), dashes (-), at signs (@), or periods (.).",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "Contain 256 characters or fewer.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "SNSDestination",
                  "type": "dict",
                  "description": "An object that contains the topic ARN associated with an Amazon Simple Notification Service (Amazon SNS) event destination.",
                  "nested_items": [
                    {
                      "name": "TopicARN",
                      "type": "string",
                      "description": "The ARN of the Amazon SNS topic for email sending events. You can find the ARN of a topic by using the ListTopics Amazon SNS operation.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "TrackingOptions",
          "type": "dict",
          "description": "The name of the custom open and click tracking domain associated with the configuration set.",
          "nested_items": [
            {
              "name": "CustomRedirectDomain",
              "type": "string",
              "description": "The custom subdomain that is used to redirect email recipients to the Amazon SES event tracking domain.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "DeliveryOptions",
          "type": "dict",
          "description": "Specifies whether messages that use the configuration set are required to use Transport Layer Security (TLS).",
          "nested_items": [
            {
              "name": "TlsPolicy",
              "type": "string",
              "description": "Specifies whether messages that use the configuration set are required to use Transport Layer Security (TLS). If the value is Require, messages are only delivered if a TLS connection can be established. If the value is Optional, messages can be delivered in plain text if a TLS connection can't be established.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "ReputationOptions",
          "type": "dict",
          "description": "An object that represents the reputation settings for the configuration set.",
          "nested_items": [
            {
              "name": "SendingEnabled",
              "type": "boolean",
              "description": "Describes whether email sending is enabled or disabled for the configuration set. If the value is true, then Amazon SES sends emails that use the configuration set. If the value is false, Amazon SES does not send emails that use the configuration set. The default value is true. You can change this setting using  UpdateConfigurationSetSendingEnabled.",
              "nested_items": []
            },
            {
              "name": "ReputationMetricsEnabled",
              "type": "boolean",
              "description": "Describes whether or not Amazon SES publishes reputation metrics for the configuration set, such as bounce and complaint rates, to Amazon CloudWatch.",
              "nested_items": []
            },
            {
              "name": "LastFreshStart",
              "type": "datetime",
              "description": "The date and time at which the reputation metrics for the configuration set were last reset. Resetting these metrics is known as a fresh start.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}