{
  "method_name": "get_identity_notification_attributes",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ses/client/get_identity_notification_attributes.html",
  "description": "Given a list of verified identities (email addresses and/or domains), returns a structure describing identity notification attributes. This operation is throttled at one request per second and can only get notification attributes for up to 100 identities at a time. For more information about using notifications with Amazon SES, see the Amazon SES Developer Guide.",
  "parameters": [],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "NotificationAttributes",
          "type": "dict",
          "description": "A map of Identity to IdentityNotificationAttributes.",
          "nested_items": [
            {
              "name": "BounceTopic",
              "type": "string",
              "description": "(string) ---",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "BounceTopic",
                      "type": "string",
                      "description": "The Amazon Resource Name (ARN) of the Amazon SNS topic where Amazon SES publishes bounce notifications.",
                      "nested_items": []
                    },
                    {
                      "name": "ComplaintTopic",
                      "type": "string",
                      "description": "The Amazon Resource Name (ARN) of the Amazon SNS topic where Amazon SES publishes complaint notifications.",
                      "nested_items": []
                    },
                    {
                      "name": "DeliveryTopic",
                      "type": "string",
                      "description": "The Amazon Resource Name (ARN) of the Amazon SNS topic where Amazon SES publishes delivery notifications.",
                      "nested_items": []
                    },
                    {
                      "name": "ForwardingEnabled",
                      "type": "boolean",
                      "description": "Describes whether Amazon SES forwards bounce and complaint notifications as email. true indicates that Amazon SES forwards bounce and complaint notifications as email, while false indicates that bounce and complaint notifications are published only to the specified bounce and complaint Amazon SNS topics.",
                      "nested_items": []
                    },
                    {
                      "name": "HeadersInBounceNotificationsEnabled",
                      "type": "boolean",
                      "description": "Describes whether Amazon SES includes the original email headers in Amazon SNS notifications of type Bounce. A value of true specifies that Amazon SES includes headers in bounce notifications, and a value of false specifies that Amazon SES does not include headers in bounce notifications.",
                      "nested_items": []
                    },
                    {
                      "name": "HeadersInComplaintNotificationsEnabled",
                      "type": "boolean",
                      "description": "Describes whether Amazon SES includes the original email headers in Amazon SNS notifications of type Complaint. A value of true specifies that Amazon SES includes headers in complaint notifications, and a value of false specifies that Amazon SES does not include headers in complaint notifications.",
                      "nested_items": []
                    },
                    {
                      "name": "HeadersInDeliveryNotificationsEnabled",
                      "type": "boolean",
                      "description": "Describes whether Amazon SES includes the original email headers in Amazon SNS notifications of type Delivery. A value of true specifies that Amazon SES includes headers in delivery notifications, and a value of false specifies that Amazon SES does not include headers in delivery notifications.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}