{
  "method_name": "get_identity_verification_attributes",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ses/client/get_identity_verification_attributes.html",
  "description": "Given a list of identities (email addresses and/or domains), returns the verification status and (for domain identities) the verification token for each identity. The verification status of an email address is 'Pending' until the email address owner clicks the link within the verification email that Amazon SES sent to that address. If the email address owner clicks the link within 24 hours, the verification status of the email address changes to 'Success'. If the link is not clicked within 24 hours, the verification status changes to 'Failed.' In that case, to verify the email address, you must restart the verification process from the beginning. For domain identities, the domain's verification status is 'Pending' as Amazon SES searches for the required TXT record in the DNS settings of the domain. When Amazon SES detects the record, the domain's verification status changes to 'Success'. If Amazon SES is unable to detect the record within 72 hours, the domain's verification status changes to 'Failed.' In that case, to verify the domain, you must restart the verification process from the beginning. This operation is throttled at one request per second and can only get verification attributes for up to 100 identities at a time.",
  "parameters": [],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "VerificationAttributes",
          "type": "dict",
          "description": "A map of Identities to IdentityVerificationAttributes objects.",
          "nested_items": [
            {
              "name": "VerificationStatus",
              "type": "string",
              "description": "(string) ---",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "VerificationStatus",
                      "type": "string",
                      "description": "The verification status of the identity: 'Pending', 'Success', 'Failed', or 'TemporaryFailure'.",
                      "nested_items": []
                    },
                    {
                      "name": "VerificationToken",
                      "type": "string",
                      "description": "The verification token for a domain identity. Null for email address identities.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}