{
  "method_name": "get_identity_mail_from_domain_attributes",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ses/client/get_identity_mail_from_domain_attributes.html",
  "description": "Returns the custom MAIL FROM attributes for a list of identities (email addresses : domains). This operation is throttled at one request per second and can only get custom MAIL FROM attributes for up to 100 identities at a time.",
  "parameters": [],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "MailFromDomainAttributes",
          "type": "dict",
          "description": "A map of identities to custom MAIL FROM attributes.",
          "nested_items": [
            {
              "name": "MailFromDomain",
              "type": "string",
              "description": "(string) ---",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "MailFromDomain",
                      "type": "string",
                      "description": "The custom MAIL FROM domain that the identity is configured to use.",
                      "nested_items": []
                    },
                    {
                      "name": "MailFromDomainStatus",
                      "type": "string",
                      "description": "The state that indicates whether Amazon SES has successfully read the MX record required for custom MAIL FROM domain setup. If the state is Success, Amazon SES uses the specified custom MAIL FROM domain when the verified identity sends an email. All other states indicate that Amazon SES takes the action described by BehaviorOnMXFailure.",
                      "nested_items": []
                    },
                    {
                      "name": "BehaviorOnMXFailure",
                      "type": "string",
                      "description": "The action that Amazon SES takes if it cannot successfully read the required MX record when you send an email. A value of UseDefaultValue indicates that if Amazon SES cannot read the required MX record, it uses amazonses.com (or a subdomain of that) as the MAIL FROM domain. A value of RejectMessage indicates that if Amazon SES cannot read the required MX record, Amazon SES returns a MailFromDomainNotVerified error and does not send the email.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}