{
  "method_name": "send_email",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ses/client/send_email.html",
  "description": "Composes an email message and immediately queues it for sending. To send email using this operation, your message must meet the following requirements:",
  "parameters": [
    {
      "name": "Source",
      "type": "string",
      "required": true,
      "description": "The email address that is sending the email. This email address must be either individually verified with Amazon SES, or from a domain that has been verified with Amazon SES. For information about verifying identities, see the Amazon SES Developer Guide. If you are sending on behalf of another user and have been permitted to do so by a sending authorization policy, then you must also specify the SourceArn parameter. For more information about sending authorization, see the Amazon SES Developer Guide.",
      "nested_params": []
    },
    {
      "name": "Destination",
      "type": "dict",
      "required": true,
      "description": "The destination for this email, composed of To:, CC:, and BCC: fields. ToAddresses (list) --- The recipients to place on the To: line of the message. (string) --- CcAddresses (list) --- The recipients to place on the CC: line of the message. (string) --- BccAddresses (list) --- The recipients to place on the BCC: line of the message. (string) ---",
      "nested_params": [
        {
          "name": "ToAddresses",
          "type": "list",
          "required": false,
          "description": "The recipients to place on the To: line of the message.",
          "nested_params": []
        },
        {
          "name": "CcAddresses",
          "type": "list",
          "required": false,
          "description": "The recipients to place on the CC: line of the message.",
          "nested_params": []
        },
        {
          "name": "BccAddresses",
          "type": "list",
          "required": false,
          "description": "The recipients to place on the BCC: line of the message.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Message",
      "type": "dict",
      "required": true,
      "description": "The message to be sent. The subject of the message: A short summary of the content, which appears in the recipient's inbox. The textual data of the content. Charset (string) --- The character set of the content. The message body. Text (dict) --- The content of the message, in text format. Use this for text-based email clients, or clients on high-latency networks (such as mobile devices). Html (dict) --- The content of the message, in HTML format. Use this for email clients that can process HTML. You can include clickable links, formatted text, and much more in an HTML message. Charset (string) --- The character set of the content.",
      "nested_params": [
        {
          "name": "Subject",
          "type": "dict",
          "required": false,
          "description": "The subject of the message: A short summary of the content, which appears in the recipient's inbox.",
          "nested_params": [
            {
              "name": "Data",
              "type": "string",
              "required": false,
              "description": "The textual data of the content.",
              "nested_params": []
            },
            {
              "name": "Charset",
              "type": "string",
              "required": false,
              "description": "The character set of the content.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Body",
          "type": "dict",
          "required": false,
          "description": "The message body.",
          "nested_params": [
            {
              "name": "Text",
              "type": "dict",
              "required": false,
              "description": "The content of the message, in text format. Use this for text-based email clients, or clients on high-latency networks (such as mobile devices).",
              "nested_params": [
                {
                  "name": "Data",
                  "type": "string",
                  "required": false,
                  "description": "The textual data of the content.",
                  "nested_params": []
                },
                {
                  "name": "Charset",
                  "type": "string",
                  "required": false,
                  "description": "The character set of the content.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Html",
              "type": "dict",
              "required": false,
              "description": "The content of the message, in HTML format. Use this for email clients that can process HTML. You can include clickable links, formatted text, and much more in an HTML message.",
              "nested_params": [
                {
                  "name": "Data",
                  "type": "string",
                  "required": false,
                  "description": "The textual data of the content.",
                  "nested_params": []
                },
                {
                  "name": "Charset",
                  "type": "string",
                  "required": false,
                  "description": "The character set of the content.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "ReplyToAddresses",
      "type": "list",
      "required": false,
      "description": "The reply-to email address(es) for the message. If the recipient replies to the message, each reply-to address receives the reply. (string) ---",
      "nested_params": []
    },
    {
      "name": "ReturnPath",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "SourceArn",
      "type": "string",
      "required": false,
      "description": "This parameter is used only for sending authorization. It is the ARN of the identity that is associated with the sending authorization policy that permits you to send for the email address specified in the Source parameter. For example, if the owner of example.com (which has ARN arn:aws:ses:us-east-1:123456789012:identity/example.com) attaches a policy to it that authorizes you to send from user@example.com, then you would specify the SourceArn to be arn:aws:ses:us-east-1:123456789012:identity/example.com, and the Source to be user@example.com. For more information about sending authorization, see the Amazon SES Developer Guide.",
      "nested_params": []
    },
    {
      "name": "ReturnPathArn",
      "type": "string",
      "required": false,
      "description": "This parameter is used only for sending authorization. It is the ARN of the identity that is associated with the sending authorization policy that permits you to use the email address specified in the ReturnPath parameter. For example, if the owner of example.com (which has ARN arn:aws:ses:us-east-1:123456789012:identity/example.com) attaches a policy to it that authorizes you to use feedback@example.com, then you would specify the ReturnPathArn to be arn:aws:ses:us-east-1:123456789012:identity/example.com, and the ReturnPath to be feedback@example.com. For more information about sending authorization, see the Amazon SES Developer Guide.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "A list of tags, in the form of name/value pairs, to apply to an email that you send using SendEmail. Tags correspond to characteristics of the email that you define, so that you can publish email sending events. (dict) --- Contains the name and value of a tag that you can provide to SendEmail or SendRawEmail to apply to an email. Message tags, which you use with configuration sets, enable you to publish email sending events. For information about using configuration sets, see the Amazon SES Developer Guide. The name of the tag. The name must meet the following requirements: Contain only ASCII letters (a-z, A-Z), numbers (0-9), underscores (_), or dashes (-). Contain 256 characters or fewer. The value of the tag. The value must meet the following requirements: Contain only ASCII letters (a-z, A-Z), numbers (0-9), underscores (_), or dashes (-). Contain 256 characters or fewer.",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name of the tag. The name must meet the following requirements:",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value of the tag. The value must meet the following requirements:",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ConfigurationSetName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "MessageId",
          "type": "string",
          "description": "The unique message identifier returned from the SendEmail action.",
          "nested_items": []
        }
      ]
    }
  ]
}