{
  "method_name": "send_bulk_templated_email",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ses/client/send_bulk_templated_email.html",
  "description": "Composes an email message to multiple destinations. The message body is created using an email template. To send email using this operation, your call must meet the following requirements:",
  "parameters": [
    {
      "name": "Source",
      "type": "string",
      "required": true,
      "description": "The email address that is sending the email. This email address must be either individually verified with Amazon SES, or from a domain that has been verified with Amazon SES. For information about verifying identities, see the Amazon SES Developer Guide. If you are sending on behalf of another user and have been permitted to do so by a sending authorization policy, then you must also specify the SourceArn parameter. For more information about sending authorization, see the Amazon SES Developer Guide.",
      "nested_params": []
    },
    {
      "name": "SourceArn",
      "type": "string",
      "required": false,
      "description": "This parameter is used only for sending authorization. It is the ARN of the identity that is associated with the sending authorization policy that permits you to send for the email address specified in the Source parameter. For example, if the owner of example.com (which has ARN arn:aws:ses:us-east-1:123456789012:identity/example.com) attaches a policy to it that authorizes you to send from user@example.com, then you would specify the SourceArn to be arn:aws:ses:us-east-1:123456789012:identity/example.com, and the Source to be user@example.com. For more information about sending authorization, see the Amazon SES Developer Guide.",
      "nested_params": []
    },
    {
      "name": "ReplyToAddresses",
      "type": "list",
      "required": false,
      "description": "The reply-to email address(es) for the message. If the recipient replies to the message, each reply-to address receives the reply. (string) ---",
      "nested_params": []
    },
    {
      "name": "ReturnPath",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ReturnPathArn",
      "type": "string",
      "required": false,
      "description": "This parameter is used only for sending authorization. It is the ARN of the identity that is associated with the sending authorization policy that permits you to use the email address specified in the ReturnPath parameter. For example, if the owner of example.com (which has ARN arn:aws:ses:us-east-1:123456789012:identity/example.com) attaches a policy to it that authorizes you to use feedback@example.com, then you would specify the ReturnPathArn to be arn:aws:ses:us-east-1:123456789012:identity/example.com, and the ReturnPath to be feedback@example.com. For more information about sending authorization, see the Amazon SES Developer Guide.",
      "nested_params": []
    },
    {
      "name": "ConfigurationSetName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DefaultTags",
      "type": "list",
      "required": true,
      "description": "A list of tags, in the form of name/value pairs, to apply to an email that you send to a destination using SendBulkTemplatedEmail. (dict) --- Contains the name and value of a tag that you can provide to SendEmail or SendRawEmail to apply to an email. Message tags, which you use with configuration sets, enable you to publish email sending events. For information about using configuration sets, see the Amazon SES Developer Guide. The name of the tag. The name must meet the following requirements: Contain only ASCII letters (a-z, A-Z), numbers (0-9), underscores (_), or dashes (-). Contain 256 characters or fewer. The value of the tag. The value must meet the following requirements: Contain only ASCII letters (a-z, A-Z), numbers (0-9), underscores (_), or dashes (-). Contain 256 characters or fewer.",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name of the tag. The name must meet the following requirements:",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value of the tag. The value must meet the following requirements:",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Template",
      "type": "string",
      "required": true,
      "description": "The template to use when sending this email.",
      "nested_params": []
    },
    {
      "name": "TemplateArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DefaultTemplateData",
      "type": "string",
      "required": true,
      "description": "A list of replacement values to apply to the template when replacement data is not specified in a Destination object. These values act as a default or fallback option when no other data is available. The template data is a JSON object, typically consisting of key-value pairs in which the keys correspond to replacement tags in the email template.",
      "nested_params": []
    },
    {
      "name": "Destinations",
      "type": "list",
      "required": true,
      "description": "One or more Destination objects. All of the recipients in a Destination receive the same version of the email. You can specify up to 50 Destination objects within a Destinations array. (dict) --- An array that contains one or more Destinations, as well as the tags and replacement data associated with each of those Destinations. Represents the destination of the message, consisting of To:, CC:, and BCC: fields. ToAddresses (list) --- The recipients to place on the To: line of the message. (string) --- CcAddresses (list) --- The recipients to place on the CC: line of the message. (string) --- BccAddresses (list) --- The recipients to place on the BCC: line of the message. (string) --- ReplacementTags (list) --- A list of tags, in the form of name/value pairs, to apply to an email that you send using SendBulkTemplatedEmail. Tags correspond to characteristics of the email that you define, so that you can publish email sending events. (dict) --- Contains the name and value of a tag that you can provide to SendEmail or SendRawEmail to apply to an email. Message tags, which you use with configuration sets, enable you to publish email sending events. For information about using configuration sets, see the Amazon SES Developer Guide. The name of the tag. The name must meet the following requirements: Contain only ASCII letters (a-z, A-Z), numbers (0-9), underscores (_), or dashes (-). Contain 256 characters or fewer. The value of the tag. The value must meet the following requirements: Contain only ASCII letters (a-z, A-Z), numbers (0-9), underscores (_), or dashes (-). ReplacementTemplateData (string) --- A list of replacement values to apply to the template. This parameter is a JSON object, typically consisting of key-value pairs in which the keys correspond to replacement tags in the email template.",
      "nested_params": [
        {
          "name": "Destination",
          "type": "dict",
          "required": false,
          "description": "Represents the destination of the message, consisting of To:, CC:, and BCC: fields.",
          "nested_params": [
            {
              "name": "ToAddresses",
              "type": "list",
              "required": false,
              "description": "The recipients to place on the To: line of the message.",
              "nested_params": []
            },
            {
              "name": "CcAddresses",
              "type": "list",
              "required": false,
              "description": "The recipients to place on the CC: line of the message.",
              "nested_params": []
            },
            {
              "name": "BccAddresses",
              "type": "list",
              "required": false,
              "description": "The recipients to place on the BCC: line of the message.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ReplacementTags",
          "type": "list",
          "required": false,
          "description": "A list of tags, in the form of name/value pairs, to apply to an email that you send using SendBulkTemplatedEmail. Tags correspond to characteristics of the email that you define, so that you can publish email sending events.",
          "nested_params": [
            {
              "name": "Name",
              "type": "string",
              "required": false,
              "description": "The name of the tag. The name must meet the following requirements:",
              "nested_params": []
            },
            {
              "name": "Value",
              "type": "string",
              "required": false,
              "description": "The value of the tag. The value must meet the following requirements:",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ReplacementTemplateData",
          "type": "string",
          "required": false,
          "description": "A list of replacement values to apply to the template. This parameter is a JSON object, typically consisting of key-value pairs in which the keys correspond to replacement tags in the email template.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Status",
          "type": "list",
          "description": "One object per intended recipient. Check each response object and retry any messages with a failure status. (Note that order of responses will be respective to order of destinations in the request.)Receipt rules enable you to specify which actions.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Status",
                  "type": "string",
                  "description": "The status of a message sent using the SendBulkTemplatedEmail operation.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "Success: Amazon SES accepted the message, and attempts to deliver it to the recipients.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "MessageRejected: The message was rejected because it contained a virus.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "MailFromDomainNotVerified: The sender's email address or domain was not verified.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "ConfigurationSetDoesNotExist: The configuration set you specified does not exist.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "TemplateDoesNotExist: The template you specified does not exist.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "AccountSuspended: Your account has been shut down because of issues related to your email sending practices.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "AccountThrottled: The number of emails you can send has been reduced because your account has exceeded its allocated sending limit.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "AccountDailyQuotaExceeded: You have reached or exceeded the maximum number of emails you can send from your account in a 24-hour period.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "InvalidSendingPoolName: The configuration set you specified refers to an IP pool that does not exist.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "AccountSendingPaused: Email sending for the Amazon SES account was disabled using the  UpdateAccountSendingEnabled operation.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "ConfigurationSetSendingPaused: Email sending for this configuration set was disabled using the  UpdateConfigurationSetSendingEnabled operation.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "InvalidParameterValue: One or more of the parameters you specified when calling this operation was invalid. See the error message for additional information.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "TransientFailure: Amazon SES was unable to process your request because of a temporary issue.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Failed: Amazon SES was unable to process your request. See the error message for additional information.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Error",
                  "type": "string",
                  "description": "A description of an error that prevented a message being sent using the SendBulkTemplatedEmail operation.",
                  "nested_items": []
                },
                {
                  "name": "MessageId",
                  "type": "string",
                  "description": "The unique message identifier returned from the SendBulkTemplatedEmail operation.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}