{
  "method_name": "create_event_subscription",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/docdb/client/create_event_subscription.html",
  "description": "Creates an Amazon DocumentDB event notification subscription. This action requires a topic Amazon Resource Name (ARN) created by using the Amazon DocumentDB console, the Amazon SNS console, or the Amazon SNS API. To obtain an ARN with Amazon SNS, you must create a topic in Amazon SNS and subscribe to the topic. The ARN is displayed in the Amazon SNS console. You can specify the type of source ( SourceType) that you want to be notified of. You can also provide a list of Amazon DocumentDB sources ( SourceIds) that trigger the events, and you can provide a list of event categories ( EventCategories) for events that you want to be notified of. For example, you can specify SourceType = db-instance, SourceIds = mydbinstance1, mydbinstance2 and EventCategories = Availability, Backup. If you specify both the SourceType and SourceIds (such as SourceType = db-instance and SourceIdentifier = myDBInstance1), you are notified of all the db-instance events for the specified source. If you specify a SourceType but do not specify a SourceIdentifier, you receive notice of the events for that source type for all your Amazon DocumentDB sources. If you do not specify either the SourceType or the SourceIdentifier, you are notified of events generated from all Amazon DocumentDB sources belonging to your customer account.",
  "parameters": [
    {
      "name": "SubscriptionName",
      "type": "string",
      "required": true,
      "description": "The name of the subscription. Constraints: The name must be fewer than 255 characters.",
      "nested_params": []
    },
    {
      "name": "SnsTopicArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the SNS topic created for event notification. Amazon SNS creates the ARN when you create a topic and subscribe to it.",
      "nested_params": []
    },
    {
      "name": "SourceType",
      "type": "string",
      "required": false,
      "description": "The type of source that is generating the events. For example, if you want to be notified of events generated by an instance, you would set this parameter to db-instance. If this value is not specified, all events are returned. Valid values: db-instance, db-cluster, db-parameter-group, db-security-group, db-cluster-snapshot.",
      "nested_params": []
    },
    {
      "name": "EventCategories",
      "type": "list",
      "required": false,
      "description": "A list of event categories for a SourceType that you want to subscribe to. (string) ---",
      "nested_params": []
    },
    {
      "name": "SourceIds",
      "type": "list",
      "required": false,
      "description": "The list of identifiers of the event sources for which events are returned. If not specified, then all sources are included in the response. An identifier must begin with a letter and must contain only ASCII letters, digits, and hyphens; it can't end with a hyphen or contain two consecutive hyphens. Constraints: If SourceIds are provided, SourceType must also be provided. If the source type is an instance, a DBInstanceIdentifier must be provided. If the source type is a security group, a DBSecurityGroupName must be provided. If the source type is a parameter group, a DBParameterGroupName must be provided. If the source type is a snapshot, a DBSnapshotIdentifier must be provided. (string) ---",
      "nested_params": []
    },
    {
      "name": "Enabled",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": false,
      "description": "The tags to be assigned to the event subscription. (dict) --- Metadata assigned to an Amazon DocumentDB resource consisting of a key-value pair. Key (string) --- The required name of the tag. The string value can be from 1 to 128 Unicode characters in length and can't be prefixed with ' aws:' or ' rds:'. The string can contain only the set of Unicode letters, digits, white space, --\u0098_', --\u0098.', --\u0098/', --\u0098=', --\u0098+', --\u0098-' (Java regex: '^([\\p{L}\\p{Z}\\p{N}_.:/=+\\-]*)$'). Value (string) --- The optional value of the tag. The string value can be from 1 to 256 Unicode characters in length and can't be prefixed with ' aws:' or ' rds:'. The string can contain only the set of Unicode letters, digits, white space, --\u0098_', --\u0098.', --\u0098/', --\u0098=', --\u0098+', --\u0098-' (Java regex: '^([\\p{L}\\p{Z}\\p{N}_.:/=+\\-]*)$').",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The required name of the tag. The string value can be from 1 to 128 Unicode characters in length and can't be prefixed with ' aws:' or ' rds:'. The string can contain only the set of Unicode letters, digits, white space, --\u0098_', --\u0098.', --\u0098/', --\u0098=', --\u0098+', --\u0098-' (Java regex: '^([\\p{L}\\p{Z}\\p{N}_.:/=+\\-]*)$').",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The optional value of the tag. The string value can be from 1 to 256 Unicode characters in length and can't be prefixed with ' aws:' or ' rds:'. The string can contain only the set of Unicode letters, digits, white space, --\u0098_', --\u0098.', --\u0098/', --\u0098=', --\u0098+', --\u0098-' (Java regex: '^([\\p{L}\\p{Z}\\p{N}_.:/=+\\-]*)$').",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "EventSubscription",
          "type": "dict",
          "description": "Detailed information about an event to which you have subscribed.",
          "nested_items": [
            {
              "name": "CustomerAwsId",
              "type": "string",
              "description": "The Amazon Web Services customer account that is associated with the Amazon DocumentDB event notification subscription.",
              "nested_items": []
            },
            {
              "name": "CustSubscriptionId",
              "type": "string",
              "description": "The Amazon DocumentDB event notification subscription ID.",
              "nested_items": []
            },
            {
              "name": "SnsTopicArn",
              "type": "string",
              "description": "The topic ARN of the Amazon DocumentDB event notification subscription.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The status of the Amazon DocumentDB event notification subscription.",
              "nested_items": []
            },
            {
              "name": "SubscriptionCreationTime",
              "type": "string",
              "description": "The time at which the Amazon DocumentDB event notification subscription was created.",
              "nested_items": []
            },
            {
              "name": "SourceType",
              "type": "string",
              "description": "The source type for the Amazon DocumentDB event notification subscription.",
              "nested_items": []
            },
            {
              "name": "SourceIdsList",
              "type": "list",
              "description": "A list of source IDs for the Amazon DocumentDB event notification subscription.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "EventCategoriesList",
              "type": "list",
              "description": "A list of event categories for the Amazon DocumentDB event notification subscription.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Enabled",
              "type": "boolean",
              "description": "A Boolean value indicating whether the subscription is enabled. A value of true indicates that the subscription is enabled.",
              "nested_items": []
            },
            {
              "name": "EventSubscriptionArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) for the event subscription.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}