{
  "method_name": "describe_pending_maintenance_actions",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/docdb/client/describe_pending_maintenance_actions.html",
  "description": "Returns a list of resources (for example, instances) that have at least one pending maintenance action.",
  "parameters": [
    {
      "name": "ResourceIdentifier",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": true,
      "description": "A filter that specifies one or more resources to return pending maintenance actions for. Supported filters: db-cluster-id - Accepts cluster identifiers and cluster Amazon Resource Names (ARNs). The results list includes only pending maintenance actions for the clusters identified by these ARNs. db-instance-id - Accepts instance identifiers and instance ARNs. The results list includes only pending maintenance actions for the DB instances identified by these ARNs. (dict) --- A named set of filter values, used to return a more specific list of results. You can use a filter to match a set of resources by specific criteria, such as IDs. Wildcards are not supported in filters. The name of the filter. Filter names are case sensitive. One or more filter values. Filter values are case sensitive. (string) ---",
      "nested_params": []
    },
    {
      "name": "Marker",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxRecords",
      "type": "integer",
      "required": false,
      "description": "The maximum number of records to include in the response. If more records exist than the specified MaxRecords value, a pagination token (marker) is included in the response so that the remaining results can be retrieved. Default: 100 Constraints: Minimum 20, maximum 100.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "PendingMaintenanceActions",
          "type": "list",
          "description": "The maintenance actions to be applied.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ResourceIdentifier",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the resource that has pending maintenance actions.",
                  "nested_items": []
                },
                {
                  "name": "PendingMaintenanceActionDetails",
                  "type": "list",
                  "description": "A list that provides details about the pending maintenance actions for the resource.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Action",
                          "type": "string",
                          "description": "The type of pending maintenance action that is available for the resource.",
                          "nested_items": []
                        },
                        {
                          "name": "AutoAppliedAfterDate",
                          "type": "datetime",
                          "description": "The date of the maintenance window when the action is applied. The maintenance action is applied to the resource during its first maintenance window after this date. If this date is specified, any next-maintenance opt-in requests are ignored.",
                          "nested_items": []
                        },
                        {
                          "name": "ForcedApplyDate",
                          "type": "datetime",
                          "description": "The date when the maintenance action is automatically applied. The maintenance action is applied to the resource on this date regardless of the maintenance window for the resource. If this date is specified, any immediate opt-in requests are ignored.",
                          "nested_items": []
                        },
                        {
                          "name": "OptInStatus",
                          "type": "string",
                          "description": "Indicates the type of opt-in request that has been received for the resource.",
                          "nested_items": []
                        },
                        {
                          "name": "CurrentApplyDate",
                          "type": "datetime",
                          "description": "The effective date when the pending maintenance action is applied to the resource.",
                          "nested_items": []
                        },
                        {
                          "name": "Description",
                          "type": "string",
                          "description": "A description providing more detail about the maintenance action.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Marker",
          "type": "string",
          "description": "An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by MaxRecords.",
          "nested_items": []
        }
      ]
    }
  ]
}