{
  "method_name": "describe_db_cluster_snapshots",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/docdb/client/describe_db_cluster_snapshots.html",
  "description": "Returns information about cluster snapshots. This API operation supports pagination.",
  "parameters": [
    {
      "name": "DBClusterIdentifier",
      "type": "string",
      "required": false,
      "description": "The ID of the cluster to retrieve the list of cluster snapshots for. This parameter can't be used with the DBClusterSnapshotIdentifier parameter. This parameter is not case sensitive. Constraints: If provided, must match the identifier of an existing DBCluster.",
      "nested_params": []
    },
    {
      "name": "DBClusterSnapshotIdentifier",
      "type": "string",
      "required": false,
      "description": "A specific cluster snapshot identifier to describe. This parameter can't be used with the DBClusterIdentifier parameter. This value is stored as a lowercase string. Constraints: If provided, must match the identifier of an existing DBClusterSnapshot. If this identifier is for an automated snapshot, the SnapshotType parameter must also be specified.",
      "nested_params": []
    },
    {
      "name": "SnapshotType",
      "type": "string",
      "required": false,
      "description": "The type of cluster snapshots to be returned. You can specify one of the following values: automated - Return all cluster snapshots that Amazon DocumentDB has automatically created for your Amazon Web Services account. manual - Return all cluster snapshots that you have manually created for your Amazon Web Services account. shared - Return all manual cluster snapshots that have been shared to your Amazon Web Services account. public - Return all cluster snapshots that have been marked as public. If you don't specify a SnapshotType value, then both automated and manual cluster snapshots are returned. You can include shared cluster snapshots with these results by setting the IncludeShared parameter to true. You can include public cluster snapshots with these results by setting the IncludePublic parameter to true. The IncludeShared and IncludePublic parameters don't apply for SnapshotType values of manual or automated. The IncludePublic parameter doesn't apply when SnapshotType is set to shared. The IncludeShared parameter doesn't apply when SnapshotType is set to public.",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": true,
      "description": "This parameter is not currently supported. (dict) --- A named set of filter values, used to return a more specific list of results. You can use a filter to match a set of resources by specific criteria, such as IDs. Wildcards are not supported in filters. The name of the filter. Filter names are case sensitive. One or more filter values. Filter values are case sensitive. (string) ---",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name of the filter. Filter names are case sensitive.",
          "nested_params": []
        },
        {
          "name": "Values",
          "type": "list",
          "required": false,
          "description": "One or more filter values. Filter values are case sensitive.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "MaxRecords",
      "type": "integer",
      "required": false,
      "description": "The maximum number of records to include in the response. If more records exist than the specified MaxRecords value, a pagination token (marker) is included in the response so that the remaining results can be retrieved. Default: 100 Constraints: Minimum 20, maximum 100.",
      "nested_params": []
    },
    {
      "name": "Marker",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "IncludeShared",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "IncludePublic",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Marker",
          "type": "string",
          "description": "An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by MaxRecords.",
          "nested_items": []
        },
        {
          "name": "DBClusterSnapshots",
          "type": "list",
          "description": "Provides a list of cluster snapshots.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "AvailabilityZones",
                  "type": "list",
                  "description": "Provides the list of Amazon EC2 Availability Zones that instances in the cluster snapshot can be restored in.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "DBClusterSnapshotIdentifier",
                  "type": "string",
                  "description": "Specifies the identifier for the cluster snapshot.",
                  "nested_items": []
                },
                {
                  "name": "DBClusterIdentifier",
                  "type": "string",
                  "description": "Specifies the cluster identifier of the cluster that this cluster snapshot was created from.",
                  "nested_items": []
                },
                {
                  "name": "SnapshotCreateTime",
                  "type": "datetime",
                  "description": "Provides the time when the snapshot was taken, in UTC.",
                  "nested_items": []
                },
                {
                  "name": "Engine",
                  "type": "string",
                  "description": "Specifies the name of the database engine.",
                  "nested_items": []
                },
                {
                  "name": "Status",
                  "type": "string",
                  "description": "Specifies the status of this cluster snapshot.",
                  "nested_items": []
                },
                {
                  "name": "Port",
                  "type": "integer",
                  "description": "Specifies the port that the cluster was listening on at the time of the snapshot.",
                  "nested_items": []
                },
                {
                  "name": "VpcId",
                  "type": "string",
                  "description": "Provides the virtual private cloud (VPC) ID that is associated with the cluster snapshot.",
                  "nested_items": []
                },
                {
                  "name": "ClusterCreateTime",
                  "type": "datetime",
                  "description": "Specifies the time when the cluster was created, in Universal Coordinated Time (UTC).",
                  "nested_items": []
                },
                {
                  "name": "MasterUsername",
                  "type": "string",
                  "description": "Provides the master user name for the cluster snapshot.",
                  "nested_items": []
                },
                {
                  "name": "EngineVersion",
                  "type": "string",
                  "description": "Provides the version of the database engine for this cluster snapshot.",
                  "nested_items": []
                },
                {
                  "name": "SnapshotType",
                  "type": "string",
                  "description": "Provides the type of the cluster snapshot.",
                  "nested_items": []
                },
                {
                  "name": "PercentProgress",
                  "type": "integer",
                  "description": "Specifies the percentage of the estimated data that has been transferred.",
                  "nested_items": []
                },
                {
                  "name": "StorageEncrypted",
                  "type": "boolean",
                  "description": "Specifies whether the cluster snapshot is encrypted.",
                  "nested_items": []
                },
                {
                  "name": "KmsKeyId",
                  "type": "string",
                  "description": "If StorageEncrypted is true, the KMS key identifier for the encrypted cluster snapshot.",
                  "nested_items": []
                },
                {
                  "name": "DBClusterSnapshotArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) for the cluster snapshot.",
                  "nested_items": []
                },
                {
                  "name": "SourceDBClusterSnapshotArn",
                  "type": "string",
                  "description": "If the cluster snapshot was copied from a source cluster snapshot, the ARN for the source cluster snapshot; otherwise, a null value.",
                  "nested_items": []
                },
                {
                  "name": "StorageType",
                  "type": "string",
                  "description": "Storage type associated with your cluster snapshot.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}