{
  "method_name": "describe_certificates",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/docdb/client/describe_certificates.html",
  "description": "Returns a list of certificate authority (CA) certificates provided by Amazon DocumentDB for this Amazon Web Services account.",
  "parameters": [
    {
      "name": "CertificateIdentifier",
      "type": "string",
      "required": false,
      "description": "The user-supplied certificate identifier. If this parameter is specified, information for only the specified certificate is returned. If this parameter is omitted, a list of up to MaxRecords certificates is returned. This parameter is not case sensitive. Constraints Must match an existing CertificateIdentifier.",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": true,
      "description": "This parameter is not currently supported. (dict) --- A named set of filter values, used to return a more specific list of results. You can use a filter to match a set of resources by specific criteria, such as IDs. Wildcards are not supported in filters. The name of the filter. Filter names are case sensitive. One or more filter values. Filter values are case sensitive. (string) ---",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name of the filter. Filter names are case sensitive.",
          "nested_params": []
        },
        {
          "name": "Values",
          "type": "list",
          "required": false,
          "description": "One or more filter values. Filter values are case sensitive.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "MaxRecords",
      "type": "integer",
      "required": false,
      "description": "The maximum number of records to include in the response. If more records exist than the specified MaxRecords value, a pagination token called a marker is included in the response so that the remaining results can be retrieved. Default: 100 Constraints: Minimum: 20 Maximum: 100",
      "nested_params": []
    },
    {
      "name": "Marker",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Certificates",
          "type": "list",
          "description": "A list of certificates for this Amazon Web Services account.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "CertificateIdentifier",
                  "type": "string",
                  "description": "The unique key that identifies a certificate.",
                  "nested_items": []
                },
                {
                  "name": "CertificateType",
                  "type": "string",
                  "description": "The type of the certificate.",
                  "nested_items": []
                },
                {
                  "name": "Thumbprint",
                  "type": "string",
                  "description": "The thumbprint of the certificate.",
                  "nested_items": []
                },
                {
                  "name": "ValidFrom",
                  "type": "datetime",
                  "description": "The starting date-time from which the certificate is valid.",
                  "nested_items": []
                },
                {
                  "name": "ValidTill",
                  "type": "datetime",
                  "description": "The date-time after which the certificate is no longer valid.",
                  "nested_items": []
                },
                {
                  "name": "CertificateArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) for the certificate.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "Marker",
          "type": "string",
          "description": "An optional pagination token provided if the number of records retrieved is greater than MaxRecords. If this parameter is specified, the marker specifies the next record in the list. Including the value of Marker in the next call to DescribeCertificates results in the next page of certificates.",
          "nested_items": []
        }
      ]
    }
  ]
}