{
  "method_name": "modify_db_cluster_snapshot_attribute",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/docdb/client/modify_db_cluster_snapshot_attribute.html",
  "description": "Adds an attribute and values to, or removes an attribute and values from, a manual cluster snapshot. To share a manual cluster snapshot with other Amazon Web Services accounts, specify restore as the AttributeName, and use the ValuesToAdd parameter to add a list of IDs of the Amazon Web Services accounts that are authorized to restore the manual cluster snapshot. Use the value all to make the manual cluster snapshot public, which means that it can be copied or restored by all Amazon Web Services accounts. Do not add the all value for any manual cluster snapshots that contain private information that you don't want available to all Amazon Web Services accounts. If a manual cluster snapshot is encrypted, it can be shared, but only by specifying a list of authorized Amazon Web Services account IDs for the ValuesToAdd parameter. You can't use all as a value for that parameter in this case.",
  "parameters": [
    {
      "name": "DBClusterSnapshotIdentifier",
      "type": "string",
      "required": true,
      "description": "The identifier for the cluster snapshot to modify the attributes for.",
      "nested_params": []
    },
    {
      "name": "AttributeName",
      "type": "string",
      "required": true,
      "description": "The name of the cluster snapshot attribute to modify. To manage authorization for other Amazon Web Services accounts to copy or restore a manual cluster snapshot, set this value to restore.",
      "nested_params": []
    },
    {
      "name": "ValuesToAdd",
      "type": "list",
      "required": false,
      "description": "A list of cluster snapshot attributes to add to the attribute specified by AttributeName. To authorize other Amazon Web Services accounts to copy or restore a manual cluster snapshot, set this list to include one or more Amazon Web Services account IDs. To make the manual cluster snapshot restorable by any Amazon Web Services account, set it to all. Do not add the all value for any manual cluster snapshots that contain private information that you don't want to be available to all Amazon Web Services accounts. (string) ---",
      "nested_params": []
    },
    {
      "name": "ValuesToRemove",
      "type": "list",
      "required": false,
      "description": "A list of cluster snapshot attributes to remove from the attribute specified by AttributeName. To remove authorization for other Amazon Web Services accounts to copy or restore a manual cluster snapshot, set this list to include one or more Amazon Web Services account identifiers. To remove authorization for any Amazon Web Services account to copy or restore the cluster snapshot, set it to all . If you specify all, an Amazon Web Services account whose account ID is explicitly added to the restore attribute can still copy or restore a manual cluster snapshot. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "DBClusterSnapshotAttributesResult",
          "type": "dict",
          "description": "Detailed information about the attributes that are associated with a cluster snapshot.",
          "nested_items": [
            {
              "name": "DBClusterSnapshotIdentifier",
              "type": "string",
              "description": "The identifier of the cluster snapshot that the attributes apply to.",
              "nested_items": []
            },
            {
              "name": "DBClusterSnapshotAttributes",
              "type": "list",
              "description": "The list of attributes and values for the cluster snapshot.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "AttributeName",
                      "type": "string",
                      "description": "The name of the manual cluster snapshot attribute.",
                      "nested_items": []
                    },
                    {
                      "name": "AttributeValues",
                      "type": "list",
                      "description": "The values for the manual cluster snapshot attribute.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}