{
  "method_name": "create_gateway",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iotsitewise/client/create_gateway.html",
  "description": "Creates a gateway, which is a virtual or edge device that delivers industrial data streams from local servers to IoT SiteWise. For more information, see Ingesting data using a gateway in the IoT SiteWise User Guide.",
  "parameters": [
    {
      "name": "gatewayName",
      "type": "string",
      "required": true,
      "description": "A unique name for the gateway.",
      "nested_params": []
    },
    {
      "name": "gatewayPlatform",
      "type": "dict",
      "required": true,
      "description": "The gateway's platform. You can only specify one platform in a gateway. greengrass (dict) --- A gateway that runs on IoT Greengrass. The ARN of the Greengrass group. For more information about how to find a group's ARN, see ListGroups and GetGroup in the IoT Greengrass V1 API Reference. greengrassV2 (dict) --- A gateway that runs on IoT Greengrass V2. The name of the IoT thing for your IoT Greengrass V2 core device. coreDeviceOperatingSystem (string) --- The operating system of the core device in IoT Greengrass V2. siemensIE (dict) --- A SiteWise Edge gateway that runs on a Siemens Industrial Edge Device. The name of the IoT Thing for your SiteWise Edge gateway.",
      "nested_params": [
        {
          "name": "greengrass",
          "type": "dict",
          "required": false,
          "description": "A gateway that runs on IoT Greengrass.",
          "nested_params": [
            {
              "name": "groupArn",
              "type": "string",
              "required": false,
              "description": "The ARN of the Greengrass group. For more information about how to find a group's ARN, see ListGroups and GetGroup in the IoT Greengrass V1 API Reference.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "greengrassV2",
          "type": "dict",
          "required": false,
          "description": "A gateway that runs on IoT Greengrass V2.",
          "nested_params": [
            {
              "name": "coreDeviceThingName",
              "type": "string",
              "required": false,
              "description": "The name of the IoT thing for your IoT Greengrass V2 core device.",
              "nested_params": []
            },
            {
              "name": "coreDeviceOperatingSystem",
              "type": "string",
              "required": false,
              "description": "The operating system of the core device in IoT Greengrass V2.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "siemensIE",
          "type": "dict",
          "required": false,
          "description": "A SiteWise Edge gateway that runs on a Siemens Industrial Edge Device.",
          "nested_params": [
            {
              "name": "iotCoreThingName",
              "type": "string",
              "required": false,
              "description": "The name of the IoT Thing for your SiteWise Edge gateway.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "gatewayVersion",
      "type": "string",
      "required": false,
      "description": "The version of the gateway to create. Specify 3 to create an MQTT-enabled, V3 gateway and 2 To create a Classic streams, V2 gateway. If the version isn't specified, a Classic streams, V2 gateway is created by default. We recommend creating an MQTT-enabled, V3 gateway for self-hosted gateways. SiteWise Edge gateways on Siemens Industrial Edge should use gateway version 2. For more information on gateway versions, see Self-host a SiteWise Edge gateway with IoT Greengrass V2.",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "dict",
      "required": false,
      "description": "A list of key-value pairs that contain metadata for the gateway. For more information, see Tagging your IoT SiteWise resources in the IoT SiteWise User Guide. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "gatewayId",
          "type": "string",
          "description": "The ID of the gateway device. You can use this ID when you call other IoT SiteWise API operations.",
          "nested_items": []
        },
        {
          "name": "gatewayArn",
          "type": "string",
          "description": "The ARN of the gateway, which has the following format.",
          "nested_items": []
        }
      ]
    }
  ]
}