{
  "method_name": "update_event_source_mapping",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/lambda/client/update_event_source_mapping.html",
  "description": "Updates an event source mapping. You can change the function that Lambda invokes, or pause invocation and resume later from the same location. For details about how to configure different event sources, see the following topics. The following error handling options are available only for DynamoDB and Kinesis event sources: For stream sources (DynamoDB, Kinesis, Amazon MSK, and self-managed Apache Kafka), the following option is also available: For information about which configuration parameters apply to each event source, see the following topics.",
  "parameters": [
    {
      "name": "UUID",
      "type": "string",
      "required": true,
      "description": "The identifier of the event source mapping.",
      "nested_params": []
    },
    {
      "name": "FunctionName",
      "type": "string",
      "required": false,
      "description": "The name or ARN of the Lambda function. Function name --- MyFunction. Function ARN --- arn:aws:lambda:us-west-2:123456789012:function:MyFunction. Version or Alias ARN --- arn:aws:lambda:us-west-2:123456789012:function:MyFunction:PROD. Partial ARN --- 123456789012:function:MyFunction. The length constraint applies only to the full ARN. If you specify only the function name, it's limited to 64 characters in length.",
      "nested_params": [
        {
          "name": "Function name",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "Function ARN",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "Version or Alias ARN",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "Partial ARN",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Enabled",
      "type": "boolean",
      "required": false,
      "description": "When true, the event source mapping is active. When false, Lambda pauses polling and invocation. Default: True.",
      "nested_params": []
    },
    {
      "name": "BatchSize",
      "type": "integer",
      "required": false,
      "description": "The maximum number of records in each batch that Lambda pulls from your stream or queue and sends to your function. Lambda passes all of the records in the batch to the function in a single call, up to the payload limit for synchronous invocation (6 MB). Amazon Kinesis --- Default 100. Max 10,000. Amazon DynamoDB Streams --- Default 100. Amazon Simple Queue Service --- Default 10. For standard queues the max is 10,000. For FIFO queues the max is 10. Amazon Managed Streaming for Apache Kafka --- Default 100. Self-managed Apache Kafka --- Default 100. Amazon MQ (ActiveMQ and RabbitMQ) --- Default 100. DocumentDB --- Default 100. Max 10,000.",
      "nested_params": [
        {
          "name": "Amazon Kinesis",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "Amazon DynamoDB Streams",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "Amazon Simple Queue Service",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "Amazon Managed Streaming for Apache Kafka",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "Self-managed Apache Kafka",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "Amazon MQ (ActiveMQ and RabbitMQ)",
          "type": "ActiveMQ and RabbitMQ",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "DocumentDB",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        }
      ]
    },
    {
      "name": "FilterCriteria",
      "type": "dict",
      "required": false,
      "description": "An object that defines the filter criteria that determine whether Lambda should process an event. For more information, see Lambda event filtering. Filters (list) --- A list of filters. (dict) --- A structure within a FilterCriteria object that defines an event filtering pattern. Pattern (string) --- A filter pattern. For more information on the syntax of a filter pattern, see Filter rule syntax.",
      "nested_params": [
        {
          "name": "Filters",
          "type": "list",
          "required": false,
          "description": "A list of filters.",
          "nested_params": [
            {
              "name": "Pattern",
              "type": "string",
              "required": false,
              "description": "A filter pattern. For more information on the syntax of a filter pattern, see Filter rule syntax.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "MaximumBatchingWindowInSeconds",
      "type": "integer",
      "required": false,
      "description": "The maximum amount of time, in seconds, that Lambda spends gathering records before invoking the function. You can configure MaximumBatchingWindowInSeconds to any value from 0 seconds to 300 seconds in increments of seconds. For Kinesis, DynamoDB, and Amazon SQS event sources, the default batching window is 0 seconds. For Amazon MSK, Self-managed Apache Kafka, Amazon MQ, and DocumentDB event sources, the default batching window is 500 ms. Note that because you can only change MaximumBatchingWindowInSeconds in increments of seconds, you cannot revert back to the 500 ms default batching window after you have changed it. To restore the default batching window, you must create a new event source mapping. Related setting: For Kinesis, DynamoDB, and Amazon SQS event sources, when you set BatchSize to a value greater than 10, you must set MaximumBatchingWindowInSeconds to at least 1.",
      "nested_params": []
    },
    {
      "name": "DestinationConfig",
      "type": "dict",
      "required": false,
      "description": "(Kinesis, DynamoDB Streams, Amazon MSK, and self-managed Kafka only) A configuration object that specifies the destination of an event after Lambda processes it. OnSuccess (dict) --- The destination configuration for successful invocations. Destination (string) --- The Amazon Resource Name (ARN) of the destination resource. OnFailure (dict) --- The destination configuration for failed invocations. To retain records of unsuccessful asynchronous invocations, you can configure an Amazon SNS topic, Amazon SQS queue, Amazon S3 bucket, Lambda function, or Amazon EventBridge event bus as the destination. To retain records of failed invocations from Kinesis, DynamoDB, self-managed Kafka or Amazon MSK, you can configure an Amazon SNS topic, Amazon SQS queue, or Amazon S3 bucket as the destination.",
      "nested_params": [
        {
          "name": "OnSuccess",
          "type": "dict",
          "required": false,
          "description": "The destination configuration for successful invocations.",
          "nested_params": [
            {
              "name": "Destination",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of the destination resource.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "OnFailure",
          "type": "dict",
          "required": false,
          "description": "The destination configuration for failed invocations.",
          "nested_params": [
            {
              "name": "Destination",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of the destination resource. To retain records of unsuccessful asynchronous invocations, you can configure an Amazon SNS topic, Amazon SQS queue, Amazon S3 bucket, Lambda function, or Amazon EventBridge event bus as the destination. To retain records of failed invocations from Kinesis, DynamoDB, self-managed Kafka or Amazon MSK, you can configure an Amazon SNS topic, Amazon SQS queue, or Amazon S3 bucket as the destination.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "MaximumRecordAgeInSeconds",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "BisectBatchOnFunctionError",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaximumRetryAttempts",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ParallelizationFactor",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "SourceAccessConfigurations",
      "type": "list",
      "required": false,
      "description": "An array of authentication protocols or VPC components required to secure your event source. (dict) --- To secure and define access to your event source, you can specify the authentication protocol, VPC components, or virtual host. Type (string) --- The type of authentication protocol, VPC components, or virtual host for your event source. For example: \"Type\":\"SASL_SCRAM_512_AUTH\". BASIC_AUTH --- (Amazon MQ) The Secrets Manager secret that stores your broker credentials. BASIC_AUTH --- (Self-managed Apache Kafka) The Secrets Manager ARN of your secret key used for SASL/PLAIN authentication of your Apache Kafka brokers. VPC_SUBNET --- (Self-managed Apache Kafka) The subnets associated with your VPC. Lambda connects to these subnets to fetch data from your self-managed Apache Kafka cluster. VPC_SECURITY_GROUP --- (Self-managed Apache Kafka) The VPC security group used to manage access to your self-managed Apache Kafka brokers. SASL_SCRAM_256_AUTH --- (Self-managed Apache Kafka) The Secrets Manager ARN of your secret key used for SASL SCRAM-256 authentication of your self-managed Apache Kafka brokers. SASL_SCRAM_512_AUTH --- (Amazon MSK, Self-managed Apache Kafka) The Secrets Manager ARN of your secret key used for SASL SCRAM-512 authentication of your self-managed Apache Kafka brokers. VIRTUAL_HOST ---- (RabbitMQ) The name of the virtual host in your RabbitMQ broker. Lambda uses this RabbitMQ host as the event source. This property cannot be specified in an UpdateEventSourceMapping API call. CLIENT_CERTIFICATE_TLS_AUTH --- (Amazon MSK, self-managed Apache Kafka) The Secrets Manager ARN of your secret key containing the certificate chain (X.509 PEM), private key (PKCS#8 PEM), and private key password (optional) used for mutual TLS authentication of your MSK/Apache Kafka brokers. SERVER_ROOT_CA_CERTIFICATE --- (Self-managed Apache Kafka) The Secrets Manager ARN of your secret key containing the root CA certificate (X.509 PEM) used for TLS encryption of your Apache Kafka brokers. URI (string) --- The value for your chosen configuration in Type. For example: \"URI\": \"arn:aws:secretsmanager:us-east-1:01234567890:secret:MyBrokerSecretName\".",
      "nested_params": [
        {
          "name": "Type",
          "type": "string",
          "required": false,
          "description": "The type of authentication protocol, VPC components, or virtual host for your event source. For example: \"Type\":\"SASL_SCRAM_512_AUTH\".",
          "nested_params": []
        },
        {
          "name": "URI",
          "type": "string",
          "required": false,
          "description": "The value for your chosen configuration in Type. For example: \"URI\": \"arn:aws:secretsmanager:us-east-1:01234567890:secret:MyBrokerSecretName\".",
          "nested_params": []
        }
      ]
    },
    {
      "name": "TumblingWindowInSeconds",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "FunctionResponseTypes",
      "type": "list",
      "required": false,
      "description": "(Kinesis, DynamoDB Streams, and Amazon SQS) A list of current response type enums applied to the event source mapping. (string) ---",
      "nested_params": []
    },
    {
      "name": "ScalingConfig",
      "type": "dict",
      "required": false,
      "description": "(Amazon SQS only) The scaling configuration for the event source. For more information, see Configuring maximum concurrency for Amazon SQS event sources. MaximumConcurrency (integer) --- Limits the number of concurrent instances that the Amazon SQS event source can invoke.",
      "nested_params": [
        {
          "name": "MaximumConcurrency",
          "type": "integer",
          "required": false,
          "description": "Limits the number of concurrent instances that the Amazon SQS event source can invoke.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "DocumentDBEventSourceConfig",
      "type": "dict",
      "required": false,
      "description": "Specific configuration settings for a DocumentDB event source. DatabaseName (string) --- The name of the database to consume within the DocumentDB cluster. CollectionName (string) --- The name of the collection to consume within the database. If you do not specify a collection, Lambda consumes all collections. FullDocument (string) --- Determines what DocumentDB sends to your event stream during document update operations. If set to UpdateLookup, DocumentDB sends a delta describing the changes, along with a copy of the entire document. Otherwise, DocumentDB sends only a partial document that contains the changes.",
      "nested_params": [
        {
          "name": "DatabaseName",
          "type": "string",
          "required": false,
          "description": "The name of the database to consume within the DocumentDB cluster.",
          "nested_params": []
        },
        {
          "name": "CollectionName",
          "type": "string",
          "required": false,
          "description": "The name of the collection to consume within the database. If you do not specify a collection, Lambda consumes all collections.",
          "nested_params": []
        },
        {
          "name": "FullDocument",
          "type": "string",
          "required": false,
          "description": "Determines what DocumentDB sends to your event stream during document update operations. If set to UpdateLookup, DocumentDB sends a delta describing the changes, along with a copy of the entire document. Otherwise, DocumentDB sends only a partial document that contains the changes.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "KMSKeyArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MetricsConfig",
      "type": "dict",
      "required": false,
      "description": "The metrics configuration for your event source. For more information, see Event source mapping metrics. Metrics (list) --- The metrics you want your event source mapping to produce. Include EventCount to receive event source mapping metrics related to the number of events processed by your event source mapping. For more information about these metrics, see Event source mapping metrics. (string) ---",
      "nested_params": [
        {
          "name": "Metrics",
          "type": "list",
          "required": false,
          "description": "The metrics you want your event source mapping to produce. Include EventCount to receive event source mapping metrics related to the number of events processed by your event source mapping. For more information about these metrics, see Event source mapping metrics.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ProvisionedPollerConfig",
      "type": "dict",
      "required": false,
      "description": "(Amazon MSK and self-managed Apache Kafka only) The provisioned mode configuration for the event source. For more information, see provisioned mode. MinimumPollers (integer) --- The minimum number of event pollers this event source can scale down to. MaximumPollers (integer) --- The maximum number of event pollers this event source can scale up to.",
      "nested_params": [
        {
          "name": "MinimumPollers",
          "type": "integer",
          "required": false,
          "description": "The minimum number of event pollers this event source can scale down to.",
          "nested_params": []
        },
        {
          "name": "MaximumPollers",
          "type": "integer",
          "required": false,
          "description": "The maximum number of event pollers this event source can scale up to.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "UUID",
          "type": "string",
          "description": "The identifier of the event source mapping.",
          "nested_items": []
        },
        {
          "name": "StartingPosition",
          "type": "string",
          "description": "The position in a stream from which to start reading. Required for Amazon Kinesis and Amazon DynamoDB Stream event sources. AT_TIMESTAMP is supported only for Amazon Kinesis streams, Amazon DocumentDB, Amazon MSK, and self-managed Apache Kafka.",
          "nested_items": []
        },
        {
          "name": "StartingPositionTimestamp",
          "type": "datetime",
          "description": "With StartingPosition set to AT_TIMESTAMP, the time from which to start reading. StartingPositionTimestamp cannot be in the future.",
          "nested_items": []
        },
        {
          "name": "BatchSize",
          "type": "integer",
          "description": "The maximum number of records in each batch that Lambda pulls from your stream or queue and sends to your function. Lambda passes all of the records in the batch to the function in a single call, up to the payload limit for synchronous invocation (6 MB).",
          "nested_items": []
        },
        {
          "name": "MaximumBatchingWindowInSeconds",
          "type": "integer",
          "description": "The maximum amount of time, in seconds, that Lambda spends gathering records before invoking the function. You can configure MaximumBatchingWindowInSeconds to any value from 0 seconds to 300 seconds in increments of seconds.",
          "nested_items": []
        },
        {
          "name": "ParallelizationFactor",
          "type": "integer",
          "description": "(Kinesis and DynamoDB Streams only) The number of batches to process concurrently from each shard. The default value is 1.",
          "nested_items": []
        },
        {
          "name": "EventSourceArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the event source.",
          "nested_items": []
        },
        {
          "name": "FilterCriteria",
          "type": "dict",
          "description": "An object that defines the filter criteria that determine whether Lambda should process an event. For more information, see Lambda event filtering.",
          "nested_items": [
            {
              "name": "Filters",
              "type": "list",
              "description": "A list of filters.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Pattern",
                      "type": "string",
                      "description": "A filter pattern. For more information on the syntax of a filter pattern, see Filter rule syntax.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "FunctionArn",
          "type": "string",
          "description": "The ARN of the Lambda function.",
          "nested_items": []
        },
        {
          "name": "LastModified",
          "type": "datetime",
          "description": "The date that the event source mapping was last updated or that its state changed.",
          "nested_items": []
        },
        {
          "name": "LastProcessingResult",
          "type": "string",
          "description": "The result of the last Lambda invocation of your function.",
          "nested_items": []
        },
        {
          "name": "State",
          "type": "string",
          "description": "The state of the event source mapping. It can be one of the following: Creating, Enabling, Enabled, Disabling, Disabled, Updating, or Deleting.",
          "nested_items": []
        },
        {
          "name": "StateTransitionReason",
          "type": "string",
          "description": "Indicates whether a user or Lambda made the last change to the event source mapping.",
          "nested_items": []
        },
        {
          "name": "DestinationConfig",
          "type": "dict",
          "description": "(Kinesis, DynamoDB Streams, Amazon MSK, and self-managed Apache Kafka event sources only) A configuration object that specifies the destination of an event after Lambda processes it.",
          "nested_items": [
            {
              "name": "OnSuccess",
              "type": "dict",
              "description": "The destination configuration for successful invocations.",
              "nested_items": [
                {
                  "name": "Destination",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the destination resource.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "OnFailure",
              "type": "dict",
              "description": "The destination configuration for failed invocations.",
              "nested_items": [
                {
                  "name": "Destination",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the destination resource.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "Topics",
          "type": "list",
          "description": "The name of the Kafka topic.",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": []
            }
          ]
        },
        {
          "name": "Queues",
          "type": "list",
          "description": "(Amazon MQ) The name of the Amazon MQ broker destination queue to consume.",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": []
            }
          ]
        },
        {
          "name": "SourceAccessConfigurations",
          "type": "list",
          "description": "An array of the authentication protocol, VPC components, or virtual host to secure and define your event source.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Type",
                  "type": "string",
                  "description": "The type of authentication protocol, VPC components, or virtual host for your event source. For example: \"Type\":\"SASL_SCRAM_512_AUTH\".",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "Amazon MQ",
                      "description": "BASIC_AUTH --- (Amazon MQ) The Secrets Manager secret that stores your broker credentials.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "Self-managed Apache Kafka",
                      "description": "BASIC_AUTH --- (Self-managed Apache Kafka) The Secrets Manager ARN of your secret key used for SASL/PLAIN authentication of your Apache Kafka brokers.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "Self-managed Apache Kafka",
                      "description": "VPC_SUBNET --- (Self-managed Apache Kafka) The subnets associated with your VPC. Lambda connects to these subnets to fetch data from your self-managed Apache Kafka cluster.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "Self-managed Apache Kafka",
                      "description": "VPC_SECURITY_GROUP --- (Self-managed Apache Kafka) The VPC security group used to manage access to your self-managed Apache Kafka brokers.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "Self-managed Apache Kafka",
                      "description": "SASL_SCRAM_256_AUTH --- (Self-managed Apache Kafka) The Secrets Manager ARN of your secret key used for SASL SCRAM-256 authentication of your self-managed Apache Kafka brokers.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "Amazon MSK, Self-managed Apache Kafka",
                      "description": "SASL_SCRAM_512_AUTH --- (Amazon MSK, Self-managed Apache Kafka) The Secrets Manager ARN of your secret key used for SASL SCRAM-512 authentication of your self-managed Apache Kafka brokers.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "RabbitMQ",
                      "description": "VIRTUAL_HOST ---- (RabbitMQ) The name of the virtual host in your RabbitMQ broker. Lambda uses this RabbitMQ host as the event source. This property cannot be specified in an UpdateEventSourceMapping API call.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "Amazon MSK, self-managed Apache Kafka",
                      "description": "CLIENT_CERTIFICATE_TLS_AUTH --- (Amazon MSK, self-managed Apache Kafka) The Secrets Manager ARN of your secret key containing the certificate chain (X.509 PEM), private key (PKCS#8 PEM), and private key password (optional) used for mutual TLS authentication of your MSK/Apache Kafka brokers.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "Self-managed Apache Kafka",
                      "description": "SERVER_ROOT_CA_CERTIFICATE --- (Self-managed Apache Kafka) The Secrets Manager ARN of your secret key containing the root CA certificate (X.509 PEM) used for TLS encryption of your Apache Kafka brokers.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "URI",
                  "type": "string",
                  "description": "The value for your chosen configuration in Type. For example: \"URI\": \"arn:aws:secretsmanager:us-east-1:01234567890:secret:MyBrokerSecretName\".",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "SelfManagedEventSource",
          "type": "dict",
          "description": "The self-managed Apache Kafka cluster for your event source.",
          "nested_items": [
            {
              "name": "Endpoints",
              "type": "dict",
              "description": "The list of bootstrap servers for your Kafka brokers in the following format: \"KAFKA_BOOTSTRAP_SERVERS\": [\"abc.xyz.com:xxxx\",\"abc2.xyz.com:xxxx\"].",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "list",
                      "description": "(list) ---",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "MaximumRecordAgeInSeconds",
          "type": "integer",
          "description": "(Kinesis and DynamoDB Streams only) Discard records older than the specified age. The default value is -1, which sets the maximum age to infinite. When the value is set to infinite, Lambda never discards old records.",
          "nested_items": []
        },
        {
          "name": "BisectBatchOnFunctionError",
          "type": "boolean",
          "description": "(Kinesis and DynamoDB Streams only) If the function returns an error, split the batch in two and retry. The default value is false.",
          "nested_items": []
        },
        {
          "name": "MaximumRetryAttempts",
          "type": "integer",
          "description": "(Kinesis and DynamoDB Streams only) Discard records after the specified number of retries. The default value is -1, which sets the maximum number of retries to infinite. When MaximumRetryAttempts is infinite, Lambda retries failed records until the record expires in the event source.",
          "nested_items": []
        },
        {
          "name": "TumblingWindowInSeconds",
          "type": "integer",
          "description": "(Kinesis and DynamoDB Streams only) The duration in seconds of a processing window for DynamoDB and Kinesis Streams event sources. A value of 0 seconds indicates no tumbling window.",
          "nested_items": []
        },
        {
          "name": "FunctionResponseTypes",
          "type": "list",
          "description": "(Kinesis, DynamoDB Streams, and Amazon SQS) A list of current response type enums applied to the event source mapping.",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": []
            }
          ]
        },
        {
          "name": "AmazonManagedKafkaEventSourceConfig",
          "type": "dict",
          "description": "Specific configuration settings for an Amazon Managed Streaming for Apache Kafka (Amazon MSK) event source.",
          "nested_items": [
            {
              "name": "ConsumerGroupId",
              "type": "string",
              "description": "The identifier for the Kafka consumer group to join. The consumer group ID must be unique among all your Kafka event sources. After creating a Kafka event source mapping with the consumer group ID specified, you cannot update this value. For more information, see Customizable consumer group ID.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "SelfManagedKafkaEventSourceConfig",
          "type": "dict",
          "description": "Specific configuration settings for a self-managed Apache Kafka event source.",
          "nested_items": [
            {
              "name": "ConsumerGroupId",
              "type": "string",
              "description": "The identifier for the Kafka consumer group to join. The consumer group ID must be unique among all your Kafka event sources. After creating a Kafka event source mapping with the consumer group ID specified, you cannot update this value. For more information, see Customizable consumer group ID.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "ScalingConfig",
          "type": "dict",
          "description": "(Amazon SQS only) The scaling configuration for the event source. For more information, see Configuring maximum concurrency for Amazon SQS event sources.",
          "nested_items": [
            {
              "name": "MaximumConcurrency",
              "type": "integer",
              "description": "Limits the number of concurrent instances that the Amazon SQS event source can invoke.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "DocumentDBEventSourceConfig",
          "type": "dict",
          "description": "Specific configuration settings for a DocumentDB event source.",
          "nested_items": [
            {
              "name": "DatabaseName",
              "type": "string",
              "description": "The name of the database to consume within the DocumentDB cluster.",
              "nested_items": []
            },
            {
              "name": "CollectionName",
              "type": "string",
              "description": "The name of the collection to consume within the database. If you do not specify a collection, Lambda consumes all collections.",
              "nested_items": []
            },
            {
              "name": "FullDocument",
              "type": "string",
              "description": "Determines what DocumentDB sends to your event stream during document update operations. If set to UpdateLookup, DocumentDB sends a delta describing the changes, along with a copy of the entire document. Otherwise, DocumentDB sends only a partial document that contains the changes.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "KMSKeyArn",
          "type": "string",
          "description": "The ARN of the Key Management Service (KMS) customer managed key that Lambda uses to encrypt your function's filter criteria.",
          "nested_items": []
        },
        {
          "name": "FilterCriteriaError",
          "type": "dict",
          "description": "An object that contains details about an error related to filter criteria encryption.",
          "nested_items": [
            {
              "name": "ErrorCode",
              "type": "string",
              "description": "The KMS exception that resulted from filter criteria encryption or decryption.",
              "nested_items": []
            },
            {
              "name": "Message",
              "type": "string",
              "description": "The error message.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "EventSourceMappingArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the event source mapping.",
          "nested_items": []
        },
        {
          "name": "MetricsConfig",
          "type": "dict",
          "description": "The metrics configuration for your event source. For more information, see Event source mapping metrics.",
          "nested_items": [
            {
              "name": "Metrics",
              "type": "list",
              "description": "The metrics you want your event source mapping to produce. Include EventCount to receive event source mapping metrics related to the number of events processed by your event source mapping. For more information about these metrics, see Event source mapping metrics.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "ProvisionedPollerConfig",
          "type": "dict",
          "description": "(Amazon MSK and self-managed Apache Kafka only) The provisioned mode configuration for the event source. For more information, see provisioned mode.",
          "nested_items": [
            {
              "name": "MinimumPollers",
              "type": "integer",
              "description": "The minimum number of event pollers this event source can scale down to.",
              "nested_items": []
            },
            {
              "name": "MaximumPollers",
              "type": "integer",
              "description": "The maximum number of event pollers this event source can scale up to.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}