{
  "method_name": "get_insights",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/auditmanager/client/get_insights.html",
  "description": "Gets the latest analytics data for all your current active assessments.",
  "parameters": [],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "activeAssessmentsCount",
              "type": "integer",
              "description": "The number of active assessments in Audit Manager.",
              "nested_items": []
            },
            {
              "name": "noncompliantEvidenceCount",
              "type": "integer",
              "description": "The number of compliance check evidence that Audit Manager classified as non-compliant on the lastUpdated date. This includes evidence that was collected from Security Hub with a Fail ruling, or collected from Config with a Non-compliant ruling.",
              "nested_items": []
            },
            {
              "name": "compliantEvidenceCount",
              "type": "integer",
              "description": "The number of compliance check evidence that Audit Manager classified as compliant on the lastUpdated date. This includes evidence that was collected from Security Hub with a Pass ruling, or collected from Config with a Compliant ruling.",
              "nested_items": []
            },
            {
              "name": "inconclusiveEvidenceCount",
              "type": "integer",
              "description": "The number of evidence without a compliance check ruling. Evidence is inconclusive when the associated control uses Security Hub or Config as a data source but you didn't enable those services. This is also the case when a control uses a data source that doesn't support compliance checks (for example: manual evidence, API calls, or CloudTrail).",
              "nested_items": []
            },
            {
              "name": "assessmentControlsCountByNoncompliantEvidence",
              "type": "integer",
              "description": "The number of assessment controls that collected non-compliant evidence on the lastUpdated date.",
              "nested_items": []
            },
            {
              "name": "totalAssessmentControlsCount",
              "type": "integer",
              "description": "The total number of controls across all active assessments.",
              "nested_items": []
            },
            {
              "name": "lastUpdated",
              "type": "datetime",
              "description": "The time when the cross-assessment insights were last updated.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}