{
  "method_name": "create_launch_configuration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/autoscaling/client/create_launch_configuration.html",
  "description": "Creates a launch configuration. If you exceed your maximum limit of launch configurations, the call fails. To query this limit, call the DescribeAccountLimits API. For information about updating this limit, see Quotas for Amazon EC2 Auto Scaling in the Amazon EC2 Auto Scaling User Guide. For more information, see Launch configurations in the Amazon EC2 Auto Scaling User Guide.",
  "parameters": [
    {
      "name": "LaunchConfigurationName",
      "type": "string",
      "required": true,
      "description": "The name of the launch configuration. This name must be unique per Region per account.",
      "nested_params": []
    },
    {
      "name": "ImageId",
      "type": "string",
      "required": false,
      "description": "The ID of the Amazon Machine Image (AMI) that was assigned during registration. For more information, see Find a Linux AMI in the Amazon EC2 User Guide for Linux Instances. If you specify InstanceId, an ImageId is not required.",
      "nested_params": []
    },
    {
      "name": "KeyName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "SecurityGroups",
      "type": "list",
      "required": false,
      "description": "A list that contains the security group IDs to assign to the instances in the Auto Scaling group. For more information, see Control traffic to your Amazon Web Services resources using security groups in the Amazon Virtual Private Cloud User Guide. (string) ---",
      "nested_params": []
    },
    {
      "name": "ClassicLinkVPCId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ClassicLinkVPCSecurityGroups",
      "type": "list",
      "required": false,
      "description": "Available for backward compatibility. (string) ---",
      "nested_params": []
    },
    {
      "name": "UserData",
      "type": "string",
      "required": false,
      "description": "The user data to make available to the launched EC2 instances. For more information, see Instance metadata and user data (Linux) and Instance metadata and user data (Windows). If you are using a command line tool, base64-encoding is performed for you, and you can load the text from a file. Otherwise, you must provide base64-encoded text. User data is limited to 16 KB.",
      "nested_params": []
    },
    {
      "name": "InstanceId",
      "type": "string",
      "required": false,
      "description": "The ID of the instance to use to create the launch configuration. The new launch configuration derives attributes from the instance, except for the block device mapping. To create a launch configuration with a block device mapping or override any other instance attributes, specify them as part of the same request. For more information, see Create a launch configuration in the Amazon EC2 Auto Scaling User Guide.",
      "nested_params": []
    },
    {
      "name": "InstanceType",
      "type": "string",
      "required": false,
      "description": "Specifies the instance type of the EC2 instance. For information about available instance types, see Available instance types in the Amazon EC2 User Guide for Linux Instances. If you specify InstanceId, an InstanceType is not required.",
      "nested_params": []
    },
    {
      "name": "KernelId",
      "type": "string",
      "required": false,
      "description": "The ID of the kernel associated with the AMI.",
      "nested_params": []
    },
    {
      "name": "RamdiskId",
      "type": "string",
      "required": false,
      "description": "The ID of the RAM disk to select.",
      "nested_params": []
    },
    {
      "name": "BlockDeviceMappings",
      "type": "list",
      "required": true,
      "description": "The block device mapping entries that define the block devices to attach to the instances at launch. By default, the block devices specified in the block device mapping for the AMI are used. For more information, see Block device mappings in the Amazon EC2 User Guide for Linux Instances. (dict) --- Describes a block device mapping. VirtualName (string) --- The name of the instance store volume (virtual device) to attach to an instance at launch. The name must be in the form ephemeral*X* where X is a number starting from zero (0), for example, ephemeral0. The device name assigned to the volume (for example, /dev/sdh or xvdh). For more information, see Device naming on Linux instances in the Amazon EC2 User Guide for Linux Instances. Ebs (dict) --- Information to attach an EBS volume to an instance at launch. SnapshotId (string) --- The snapshot ID of the volume to use. You must specify either a VolumeSize or a SnapshotId. VolumeSize (integer) --- The volume size, in GiBs. The following are the supported volumes sizes for each volume type: gp2 and gp3: 1-16,384 io1: 4-16,384 st1 and sc1: 125-16,384 standard: 1-1,024 You must specify either a SnapshotId or a VolumeSize. If you specify both SnapshotId and VolumeSize, the volume size must be equal or greater than the size of the snapshot. VolumeType (string) --- The volume type. For more information, see Amazon EBS volume types in the Amazon EBS User Guide. Valid values: standard | io1 | gp2 | st1 | sc1 | gp3 DeleteOnTermination (boolean) --- Indicates whether the volume is deleted on instance termination. For Amazon EC2 Auto Scaling, the default value is true. Iops (integer) --- The number of input/output (I/O) operations per second (IOPS) to provision for the volume. For gp3 and io1 volumes, this represents the number of IOPS that are provisioned for the volume. For gp2 volumes, this represents the baseline performance of the volume and the rate at which the volume accumulates I/O credits for bursting. The following are the supported values for each volume type: gp3: 3,000-16,000 IOPS io1: 100-64,000 IOPS For io1 volumes, we guarantee 64,000 IOPS only for Instances built on the Amazon Web Services Nitro System. Other instance families guarantee performance up to 32,000 IOPS. Iops is supported when the volume type is gp3 or io1 and required only when the volume type is io1. (Not used with standard, gp2, st1, or sc1 volumes.) Encrypted (boolean) --- Specifies whether the volume should be encrypted. Encrypted EBS volumes can only be attached to instances that support Amazon EBS encryption. For more information, see Requirements for Amazon EBS encryption in the Amazon EBS User Guide. If your AMI uses encrypted volumes, you can also only launch it on supported instance types. Throughput (integer) --- The throughput (MiBps) to provision for a gp3 volume. NoDevice (boolean) --- Setting this value to true prevents a volume that is included in the block device mapping of the AMI from being mapped to the specified device name at launch. If NoDevice is true for the root device, instances might fail the EC2 health check. In that case, Amazon EC2 Auto Scaling launches replacement instances.",
      "nested_params": [
        {
          "name": "VirtualName",
          "type": "string",
          "required": false,
          "description": "The name of the instance store volume (virtual device) to attach to an instance at launch. The name must be in the form ephemeral*X* where X is a number starting from zero (0), for example, ephemeral0.",
          "nested_params": []
        },
        {
          "name": "DeviceName",
          "type": "string",
          "required": false,
          "description": "The device name assigned to the volume (for example, /dev/sdh or xvdh). For more information, see Device naming on Linux instances in the Amazon EC2 User Guide for Linux Instances.",
          "nested_params": []
        },
        {
          "name": "Ebs",
          "type": "dict",
          "required": false,
          "description": "Information to attach an EBS volume to an instance at launch.",
          "nested_params": [
            {
              "name": "SnapshotId",
              "type": "string",
              "required": false,
              "description": "The snapshot ID of the volume to use. You must specify either a VolumeSize or a SnapshotId.",
              "nested_params": []
            },
            {
              "name": "VolumeSize",
              "type": "integer",
              "required": false,
              "description": "The volume size, in GiBs. The following are the supported volumes sizes for each volume type:",
              "nested_params": []
            },
            {
              "name": "VolumeType",
              "type": "string",
              "required": false,
              "description": "The volume type. For more information, see Amazon EBS volume types in the Amazon EBS User Guide. Valid values: standard | io1 | gp2 | st1 | sc1 | gp3",
              "nested_params": []
            },
            {
              "name": "DeleteOnTermination",
              "type": "boolean",
              "required": false,
              "description": "Indicates whether the volume is deleted on instance termination. For Amazon EC2 Auto Scaling, the default value is true.",
              "nested_params": []
            },
            {
              "name": "Iops",
              "type": "integer",
              "required": false,
              "description": "The number of input/output (I/O) operations per second (IOPS) to provision for the volume. For gp3 and io1 volumes, this represents the number of IOPS that are provisioned for the volume. For gp2 volumes, this represents the baseline performance of the volume and the rate at which the volume accumulates I/O credits for bursting. The following are the supported values for each volume type:",
              "nested_params": []
            },
            {
              "name": "Encrypted",
              "type": "boolean",
              "required": false,
              "description": "Specifies whether the volume should be encrypted. Encrypted EBS volumes can only be attached to instances that support Amazon EBS encryption. For more information, see Requirements for Amazon EBS encryption in the Amazon EBS User Guide. If your AMI uses encrypted volumes, you can also only launch it on supported instance types.",
              "nested_params": []
            },
            {
              "name": "Throughput",
              "type": "integer",
              "required": false,
              "description": "The throughput (MiBps) to provision for a gp3 volume.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "NoDevice",
          "type": "boolean",
          "required": false,
          "description": "Setting this value to true prevents a volume that is included in the block device mapping of the AMI from being mapped to the specified device name at launch. If NoDevice is true for the root device, instances might fail the EC2 health check. In that case, Amazon EC2 Auto Scaling launches replacement instances.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "InstanceMonitoring",
      "type": "dict",
      "required": false,
      "description": "Controls whether instances in this group are launched with detailed ( true) or basic ( false) monitoring. The default value is true (enabled). Enabled (boolean) --- If true, detailed monitoring is enabled. Otherwise, basic monitoring is enabled.",
      "nested_params": [
        {
          "name": "Enabled",
          "type": "boolean",
          "required": false,
          "description": "If true, detailed monitoring is enabled. Otherwise, basic monitoring is enabled.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "SpotPrice",
      "type": "string",
      "required": false,
      "description": "The maximum hourly price to be paid for any Spot Instance launched to fulfill the request. Spot Instances are launched when the price you specify exceeds the current Spot price. For more information, see Request Spot Instances for fault-tolerant and flexible applications in the Amazon EC2 Auto Scaling User Guide. Valid Range: Minimum value of 0.001",
      "nested_params": []
    },
    {
      "name": "IamInstanceProfile",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "EbsOptimized",
      "type": "boolean",
      "required": false,
      "description": "Specifies whether the launch configuration is optimized for EBS I/O ( true) or not ( false). The optimization provides dedicated throughput to Amazon EBS and an optimized configuration stack to provide optimal I/O performance. This optimization is not available with all instance types. Additional fees are incurred when you enable EBS optimization for an instance type that is not EBS-optimized by default. For more information, see Amazon EBS-optimized instances in the Amazon EC2 User Guide for Linux Instances. The default value is false.",
      "nested_params": []
    },
    {
      "name": "AssociatePublicIpAddress",
      "type": "boolean",
      "required": false,
      "description": "Specifies whether to assign a public IPv4 address to the group's instances. If the instance is launched into a default subnet, the default is to assign a public IPv4 address, unless you disabled the option to assign a public IPv4 address on the subnet. If the instance is launched into a nondefault subnet, the default is not to assign a public IPv4 address, unless you enabled the option to assign a public IPv4 address on the subnet. If you specify true, each instance in the Auto Scaling group receives a unique public IPv4 address. For more information, see Provide network connectivity for your Auto Scaling instances using Amazon VPC in the Amazon EC2 Auto Scaling User Guide. If you specify this property, you must specify at least one subnet for VPCZoneIdentifier when you create your group.",
      "nested_params": []
    },
    {
      "name": "PlacementTenancy",
      "type": "string",
      "required": false,
      "description": "The tenancy of the instance, either default or dedicated. An instance with dedicated tenancy runs on isolated, single-tenant hardware and can only be launched into a VPC. To launch dedicated instances into a shared tenancy VPC (a VPC with the instance placement tenancy attribute set to default), you must set the value of this property to dedicated. If you specify PlacementTenancy, you must specify at least one subnet for VPCZoneIdentifier when you create your group. Valid values: default | dedicated.",
      "nested_params": []
    },
    {
      "name": "MetadataOptions",
      "type": "dict",
      "required": false,
      "description": "The metadata options for the instances. For more information, see Configure the instance metadata options in the Amazon EC2 Auto Scaling User Guide. HttpTokens (string) --- The state of token usage for your instance metadata requests. If the parameter is not specified in the request, the default state is optional. If the state is optional, you can choose to retrieve instance metadata with or without a signed token header on your request. If you retrieve the IAM role credentials without a token, the version 1.0 role credentials are returned. If you retrieve the IAM role credentials using a valid signed token, the version 2.0 role credentials are returned. If the state is required, you must send a signed token header with any instance metadata retrieval requests. In this state, retrieving the IAM role credentials always returns the version 2.0 credentials; the version 1.0 credentials are not available. HttpPutResponseHopLimit (integer) --- The desired HTTP PUT response hop limit for instance metadata requests. The larger the number, the further instance metadata requests can travel. Default: 1 HttpEndpoint (string) --- This parameter enables or disables the HTTP metadata endpoint on your instances. If the parameter is not specified, the default state is enabled.",
      "nested_params": [
        {
          "name": "HttpTokens",
          "type": "string",
          "required": false,
          "description": "The state of token usage for your instance metadata requests. If the parameter is not specified in the request, the default state is optional. If the state is optional, you can choose to retrieve instance metadata with or without a signed token header on your request. If you retrieve the IAM role credentials without a token, the version 1.0 role credentials are returned. If you retrieve the IAM role credentials using a valid signed token, the version 2.0 role credentials are returned. If the state is required, you must send a signed token header with any instance metadata retrieval requests. In this state, retrieving the IAM role credentials always returns the version 2.0 credentials; the version 1.0 credentials are not available.",
          "nested_params": []
        },
        {
          "name": "HttpPutResponseHopLimit",
          "type": "integer",
          "required": false,
          "description": "The desired HTTP PUT response hop limit for instance metadata requests. The larger the number, the further instance metadata requests can travel. Default: 1",
          "nested_params": []
        },
        {
          "name": "HttpEndpoint",
          "type": "string",
          "required": false,
          "description": "This parameter enables or disables the HTTP metadata endpoint on your instances. If the parameter is not specified, the default state is enabled.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}