{
  "method_name": "describe_traffic_sources",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/autoscaling/client/describe_traffic_sources.html",
  "description": "Gets information about the traffic sources for the specified Auto Scaling group. You can optionally provide a traffic source type. If you provide a traffic source type, then the results only include that traffic source type. If you do not provide a traffic source type, then the results include all the traffic sources for the specified Auto Scaling group.",
  "parameters": [
    {
      "name": "AutoScalingGroupName",
      "type": "string",
      "required": true,
      "description": "The name of the Auto Scaling group.",
      "nested_params": []
    },
    {
      "name": "TrafficSourceType",
      "type": "string",
      "required": false,
      "description": "The traffic source type that you want to describe. The following lists the valid values: elb if the traffic source is a Classic Load Balancer. elbv2 if the traffic source is a Application Load Balancer, Gateway Load Balancer, or Network Load Balancer. vpc-lattice if the traffic source is VPC Lattice.",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxRecords",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "TrafficSources",
          "type": "list",
          "description": "Information about the traffic sources.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "TrafficSource",
                  "type": "string",
                  "description": "This is replaced by Identifier.",
                  "nested_items": []
                },
                {
                  "name": "State",
                  "type": "string",
                  "description": "Describes the current state of a traffic source.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "Adding - The Auto Scaling instances are being registered with the load balancer or target group.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Added - All Auto Scaling instances are registered with the load balancer or target group.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "InService - For an Elastic Load Balancing load balancer or target group, at least one Auto Scaling instance passed an ELB health check. For VPC Lattice, at least one Auto Scaling instance passed an VPC_LATTICE health check.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "deregistration delay",
                      "description": "Removing - The Auto Scaling instances are being deregistered from the load balancer or target group. If connection draining (deregistration delay) is enabled, Elastic Load Balancing or VPC Lattice waits for in-flight requests to complete before deregistering the instances.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Removed - All Auto Scaling instances are deregistered from the load balancer or target group.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Identifier",
                  "type": "string",
                  "description": "The unique identifier of the traffic source.",
                  "nested_items": []
                },
                {
                  "name": "Type",
                  "type": "string",
                  "description": "Provides additional context for the value of Identifier.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "elb if Identifier is the name of a Classic Load Balancer.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "elbv2 if Identifier is the ARN of an Application Load Balancer, Gateway Load Balancer, or Network Load Balancer target group.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "vpc-lattice if Identifier is the ARN of a VPC Lattice target group.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "This string indicates that the response contains more items than can be returned in a single response. To receive additional items, specify this string for the NextToken value when requesting the next set of items. This value is null when there are no more items to return.",
          "nested_items": []
        }
      ]
    }
  ]
}