{
  "method_name": "create_event_bus",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/events/client/create_event_bus.html",
  "description": "Creates a new event bus within your account. This can be a custom event bus which you can use to receive events from your custom applications and services, or it can be a partner event bus which can be matched to a partner event source.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "The name of the new event bus. Custom event bus names can't contain the / character, but you can use the / character in partner event bus names. In addition, for partner event buses, the name must exactly match the name of the partner event source that this event bus is matched to. You can't use the name default for a custom event bus, as this name is already used for your account's default event bus.",
      "nested_params": []
    },
    {
      "name": "EventSourceName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "KmsKeyIdentifier",
      "type": "string",
      "required": false,
      "description": "The identifier of the KMS customer managed key for EventBridge to use, if you choose to use a customer managed key to encrypt events on this event bus. The identifier can be the key Amazon Resource Name (ARN), KeyId, key alias, or key alias ARN. If you do not specify a customer managed key identifier, EventBridge uses an Amazon Web Services owned key to encrypt events on the event bus. For more information, see Identify and view keys in the Key Management Service Developer Guide.",
      "nested_params": []
    },
    {
      "name": "DeadLetterConfig",
      "type": "dict",
      "required": false,
      "description": "Configuration details of the Amazon SQS queue for EventBridge to use as a dead-letter queue (DLQ). For more information, see Using dead-letter queues to process undelivered events in the EventBridge User Guide. Arn (string) --- The ARN of the SQS queue specified as the target for the dead-letter queue.",
      "nested_params": [
        {
          "name": "Arn",
          "type": "string",
          "required": false,
          "description": "The ARN of the SQS queue specified as the target for the dead-letter queue.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "Tags to associate with the event bus. (dict) --- A key-value pair associated with an Amazon Web Services resource. In EventBridge, rules and event buses support tagging. A string you can use to assign a value. The combination of tag keys and values can help you organize and categorize your resources. The value for the specified tag key.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "A string you can use to assign a value. The combination of tag keys and values can help you organize and categorize your resources.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value for the specified tag key.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "EventBusArn",
          "type": "string",
          "description": "The ARN of the new event bus.",
          "nested_items": []
        },
        {
          "name": "Description",
          "type": "string",
          "description": "The event bus description.",
          "nested_items": []
        },
        {
          "name": "KmsKeyIdentifier",
          "type": "string",
          "description": "The identifier of the KMS customer managed key for EventBridge to use to encrypt events on this event bus, if one has been specified.",
          "nested_items": []
        },
        {
          "name": "DeadLetterConfig",
          "type": "dict",
          "description": "Configuration details of the Amazon SQS queue for EventBridge to use as a dead-letter queue (DLQ).",
          "nested_items": [
            {
              "name": "Arn",
              "type": "string",
              "description": "The ARN of the SQS queue specified as the target for the dead-letter queue.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}