{
  "method_name": "update_virtual_gateway",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/appmesh/client/update_virtual_gateway.html",
  "description": "Updates an existing virtual gateway in a specified service mesh.",
  "parameters": [
    {
      "name": "clientToken",
      "type": "string",
      "required": false,
      "description": "Unique, case-sensitive identifier that you provide to ensure the idempotency of the request. Up to 36 letters, numbers, hyphens, and underscores are allowed. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "meshName",
      "type": "string",
      "required": true,
      "description": "The name of the service mesh that the virtual gateway resides in.",
      "nested_params": []
    },
    {
      "name": "meshOwner",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "spec",
      "type": "dict",
      "required": true,
      "description": "The new virtual gateway specification to apply. This overwrites the existing data. backendDefaults (dict) --- A reference to an object that represents the defaults for backends. clientPolicy (dict) --- A reference to an object that represents a client policy. tls (dict) --- A reference to an object that represents a Transport Layer Security (TLS) client policy. certificate (dict) --- A reference to an object that represents a virtual gateway's client's Transport Layer Security (TLS) certificate. file (dict) --- An object that represents a local file certificate. The certificate must meet specific requirements and you must have proxy authorization enabled. For more information, see Transport Layer Security (TLS). The certificate chain for the certificate. The private key for a certificate stored on the file system of the mesh endpoint that the proxy is running on. sds (dict) --- A reference to an object that represents a virtual gateway's client's Secret Discovery Service certificate. A reference to an object that represents the name of the secret secret requested from the Secret Discovery Service provider representing Transport Layer Security (TLS) materials like a certificate or certificate chain. enforce (boolean) --- Whether the policy is enforced. The default is True, if a value isn't specified. ports (list) --- One or more ports that the policy is enforced for. (integer) --- A reference to an object that represents a Transport Layer Security (TLS) validation context. subjectAlternativeNames (dict) --- A reference to an object that represents the SANs for a virtual gateway's listener's Transport Layer Security (TLS) validation context. An object that represents the criteria for determining a SANs match. The values sent must match the specified values exactly. (string) --- A reference to where to retrieve the trust chain when validating a peer's Transport Layer Security (TLS) certificate. acm (dict) --- A reference to an object that represents a Transport Layer Security (TLS) validation context trust for an Certificate Manager certificate. One or more ACM Amazon Resource Name (ARN)s. (string) --- file (dict) --- An object that represents a Transport Layer Security (TLS) validation context trust for a local file. The certificate trust chain for a certificate stored on the file system of the virtual node that the proxy is running on. sds (dict) --- A reference to an object that represents a virtual gateway's Transport Layer Security (TLS) Secret Discovery Service validation context trust. A reference to an object that represents the name of the secret for a virtual gateway's Transport Layer Security (TLS) Secret Discovery Service validation context trust. The listeners that the mesh endpoint is expected to receive inbound traffic from. You can specify one listener. (dict) --- An object that represents a listener for a virtual gateway. connectionPool (dict) --- The connection pool information for the virtual gateway listener. grpc (dict) --- An object that represents a type of connection pool. Maximum number of inflight requests Envoy can concurrently support across hosts in upstream cluster. http (dict) --- An object that represents a type of connection pool. Maximum number of outbound TCP connections Envoy can establish concurrently with all hosts in upstream cluster. maxPendingRequests (integer) --- Number of overflowing requests after max_connections Envoy will queue to upstream cluster. http2 (dict) --- An object that represents a type of connection pool. healthCheck (dict) --- The health check information for the listener. The number of consecutive successful health checks that must occur before declaring the listener healthy. The time period in milliseconds between each health check execution. path (string) --- The destination path for the health check request. This value is only used if the specified protocol is HTTP or HTTP/2. For any other protocol, this value is ignored. port (integer) --- The destination port for the health check request. This port must match the port defined in the  PortMapping for the listener. The protocol for the health check request. If you specify grpc, then your service must conform to the GRPC Health Checking Protocol. The amount of time to wait when receiving a response from the health check, in milliseconds. The number of consecutive failed health checks that must occur before declaring a virtual gateway unhealthy. The port mapping information for the listener. The port used for the port mapping. Specify one protocol. The protocol used for the port mapping. tls (dict) --- A reference to an object that represents the Transport Layer Security (TLS) properties for the listener. An object that represents a Transport Layer Security (TLS) certificate. acm (dict) --- A reference to an object that represents an Certificate Manager certificate. The Amazon Resource Name (ARN) for the certificate. file (dict) --- A reference to an object that represents a local file certificate. sds (dict) --- A reference to an object that represents a virtual gateway's listener's Secret Discovery Service certificate. Specify one of the following modes. STRICT --- Listener only accepts connections with TLS enabled. PERMISSIVE --- Listener accepts connections with or without TLS enabled. DISABLED --- Listener only accepts connections without TLS. validation (dict) --- A reference to an object that represents a virtual gateway's listener's Transport Layer Security (TLS) validation context. subjectAlternativeNames (dict) --- A reference to an object that represents the SANs for a virtual gateway listener's Transport Layer Security (TLS) validation context. file (dict) --- An object that represents a Transport Layer Security (TLS) validation context trust for a local file. sds (dict) --- A reference to an object that represents a virtual gateway's listener's Transport Layer Security (TLS) Secret Discovery Service validation context trust. logging (dict) --- An object that represents logging information. accessLog (dict) --- The access log configuration. file (dict) --- The file object to send virtual gateway access logs to. format (dict) --- The specified format for the virtual gateway access logs. It can be either json_format or text_format. json (list) --- (dict) --- An object that represents the key value pairs for the JSON. The specified key for the JSON. The specified value for the JSON. text (string) --- The file path to write access logs to. You can use /dev/stdout to send access logs to standard out and configure your Envoy container to use a log driver, such as awslogs, to export the access logs to a log storage service such as Amazon CloudWatch Logs. You can also specify a path in the Envoy container's file system to write the files to disk.",
      "nested_params": [
        {
          "name": "backendDefaults",
          "type": "dict",
          "required": false,
          "description": "A reference to an object that represents the defaults for backends.",
          "nested_params": [
            {
              "name": "clientPolicy",
              "type": "dict",
              "required": false,
              "description": "A reference to an object that represents a client policy.",
              "nested_params": [
                {
                  "name": "tls",
                  "type": "dict",
                  "required": false,
                  "description": "A reference to an object that represents a Transport Layer Security (TLS) client policy.",
                  "nested_params": [
                    {
                      "name": "certificate",
                      "type": "dict",
                      "required": false,
                      "description": "A reference to an object that represents a virtual gateway's client's Transport Layer Security (TLS) certificate.",
                      "nested_params": [
                        {
                          "name": "file",
                          "type": "dict",
                          "required": false,
                          "description": "An object that represents a local file certificate. The certificate must meet specific requirements and you must have proxy authorization enabled. For more information, see Transport Layer Security (TLS).",
                          "nested_params": [
                            {
                              "name": "certificateChain",
                              "type": "string",
                              "required": false,
                              "description": "The certificate chain for the certificate.",
                              "nested_params": []
                            },
                            {
                              "name": "privateKey",
                              "type": "string",
                              "required": false,
                              "description": "The private key for a certificate stored on the file system of the mesh endpoint that the proxy is running on.",
                              "nested_params": []
                            }
                          ]
                        },
                        {
                          "name": "sds",
                          "type": "dict",
                          "required": false,
                          "description": "A reference to an object that represents a virtual gateway's client's Secret Discovery Service certificate.",
                          "nested_params": [
                            {
                              "name": "secretName",
                              "type": "string",
                              "required": false,
                              "description": "A reference to an object that represents the name of the secret secret requested from the Secret Discovery Service provider representing Transport Layer Security (TLS) materials like a certificate or certificate chain.",
                              "nested_params": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "enforce",
                      "type": "boolean",
                      "required": false,
                      "description": "Whether the policy is enforced. The default is True, if a value isn't specified.",
                      "nested_params": []
                    },
                    {
                      "name": "ports",
                      "type": "list",
                      "required": false,
                      "description": "One or more ports that the policy is enforced for.",
                      "nested_params": []
                    },
                    {
                      "name": "validation",
                      "type": "dict",
                      "required": false,
                      "description": "A reference to an object that represents a Transport Layer Security (TLS) validation context.",
                      "nested_params": [
                        {
                          "name": "subjectAlternativeNames",
                          "type": "dict",
                          "required": false,
                          "description": "A reference to an object that represents the SANs for a virtual gateway's listener's Transport Layer Security (TLS) validation context.",
                          "nested_params": [
                            {
                              "name": "match",
                              "type": "dict",
                              "required": false,
                              "description": "An object that represents the criteria for determining a SANs match.",
                              "nested_params": [
                                {
                                  "name": "exact",
                                  "type": "list",
                                  "required": false,
                                  "description": "The values sent must match the specified values exactly.",
                                  "nested_params": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "name": "trust",
                          "type": "dict",
                          "required": false,
                          "description": "A reference to where to retrieve the trust chain when validating a peer's Transport Layer Security (TLS) certificate.",
                          "nested_params": [
                            {
                              "name": "acm",
                              "type": "dict",
                              "required": false,
                              "description": "A reference to an object that represents a Transport Layer Security (TLS) validation context trust for an Certificate Manager certificate.",
                              "nested_params": [
                                {
                                  "name": "certificateAuthorityArns",
                                  "type": "list",
                                  "required": false,
                                  "description": "One or more ACM Amazon Resource Name (ARN)s.",
                                  "nested_params": []
                                }
                              ]
                            },
                            {
                              "name": "file",
                              "type": "dict",
                              "required": false,
                              "description": "An object that represents a Transport Layer Security (TLS) validation context trust for a local file.",
                              "nested_params": [
                                {
                                  "name": "certificateChain",
                                  "type": "string",
                                  "required": false,
                                  "description": "The certificate trust chain for a certificate stored on the file system of the virtual node that the proxy is running on.",
                                  "nested_params": []
                                }
                              ]
                            },
                            {
                              "name": "sds",
                              "type": "dict",
                              "required": false,
                              "description": "A reference to an object that represents a virtual gateway's Transport Layer Security (TLS) Secret Discovery Service validation context trust.",
                              "nested_params": [
                                {
                                  "name": "secretName",
                                  "type": "string",
                                  "required": false,
                                  "description": "A reference to an object that represents the name of the secret for a virtual gateway's Transport Layer Security (TLS) Secret Discovery Service validation context trust.",
                                  "nested_params": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "listeners",
          "type": "list",
          "required": false,
          "description": "The listeners that the mesh endpoint is expected to receive inbound traffic from. You can specify one listener.",
          "nested_params": [
            {
              "name": "connectionPool",
              "type": "dict",
              "required": false,
              "description": "The connection pool information for the virtual gateway listener.",
              "nested_params": [
                {
                  "name": "grpc",
                  "type": "dict",
                  "required": false,
                  "description": "An object that represents a type of connection pool.",
                  "nested_params": [
                    {
                      "name": "maxRequests",
                      "type": "integer",
                      "required": false,
                      "description": "Maximum number of inflight requests Envoy can concurrently support across hosts in upstream cluster.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "http",
                  "type": "dict",
                  "required": false,
                  "description": "An object that represents a type of connection pool.",
                  "nested_params": [
                    {
                      "name": "maxConnections",
                      "type": "integer",
                      "required": false,
                      "description": "Maximum number of outbound TCP connections Envoy can establish concurrently with all hosts in upstream cluster.",
                      "nested_params": []
                    },
                    {
                      "name": "maxPendingRequests",
                      "type": "integer",
                      "required": false,
                      "description": "Number of overflowing requests after max_connections Envoy will queue to upstream cluster.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "http2",
                  "type": "dict",
                  "required": false,
                  "description": "An object that represents a type of connection pool.",
                  "nested_params": [
                    {
                      "name": "maxRequests",
                      "type": "integer",
                      "required": false,
                      "description": "Maximum number of inflight requests Envoy can concurrently support across hosts in upstream cluster.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "healthCheck",
              "type": "dict",
              "required": false,
              "description": "The health check information for the listener.",
              "nested_params": [
                {
                  "name": "healthyThreshold",
                  "type": "integer",
                  "required": false,
                  "description": "The number of consecutive successful health checks that must occur before declaring the listener healthy.",
                  "nested_params": []
                },
                {
                  "name": "intervalMillis",
                  "type": "integer",
                  "required": false,
                  "description": "The time period in milliseconds between each health check execution.",
                  "nested_params": []
                },
                {
                  "name": "path",
                  "type": "string",
                  "required": false,
                  "description": "The destination path for the health check request. This value is only used if the specified protocol is HTTP or HTTP/2. For any other protocol, this value is ignored.",
                  "nested_params": []
                },
                {
                  "name": "port",
                  "type": "integer",
                  "required": false,
                  "description": "The destination port for the health check request. This port must match the port defined in the  PortMapping for the listener.",
                  "nested_params": []
                },
                {
                  "name": "protocol",
                  "type": "string",
                  "required": false,
                  "description": "The protocol for the health check request. If you specify grpc, then your service must conform to the GRPC Health Checking Protocol.",
                  "nested_params": []
                },
                {
                  "name": "timeoutMillis",
                  "type": "integer",
                  "required": false,
                  "description": "The amount of time to wait when receiving a response from the health check, in milliseconds.",
                  "nested_params": []
                },
                {
                  "name": "unhealthyThreshold",
                  "type": "integer",
                  "required": false,
                  "description": "The number of consecutive failed health checks that must occur before declaring a virtual gateway unhealthy.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "portMapping",
              "type": "dict",
              "required": false,
              "description": "The port mapping information for the listener.",
              "nested_params": [
                {
                  "name": "port",
                  "type": "integer",
                  "required": false,
                  "description": "The port used for the port mapping. Specify one protocol.",
                  "nested_params": []
                },
                {
                  "name": "protocol",
                  "type": "string",
                  "required": false,
                  "description": "The protocol used for the port mapping.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "tls",
              "type": "dict",
              "required": false,
              "description": "A reference to an object that represents the Transport Layer Security (TLS) properties for the listener.",
              "nested_params": [
                {
                  "name": "certificate",
                  "type": "dict",
                  "required": false,
                  "description": "An object that represents a Transport Layer Security (TLS) certificate.",
                  "nested_params": [
                    {
                      "name": "acm",
                      "type": "dict",
                      "required": false,
                      "description": "A reference to an object that represents an Certificate Manager certificate.",
                      "nested_params": [
                        {
                          "name": "certificateArn",
                          "type": "string",
                          "required": false,
                          "description": "The Amazon Resource Name (ARN) for the certificate. The certificate must meet specific requirements and you must have proxy authorization enabled. For more information, see Transport Layer Security (TLS).",
                          "nested_params": []
                        }
                      ]
                    },
                    {
                      "name": "file",
                      "type": "dict",
                      "required": false,
                      "description": "A reference to an object that represents a local file certificate.",
                      "nested_params": [
                        {
                          "name": "certificateChain",
                          "type": "string",
                          "required": false,
                          "description": "The certificate chain for the certificate.",
                          "nested_params": []
                        },
                        {
                          "name": "privateKey",
                          "type": "string",
                          "required": false,
                          "description": "The private key for a certificate stored on the file system of the mesh endpoint that the proxy is running on.",
                          "nested_params": []
                        }
                      ]
                    },
                    {
                      "name": "sds",
                      "type": "dict",
                      "required": false,
                      "description": "A reference to an object that represents a virtual gateway's listener's Secret Discovery Service certificate.",
                      "nested_params": [
                        {
                          "name": "secretName",
                          "type": "string",
                          "required": false,
                          "description": "A reference to an object that represents the name of the secret secret requested from the Secret Discovery Service provider representing Transport Layer Security (TLS) materials like a certificate or certificate chain.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "mode",
                  "type": "string",
                  "required": false,
                  "description": "Specify one of the following modes.",
                  "nested_params": []
                },
                {
                  "name": "validation",
                  "type": "dict",
                  "required": false,
                  "description": "A reference to an object that represents a virtual gateway's listener's Transport Layer Security (TLS) validation context.",
                  "nested_params": [
                    {
                      "name": "subjectAlternativeNames",
                      "type": "dict",
                      "required": false,
                      "description": "A reference to an object that represents the SANs for a virtual gateway listener's Transport Layer Security (TLS) validation context.",
                      "nested_params": [
                        {
                          "name": "match",
                          "type": "dict",
                          "required": false,
                          "description": "An object that represents the criteria for determining a SANs match.",
                          "nested_params": [
                            {
                              "name": "exact",
                              "type": "list",
                              "required": false,
                              "description": "The values sent must match the specified values exactly.",
                              "nested_params": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "trust",
                      "type": "dict",
                      "required": false,
                      "description": "A reference to where to retrieve the trust chain when validating a peer's Transport Layer Security (TLS) certificate.",
                      "nested_params": [
                        {
                          "name": "file",
                          "type": "dict",
                          "required": false,
                          "description": "An object that represents a Transport Layer Security (TLS) validation context trust for a local file.",
                          "nested_params": [
                            {
                              "name": "certificateChain",
                              "type": "string",
                              "required": false,
                              "description": "The certificate trust chain for a certificate stored on the file system of the virtual node that the proxy is running on.",
                              "nested_params": []
                            }
                          ]
                        },
                        {
                          "name": "sds",
                          "type": "dict",
                          "required": false,
                          "description": "A reference to an object that represents a virtual gateway's listener's Transport Layer Security (TLS) Secret Discovery Service validation context trust.",
                          "nested_params": [
                            {
                              "name": "secretName",
                              "type": "string",
                              "required": false,
                              "description": "A reference to an object that represents the name of the secret for a virtual gateway's Transport Layer Security (TLS) Secret Discovery Service validation context trust.",
                              "nested_params": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "logging",
          "type": "dict",
          "required": false,
          "description": "An object that represents logging information.",
          "nested_params": [
            {
              "name": "accessLog",
              "type": "dict",
              "required": false,
              "description": "The access log configuration.",
              "nested_params": [
                {
                  "name": "file",
                  "type": "dict",
                  "required": false,
                  "description": "The file object to send virtual gateway access logs to.",
                  "nested_params": [
                    {
                      "name": "format",
                      "type": "dict",
                      "required": false,
                      "description": "The specified format for the virtual gateway access logs. It can be either json_format or text_format.",
                      "nested_params": [
                        {
                          "name": "json",
                          "type": "list",
                          "required": false,
                          "description": "",
                          "nested_params": [
                            {
                              "name": "key",
                              "type": "string",
                              "required": false,
                              "description": "The specified key for the JSON.",
                              "nested_params": []
                            },
                            {
                              "name": "value",
                              "type": "string",
                              "required": false,
                              "description": "The specified value for the JSON.",
                              "nested_params": []
                            }
                          ]
                        },
                        {
                          "name": "text",
                          "type": "string",
                          "required": false,
                          "description": "",
                          "nested_params": []
                        }
                      ]
                    },
                    {
                      "name": "path",
                      "type": "string",
                      "required": false,
                      "description": "The file path to write access logs to. You can use /dev/stdout to send access logs to standard out and configure your Envoy container to use a log driver, such as awslogs, to export the access logs to a log storage service such as Amazon CloudWatch Logs. You can also specify a path in the Envoy container's file system to write the files to disk.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "virtualGatewayName",
      "type": "string",
      "required": true,
      "description": "The name of the virtual gateway to update.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "virtualGateway",
          "type": "dict",
          "description": "A full description of the virtual gateway that was updated.",
          "nested_items": [
            {
              "name": "meshName",
              "type": "string",
              "description": "The name of the service mesh that the virtual gateway resides in.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "arn",
                  "type": "string",
                  "description": "The full Amazon Resource Name (ARN) for the resource.",
                  "nested_items": []
                },
                {
                  "name": "createdAt",
                  "type": "datetime",
                  "description": "The Unix epoch timestamp in seconds for when the resource was created.",
                  "nested_items": []
                },
                {
                  "name": "lastUpdatedAt",
                  "type": "datetime",
                  "description": "The Unix epoch timestamp in seconds for when the resource was last updated.",
                  "nested_items": []
                },
                {
                  "name": "meshOwner",
                  "type": "string",
                  "description": "The Amazon Web Services IAM account ID of the service mesh owner. If the account ID is not your own, then it's the ID of the account that shared the mesh with your account. For more information about mesh sharing, see Working with shared meshes.",
                  "nested_items": []
                },
                {
                  "name": "resourceOwner",
                  "type": "string",
                  "description": "The Amazon Web Services IAM account ID of the resource owner. If the account ID is not your own, then it's the ID of the mesh owner or of another account that the mesh is shared with. For more information about mesh sharing, see Working with shared meshes.",
                  "nested_items": []
                },
                {
                  "name": "uid",
                  "type": "string",
                  "description": "The unique identifier for the resource.",
                  "nested_items": []
                },
                {
                  "name": "version",
                  "type": "integer",
                  "description": "The version of the resource. Resources are created at version 1, and this version is incremented each time that they're updated.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "backendDefaults",
                  "type": "dict",
                  "description": "A reference to an object that represents the defaults for backends.",
                  "nested_items": [
                    {
                      "name": "clientPolicy",
                      "type": "dict",
                      "description": "A reference to an object that represents a client policy.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "certificate",
                              "type": "dict",
                              "description": "A reference to an object that represents a virtual gateway's client's Transport Layer Security (TLS) certificate.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "certificateChain",
                                      "type": "string",
                                      "description": "The certificate chain for the certificate.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "privateKey",
                                      "type": "string",
                                      "description": "The private key for a certificate stored on the file system of the mesh endpoint that the proxy is running on.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "secretName",
                                      "type": "string",
                                      "description": "A reference to an object that represents the name of the secret secret requested from the Secret Discovery Service provider representing Transport Layer Security (TLS) materials like a certificate or certificate chain.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "enforce",
                              "type": "boolean",
                              "description": "Whether the policy is enforced. The default is True, if a value isn't specified.",
                              "nested_items": []
                            },
                            {
                              "name": "ports",
                              "type": "list",
                              "description": "One or more ports that the policy is enforced for.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "integer",
                                  "description": "(integer) ---",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "validation",
                              "type": "dict",
                              "description": "A reference to an object that represents a Transport Layer Security (TLS) validation context.",
                              "nested_items": [
                                {
                                  "name": "subjectAlternativeNames",
                                  "type": "dict",
                                  "description": "A reference to an object that represents the SANs for a virtual gateway's listener's Transport Layer Security (TLS) validation context.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "dict",
                                      "description": "",
                                      "nested_items": [
                                        {
                                          "name": "exact",
                                          "type": "list",
                                          "description": "The values sent must match the specified values exactly.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "string",
                                              "description": "(string) ---",
                                              "nested_items": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "dict",
                                      "description": "",
                                      "nested_items": [
                                        {
                                          "name": "certificateAuthorityArns",
                                          "type": "list",
                                          "description": "One or more ACM Amazon Resource Name (ARN)s.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "string",
                                              "description": "(string) ---",
                                              "nested_items": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "name": "",
                                      "type": "dict",
                                      "description": "",
                                      "nested_items": [
                                        {
                                          "name": "certificateChain",
                                          "type": "string",
                                          "description": "The certificate trust chain for a certificate stored on the file system of the virtual node that the proxy is running on.",
                                          "nested_items": []
                                        }
                                      ]
                                    },
                                    {
                                      "name": "",
                                      "type": "dict",
                                      "description": "",
                                      "nested_items": [
                                        {
                                          "name": "secretName",
                                          "type": "string",
                                          "description": "A reference to an object that represents the name of the secret for a virtual gateway's Transport Layer Security (TLS) Secret Discovery Service validation context trust.",
                                          "nested_items": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "listeners",
                  "type": "list",
                  "description": "The listeners that the mesh endpoint is expected to receive inbound traffic from. You can specify one listener.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "connectionPool",
                          "type": "dict",
                          "description": "The connection pool information for the virtual gateway listener.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "dict",
                              "description": "",
                              "nested_items": [
                                {
                                  "name": "maxRequests",
                                  "type": "integer",
                                  "description": "Maximum number of inflight requests Envoy can concurrently support across hosts in upstream cluster.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "",
                              "type": "dict",
                              "description": "",
                              "nested_items": [
                                {
                                  "name": "maxConnections",
                                  "type": "integer",
                                  "description": "Maximum number of outbound TCP connections Envoy can establish concurrently with all hosts in upstream cluster.",
                                  "nested_items": []
                                },
                                {
                                  "name": "maxPendingRequests",
                                  "type": "integer",
                                  "description": "Number of overflowing requests after max_connections Envoy will queue to upstream cluster.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "",
                              "type": "dict",
                              "description": "",
                              "nested_items": [
                                {
                                  "name": "maxRequests",
                                  "type": "integer",
                                  "description": "Maximum number of inflight requests Envoy can concurrently support across hosts in upstream cluster.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "name": "healthCheck",
                          "type": "dict",
                          "description": "The health check information for the listener.",
                          "nested_items": [
                            {
                              "name": "healthyThreshold",
                              "type": "integer",
                              "description": "The number of consecutive successful health checks that must occur before declaring the listener healthy.",
                              "nested_items": []
                            },
                            {
                              "name": "intervalMillis",
                              "type": "integer",
                              "description": "The time period in milliseconds between each health check execution.",
                              "nested_items": []
                            },
                            {
                              "name": "path",
                              "type": "string",
                              "description": "The destination path for the health check request. This value is only used if the specified protocol is HTTP or HTTP/2. For any other protocol, this value is ignored.",
                              "nested_items": []
                            },
                            {
                              "name": "port",
                              "type": "integer",
                              "description": "The destination port for the health check request. This port must match the port defined in the  PortMapping for the listener.",
                              "nested_items": []
                            },
                            {
                              "name": "protocol",
                              "type": "string",
                              "description": "The protocol for the health check request. If you specify grpc, then your service must conform to the GRPC Health Checking Protocol.",
                              "nested_items": []
                            },
                            {
                              "name": "timeoutMillis",
                              "type": "integer",
                              "description": "The amount of time to wait when receiving a response from the health check, in milliseconds.",
                              "nested_items": []
                            },
                            {
                              "name": "unhealthyThreshold",
                              "type": "integer",
                              "description": "The number of consecutive failed health checks that must occur before declaring a virtual gateway unhealthy.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "portMapping",
                          "type": "dict",
                          "description": "The port mapping information for the listener.",
                          "nested_items": [
                            {
                              "name": "port",
                              "type": "integer",
                              "description": "The port used for the port mapping. Specify one protocol.",
                              "nested_items": []
                            },
                            {
                              "name": "protocol",
                              "type": "string",
                              "description": "The protocol used for the port mapping.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "certificate",
                              "type": "dict",
                              "description": "An object that represents a Transport Layer Security (TLS) certificate.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "certificateArn",
                                      "type": "string",
                                      "description": "The Amazon Resource Name (ARN) for the certificate. The certificate must meet specific requirements and you must have proxy authorization enabled. For more information, see Transport Layer Security (TLS).",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "certificateChain",
                                      "type": "string",
                                      "description": "The certificate chain for the certificate.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "privateKey",
                                      "type": "string",
                                      "description": "The private key for a certificate stored on the file system of the mesh endpoint that the proxy is running on.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "secretName",
                                      "type": "string",
                                      "description": "A reference to an object that represents the name of the secret secret requested from the Secret Discovery Service provider representing Transport Layer Security (TLS) materials like a certificate or certificate chain.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "mode",
                              "type": "string",
                              "description": "Specify one of the following modes.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "STRICT --- Listener only accepts connections with TLS enabled.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "PERMISSIVE --- Listener accepts connections with or without TLS enabled.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "DISABLED --- Listener only accepts connections without TLS.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "validation",
                              "type": "dict",
                              "description": "A reference to an object that represents a virtual gateway's listener's Transport Layer Security (TLS) validation context.",
                              "nested_items": [
                                {
                                  "name": "subjectAlternativeNames",
                                  "type": "dict",
                                  "description": "A reference to an object that represents the SANs for a virtual gateway listener's Transport Layer Security (TLS) validation context.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "dict",
                                      "description": "",
                                      "nested_items": [
                                        {
                                          "name": "exact",
                                          "type": "list",
                                          "description": "The values sent must match the specified values exactly.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "string",
                                              "description": "(string) ---",
                                              "nested_items": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "dict",
                                      "description": "",
                                      "nested_items": [
                                        {
                                          "name": "certificateChain",
                                          "type": "string",
                                          "description": "The certificate trust chain for a certificate stored on the file system of the virtual node that the proxy is running on.",
                                          "nested_items": []
                                        }
                                      ]
                                    },
                                    {
                                      "name": "",
                                      "type": "dict",
                                      "description": "",
                                      "nested_items": [
                                        {
                                          "name": "secretName",
                                          "type": "string",
                                          "description": "A reference to an object that represents the name of the secret for a virtual gateway's Transport Layer Security (TLS) Secret Discovery Service validation context trust.",
                                          "nested_items": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "accessLog",
                      "type": "dict",
                      "description": "The access log configuration.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "dict",
                              "description": "",
                              "nested_items": [
                                {
                                  "name": "json",
                                  "type": "list",
                                  "description": "(dict) ---",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "dict",
                                      "description": "",
                                      "nested_items": [
                                        {
                                          "name": "key",
                                          "type": "string",
                                          "description": "The specified key for the JSON.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "value",
                                          "type": "string",
                                          "description": "The specified value for the JSON.",
                                          "nested_items": []
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "name": "text",
                                  "type": "string",
                                  "description": "",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "path",
                              "type": "string",
                              "description": "The file path to write access logs to. You can use /dev/stdout to send access logs to standard out and configure your Envoy container to use a log driver, such as awslogs, to export the access logs to a log storage service such as Amazon CloudWatch Logs. You can also specify a path in the Envoy container's file system to write the files to disk.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "status",
                  "type": "string",
                  "description": "The current status.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "virtualGatewayName",
              "type": "string",
              "description": "The name of the virtual gateway.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}