{
  "method_name": "list_platform_branches",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/elasticbeanstalk/client/list_platform_branches.html",
  "description": "Lists the platform branches available for your account in an AWS Region. Provides summary information about each platform branch. For definitions of platform branch and other platform-related terms, see AWS Elastic Beanstalk Platforms Glossary.",
  "parameters": [
    {
      "name": "Filters",
      "type": "list",
      "required": false,
      "description": "Criteria for restricting the resulting list of platform branches. The filter is evaluated as a logical conjunction (AND) of the separate SearchFilter terms. The following list shows valid attribute values for each of the SearchFilter terms. Most operators take a single value. The in and not_in operators can take multiple values. Attribute = BranchName: Operator: = | != | begins_with | ends_with | contains | in | not_in Attribute = LifecycleState: Operator: = | != | in | not_in Values: beta | supported | deprecated | retired Attribute = PlatformName: Operator: = | != | begins_with | ends_with | contains | in | not_in Attribute = TierType: Operator: = | != Values: WebServer/Standard | Worker/SQS/HTTP Array size: limited to 10 SearchFilter objects. Within each SearchFilter item, the Values array is limited to 10 items. (dict) --- Describes criteria to restrict a list of results. For operators that apply a single value to the attribute, the filter is evaluated as follows: Attribute Operator Values[1] Some operators, e.g. in, can apply multiple values. In this case, the filter is evaluated as a logical union (OR) of applications of the operator to the attribute with each one of the values: (Attribute Operator Values[1]) OR (Attribute Operator Values[2]) OR ... The valid values for attributes of SearchFilter depend on the API action. For valid values, see the reference page for the API action you're calling that takes a SearchFilter parameter. Attribute (string) --- The result attribute to which the filter values are applied. Valid values vary by API action. Operator (string) --- The operator to apply to the Attribute with each of the Values. Valid values vary by Attribute. Values (list) --- The list of values applied to the Attribute and Operator attributes. Number of values and valid values vary by Attribute. (string) ---",
      "nested_params": []
    },
    {
      "name": "MaxRecords",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "For a paginated request. Specify a token from a previous response page to retrieve the next response page. All other parameter values must be identical to the ones specified in the initial request. If no NextToken is specified, the first page is retrieved.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "PlatformBranchSummaryList",
          "type": "list",
          "description": "Summary information about the platform branches.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "PlatformName",
                  "type": "string",
                  "description": "The name of the platform to which this platform branch belongs.",
                  "nested_items": []
                },
                {
                  "name": "BranchName",
                  "type": "string",
                  "description": "The name of the platform branch.",
                  "nested_items": []
                },
                {
                  "name": "LifecycleState",
                  "type": "string",
                  "description": "The support life cycle state of the platform branch.",
                  "nested_items": []
                },
                {
                  "name": "BranchOrder",
                  "type": "integer",
                  "description": "An ordinal number that designates the order in which platform branches have been added to a platform. This can be helpful, for example, if your code calls the ListPlatformBranches action and then displays a list of platform branches.",
                  "nested_items": []
                },
                {
                  "name": "SupportedTierList",
                  "type": "list",
                  "description": "The environment tiers that platform versions in this branch support.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "In a paginated request, if this value isn't null, it's the token that you can pass in a subsequent request to get the next response page.",
          "nested_items": []
        }
      ]
    }
  ]
}