{
  "method_name": "list_entities",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/marketplace-catalog/client/list_entities.html",
  "description": "Provides the list of entities of a given type.",
  "parameters": [
    {
      "name": "Catalog",
      "type": "string",
      "required": true,
      "description": "The catalog related to the request. Fixed value: AWSMarketplace.",
      "nested_params": []
    },
    {
      "name": "EntityType",
      "type": "string",
      "required": true,
      "description": "The type of entities to retrieve. Valid values are: AmiProduct, ContainerProduct, DataProduct, SaaSProduct, ProcurementPolicy, Experience, Audience, BrandingSettings, Offer, Seller, ResaleAuthorization.",
      "nested_params": []
    },
    {
      "name": "FilterList",
      "type": "list",
      "required": false,
      "description": "An array of filter objects. Each filter object contains two attributes, filterName and filterValues. (dict) --- A filter object, used to optionally filter results from calls to the ListEntities and ListChangeSets actions. Name (string) --- For ListEntities, the supported value for this is an EntityId. For ListChangeSets, the supported values are as follows: ValueList (list) --- ListEntities - This is a list of unique ``EntityId``s. ListChangeSets - The supported filter names and associated ``ValueList``s is as follows: ChangeSetName - The supported ValueList is a list of non-unique ChangeSetName``s. These are defined when you call the ``StartChangeSet action. Status - The supported ValueList is a list of statuses for all change set requests. EntityId - The supported ValueList is a list of unique ``EntityId``s. BeforeStartTime - The supported ValueList is a list of all change sets that started before the filter value. AfterStartTime - The supported ValueList is a list of all change sets that started after the filter value. BeforeEndTime - The supported ValueList is a list of all change sets that ended before the filter value. AfterEndTime - The supported ValueList is a list of all change sets that ended after the filter value. (string) ---",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "For ListEntities, the supported value for this is an EntityId. For ListChangeSets, the supported values are as follows:",
          "nested_params": []
        },
        {
          "name": "ValueList",
          "type": "list",
          "required": false,
          "description": "ListEntities - This is a list of unique ``EntityId``s. ListChangeSets - The supported filter names and associated ``ValueList``s is as follows:",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Sort",
      "type": "dict",
      "required": false,
      "description": "An object that contains two attributes, SortBy and SortOrder. SortBy (string) --- For ListEntities, supported attributes include LastModifiedDate (default) and EntityId. In addition to LastModifiedDate and EntityId, each EntityType might support additional fields. For ListChangeSets, supported attributes include StartTime and EndTime. SortOrder (string) --- The sorting order. Can be ASCENDING or DESCENDING. The default value is DESCENDING.",
      "nested_params": [
        {
          "name": "SortBy",
          "type": "string",
          "required": false,
          "description": "For ListEntities, supported attributes include LastModifiedDate (default) and EntityId. In addition to LastModifiedDate and EntityId, each EntityType might support additional fields. For ListChangeSets, supported attributes include StartTime and EndTime.",
          "nested_params": []
        },
        {
          "name": "SortOrder",
          "type": "string",
          "required": false,
          "description": "The sorting order. Can be ASCENDING or DESCENDING. The default value is DESCENDING.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "OwnershipType",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "EntityTypeFilters",
      "type": "dict",
      "required": false,
      "description": "A Union object containing filter shapes for all EntityType``s. Each ``EntityTypeFilter shape will have filters applicable for that EntityType that can be used to search or filter entities. DataProductFilters (dict) --- A filter for data products. EntityId (dict) --- Unique identifier for the data product. ValueList (list) --- A string array of unique entity id values to be filtered on. (string) --- ProductTitle (dict) --- The title of the data product. ValueList (list) --- A string array of unique product title values to be filtered on. (string) --- WildCardValue (string) --- A string that will be the wildCard input for product tile filter. It matches the provided value as a substring in the actual value. Visibility (dict) --- The visibility of the data product. ValueList (list) --- A string array of unique visibility values to be filtered on. (string) --- LastModifiedDate (dict) --- The last date on which the data product was modified. DateRange (dict) --- Dates between which the data product was last modified. AfterValue (string) --- Date after which the data product was last modified. BeforeValue (string) --- Date before which the data product was last modified. SaaSProductFilters (dict) --- A filter for SaaS products. EntityId (dict) --- Unique identifier for the SaaS product. (string) --- ProductTitle (dict) --- The title of the SaaS product. Visibility (dict) --- The visibility of the SaaS product. (string) --- LastModifiedDate (dict) --- The last date on which the SaaS product was modified. DateRange (dict) --- Dates between which the SaaS product was last modified. AfterValue (string) --- Date after which the SaaS product was last modified. BeforeValue (string) --- Date before which the SaaS product was last modified. AmiProductFilters (dict) --- A filter for AMI products. EntityId (dict) --- Unique identifier for the AMI product. (string) --- LastModifiedDate (dict) --- The last date on which the AMI product was modified. DateRange (dict) --- Dates between which the AMI product was last modified. AfterValue (string) --- Date after which the AMI product was last modified. BeforeValue (string) --- Date before which the AMI product was last modified. ProductTitle (dict) --- The title of the AMI product. Visibility (dict) --- The visibility of the AMI product. (string) --- OfferFilters (dict) --- A filter for offers. EntityId (dict) --- Allows filtering on EntityId of an offer. ValueList (list) --- Allows filtering on entity id of an offer with list input. (string) --- Name (dict) --- Allows filtering on the Name of an offer. ValueList (list) --- Allows filtering on the Name of an offer with list input. (string) --- WildCardValue (string) --- Allows filtering on the Name of an offer with wild card input. ProductId (dict) --- Allows filtering on the ProductId of an offer. ValueList (list) --- Allows filtering on the ProductId of an offer with list input. (string) --- ResaleAuthorizationId (dict) --- Allows filtering on the ResaleAuthorizationId of an offer. ValueList (list) --- Allows filtering on the ResaleAuthorizationId of an offer with list input. (string) --- ReleaseDate (dict) --- Allows filtering on the ReleaseDate of an offer. DateRange (dict) --- Allows filtering on the ReleaseDate of an offer with date range as input. AfterValue (string) --- Allows filtering on the ReleaseDate of offers after a date. BeforeValue (string) --- Allows filtering on the ReleaseDate of offers before a date. AvailabilityEndDate (dict) --- Allows filtering on the AvailabilityEndDate of an offer. DateRange (dict) --- Allows filtering on the AvailabilityEndDate of an offer with date range as input. AfterValue (string) --- Allows filtering on the AvailabilityEndDate of an offer after a date. BeforeValue (string) --- Allows filtering on the AvailabilityEndDate of an offer before a date. BuyerAccounts (dict) --- Allows filtering on the BuyerAccounts of an offer. WildCardValue (string) --- Allows filtering on the BuyerAccounts of an offer with wild card input. State (dict) --- Allows filtering on the State of an offer. ValueList (list) --- Allows filtering on the State of an offer with list input. (string) --- Targeting (dict) --- Allows filtering on the Targeting of an offer. ValueList (list) --- Allows filtering on the Targeting of an offer with list input. (string) --- LastModifiedDate (dict) --- Allows filtering on the LastModifiedDate of an offer. DateRange (dict) --- Allows filtering on the LastModifiedDate of an offer with date range as input. AfterValue (string) --- Allows filtering on the LastModifiedDate of an offer after a date. BeforeValue (string) --- Allows filtering on the LastModifiedDate of an offer before a date. ContainerProductFilters (dict) --- A filter for container products. EntityId (dict) --- Unique identifier for the container product. (string) --- LastModifiedDate (dict) --- The last date on which the container product was modified. DateRange (dict) --- Dates between which the container product was last modified. AfterValue (string) --- Date after which the container product was last modified. BeforeValue (string) --- Date before which the container product was last modified. ProductTitle (dict) --- The title of the container product. Visibility (dict) --- The visibility of the container product. (string) --- ResaleAuthorizationFilters (dict) --- A filter for Resale Authorizations. EntityId (dict) --- Allows filtering on the EntityId of a ResaleAuthorization. ValueList (list) --- Allows filtering on EntityId of a ResaleAuthorization with list input. (string) --- Name (dict) --- Allows filtering on the Name of a ResaleAuthorization. ValueList (list) --- Allows filtering on the Name of a ResaleAuthorization with list input. (string) --- WildCardValue (string) --- Allows filtering on the Name of a ResaleAuthorization with wild card input. ProductId (dict) --- Allows filtering on the ProductId of a ResaleAuthorization. ValueList (list) --- Allows filtering on the ProductId of a ResaleAuthorization with list input. (string) --- WildCardValue (string) --- Allows filtering on the ProductId of a ResaleAuthorization with wild card input. CreatedDate (dict) --- Allows filtering on the CreatedDate of a ResaleAuthorization. DateRange (dict) --- Allows filtering on CreatedDate of a ResaleAuthorization with date range as input. AfterValue (string) --- Allows filtering on CreatedDate of a ResaleAuthorization after a date. BeforeValue (string) --- Allows filtering on CreatedDate of a ResaleAuthorization before a date. ValueList (list) --- Allows filtering on CreatedDate of a ResaleAuthorization with date value as input. (string) --- AvailabilityEndDate (dict) --- Allows filtering on the AvailabilityEndDate of a ResaleAuthorization. DateRange (dict) --- Allows filtering on AvailabilityEndDate of a ResaleAuthorization with date range as input AfterValue (string) --- Allows filtering on AvailabilityEndDate of a ResaleAuthorization after a date. BeforeValue (string) --- Allows filtering on AvailabilityEndDate of a ResaleAuthorization before a date. ValueList (list) --- Allows filtering on AvailabilityEndDate of a ResaleAuthorization with date value as input. (string) --- ManufacturerAccountId (dict) --- Allows filtering on the ManufacturerAccountId of a ResaleAuthorization. ValueList (list) --- Allows filtering on the ManufacturerAccountId of a ResaleAuthorization with list input. (string) --- WildCardValue (string) --- Allows filtering on the ManufacturerAccountId of a ResaleAuthorization with wild card input. ProductName (dict) --- Allows filtering on the ProductName of a ResaleAuthorization. ValueList (list) --- Allows filtering on the ProductName of a ResaleAuthorization with list input. (string) --- WildCardValue (string) --- Allows filtering on the ProductName of a ResaleAuthorization with wild card input. ManufacturerLegalName (dict) --- Allows filtering on the ManufacturerLegalName of a ResaleAuthorization. ValueList (list) --- Allows filtering on the ManufacturerLegalName of a ResaleAuthorization with list input. (string) --- WildCardValue (string) --- Allows filtering on the ManufacturerLegalName of a ResaleAuthorization with wild card input. ResellerAccountID (dict) --- Allows filtering on the ResellerAccountID of a ResaleAuthorization. ValueList (list) --- Allows filtering on the ResellerAccountID of a ResaleAuthorization with list input. (string) --- WildCardValue (string) --- Allows filtering on the ResellerAccountID of a ResaleAuthorization with wild card input. ResellerLegalName (dict) --- Allows filtering on the ResellerLegalName of a ResaleAuthorization. ValueList (list) --- Allows filtering on the ResellerLegalNameProductName of a ResaleAuthorization with list input. (string) --- WildCardValue (string) --- Allows filtering on the ResellerLegalName of a ResaleAuthorization with wild card input. Status (dict) --- Allows filtering on the Status of a ResaleAuthorization. ValueList (list) --- Allows filtering on the Status of a ResaleAuthorization with list input. (string) --- OfferExtendedStatus (dict) --- Allows filtering on the OfferExtendedStatus of a ResaleAuthorization. ValueList (list) --- Allows filtering on the OfferExtendedStatus of a ResaleAuthorization with list input. (string) --- LastModifiedDate (dict) --- Allows filtering on the LastModifiedDate of a ResaleAuthorization. DateRange (dict) --- Allows filtering on the LastModifiedDate of a ResaleAuthorization with date range as input. AfterValue (string) --- Allows filtering on the LastModifiedDate of a ResaleAuthorization after a date. BeforeValue (string) --- Allows filtering on the LastModifiedDate of a ResaleAuthorization before a date. MachineLearningProductFilters (dict) --- The filters that you can use with the ListEntities operation to filter machine learning products. You can filter by EntityId, LastModifiedDate, ProductTitle, and Visibility. EntityId (dict) --- Filter machine learning products by their entity IDs. ValueList (list) --- A list of entity IDs to filter by. The operation returns machine learning products with entity IDs that match the values in this list. (string) --- The entity ID of a machine learning product. This string uniquely identifies the product. LastModifiedDate (dict) --- Filter machine learning products by their last modified date. DateRange (dict) --- A date range to filter by. The operation returns machine learning products with last modified dates that fall within this range. AfterValue (string) --- The start date (inclusive) of the date range. The operation returns machine learning products with last modified dates on or after this date. BeforeValue (string) --- The end date (inclusive) of the date range. The operation returns machine learning products with last modified dates on or before this date. ProductTitle (dict) --- Filter machine learning products by their product titles. ValueList (list) --- A list of product titles to filter by. The operation returns machine learning products with titles that exactly match the values in this list. (string) --- The title of a machine learning product. WildCardValue (string) --- A wildcard value to filter product titles. The operation returns machine learning products with titles that match this wildcard pattern. Visibility (dict) --- Filter machine learning products by their visibility status. ValueList (list) --- A list of visibility values to filter by. The operation returns machine learning products with visibility status that match the values in this list. (string) --- The visibility status of a machine learning product. Valid values are: Limited - The product is available to a limited set of buyers. Public - The product is publicly available to all buyers. Restricted - The product has restricted availability. Draft - The product is in draft state and not yet available to buyers.",
      "nested_params": [
        {
          "name": "DataProductFilters",
          "type": "dict",
          "required": false,
          "description": "A filter for data products.",
          "nested_params": [
            {
              "name": "EntityId",
              "type": "dict",
              "required": false,
              "description": "Unique identifier for the data product.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "A string array of unique entity id values to be filtered on.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ProductTitle",
              "type": "dict",
              "required": false,
              "description": "The title of the data product.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "A string array of unique product title values to be filtered on.",
                  "nested_params": []
                },
                {
                  "name": "WildCardValue",
                  "type": "string",
                  "required": false,
                  "description": "A string that will be the wildCard input for product tile filter. It matches the provided value as a substring in the actual value.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Visibility",
              "type": "dict",
              "required": false,
              "description": "The visibility of the data product.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "A string array of unique visibility values to be filtered on.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "LastModifiedDate",
              "type": "dict",
              "required": false,
              "description": "The last date on which the data product was modified.",
              "nested_params": [
                {
                  "name": "DateRange",
                  "type": "dict",
                  "required": false,
                  "description": "Dates between which the data product was last modified.",
                  "nested_params": [
                    {
                      "name": "AfterValue",
                      "type": "string",
                      "required": false,
                      "description": "Date after which the data product was last modified.",
                      "nested_params": []
                    },
                    {
                      "name": "BeforeValue",
                      "type": "string",
                      "required": false,
                      "description": "Date before which the data product was last modified.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "SaaSProductFilters",
          "type": "dict",
          "required": false,
          "description": "A filter for SaaS products.",
          "nested_params": [
            {
              "name": "EntityId",
              "type": "dict",
              "required": false,
              "description": "Unique identifier for the SaaS product.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "A string array of unique entity id values to be filtered on.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ProductTitle",
              "type": "dict",
              "required": false,
              "description": "The title of the SaaS product.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "A string array of unique product title values to be filtered on.",
                  "nested_params": []
                },
                {
                  "name": "WildCardValue",
                  "type": "string",
                  "required": false,
                  "description": "A string that will be the wildCard input for product tile filter. It matches the provided value as a substring in the actual value.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Visibility",
              "type": "dict",
              "required": false,
              "description": "The visibility of the SaaS product.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "A string array of unique visibility values to be filtered on.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "LastModifiedDate",
              "type": "dict",
              "required": false,
              "description": "The last date on which the SaaS product was modified.",
              "nested_params": [
                {
                  "name": "DateRange",
                  "type": "dict",
                  "required": false,
                  "description": "Dates between which the SaaS product was last modified.",
                  "nested_params": [
                    {
                      "name": "AfterValue",
                      "type": "string",
                      "required": false,
                      "description": "Date after which the SaaS product was last modified.",
                      "nested_params": []
                    },
                    {
                      "name": "BeforeValue",
                      "type": "string",
                      "required": false,
                      "description": "Date before which the SaaS product was last modified.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "AmiProductFilters",
          "type": "dict",
          "required": false,
          "description": "A filter for AMI products.",
          "nested_params": [
            {
              "name": "EntityId",
              "type": "dict",
              "required": false,
              "description": "Unique identifier for the AMI product.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "A string array of unique entity id values to be filtered on.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "LastModifiedDate",
              "type": "dict",
              "required": false,
              "description": "The last date on which the AMI product was modified.",
              "nested_params": [
                {
                  "name": "DateRange",
                  "type": "dict",
                  "required": false,
                  "description": "Dates between which the AMI product was last modified.",
                  "nested_params": [
                    {
                      "name": "AfterValue",
                      "type": "string",
                      "required": false,
                      "description": "Date after which the AMI product was last modified.",
                      "nested_params": []
                    },
                    {
                      "name": "BeforeValue",
                      "type": "string",
                      "required": false,
                      "description": "Date before which the AMI product was last modified.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "ProductTitle",
              "type": "dict",
              "required": false,
              "description": "The title of the AMI product.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "A string array of unique product title values to be filtered on.",
                  "nested_params": []
                },
                {
                  "name": "WildCardValue",
                  "type": "string",
                  "required": false,
                  "description": "A string that will be the wildCard input for product tile filter. It matches the provided value as a substring in the actual value.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Visibility",
              "type": "dict",
              "required": false,
              "description": "The visibility of the AMI product.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "A string array of unique visibility values to be filtered on.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "OfferFilters",
          "type": "dict",
          "required": false,
          "description": "A filter for offers.",
          "nested_params": [
            {
              "name": "EntityId",
              "type": "dict",
              "required": false,
              "description": "Allows filtering on EntityId of an offer.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "Allows filtering on entity id of an offer with list input.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Name",
              "type": "dict",
              "required": false,
              "description": "Allows filtering on the Name of an offer.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "Allows filtering on the Name of an offer with list input.",
                  "nested_params": []
                },
                {
                  "name": "WildCardValue",
                  "type": "string",
                  "required": false,
                  "description": "Allows filtering on the Name of an offer with wild card input.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ProductId",
              "type": "dict",
              "required": false,
              "description": "Allows filtering on the ProductId of an offer.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "Allows filtering on the ProductId of an offer with list input.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ResaleAuthorizationId",
              "type": "dict",
              "required": false,
              "description": "Allows filtering on the ResaleAuthorizationId of an offer.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "Allows filtering on the ResaleAuthorizationId of an offer with list input.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ReleaseDate",
              "type": "dict",
              "required": false,
              "description": "Allows filtering on the ReleaseDate of an offer.",
              "nested_params": [
                {
                  "name": "DateRange",
                  "type": "dict",
                  "required": false,
                  "description": "Allows filtering on the ReleaseDate of an offer with date range as input.",
                  "nested_params": [
                    {
                      "name": "AfterValue",
                      "type": "string",
                      "required": false,
                      "description": "Allows filtering on the ReleaseDate of offers after a date.",
                      "nested_params": []
                    },
                    {
                      "name": "BeforeValue",
                      "type": "string",
                      "required": false,
                      "description": "Allows filtering on the ReleaseDate of offers before a date.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "AvailabilityEndDate",
              "type": "dict",
              "required": false,
              "description": "Allows filtering on the AvailabilityEndDate of an offer.",
              "nested_params": [
                {
                  "name": "DateRange",
                  "type": "dict",
                  "required": false,
                  "description": "Allows filtering on the AvailabilityEndDate of an offer with date range as input.",
                  "nested_params": [
                    {
                      "name": "AfterValue",
                      "type": "string",
                      "required": false,
                      "description": "Allows filtering on the AvailabilityEndDate of an offer after a date.",
                      "nested_params": []
                    },
                    {
                      "name": "BeforeValue",
                      "type": "string",
                      "required": false,
                      "description": "Allows filtering on the AvailabilityEndDate of an offer before a date.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "BuyerAccounts",
              "type": "dict",
              "required": false,
              "description": "Allows filtering on the BuyerAccounts of an offer.",
              "nested_params": [
                {
                  "name": "WildCardValue",
                  "type": "string",
                  "required": false,
                  "description": "Allows filtering on the BuyerAccounts of an offer with wild card input.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "State",
              "type": "dict",
              "required": false,
              "description": "Allows filtering on the State of an offer.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "Allows filtering on the State of an offer with list input.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Targeting",
              "type": "dict",
              "required": false,
              "description": "Allows filtering on the Targeting of an offer.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "Allows filtering on the Targeting of an offer with list input.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "LastModifiedDate",
              "type": "dict",
              "required": false,
              "description": "Allows filtering on the LastModifiedDate of an offer.",
              "nested_params": [
                {
                  "name": "DateRange",
                  "type": "dict",
                  "required": false,
                  "description": "Allows filtering on the LastModifiedDate of an offer with date range as input.",
                  "nested_params": [
                    {
                      "name": "AfterValue",
                      "type": "string",
                      "required": false,
                      "description": "Allows filtering on the LastModifiedDate of an offer after a date.",
                      "nested_params": []
                    },
                    {
                      "name": "BeforeValue",
                      "type": "string",
                      "required": false,
                      "description": "Allows filtering on the LastModifiedDate of an offer before a date.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "ContainerProductFilters",
          "type": "dict",
          "required": false,
          "description": "A filter for container products.",
          "nested_params": [
            {
              "name": "EntityId",
              "type": "dict",
              "required": false,
              "description": "Unique identifier for the container product.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "A string array of unique entity id values to be filtered on.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "LastModifiedDate",
              "type": "dict",
              "required": false,
              "description": "The last date on which the container product was modified.",
              "nested_params": [
                {
                  "name": "DateRange",
                  "type": "dict",
                  "required": false,
                  "description": "Dates between which the container product was last modified.",
                  "nested_params": [
                    {
                      "name": "AfterValue",
                      "type": "string",
                      "required": false,
                      "description": "Date after which the container product was last modified.",
                      "nested_params": []
                    },
                    {
                      "name": "BeforeValue",
                      "type": "string",
                      "required": false,
                      "description": "Date before which the container product was last modified.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "ProductTitle",
              "type": "dict",
              "required": false,
              "description": "The title of the container product.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "A string array of unique product title values to be filtered on.",
                  "nested_params": []
                },
                {
                  "name": "WildCardValue",
                  "type": "string",
                  "required": false,
                  "description": "A string that will be the wildCard input for product tile filter. It matches the provided value as a substring in the actual value.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Visibility",
              "type": "dict",
              "required": false,
              "description": "The visibility of the container product.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "A string array of unique visibility values to be filtered on.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "ResaleAuthorizationFilters",
          "type": "dict",
          "required": false,
          "description": "A filter for Resale Authorizations.",
          "nested_params": [
            {
              "name": "EntityId",
              "type": "dict",
              "required": false,
              "description": "Allows filtering on the EntityId of a ResaleAuthorization.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "Allows filtering on EntityId of a ResaleAuthorization with list input.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Name",
              "type": "dict",
              "required": false,
              "description": "Allows filtering on the Name of a ResaleAuthorization.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "Allows filtering on the Name of a ResaleAuthorization with list input.",
                  "nested_params": []
                },
                {
                  "name": "WildCardValue",
                  "type": "string",
                  "required": false,
                  "description": "Allows filtering on the Name of a ResaleAuthorization with wild card input.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ProductId",
              "type": "dict",
              "required": false,
              "description": "Allows filtering on the ProductId of a ResaleAuthorization.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "Allows filtering on the ProductId of a ResaleAuthorization with list input.",
                  "nested_params": []
                },
                {
                  "name": "WildCardValue",
                  "type": "string",
                  "required": false,
                  "description": "Allows filtering on the ProductId of a ResaleAuthorization with wild card input.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "CreatedDate",
              "type": "dict",
              "required": false,
              "description": "Allows filtering on the CreatedDate of a ResaleAuthorization.",
              "nested_params": [
                {
                  "name": "DateRange",
                  "type": "dict",
                  "required": false,
                  "description": "Allows filtering on CreatedDate of a ResaleAuthorization with date range as input.",
                  "nested_params": [
                    {
                      "name": "AfterValue",
                      "type": "string",
                      "required": false,
                      "description": "Allows filtering on CreatedDate of a ResaleAuthorization after a date.",
                      "nested_params": []
                    },
                    {
                      "name": "BeforeValue",
                      "type": "string",
                      "required": false,
                      "description": "Allows filtering on CreatedDate of a ResaleAuthorization before a date.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "Allows filtering on CreatedDate of a ResaleAuthorization with date value as input.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "AvailabilityEndDate",
              "type": "dict",
              "required": false,
              "description": "Allows filtering on the AvailabilityEndDate of a ResaleAuthorization.",
              "nested_params": [
                {
                  "name": "DateRange",
                  "type": "dict",
                  "required": false,
                  "description": "Allows filtering on AvailabilityEndDate of a ResaleAuthorization with date range as input.",
                  "nested_params": [
                    {
                      "name": "AfterValue",
                      "type": "string",
                      "required": false,
                      "description": "Allows filtering on AvailabilityEndDate of a ResaleAuthorization after a date.",
                      "nested_params": []
                    },
                    {
                      "name": "BeforeValue",
                      "type": "string",
                      "required": false,
                      "description": "Allows filtering on AvailabilityEndDate of a ResaleAuthorization before a date.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "Allows filtering on AvailabilityEndDate of a ResaleAuthorization with date value as input.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ManufacturerAccountId",
              "type": "dict",
              "required": false,
              "description": "Allows filtering on the ManufacturerAccountId of a ResaleAuthorization.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "Allows filtering on the ManufacturerAccountId of a ResaleAuthorization with list input.",
                  "nested_params": []
                },
                {
                  "name": "WildCardValue",
                  "type": "string",
                  "required": false,
                  "description": "Allows filtering on the ManufacturerAccountId of a ResaleAuthorization with wild card input.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ProductName",
              "type": "dict",
              "required": false,
              "description": "Allows filtering on the ProductName of a ResaleAuthorization.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "Allows filtering on the ProductName of a ResaleAuthorization with list input.",
                  "nested_params": []
                },
                {
                  "name": "WildCardValue",
                  "type": "string",
                  "required": false,
                  "description": "Allows filtering on the ProductName of a ResaleAuthorization with wild card input.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ManufacturerLegalName",
              "type": "dict",
              "required": false,
              "description": "Allows filtering on the ManufacturerLegalName of a ResaleAuthorization.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "Allows filtering on the ManufacturerLegalName of a ResaleAuthorization with list input.",
                  "nested_params": []
                },
                {
                  "name": "WildCardValue",
                  "type": "string",
                  "required": false,
                  "description": "Allows filtering on the ManufacturerLegalName of a ResaleAuthorization with wild card input.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ResellerAccountID",
              "type": "dict",
              "required": false,
              "description": "Allows filtering on the ResellerAccountID of a ResaleAuthorization.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "Allows filtering on the ResellerAccountID of a ResaleAuthorization with list input.",
                  "nested_params": []
                },
                {
                  "name": "WildCardValue",
                  "type": "string",
                  "required": false,
                  "description": "Allows filtering on the ResellerAccountID of a ResaleAuthorization with wild card input.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ResellerLegalName",
              "type": "dict",
              "required": false,
              "description": "Allows filtering on the ResellerLegalName of a ResaleAuthorization.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "Allows filtering on the ResellerLegalNameProductName of a ResaleAuthorization with list input.",
                  "nested_params": []
                },
                {
                  "name": "WildCardValue",
                  "type": "string",
                  "required": false,
                  "description": "Allows filtering on the ResellerLegalName of a ResaleAuthorization with wild card input.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Status",
              "type": "dict",
              "required": false,
              "description": "Allows filtering on the Status of a ResaleAuthorization.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "Allows filtering on the Status of a ResaleAuthorization with list input.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "OfferExtendedStatus",
              "type": "dict",
              "required": false,
              "description": "Allows filtering on the OfferExtendedStatus of a ResaleAuthorization.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "Allows filtering on the OfferExtendedStatus of a ResaleAuthorization with list input.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "LastModifiedDate",
              "type": "dict",
              "required": false,
              "description": "Allows filtering on the LastModifiedDate of a ResaleAuthorization.",
              "nested_params": [
                {
                  "name": "DateRange",
                  "type": "dict",
                  "required": false,
                  "description": "Allows filtering on the LastModifiedDate of a ResaleAuthorization with date range as input.",
                  "nested_params": [
                    {
                      "name": "AfterValue",
                      "type": "string",
                      "required": false,
                      "description": "Allows filtering on the LastModifiedDate of a ResaleAuthorization after a date.",
                      "nested_params": []
                    },
                    {
                      "name": "BeforeValue",
                      "type": "string",
                      "required": false,
                      "description": "Allows filtering on the LastModifiedDate of a ResaleAuthorization before a date.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "MachineLearningProductFilters",
          "type": "dict",
          "required": false,
          "description": "The filters that you can use with the ListEntities operation to filter machine learning products. You can filter by EntityId, LastModifiedDate, ProductTitle, and Visibility.",
          "nested_params": [
            {
              "name": "EntityId",
              "type": "dict",
              "required": false,
              "description": "Filter machine learning products by their entity IDs.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "A list of entity IDs to filter by. The operation returns machine learning products with entity IDs that match the values in this list.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "LastModifiedDate",
              "type": "dict",
              "required": false,
              "description": "Filter machine learning products by their last modified date.",
              "nested_params": [
                {
                  "name": "DateRange",
                  "type": "dict",
                  "required": false,
                  "description": "A date range to filter by. The operation returns machine learning products with last modified dates that fall within this range.",
                  "nested_params": [
                    {
                      "name": "AfterValue",
                      "type": "string",
                      "required": false,
                      "description": "The start date (inclusive) of the date range. The operation returns machine learning products with last modified dates on or after this date.",
                      "nested_params": []
                    },
                    {
                      "name": "BeforeValue",
                      "type": "string",
                      "required": false,
                      "description": "The end date (inclusive) of the date range. The operation returns machine learning products with last modified dates on or before this date.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "ProductTitle",
              "type": "dict",
              "required": false,
              "description": "Filter machine learning products by their product titles.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "A list of product titles to filter by. The operation returns machine learning products with titles that exactly match the values in this list.",
                  "nested_params": []
                },
                {
                  "name": "WildCardValue",
                  "type": "string",
                  "required": false,
                  "description": "A wildcard value to filter product titles. The operation returns machine learning products with titles that match this wildcard pattern.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Visibility",
              "type": "dict",
              "required": false,
              "description": "Filter machine learning products by their visibility status.",
              "nested_params": [
                {
                  "name": "ValueList",
                  "type": "list",
                  "required": false,
                  "description": "A list of visibility values to filter by. The operation returns machine learning products with visibility status that match the values in this list.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "EntityTypeSort",
      "type": "dict",
      "required": false,
      "description": "A Union object containing Sort shapes for all EntityType``s. Each ``EntityTypeSort shape will have SortBy and SortOrder applicable for fields on that EntityType. This can be used to sort the results of the filter query. DataProductSort (dict) --- A sort for data products. SortBy (string) --- Field to sort the data products by. SortOrder (string) --- The sorting order. Can be ASCENDING or DESCENDING. The default value is DESCENDING. SaaSProductSort (dict) --- A sort for SaaS products. SortBy (string) --- Field to sort the SaaS products by. AmiProductSort (dict) --- A sort for AMI products. SortBy (string) --- Field to sort the AMI products by. OfferSort (dict) --- A sort for offers. SortBy (string) --- Allows to sort offers. SortOrder (string) --- Allows to sort offers. ContainerProductSort (dict) --- A sort for container products. SortBy (string) --- Field to sort the container products by. ResaleAuthorizationSort (dict) --- A sort for Resale Authorizations. SortBy (string) --- Allows to sort ResaleAuthorization. SortOrder (string) --- Allows to sort ResaleAuthorization. MachineLearningProductSort (dict) --- The sort options for machine learning products. SortBy (string) --- The field to sort by. Valid values: EntityId, LastModifiedDate, ProductTitle, and Visibility. SortOrder (string) --- The sort order. Valid values are ASC (ascending) and DESC (descending).",
      "nested_params": [
        {
          "name": "DataProductSort",
          "type": "dict",
          "required": false,
          "description": "A sort for data products.",
          "nested_params": [
            {
              "name": "SortBy",
              "type": "string",
              "required": false,
              "description": "Field to sort the data products by.",
              "nested_params": []
            },
            {
              "name": "SortOrder",
              "type": "string",
              "required": false,
              "description": "The sorting order. Can be ASCENDING or DESCENDING. The default value is DESCENDING.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "SaaSProductSort",
          "type": "dict",
          "required": false,
          "description": "A sort for SaaS products.",
          "nested_params": [
            {
              "name": "SortBy",
              "type": "string",
              "required": false,
              "description": "Field to sort the SaaS products by.",
              "nested_params": []
            },
            {
              "name": "SortOrder",
              "type": "string",
              "required": false,
              "description": "The sorting order. Can be ASCENDING or DESCENDING. The default value is DESCENDING.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "AmiProductSort",
          "type": "dict",
          "required": false,
          "description": "A sort for AMI products.",
          "nested_params": [
            {
              "name": "SortBy",
              "type": "string",
              "required": false,
              "description": "Field to sort the AMI products by.",
              "nested_params": []
            },
            {
              "name": "SortOrder",
              "type": "string",
              "required": false,
              "description": "The sorting order. Can be ASCENDING or DESCENDING. The default value is DESCENDING.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "OfferSort",
          "type": "dict",
          "required": false,
          "description": "A sort for offers.",
          "nested_params": [
            {
              "name": "SortBy",
              "type": "string",
              "required": false,
              "description": "Allows to sort offers.",
              "nested_params": []
            },
            {
              "name": "SortOrder",
              "type": "string",
              "required": false,
              "description": "Allows to sort offers.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ContainerProductSort",
          "type": "dict",
          "required": false,
          "description": "A sort for container products.",
          "nested_params": [
            {
              "name": "SortBy",
              "type": "string",
              "required": false,
              "description": "Field to sort the container products by.",
              "nested_params": []
            },
            {
              "name": "SortOrder",
              "type": "string",
              "required": false,
              "description": "The sorting order. Can be ASCENDING or DESCENDING. The default value is DESCENDING.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ResaleAuthorizationSort",
          "type": "dict",
          "required": false,
          "description": "A sort for Resale Authorizations.",
          "nested_params": [
            {
              "name": "SortBy",
              "type": "string",
              "required": false,
              "description": "Allows to sort ResaleAuthorization.",
              "nested_params": []
            },
            {
              "name": "SortOrder",
              "type": "string",
              "required": false,
              "description": "Allows to sort ResaleAuthorization.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "MachineLearningProductSort",
          "type": "dict",
          "required": false,
          "description": "The sort options for machine learning products.",
          "nested_params": [
            {
              "name": "SortBy",
              "type": "string",
              "required": false,
              "description": "The field to sort by. Valid values: EntityId, LastModifiedDate, ProductTitle, and Visibility.",
              "nested_params": []
            },
            {
              "name": "SortOrder",
              "type": "string",
              "required": false,
              "description": "The sort order. Valid values are ASC (ascending) and DESC (descending).",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "EntitySummaryList",
          "type": "list",
          "description": "Array of EntitySummary objects.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The name for the entity. This value is not unique. It is defined by the seller.",
                  "nested_items": []
                },
                {
                  "name": "EntityType",
                  "type": "string",
                  "description": "The type of the entity.",
                  "nested_items": []
                },
                {
                  "name": "EntityId",
                  "type": "string",
                  "description": "The unique identifier for the entity.",
                  "nested_items": []
                },
                {
                  "name": "EntityArn",
                  "type": "string",
                  "description": "The ARN associated with the unique identifier for the entity.",
                  "nested_items": []
                },
                {
                  "name": "LastModifiedDate",
                  "type": "string",
                  "description": "The last time the entity was published, using ISO 8601 format (2018-02-27T13:45:22Z).",
                  "nested_items": []
                },
                {
                  "name": "Visibility",
                  "type": "string",
                  "description": "The visibility status of the entity to buyers. This value can be Public (everyone can view the entity), Limited (the entity is visible to limited accounts only), or Restricted (the entity was published and then unpublished and only existing buyers can view it).",
                  "nested_items": []
                },
                {
                  "name": "AmiProductSummary",
                  "type": "dict",
                  "description": "An object that contains summary information about the AMI product.",
                  "nested_items": [
                    {
                      "name": "ProductTitle",
                      "type": "string",
                      "description": "The title of the AMI product.",
                      "nested_items": []
                    },
                    {
                      "name": "Visibility",
                      "type": "string",
                      "description": "The lifecycle of the AMI product.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "ContainerProductSummary",
                  "type": "dict",
                  "description": "An object that contains summary information about the container product.",
                  "nested_items": [
                    {
                      "name": "ProductTitle",
                      "type": "string",
                      "description": "The title of the container product.",
                      "nested_items": []
                    },
                    {
                      "name": "Visibility",
                      "type": "string",
                      "description": "The lifecycle of the product.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "DataProductSummary",
                  "type": "dict",
                  "description": "An object that contains summary information about the data product.",
                  "nested_items": [
                    {
                      "name": "ProductTitle",
                      "type": "string",
                      "description": "The title of the data product.",
                      "nested_items": []
                    },
                    {
                      "name": "Visibility",
                      "type": "string",
                      "description": "The lifecycle of the data product.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "SaaSProductSummary",
                  "type": "dict",
                  "description": "An object that contains summary information about the SaaS product.",
                  "nested_items": [
                    {
                      "name": "ProductTitle",
                      "type": "string",
                      "description": "The title of the SaaS product.",
                      "nested_items": []
                    },
                    {
                      "name": "Visibility",
                      "type": "string",
                      "description": "The lifecycle of the SaaS product.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "OfferSummary",
                  "type": "dict",
                  "description": "An object that contains summary information about the offer.",
                  "nested_items": [
                    {
                      "name": "Name",
                      "type": "string",
                      "description": "The name of the offer.",
                      "nested_items": []
                    },
                    {
                      "name": "ProductId",
                      "type": "string",
                      "description": "The product ID of the offer.",
                      "nested_items": []
                    },
                    {
                      "name": "ResaleAuthorizationId",
                      "type": "string",
                      "description": "The ResaleAuthorizationId of the offer.",
                      "nested_items": []
                    },
                    {
                      "name": "ReleaseDate",
                      "type": "string",
                      "description": "The release date of the offer.",
                      "nested_items": []
                    },
                    {
                      "name": "AvailabilityEndDate",
                      "type": "string",
                      "description": "The availability end date of the offer.",
                      "nested_items": []
                    },
                    {
                      "name": "BuyerAccounts",
                      "type": "list",
                      "description": "The buyer accounts in the offer.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "State",
                      "type": "string",
                      "description": "The status of the offer.",
                      "nested_items": []
                    },
                    {
                      "name": "Targeting",
                      "type": "list",
                      "description": "The targeting in the offer.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "ResaleAuthorizationSummary",
                  "type": "dict",
                  "description": "An object that contains summary information about the Resale Authorization.",
                  "nested_items": [
                    {
                      "name": "Name",
                      "type": "string",
                      "description": "The name of the ResaleAuthorization.",
                      "nested_items": []
                    },
                    {
                      "name": "ProductId",
                      "type": "string",
                      "description": "The product ID of the ResaleAuthorization.",
                      "nested_items": []
                    },
                    {
                      "name": "ProductName",
                      "type": "string",
                      "description": "The product name of the ResaleAuthorization.",
                      "nested_items": []
                    },
                    {
                      "name": "ManufacturerAccountId",
                      "type": "string",
                      "description": "The manufacturer account ID of the ResaleAuthorization.",
                      "nested_items": []
                    },
                    {
                      "name": "ManufacturerLegalName",
                      "type": "string",
                      "description": "The manufacturer legal name of the ResaleAuthorization.",
                      "nested_items": []
                    },
                    {
                      "name": "ResellerAccountID",
                      "type": "string",
                      "description": "The reseller account ID of the ResaleAuthorization.",
                      "nested_items": []
                    },
                    {
                      "name": "ResellerLegalName",
                      "type": "string",
                      "description": "The reseller legal name of the ResaleAuthorization.",
                      "nested_items": []
                    },
                    {
                      "name": "Status",
                      "type": "string",
                      "description": "The status of the ResaleAuthorization.",
                      "nested_items": []
                    },
                    {
                      "name": "OfferExtendedStatus",
                      "type": "string",
                      "description": "The offer extended status of the ResaleAuthorization.",
                      "nested_items": []
                    },
                    {
                      "name": "CreatedDate",
                      "type": "string",
                      "description": "The created date of the ResaleAuthorization.",
                      "nested_items": []
                    },
                    {
                      "name": "AvailabilityEndDate",
                      "type": "string",
                      "description": "The availability end date of the ResaleAuthorization.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "MachineLearningProductSummary",
                  "type": "dict",
                  "description": "A summary of a machine learning product.",
                  "nested_items": [
                    {
                      "name": "ProductTitle",
                      "type": "string",
                      "description": "The title of the machine learning product.",
                      "nested_items": []
                    },
                    {
                      "name": "Visibility",
                      "type": "string",
                      "description": "The visibility status of the machine learning product. Valid values are Limited, Public, Restricted, and Draft.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The value of the next token if it exists. Null if there is no more result.",
          "nested_items": []
        }
      ]
    }
  ]
}