{
  "method_name": "list_change_sets",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/marketplace-catalog/client/list_change_sets.html",
  "description": "Returns the list of change sets owned by the account being used to make the call. You can filter this list by providing any combination of entityId, ChangeSetName, and status. If you provide more than one filter, the API operation applies a logical AND between the filters. You can describe a change during the 60-day request history retention period for API calls.",
  "parameters": [
    {
      "name": "Catalog",
      "type": "string",
      "required": true,
      "description": "The catalog related to the request. Fixed value: AWSMarketplace.",
      "nested_params": []
    },
    {
      "name": "FilterList",
      "type": "list",
      "required": false,
      "description": "An array of filter objects. (dict) --- A filter object, used to optionally filter results from calls to the ListEntities and ListChangeSets actions. Name (string) --- For ListEntities, the supported value for this is an EntityId. For ListChangeSets, the supported values are as follows: ValueList (list) --- ListEntities - This is a list of unique ``EntityId``s. ListChangeSets - The supported filter names and associated ``ValueList``s is as follows: ChangeSetName - The supported ValueList is a list of non-unique ChangeSetName``s. These are defined when you call the ``StartChangeSet action. Status - The supported ValueList is a list of statuses for all change set requests. EntityId - The supported ValueList is a list of unique ``EntityId``s. BeforeStartTime - The supported ValueList is a list of all change sets that started before the filter value. AfterStartTime - The supported ValueList is a list of all change sets that started after the filter value. BeforeEndTime - The supported ValueList is a list of all change sets that ended before the filter value. AfterEndTime - The supported ValueList is a list of all change sets that ended after the filter value. (string) ---",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "For ListEntities, the supported value for this is an EntityId. For ListChangeSets, the supported values are as follows:",
          "nested_params": []
        },
        {
          "name": "ValueList",
          "type": "list",
          "required": false,
          "description": "ListEntities - This is a list of unique ``EntityId``s. ListChangeSets - The supported filter names and associated ``ValueList``s is as follows:",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Sort",
      "type": "dict",
      "required": false,
      "description": "An object that contains two attributes, SortBy and SortOrder. SortBy (string) --- For ListEntities, supported attributes include LastModifiedDate (default) and EntityId. In addition to LastModifiedDate and EntityId, each EntityType might support additional fields. For ListChangeSets, supported attributes include StartTime and EndTime. SortOrder (string) --- The sorting order. Can be ASCENDING or DESCENDING. The default value is DESCENDING.",
      "nested_params": [
        {
          "name": "SortBy",
          "type": "string",
          "required": false,
          "description": "For ListEntities, supported attributes include LastModifiedDate (default) and EntityId. In addition to LastModifiedDate and EntityId, each EntityType might support additional fields. For ListChangeSets, supported attributes include StartTime and EndTime.",
          "nested_params": []
        },
        {
          "name": "SortOrder",
          "type": "string",
          "required": false,
          "description": "The sorting order. Can be ASCENDING or DESCENDING. The default value is DESCENDING.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ChangeSetSummaryList",
          "type": "list",
          "description": "Array of ChangeSetSummaryListItem objects.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ChangeSetId",
                  "type": "string",
                  "description": "The unique identifier for a change set.",
                  "nested_items": []
                },
                {
                  "name": "ChangeSetArn",
                  "type": "string",
                  "description": "The ARN associated with the unique identifier for the change set referenced in this request.",
                  "nested_items": []
                },
                {
                  "name": "ChangeSetName",
                  "type": "string",
                  "description": "The non-unique name for the change set.",
                  "nested_items": []
                },
                {
                  "name": "StartTime",
                  "type": "string",
                  "description": "The time, in ISO 8601 format (2018-02-27T13:45:22Z), when the change set was started.",
                  "nested_items": []
                },
                {
                  "name": "EndTime",
                  "type": "string",
                  "description": "The time, in ISO 8601 format (2018-02-27T13:45:22Z), when the change set was finished.",
                  "nested_items": []
                },
                {
                  "name": "Status",
                  "type": "string",
                  "description": "The current status of the change set.",
                  "nested_items": []
                },
                {
                  "name": "EntityIdList",
                  "type": "list",
                  "description": "This object is a list of entity IDs (string) that are a part of a change set. The entity ID list is a maximum of 20 entities. It must contain at least one entity.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "FailureCode",
                  "type": "string",
                  "description": "Returned if the change set is in FAILED status. Can be either CLIENT_ERROR, which means that there are issues with the request (see the ErrorDetailList of DescribeChangeSet), or SERVER_FAULT, which means that there is a problem in the system, and you should retry your request.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The value of the next token, if it exists. Null if there are no more results.",
          "nested_items": []
        }
      ]
    }
  ]
}