{
  "method_name": "start_change_set",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/marketplace-catalog/client/start_change_set.html",
  "description": "Allows you to request changes for your entities. Within a single ChangeSet, you can't start the same change type against the same entity multiple times. Additionally, when a ChangeSet is running, all the entities targeted by the different changes are locked until the change set has completed (either succeeded, cancelled, or failed). If you try to start a change set containing a change against an entity that is already locked, you will receive a ResourceInUseException error. For example, you can't start the ChangeSet described in the example later in this topic because it contains two changes to run the same change type ( AddRevisions) against the same entity ( entity-id@1). For more information about working with change sets, see Working with change sets. For information about change types for single-AMI products, see Working with single-AMI products. Also, for more information about change types available for container-based products, see Working with container products. To download 'DetailsDocument' shapes, see Python and Java shapes on GitHub.",
  "parameters": [
    {
      "name": "Catalog",
      "type": "string",
      "required": true,
      "description": "The catalog related to the request. Fixed value: AWSMarketplace.",
      "nested_params": []
    },
    {
      "name": "ChangeSet",
      "type": "list",
      "required": true,
      "description": "Array of change object. (dict) --- An object that contains the ChangeType, Details, and Entity. Change types are single string values that describe your intention for the change. Each change type is unique for each EntityType provided in the change's scope. For more information about change types available for single-AMI products, see Working with single-AMI products. Also, for more information about change types available for container-based products, see Working with container products. The entity to be changed. The type of entity. Identifier (string) --- The identifier for the entity. EntityTags (list) --- The tags associated with the change. (dict) --- A list of objects specifying each key name and value. The key associated with the tag. The value associated with the tag. Details (string) --- This object contains details specific to the change type of the requested change. DetailsDocument (document) --- Alternative field that accepts a JSON value instead of a string for ChangeType details. You can use either Details or DetailsDocument, but not both. To download the 'DetailsDocument' shapes, see the Python and Java shapes on GitHub. ChangeName (string) --- Optional name for the change.",
      "nested_params": [
        {
          "name": "ChangeType",
          "type": "string",
          "required": false,
          "description": "Change types are single string values that describe your intention for the change. Each change type is unique for each EntityType provided in the change's scope. For more information about change types available for single-AMI products, see Working with single-AMI products. Also, for more information about change types available for container-based products, see Working with container products.",
          "nested_params": []
        },
        {
          "name": "Entity",
          "type": "dict",
          "required": false,
          "description": "The entity to be changed.",
          "nested_params": [
            {
              "name": "Type",
              "type": "string",
              "required": false,
              "description": "The type of entity.",
              "nested_params": []
            },
            {
              "name": "Identifier",
              "type": "string",
              "required": false,
              "description": "The identifier for the entity.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "EntityTags",
          "type": "list",
          "required": false,
          "description": "The tags associated with the change.",
          "nested_params": [
            {
              "name": "Key",
              "type": "string",
              "required": false,
              "description": "The key associated with the tag.",
              "nested_params": []
            },
            {
              "name": "Value",
              "type": "string",
              "required": false,
              "description": "The value associated with the tag.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Details",
          "type": "string",
          "required": false,
          "description": "This object contains details specific to the change type of the requested change. For more information about change types available for single-AMI products, see Working with single-AMI products. Also, for more information about change types available for container-based products, see Working with container products.",
          "nested_params": []
        },
        {
          "name": "DetailsDocument",
          "type": "document",
          "required": false,
          "description": "Alternative field that accepts a JSON value instead of a string for ChangeType details. You can use either Details or DetailsDocument, but not both. To download the 'DetailsDocument' shapes, see the Python and Java shapes on GitHub.",
          "nested_params": []
        },
        {
          "name": "ChangeName",
          "type": "string",
          "required": false,
          "description": "Optional name for the change.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ChangeSetName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ClientRequestToken",
      "type": "string",
      "required": false,
      "description": "A unique token to identify the request to ensure idempotency. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "ChangeSetTags",
      "type": "list",
      "required": true,
      "description": "A list of objects specifying each key name and value for the ChangeSetTags property. (dict) --- A list of objects specifying each key name and value. The key associated with the tag. The value associated with the tag.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key associated with the tag.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value associated with the tag.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Intent",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ChangeSetId",
          "type": "string",
          "description": "Unique identifier generated for the request.",
          "nested_items": []
        },
        {
          "name": "ChangeSetArn",
          "type": "string",
          "description": "The ARN associated to the unique identifier generated for the request.",
          "nested_items": []
        }
      ]
    }
  ]
}