{
  "method_name": "create_rule_group",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/waf/client/create_rule_group.html",
  "description": "Creates a RuleGroup. A rule group is a collection of predefined rules that you add to a web ACL. You use  UpdateRuleGroup to add rules to the rule group. Rule groups are subject to the following limits: For more information about how to use the AWS WAF API to allow or block HTTP requests, see the AWS WAF Developer Guide.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "A friendly name or description of the  RuleGroup. You can't change Name after you create a RuleGroup.",
      "nested_params": []
    },
    {
      "name": "MetricName",
      "type": "string",
      "required": true,
      "description": "A friendly name or description for the metrics for this RuleGroup. The name can contain only alphanumeric characters (A-Z, a-z, 0-9), with maximum length 128 and minimum length one. It can't contain whitespace or metric names reserved for AWS WAF, including 'All' and 'Default_Action.' You can't change the name of the metric after you create the RuleGroup.",
      "nested_params": []
    },
    {
      "name": "ChangeToken",
      "type": "string",
      "required": true,
      "description": "The value returned by the most recent call to  GetChangeToken.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "(dict) --- A tag associated with an AWS resource. Tags are key:value pairs that you can use to categorize and manage your resources, for purposes like billing. For example, you might set the tag key to 'customer' and the value to the customer name or ID. You can specify one or more tags to add to each AWS resource, up to 50 tags for a resource. Tagging is only available through the API, SDKs, and CLI. You can't manage or view tags through the AWS WAF Classic console. You can tag the AWS resources that you manage through AWS WAF Classic: web ACLs, rule groups, and rules.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "RuleGroup",
          "type": "dict",
          "description": "An empty  RuleGroup.",
          "nested_items": [
            {
              "name": "RuleGroupId",
              "type": "string",
              "description": "A unique identifier for a RuleGroup. You use RuleGroupId to get more information about a RuleGroup (see  GetRuleGroup), update a RuleGroup (see  UpdateRuleGroup), insert a RuleGroup into a WebACL or delete a one from a WebACL (see  UpdateWebACL), or delete a RuleGroup from AWS WAF (see  DeleteRuleGroup).",
              "nested_items": []
            },
            {
              "name": "Name",
              "type": "string",
              "description": "The friendly name or description for the RuleGroup. You can't change the name of a RuleGroup after you create it.",
              "nested_items": []
            },
            {
              "name": "MetricName",
              "type": "string",
              "description": "A friendly name or description for the metrics for this RuleGroup. The name can contain only alphanumeric characters (A-Z, a-z, 0-9), with maximum length 128 and minimum length one. It can't contain whitespace or metric names reserved for AWS WAF, including 'All' and 'Default_Action.' You can't change the name of the metric after you create the RuleGroup.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "ChangeToken",
          "type": "string",
          "description": "The ChangeToken that you used to submit the CreateRuleGroup request. You can also use this value to query the status of the request. For more information, see  GetChangeTokenStatus.",
          "nested_items": []
        }
      ]
    }
  ]
}