{
  "method_name": "get_rule_group",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/waf/client/get_rule_group.html",
  "description": "Returns the  RuleGroup that is specified by the RuleGroupId that you included in the GetRuleGroup request. To view the rules in a rule group, use  ListActivatedRulesInRuleGroup.",
  "parameters": [
    {
      "name": "RuleGroupId",
      "type": "string",
      "required": true,
      "description": "The RuleGroupId of the  RuleGroup that you want to get. RuleGroupId is returned by  CreateRuleGroup and by  ListRuleGroups.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "RuleGroup",
          "type": "dict",
          "description": "Information about the  RuleGroup that you specified in the GetRuleGroup request.",
          "nested_items": [
            {
              "name": "RuleGroupId",
              "type": "string",
              "description": "A unique identifier for a RuleGroup. You use RuleGroupId to get more information about a RuleGroup (see  GetRuleGroup), update a RuleGroup (see  UpdateRuleGroup), insert a RuleGroup into a WebACL or delete a one from a WebACL (see  UpdateWebACL), or delete a RuleGroup from AWS WAF (see  DeleteRuleGroup).",
              "nested_items": []
            },
            {
              "name": "Name",
              "type": "string",
              "description": "The friendly name or description for the RuleGroup. You can't change the name of a RuleGroup after you create it.",
              "nested_items": []
            },
            {
              "name": "MetricName",
              "type": "string",
              "description": "A friendly name or description for the metrics for this RuleGroup. The name can contain only alphanumeric characters (A-Z, a-z, 0-9), with maximum length 128 and minimum length one. It can't contain whitespace or metric names reserved for AWS WAF, including 'All' and 'Default_Action.' You can't change the name of the metric after you create the RuleGroup.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}