{
  "method_name": "get_regex_match_set",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/waf/client/get_regex_match_set.html",
  "description": "Returns the  RegexMatchSet specified by RegexMatchSetId.",
  "parameters": [
    {
      "name": "RegexMatchSetId",
      "type": "string",
      "required": true,
      "description": "The RegexMatchSetId of the  RegexMatchSet that you want to get. RegexMatchSetId is returned by  CreateRegexMatchSet and by  ListRegexMatchSets.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "RegexMatchSet",
          "type": "dict",
          "description": "Information about the  RegexMatchSet that you specified in the GetRegexMatchSet request. For more information, see  RegexMatchTuple.",
          "nested_items": [
            {
              "name": "RegexMatchSetId",
              "type": "string",
              "description": "The RegexMatchSetId for a RegexMatchSet. You use RegexMatchSetId to get information about a RegexMatchSet (see  GetRegexMatchSet), update a RegexMatchSet (see  UpdateRegexMatchSet), insert a RegexMatchSet into a Rule or delete one from a Rule (see  UpdateRule), and delete a RegexMatchSet from AWS WAF (see  DeleteRegexMatchSet).",
              "nested_items": []
            },
            {
              "name": "Name",
              "type": "string",
              "description": "A friendly name or description of the  RegexMatchSet. You can't change Name after you create a RegexMatchSet.",
              "nested_items": []
            },
            {
              "name": "RegexMatchTuples",
              "type": "list",
              "description": "Contains an array of  RegexMatchTuple objects. Each RegexMatchTuple object contains:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "The part of a web request that you want AWS WAF to inspect, such as a query string or the value of the User-Agent header.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "a regular expression",
                  "description": "The identifier of the pattern (a regular expression) that you want AWS WAF to look for. For more information, see  RegexPatternSet.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Whether to perform any conversions on the request, such as converting it to lowercase, before inspecting it for the specified string.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}