{
  "method_name": "update_regex_pattern_set",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/waf/client/update_regex_pattern_set.html",
  "description": "Inserts or deletes RegexPatternString objects in a  RegexPatternSet. For each RegexPatternString object, you specify the following values: For example, you can create a RegexPatternString such as B[a@]dB[o0]t. AWS WAF will match this RegexPatternString to: To create and configure a RegexPatternSet, perform the following steps: For more information about how to use the AWS WAF API to allow or block HTTP requests, see the AWS WAF Developer Guide.",
  "parameters": [
    {
      "name": "RegexPatternSetId",
      "type": "string",
      "required": true,
      "description": "The RegexPatternSetId of the  RegexPatternSet that you want to update. RegexPatternSetId is returned by  CreateRegexPatternSet and by  ListRegexPatternSets.",
      "nested_params": []
    },
    {
      "name": "Updates",
      "type": "list",
      "required": true,
      "description": "An array of RegexPatternSetUpdate objects that you want to insert into or delete from a  RegexPatternSet. (dict) --- In an  UpdateRegexPatternSet request, RegexPatternSetUpdate specifies whether to insert or delete a RegexPatternString and includes the settings for the RegexPatternString. Specifies whether to insert or delete a RegexPatternString. Specifies the regular expression (regex) pattern that you want AWS WAF to search for, such as B[a@]dB[o0]t.",
      "nested_params": [
        {
          "name": "Action",
          "type": "string",
          "required": false,
          "description": "Specifies whether to insert or delete a RegexPatternString.",
          "nested_params": []
        },
        {
          "name": "RegexPatternString",
          "type": "string",
          "required": false,
          "description": "Specifies the regular expression (regex) pattern that you want AWS WAF to search for, such as B[a@]dB[o0]t.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ChangeToken",
      "type": "string",
      "required": true,
      "description": "The value returned by the most recent call to  GetChangeToken.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ChangeToken",
          "type": "string",
          "description": "The ChangeToken that you used to submit the UpdateRegexPatternSet request. You can also use this value to query the status of the request. For more information, see  GetChangeTokenStatus.",
          "nested_items": []
        }
      ]
    }
  ]
}