{
  "method_name": "update_rule_group",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/waf/client/update_rule_group.html",
  "description": "Inserts or deletes  ActivatedRule objects in a RuleGroup. You can only insert REGULAR rules into a rule group. You can have a maximum of ten rules per rule group. To create and configure a RuleGroup, perform the following steps: If you want to replace one Rule with another, you delete the existing one and add the new one. For more information about how to use the AWS WAF API to allow or block HTTP requests, see the AWS WAF Developer Guide.",
  "parameters": [
    {
      "name": "RuleGroupId",
      "type": "string",
      "required": true,
      "description": "The RuleGroupId of the  RuleGroup that you want to update. RuleGroupId is returned by  CreateRuleGroup and by  ListRuleGroups.",
      "nested_params": []
    },
    {
      "name": "Updates",
      "type": "list",
      "required": true,
      "description": "An array of RuleGroupUpdate objects that you want to insert into or delete from a  RuleGroup. You can only insert REGULAR rules into a rule group. ActivatedRule|OverrideAction applies only when updating or adding a RuleGroup to a WebACL. In this case you do not use ActivatedRule|Action. For all other update requests, ActivatedRule|Action is used instead of ActivatedRule|OverrideAction. (dict) --- Specifies an ActivatedRule and indicates whether you want to add it to a RuleGroup or delete it from a RuleGroup. Specify INSERT to add an ActivatedRule to a RuleGroup. Use DELETE to remove an ActivatedRule from a RuleGroup. The ActivatedRule object specifies a Rule that you want to insert or delete, the priority of the Rule in the WebACL, and the action that you want AWS WAF to take when a web request matches the Rule ( ALLOW, BLOCK, or COUNT). Specifies the order in which the Rules in a WebACL are evaluated. Rules with a lower value for Priority are evaluated before Rules with a higher value. The value must be a unique integer. If you add multiple Rules to a WebACL, the values don't need to be consecutive. The RuleId for a Rule. You use RuleId to get more information about a Rule (see  GetRule), update a Rule (see  UpdateRule), insert a Rule into a WebACL or delete a one from a WebACL (see  UpdateWebACL), or delete a Rule from AWS WAF (see  DeleteRule). RuleId is returned by  CreateRule and by  ListRules. Action (dict) --- Specifies the action that CloudFront or AWS WAF takes when a web request matches the conditions in the Rule. Valid values for Action include the following: ALLOW: CloudFront responds with the requested object. BLOCK: CloudFront responds with an HTTP 403 (Forbidden) status code. COUNT: AWS WAF increments a counter of requests that match the conditions in the rule and then continues to inspect the web request based on the remaining rules in the web ACL. In this case, you do not use ActivatedRule|Action. Specifies how you want AWS WAF to respond to requests that match the settings in a Rule. Valid settings include the following: ALLOW: AWS WAF allows requests BLOCK: AWS WAF blocks requests COUNT: AWS WAF increments a counter of the requests that match all of the conditions in the rule. AWS WAF then continues to inspect the web request based on the remaining rules in the web ACL. You can't specify COUNT for the default action for a WebACL. OverrideAction (dict) --- Use the OverrideAction to test your RuleGroup. Any rule in a RuleGroup can potentially block a request. If you set the OverrideAction to None, the RuleGroup will block a request if any individual rule in the RuleGroup matches the request and is configured to block that request. However if you first want to test the RuleGroup, set the OverrideAction to Count. The RuleGroup will then override any block action specified by individual rules contained within the group. Instead of blocking matching requests, those requests will be counted. You can view a record of counted requests using  GetSampledRequests. COUNT overrides the action specified by the individual rule within a RuleGroup . If set to NONE, the rule's action will take place. Type (string) --- The rule type, either REGULAR, as defined by  Rule, RATE_BASED, as defined by  RateBasedRule, or GROUP, as defined by  RuleGroup. The default is REGULAR. Although this field is optional, be aware that if you try to add a RATE_BASED rule to a web ACL without setting the type, the  UpdateWebACL request will fail because the request tries to add a REGULAR rule with the specified ID, which does not exist. ExcludedRules (list) --- An array of rules to exclude from a rule group. This is applicable only when the ActivatedRule refers to a RuleGroup. Sometimes it is necessary to troubleshoot rule groups that are blocking traffic unexpectedly (false positives). One troubleshooting technique is to identify the specific rule within the rule group that is blocking the legitimate traffic and then disable (exclude) that particular rule. You can exclude rules from both your own rule groups and AWS Marketplace rule groups that have been associated with a web ACL. Specifying ExcludedRules does not remove those rules from the rule group. Rather, it changes the action for the rules to COUNT. Therefore, requests that match an ExcludedRule are counted but not blocked. The RuleGroup owner will receive COUNT metrics for each ExcludedRule. If you want to exclude rules from a rule group that is already associated with a web ACL, perform the following steps: Use the AWS WAF logs to identify the IDs of the rules that you want to exclude. For more information about the logs, see Logging Web ACL Traffic Information. Submit an  UpdateWebACL request that has two actions: The first action deletes the existing rule group from the web ACL. That is, in the  UpdateWebACL request, the first Updates:Action should be DELETE and Updates:ActivatedRule:RuleId should be the rule group that contains the rules that you want to exclude. The second action inserts the same rule group back in, but specifying the rules to exclude. That is, the second Updates:Action should be INSERT, Updates:ActivatedRule:RuleId should be the rule group that you just removed, and ExcludedRules should contain the rules that you want to exclude. (dict) --- The rule to exclude from a rule group. The rule must belong to the RuleGroup that is specified by the ActivatedRule. The unique identifier for the rule to exclude from the rule group.",
      "nested_params": [
        {
          "name": "Action",
          "type": "string",
          "required": false,
          "description": "Specify INSERT to add an ActivatedRule to a RuleGroup. Use DELETE to remove an ActivatedRule from a RuleGroup.",
          "nested_params": []
        },
        {
          "name": "ActivatedRule",
          "type": "dict",
          "required": false,
          "description": "The ActivatedRule object specifies a Rule that you want to insert or delete, the priority of the Rule in the WebACL, and the action that you want AWS WAF to take when a web request matches the Rule ( ALLOW, BLOCK, or COUNT).",
          "nested_params": [
            {
              "name": "Priority",
              "type": "integer",
              "required": false,
              "description": "Specifies the order in which the Rules in a WebACL are evaluated. Rules with a lower value for Priority are evaluated before Rules with a higher value. The value must be a unique integer. If you add multiple Rules to a WebACL, the values don't need to be consecutive.",
              "nested_params": []
            },
            {
              "name": "RuleId",
              "type": "string",
              "required": false,
              "description": "The RuleId for a Rule. You use RuleId to get more information about a Rule (see  GetRule), update a Rule (see  UpdateRule), insert a Rule into a WebACL or delete a one from a WebACL (see  UpdateWebACL), or delete a Rule from AWS WAF (see  DeleteRule). RuleId is returned by  CreateRule and by  ListRules.",
              "nested_params": []
            },
            {
              "name": "Action",
              "type": "dict",
              "required": false,
              "description": "Specifies the action that CloudFront or AWS WAF takes when a web request matches the conditions in the Rule. Valid values for Action include the following:",
              "nested_params": []
            },
            {
              "name": "OverrideAction",
              "type": "dict",
              "required": false,
              "description": "Use the OverrideAction to test your RuleGroup. Any rule in a RuleGroup can potentially block a request. If you set the OverrideAction to None, the RuleGroup will block a request if any individual rule in the RuleGroup matches the request and is configured to block that request. However if you first want to test the RuleGroup, set the OverrideAction to Count. The RuleGroup will then override any block action specified by individual rules contained within the group. Instead of blocking matching requests, those requests will be counted. You can view a record of counted requests using  GetSampledRequests. ActivatedRule|OverrideAction applies only when updating or adding a RuleGroup to a WebACL. In this case you do not use ActivatedRule|Action. For all other update requests, ActivatedRule|Action is used instead of ActivatedRule|OverrideAction.",
              "nested_params": [
                {
                  "name": "Type",
                  "type": "string",
                  "required": false,
                  "description": "COUNT overrides the action specified by the individual rule within a RuleGroup . If set to NONE, the rule's action will take place.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Type",
              "type": "string",
              "required": false,
              "description": "The rule type, either REGULAR, as defined by  Rule, RATE_BASED, as defined by  RateBasedRule, or GROUP, as defined by  RuleGroup. The default is REGULAR. Although this field is optional, be aware that if you try to add a RATE_BASED rule to a web ACL without setting the type, the  UpdateWebACL request will fail because the request tries to add a REGULAR rule with the specified ID, which does not exist.",
              "nested_params": []
            },
            {
              "name": "ExcludedRules",
              "type": "list",
              "required": false,
              "description": "An array of rules to exclude from a rule group. This is applicable only when the ActivatedRule refers to a RuleGroup. Sometimes it is necessary to troubleshoot rule groups that are blocking traffic unexpectedly (false positives). One troubleshooting technique is to identify the specific rule within the rule group that is blocking the legitimate traffic and then disable (exclude) that particular rule. You can exclude rules from both your own rule groups and AWS Marketplace rule groups that have been associated with a web ACL. Specifying ExcludedRules does not remove those rules from the rule group. Rather, it changes the action for the rules to COUNT. Therefore, requests that match an ExcludedRule are counted but not blocked. The RuleGroup owner will receive COUNT metrics for each ExcludedRule. If you want to exclude rules from a rule group that is already associated with a web ACL, perform the following steps:",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "ChangeToken",
      "type": "string",
      "required": true,
      "description": "The value returned by the most recent call to  GetChangeToken.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ChangeToken",
          "type": "string",
          "description": "The ChangeToken that you used to submit the UpdateRuleGroup request. You can also use this value to query the status of the request. For more information, see  GetChangeTokenStatus.",
          "nested_items": []
        }
      ]
    }
  ]
}