{
  "method_name": "update_rule",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/waf/client/update_rule.html",
  "description": "Inserts or deletes  Predicate objects in a Rule. Each Predicate object identifies a predicate, such as a  ByteMatchSet or an  IPSet, that specifies the web requests that you want to allow, block, or count. If you add more than one predicate to a Rule, a request must match all of the specifications to be allowed, blocked, or counted. For example, suppose that you add the following to a Rule: You then add the Rule to a WebACL and specify that you want to block requests that satisfy the Rule. For a request to be blocked, the User-Agent header in the request must contain the value BadBot and the request must originate from the IP address 192.0.2.44. To create and configure a Rule, perform the following steps: If you want to replace one ByteMatchSet or IPSet with another, you delete the existing one and add the new one. For more information about how to use the AWS WAF API to allow or block HTTP requests, see the AWS WAF Developer Guide.",
  "parameters": [
    {
      "name": "RuleId",
      "type": "string",
      "required": true,
      "description": "The RuleId of the Rule that you want to update. RuleId is returned by CreateRule and by  ListRules.",
      "nested_params": []
    },
    {
      "name": "ChangeToken",
      "type": "string",
      "required": true,
      "description": "The value returned by the most recent call to  GetChangeToken.",
      "nested_params": []
    },
    {
      "name": "Updates",
      "type": "list",
      "required": true,
      "description": "An array of RuleUpdate objects that you want to insert into or delete from a  Rule. For more information, see the applicable data types: RuleUpdate: Contains Action and Predicate Predicate: Contains DataId, Negated, and Type FieldToMatch: Contains Data and Type (dict) --- Specifies a Predicate (such as an IPSet) and indicates whether you want to add it to a Rule or delete it from a Rule. Specify INSERT to add a Predicate to a Rule. Use DELETE to remove a Predicate from a Rule. The ID of the Predicate (such as an IPSet) that you want to add to a Rule. Set Negated to False if you want AWS WAF to allow, block, or count requests based on the settings in the specified  ByteMatchSet,  IPSet,  SqlInjectionMatchSet,  XssMatchSet,  RegexMatchSet,  GeoMatchSet, or  SizeConstraintSet. For example, if an IPSet includes the IP address 192.0.2.44, AWS WAF will allow or block requests based on that IP address. Set Negated to True if you want AWS WAF to allow or block a request based on the negation of the settings in the  ByteMatchSet,  IPSet,  SqlInjectionMatchSet,  XssMatchSet,  RegexMatchSet,  GeoMatchSet, or  SizeConstraintSet. For example, if an IPSet includes the IP address 192.0.2.44, AWS WAF will allow, block, or count requests based on all IP addresses except 192.0.2.44. The type of predicate in a Rule, such as ByteMatch or IPSet. A unique identifier for a predicate in a Rule, such as ByteMatchSetId or IPSetId. The ID is returned by the corresponding Create or List command.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ChangeToken",
          "type": "string",
          "description": "The ChangeToken that you used to submit the UpdateRule request. You can also use this value to query the status of the request. For more information, see  GetChangeTokenStatus.",
          "nested_items": []
        }
      ]
    }
  ]
}