{
  "method_name": "create_environment_account_connection",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/proton/client/create_environment_account_connection.html",
  "description": "Create an environment account connection in an environment account so that environment infrastructure resources can be provisioned in the environment account from a management account. An environment account connection is a secure bi-directional connection between a management account and an environment account that maintains authorization and permissions. For more information, see Environment account connections in the Proton User guide.",
  "parameters": [
    {
      "name": "clientToken",
      "type": "string",
      "required": false,
      "description": "When included, if two identical requests are made with the same client token, Proton returns the environment account connection that the first request created. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "codebuildRoleArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "componentRoleArn",
      "type": "string",
      "required": false,
      "description": "The Amazon Resource Name (ARN) of the IAM service role that Proton uses when provisioning directly defined components in the associated environment account. It determines the scope of infrastructure that a component can provision in the account. You must specify componentRoleArn to allow directly defined components to be associated with any environments running in this account. For more information about components, see Proton components in the Proton User Guide.",
      "nested_params": []
    },
    {
      "name": "environmentName",
      "type": "string",
      "required": true,
      "description": "The name of the Proton environment that's created in the associated management account.",
      "nested_params": []
    },
    {
      "name": "managementAccountId",
      "type": "string",
      "required": true,
      "description": "The ID of the management account that accepts or rejects the environment account connection. You create and manage the Proton environment in this account. If the management account accepts the environment account connection, Proton can use the associated IAM role to provision environment infrastructure resources in the associated environment account.",
      "nested_params": []
    },
    {
      "name": "roleArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "list",
      "required": true,
      "description": "An optional list of metadata items that you can associate with the Proton environment account connection. A tag is a key-value pair. For more information, see Proton resources and tagging in the Proton User Guide. (dict) --- A description of a resource tag. The key of the resource tag. The value of the resource tag.",
      "nested_params": [
        {
          "name": "key",
          "type": "string",
          "required": false,
          "description": "The key of the resource tag.",
          "nested_params": []
        },
        {
          "name": "value",
          "type": "string",
          "required": false,
          "description": "The value of the resource tag.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "environmentAccountConnection",
          "type": "dict",
          "description": "The environment account connection detail data that's returned by Proton.",
          "nested_items": [
            {
              "name": "arn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the environment account connection.",
              "nested_items": []
            },
            {
              "name": "codebuildRoleArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of an IAM service role in the environment account. Proton uses this role to provision infrastructure resources using CodeBuild-based provisioning in the associated environment account.",
              "nested_items": []
            },
            {
              "name": "componentRoleArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the IAM service role that Proton uses when provisioning directly defined components in the associated environment account. It determines the scope of infrastructure that a component can provision in the account.",
              "nested_items": []
            },
            {
              "name": "environmentAccountId",
              "type": "string",
              "description": "The environment account that's connected to the environment account connection.",
              "nested_items": []
            },
            {
              "name": "environmentName",
              "type": "string",
              "description": "The name of the environment that's associated with the environment account connection.",
              "nested_items": []
            },
            {
              "name": "id",
              "type": "string",
              "description": "The ID of the environment account connection.",
              "nested_items": []
            },
            {
              "name": "lastModifiedAt",
              "type": "datetime",
              "description": "The time when the environment account connection was last modified.",
              "nested_items": []
            },
            {
              "name": "managementAccountId",
              "type": "string",
              "description": "The ID of the management account that's connected to the environment account connection.",
              "nested_items": []
            },
            {
              "name": "requestedAt",
              "type": "datetime",
              "description": "The time when the environment account connection request was made.",
              "nested_items": []
            },
            {
              "name": "roleArn",
              "type": "string",
              "description": "The IAM service role that's associated with the environment account connection.",
              "nested_items": []
            },
            {
              "name": "status",
              "type": "string",
              "description": "The status of the environment account connection.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}