{
  "method_name": "update_environment",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/proton/client/update_environment.html",
  "description": "Update an environment. If the environment is associated with an environment account connection, don't update or include the protonServiceRoleArn and provisioningRepository parameter to update or connect to an environment account connection. You can only update to a new environment account connection if that connection was created in the same environment account that the current environment account connection was created in. The account connection must also be associated with the current environment. If the environment isn't associated with an environment account connection, don't update or include the environmentAccountConnectionId parameter. You can't update or connect the environment to an environment account connection if it isn't already associated with an environment connection. You can update either the environmentAccountConnectionId or protonServiceRoleArn parameter and value. You can't update both. If the environment was configured for Amazon Web Services-managed provisioning, omit the provisioningRepository parameter. If the environment was configured for self-managed provisioning, specify the provisioningRepository parameter and omit the protonServiceRoleArn and environmentAccountConnectionId parameters. For more information, see Environments and Provisioning methods in the Proton User Guide. There are four modes for updating an environment. The deploymentType field defines the mode. NONE. In this mode, a deployment doesn't occur. Only the requested metadata parameters are updated. CURRENT_VERSION. In this mode, the environment is deployed and updated with the new spec that you provide. Only requested parameters are updated. Don't include minor or major version parameters when you use this deployment-type. MINOR_VERSION. In this mode, the environment is deployed and updated with the published, recommended (latest) minor version of the current major version in use, by default. You can also specify a different minor version of the current major version in use. MAJOR_VERSION. In this mode, the environment is deployed and updated with the published, recommended (latest) major and minor version of the current template, by default. You can also specify a different major version that's higher than the major version in use and a minor version.",
  "parameters": [
    {
      "name": "codebuildRoleArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "componentRoleArn",
      "type": "string",
      "required": false,
      "description": "The Amazon Resource Name (ARN) of the IAM service role that Proton uses when provisioning directly defined components in this environment. It determines the scope of infrastructure that a component can provision. The environment must have a componentRoleArn to allow directly defined components to be associated with the environment. For more information about components, see Proton components in the Proton User Guide.",
      "nested_params": []
    },
    {
      "name": "deploymentType",
      "type": "string",
      "required": true,
      "description": "There are four modes for updating an environment. The deploymentType field defines the mode. NONE In this mode, a deployment doesn't occur. Only the requested metadata parameters are updated. CURRENT_VERSION In this mode, the environment is deployed and updated with the new spec that you provide. Only requested parameters are updated. Don't include major or minor version parameters when you use this deployment-type. MINOR_VERSION In this mode, the environment is deployed and updated with the published, recommended (latest) minor version of the current major version in use, by default. You can also specify a different minor version of the current major version in use. MAJOR_VERSION In this mode, the environment is deployed and updated with the published, recommended (latest) major and minor version of the current template, by default. You can also specify a different major version that is higher than the major version in use and a minor version (optional).",
      "nested_params": []
    },
    {
      "name": "description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "environmentAccountConnectionId",
      "type": "string",
      "required": false,
      "description": "The ID of the environment account connection. You can only update to a new environment account connection if it was created in the same environment account that the current environment account connection was created in and is associated with the current environment.",
      "nested_params": []
    },
    {
      "name": "name",
      "type": "string",
      "required": true,
      "description": "The name of the environment to update.",
      "nested_params": []
    },
    {
      "name": "protonServiceRoleArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "provisioningRepository",
      "type": "dict",
      "required": true,
      "description": "The linked repository that you use to host your rendered infrastructure templates for self-managed provisioning. A linked repository is a repository that has been registered with Proton. For more information, see  CreateRepository. The repository branch. The repository name. The repository provider.",
      "nested_params": [
        {
          "name": "branch",
          "type": "string",
          "required": false,
          "description": "The repository branch.",
          "nested_params": []
        },
        {
          "name": "name",
          "type": "string",
          "required": false,
          "description": "The repository name.",
          "nested_params": []
        },
        {
          "name": "provider",
          "type": "string",
          "required": false,
          "description": "The repository provider.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "spec",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "templateMajorVersion",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "templateMinorVersion",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "environment",
          "type": "dict",
          "description": "The environment detail data that's returned by Proton.",
          "nested_items": [
            {
              "name": "arn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the environment.",
              "nested_items": []
            },
            {
              "name": "codebuildRoleArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the IAM service role that allows Proton to provision infrastructure using CodeBuild-based provisioning on your behalf.",
              "nested_items": []
            },
            {
              "name": "componentRoleArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the IAM service role that Proton uses when provisioning directly defined components in this environment. It determines the scope of infrastructure that a component can provision.",
              "nested_items": []
            },
            {
              "name": "createdAt",
              "type": "datetime",
              "description": "The time when the environment was created.",
              "nested_items": []
            },
            {
              "name": "deploymentStatus",
              "type": "string",
              "description": "The environment deployment status.",
              "nested_items": []
            },
            {
              "name": "deploymentStatusMessage",
              "type": "string",
              "description": "An environment deployment status message.",
              "nested_items": []
            },
            {
              "name": "description",
              "type": "string",
              "description": "The description of the environment.",
              "nested_items": []
            },
            {
              "name": "environmentAccountConnectionId",
              "type": "string",
              "description": "The ID of the environment account connection that's used to provision infrastructure resources in an environment account.",
              "nested_items": []
            },
            {
              "name": "environmentAccountId",
              "type": "string",
              "description": "The ID of the environment account that the environment infrastructure resources are provisioned in.",
              "nested_items": []
            },
            {
              "name": "lastAttemptedDeploymentId",
              "type": "string",
              "description": "The ID of the last attempted deployment of this environment.",
              "nested_items": []
            },
            {
              "name": "lastDeploymentAttemptedAt",
              "type": "datetime",
              "description": "The time when a deployment of the environment was last attempted.",
              "nested_items": []
            },
            {
              "name": "lastDeploymentSucceededAt",
              "type": "datetime",
              "description": "The time when the environment was last deployed successfully.",
              "nested_items": []
            },
            {
              "name": "lastSucceededDeploymentId",
              "type": "string",
              "description": "The ID of the last successful deployment of this environment.",
              "nested_items": []
            },
            {
              "name": "name",
              "type": "string",
              "description": "The name of the environment.",
              "nested_items": []
            },
            {
              "name": "protonServiceRoleArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the Proton service role that allows Proton to make calls to other services on your behalf.",
              "nested_items": []
            },
            {
              "name": "provisioning",
              "type": "string",
              "description": "When included, indicates that the environment template is for customer provisioned and managed infrastructure.",
              "nested_items": []
            },
            {
              "name": "provisioningRepository",
              "type": "dict",
              "description": "The linked repository that you use to host your rendered infrastructure templates for self-managed provisioning. A linked repository is a repository that has been registered with Proton. For more information, see CreateRepository.",
              "nested_items": [
                {
                  "name": "arn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the linked repository.",
                  "nested_items": []
                },
                {
                  "name": "branch",
                  "type": "string",
                  "description": "The repository branch.",
                  "nested_items": []
                },
                {
                  "name": "name",
                  "type": "string",
                  "description": "The repository name.",
                  "nested_items": []
                },
                {
                  "name": "provider",
                  "type": "string",
                  "description": "The repository provider.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "spec",
              "type": "string",
              "description": "The environment spec.",
              "nested_items": []
            },
            {
              "name": "templateMajorVersion",
              "type": "string",
              "description": "The major version of the environment template.",
              "nested_items": []
            },
            {
              "name": "templateMinorVersion",
              "type": "string",
              "description": "The minor version of the environment template.",
              "nested_items": []
            },
            {
              "name": "templateName",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the environment template.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}