{
  "method_name": "update_environment_account_connection",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/proton/client/update_environment_account_connection.html",
  "description": "In an environment account, update an environment account connection to use a new IAM role. For more information, see Environment account connections in the Proton User guide.",
  "parameters": [
    {
      "name": "codebuildRoleArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "componentRoleArn",
      "type": "string",
      "required": false,
      "description": "The Amazon Resource Name (ARN) of the IAM service role that Proton uses when provisioning directly defined components in the associated environment account. It determines the scope of infrastructure that a component can provision in the account. The environment account connection must have a componentRoleArn to allow directly defined components to be associated with any environments running in the account. For more information about components, see Proton components in the Proton User Guide.",
      "nested_params": []
    },
    {
      "name": "id",
      "type": "string",
      "required": true,
      "description": "The ID of the environment account connection to update.",
      "nested_params": []
    },
    {
      "name": "roleArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "environmentAccountConnection",
          "type": "dict",
          "description": "The environment account connection detail data that's returned by Proton.",
          "nested_items": [
            {
              "name": "arn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the environment account connection.",
              "nested_items": []
            },
            {
              "name": "codebuildRoleArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of an IAM service role in the environment account. Proton uses this role to provision infrastructure resources using CodeBuild-based provisioning in the associated environment account.",
              "nested_items": []
            },
            {
              "name": "componentRoleArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the IAM service role that Proton uses when provisioning directly defined components in the associated environment account. It determines the scope of infrastructure that a component can provision in the account.",
              "nested_items": []
            },
            {
              "name": "environmentAccountId",
              "type": "string",
              "description": "The environment account that's connected to the environment account connection.",
              "nested_items": []
            },
            {
              "name": "environmentName",
              "type": "string",
              "description": "The name of the environment that's associated with the environment account connection.",
              "nested_items": []
            },
            {
              "name": "id",
              "type": "string",
              "description": "The ID of the environment account connection.",
              "nested_items": []
            },
            {
              "name": "lastModifiedAt",
              "type": "datetime",
              "description": "The time when the environment account connection was last modified.",
              "nested_items": []
            },
            {
              "name": "managementAccountId",
              "type": "string",
              "description": "The ID of the management account that's connected to the environment account connection.",
              "nested_items": []
            },
            {
              "name": "requestedAt",
              "type": "datetime",
              "description": "The time when the environment account connection request was made.",
              "nested_items": []
            },
            {
              "name": "roleArn",
              "type": "string",
              "description": "The IAM service role that's associated with the environment account connection.",
              "nested_items": []
            },
            {
              "name": "status",
              "type": "string",
              "description": "The status of the environment account connection.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}