{
  "method_name": "create_template",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/pca-connector-ad/client/create_template.html",
  "description": "Creates an Active Directory compatible certificate template. The connectors issues certificates using these templates based on the requester's Active Directory group membership.",
  "parameters": [
    {
      "name": "ClientToken",
      "type": "string",
      "required": false,
      "description": "Idempotency token. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "ConnectorArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) that was returned when you called CreateConnector.",
      "nested_params": []
    },
    {
      "name": "Definition",
      "type": "dict",
      "required": true,
      "description": "Template configuration to define the information included in certificates. Define certificate validity and renewal periods, certificate request handling and enrollment options, key usage extensions, application policies, and cryptography settings. TemplateV2 (dict) --- Template configuration to define the information included in certificates. Certificate validity describes the validity and renewal periods of a certificate. Renewal period is the period of time before certificate expiration when a new certificate will be requested. The numeric value for the validity period. The unit of time. You can select hours, days, weeks, months, and years. Information describing the end of the validity period of the certificate. This parameter sets the 'Not After' date for the certificate. Certificate validity is the period of time during which a certificate is valid. Validity can be expressed as an explicit date and time when the certificate expires, or as a span of time after issuance, stated in days, months, or years. For more information, see Validity in RFC 5280. This value is unaffected when ValidityNotBefore is also specified. For example, if Validity is set to 20 days in the future, the certificate will expire 20 days from issuance time regardless of the ValidityNotBefore value. Enrollment flags describe the enrollment settings for certificates such as using the existing private key and deleting expired or revoked certificates. EnableKeyReuseOnNtTokenKeysetStorageFull (boolean) --- Allow renewal using the same key. IncludeSymmetricAlgorithms (boolean) --- Include symmetric algorithms allowed by the subject. NoSecurityExtension (boolean) --- This flag instructs the CA to not include the security extension szOID_NTDS_CA_SECURITY_EXT (OID:1.3.6.1.4.1.311.25.2), as specified in [MS-WCCE] sections 2.2.2.7.7.4 and 3.2.2.6.2.1.4.5.9, in the issued certificate. This addresses a Windows Kerberos elevation-of-privilege vulnerability. RemoveInvalidCertificateFromPersonalStore (boolean) --- Delete expired or revoked certificates instead of archiving them. UserInteractionRequired (boolean) --- Require user interaction when the subject is enrolled and the private key associated with the certificate is used. Extensions describe the key usage extensions and application policies for a template. ApplicationPolicies (dict) --- Application policies specify what the certificate is used for and its purpose. Critical (boolean) --- Marks the application policy extension as critical. Application policies describe what the certificate can be used for. (dict) --- Application policies describe what the certificate can be used for. PolicyObjectIdentifier (string) --- The object identifier (OID) of an application policy. PolicyType (string) --- The type of application policy The key usage extension defines the purpose (e.g., encipherment, signature, certificate signing) of the key contained in the certificate. Critical (boolean) --- Sets the key usage extension to critical. The key usage flags represent the purpose (e.g., encipherment, signature) of the key contained in the certificate. DataEncipherment (boolean) --- DataEncipherment is asserted when the subject public key is used for directly enciphering raw user data without the use of an intermediate symmetric cipher. DigitalSignature (boolean) --- The digitalSignature is asserted when the subject public key is used for verifying digital signatures. KeyAgreement (boolean) --- KeyAgreement is asserted when the subject public key is used for key agreement. KeyEncipherment (boolean) --- KeyEncipherment is asserted when the subject public key is used for enciphering private or secret keys, i.e., for key transport. NonRepudiation (boolean) --- NonRepudiation is asserted when the subject public key is used to verify digital signatures. General flags describe whether the template is used for computers or users and if the template can be used with autoenrollment. AutoEnrollment (boolean) --- Allows certificate issuance using autoenrollment. Set to TRUE to allow autoenrollment. MachineType (boolean) --- Defines if the template is for machines or users. Set to TRUE if the template is for machines. Set to FALSE if the template is for users. Private key attributes allow you to specify the minimal key length, key spec, and cryptographic providers for the private key of a certificate for v2 templates. V2 templates allow you to use Legacy Cryptographic Service Providers. CryptoProviders (list) --- Defines the cryptographic providers used to generate the private key. (string) --- Defines the purpose of the private key. Set it to 'KEY_EXCHANGE' or 'SIGNATURE' value. Set the minimum key length of the private key. Private key flags for v2 templates specify the client compatibility, if the private key can be exported, and if user input is required when using a private key. Defines the minimum client compatibility. ExportableKey (boolean) --- Allows the private key to be exported. StrongKeyProtectionRequired (boolean) --- Require user input when using the private key for enrollment. Subject name flags describe the subject name and subject alternate name that is included in a certificate. RequireCommonName (boolean) --- Include the common name in the subject name. RequireDirectoryPath (boolean) --- Include the directory path in the subject name. RequireDnsAsCn (boolean) --- Include the DNS as common name in the subject name. RequireEmail (boolean) --- Include the subject's email in the subject name. SanRequireDirectoryGuid (boolean) --- Include the globally unique identifier (GUID) in the subject alternate name. SanRequireDns (boolean) --- Include the DNS in the subject alternate name. SanRequireDomainDns (boolean) --- Include the domain DNS in the subject alternate name. SanRequireEmail (boolean) --- Include the subject's email in the subject alternate name. SanRequireSpn (boolean) --- Include the service principal name (SPN) in the subject alternate name. SanRequireUpn (boolean) --- Include the user principal name (UPN) in the subject alternate name. SupersededTemplates (list) --- List of templates in Active Directory that are superseded by this template. (string) --- TemplateV3 (dict) --- Template configuration to define the information included in certificates. Set to FALSE if the template is for users Specifies the hash algorithm used to hash the private key. Private key attributes allow you to specify the algorithm, minimal key length, key spec, key usage, and cryptographic providers for the private key of a certificate for v3 templates. V3 templates allow you to use Key Storage Providers. Defines the algorithm used to generate the private key. The key usage property defines the purpose of the private key contained in the certificate. You can specify specific purposes using property flags or all by using property type ALL. PropertyFlags (dict) --- You can specify key usage for encryption, key agreement, and signature. You can use property flags or property type but not both. Decrypt (boolean) --- Allows key for encryption and decryption. KeyAgreement (boolean) --- Allows key exchange without encryption. Sign (boolean) --- Allow key use for digital signature. PropertyType (string) --- You can specify all key usages using property type ALL. You can use property type or property flags but not both. Private key flags for v3 templates specify the client compatibility, if the private key can be exported, if user input is required when using a private key, and if an alternate signature algorithm should be used. RequireAlternateSignatureAlgorithm (boolean) --- Reguires the PKCS #1 v2.1 signature format for certificates. You should verify that your CA, objects, and applications can accept this signature format. StrongKeyProtectionRequired (boolean) --- Requirer user input when using the private key for enrollment. (string) --- TemplateV4 (dict) --- Template configuration to define the information included in certificates. Enrollment flags describe the enrollment settings for certificates using the existing private key and deleting expired or revoked certificates. PolicyType (string) --- The type of application policy The key usage extension defines the purpose (e.g., encipherment, signature) of the key contained in the certificate. Set to FALSE if the template is for users HashAlgorithm (string) --- Specifies the hash algorithm used to hash the private key. Hash algorithm can only be specified when using Key Storage Providers. Private key attributes allow you to specify the minimal key length, key spec, key usage, and cryptographic providers for the private key of a certificate for v4 templates. V4 templates allow you to use either Key Storage Providers or Legacy Cryptographic Service Providers. You specify the cryptography provider category in private key flags. Algorithm (string) --- Defines the algorithm used to generate the private key. KeyUsageProperty (dict) --- The key usage property defines the purpose of the private key contained in the certificate. Private key flags for v4 templates specify the client compatibility, if the private key can be exported, if user input is required when using a private key, if an alternate signature algorithm should be used, and if certificates are renewed using the same private key. RequireAlternateSignatureAlgorithm (boolean) --- Requires the PKCS #1 v2.1 signature format for certificates. RequireSameKeyRenewal (boolean) --- Renew certificate using the same private key. UseLegacyProvider (boolean) --- Specifies the cryptographic service provider category used to generate private keys. Set to TRUE to use Legacy Cryptographic Service Providers and FALSE to use Key Storage Providers. (string) ---",
      "nested_params": [
        {
          "name": "TemplateV2",
          "type": "dict",
          "required": false,
          "description": "Template configuration to define the information included in certificates. Define certificate validity and renewal periods, certificate request handling and enrollment options, key usage extensions, application policies, and cryptography settings.",
          "nested_params": [
            {
              "name": "CertificateValidity",
              "type": "dict",
              "required": false,
              "description": "Certificate validity describes the validity and renewal periods of a certificate.",
              "nested_params": [
                {
                  "name": "RenewalPeriod",
                  "type": "dict",
                  "required": false,
                  "description": "Renewal period is the period of time before certificate expiration when a new certificate will be requested.",
                  "nested_params": [
                    {
                      "name": "Period",
                      "type": "integer",
                      "required": false,
                      "description": "The numeric value for the validity period.",
                      "nested_params": []
                    },
                    {
                      "name": "PeriodType",
                      "type": "string",
                      "required": false,
                      "description": "The unit of time. You can select hours, days, weeks, months, and years.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "ValidityPeriod",
                  "type": "dict",
                  "required": false,
                  "description": "Information describing the end of the validity period of the certificate. This parameter sets the 'Not After' date for the certificate. Certificate validity is the period of time during which a certificate is valid. Validity can be expressed as an explicit date and time when the certificate expires, or as a span of time after issuance, stated in days, months, or years. For more information, see Validity in RFC 5280. This value is unaffected when ValidityNotBefore is also specified. For example, if Validity is set to 20 days in the future, the certificate will expire 20 days from issuance time regardless of the ValidityNotBefore value.",
                  "nested_params": [
                    {
                      "name": "Period",
                      "type": "integer",
                      "required": false,
                      "description": "The numeric value for the validity period.",
                      "nested_params": []
                    },
                    {
                      "name": "PeriodType",
                      "type": "string",
                      "required": false,
                      "description": "The unit of time. You can select hours, days, weeks, months, and years.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "EnrollmentFlags",
              "type": "dict",
              "required": false,
              "description": "Enrollment flags describe the enrollment settings for certificates such as using the existing private key and deleting expired or revoked certificates.",
              "nested_params": [
                {
                  "name": "EnableKeyReuseOnNtTokenKeysetStorageFull",
                  "type": "boolean",
                  "required": false,
                  "description": "Allow renewal using the same key.",
                  "nested_params": []
                },
                {
                  "name": "IncludeSymmetricAlgorithms",
                  "type": "boolean",
                  "required": false,
                  "description": "Include symmetric algorithms allowed by the subject.",
                  "nested_params": []
                },
                {
                  "name": "NoSecurityExtension",
                  "type": "boolean",
                  "required": false,
                  "description": "This flag instructs the CA to not include the security extension szOID_NTDS_CA_SECURITY_EXT (OID:1.3.6.1.4.1.311.25.2), as specified in [MS-WCCE] sections 2.2.2.7.7.4 and 3.2.2.6.2.1.4.5.9, in the issued certificate. This addresses a Windows Kerberos elevation-of-privilege vulnerability.",
                  "nested_params": []
                },
                {
                  "name": "RemoveInvalidCertificateFromPersonalStore",
                  "type": "boolean",
                  "required": false,
                  "description": "Delete expired or revoked certificates instead of archiving them.",
                  "nested_params": []
                },
                {
                  "name": "UserInteractionRequired",
                  "type": "boolean",
                  "required": false,
                  "description": "Require user interaction when the subject is enrolled and the private key associated with the certificate is used.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Extensions",
              "type": "dict",
              "required": false,
              "description": "Extensions describe the key usage extensions and application policies for a template.",
              "nested_params": [
                {
                  "name": "ApplicationPolicies",
                  "type": "dict",
                  "required": false,
                  "description": "Application policies specify what the certificate is used for and its purpose.",
                  "nested_params": [
                    {
                      "name": "Critical",
                      "type": "boolean",
                      "required": false,
                      "description": "Marks the application policy extension as critical.",
                      "nested_params": []
                    },
                    {
                      "name": "Policies",
                      "type": "list",
                      "required": false,
                      "description": "Application policies describe what the certificate can be used for.",
                      "nested_params": [
                        {
                          "name": "PolicyObjectIdentifier",
                          "type": "string",
                          "required": false,
                          "description": "The object identifier (OID) of an application policy.",
                          "nested_params": []
                        },
                        {
                          "name": "PolicyType",
                          "type": "string",
                          "required": false,
                          "description": "The type of application policy.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "KeyUsage",
                  "type": "dict",
                  "required": false,
                  "description": "The key usage extension defines the purpose (e.g., encipherment, signature, certificate signing) of the key contained in the certificate.",
                  "nested_params": [
                    {
                      "name": "Critical",
                      "type": "boolean",
                      "required": false,
                      "description": "Sets the key usage extension to critical.",
                      "nested_params": []
                    },
                    {
                      "name": "UsageFlags",
                      "type": "dict",
                      "required": false,
                      "description": "The key usage flags represent the purpose (e.g., encipherment, signature) of the key contained in the certificate.",
                      "nested_params": [
                        {
                          "name": "DataEncipherment",
                          "type": "boolean",
                          "required": false,
                          "description": "DataEncipherment is asserted when the subject public key is used for directly enciphering raw user data without the use of an intermediate symmetric cipher.",
                          "nested_params": []
                        },
                        {
                          "name": "DigitalSignature",
                          "type": "boolean",
                          "required": false,
                          "description": "The digitalSignature is asserted when the subject public key is used for verifying digital signatures.",
                          "nested_params": []
                        },
                        {
                          "name": "KeyAgreement",
                          "type": "boolean",
                          "required": false,
                          "description": "KeyAgreement is asserted when the subject public key is used for key agreement.",
                          "nested_params": []
                        },
                        {
                          "name": "KeyEncipherment",
                          "type": "boolean",
                          "required": false,
                          "description": "KeyEncipherment is asserted when the subject public key is used for enciphering private or secret keys, i.e., for key transport.",
                          "nested_params": []
                        },
                        {
                          "name": "NonRepudiation",
                          "type": "boolean",
                          "required": false,
                          "description": "NonRepudiation is asserted when the subject public key is used to verify digital signatures.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "GeneralFlags",
              "type": "dict",
              "required": false,
              "description": "General flags describe whether the template is used for computers or users and if the template can be used with autoenrollment.",
              "nested_params": [
                {
                  "name": "AutoEnrollment",
                  "type": "boolean",
                  "required": false,
                  "description": "Allows certificate issuance using autoenrollment. Set to TRUE to allow autoenrollment.",
                  "nested_params": []
                },
                {
                  "name": "MachineType",
                  "type": "boolean",
                  "required": false,
                  "description": "Defines if the template is for machines or users. Set to TRUE if the template is for machines. Set to FALSE if the template is for users.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "PrivateKeyAttributes",
              "type": "dict",
              "required": false,
              "description": "Private key attributes allow you to specify the minimal key length, key spec, and cryptographic providers for the private key of a certificate for v2 templates. V2 templates allow you to use Legacy Cryptographic Service Providers.",
              "nested_params": [
                {
                  "name": "CryptoProviders",
                  "type": "list",
                  "required": false,
                  "description": "Defines the cryptographic providers used to generate the private key.",
                  "nested_params": []
                },
                {
                  "name": "KeySpec",
                  "type": "string",
                  "required": false,
                  "description": "Defines the purpose of the private key. Set it to 'KEY_EXCHANGE' or 'SIGNATURE' value.",
                  "nested_params": []
                },
                {
                  "name": "MinimalKeyLength",
                  "type": "integer",
                  "required": false,
                  "description": "Set the minimum key length of the private key.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "PrivateKeyFlags",
              "type": "dict",
              "required": false,
              "description": "Private key flags for v2 templates specify the client compatibility, if the private key can be exported, and if user input is required when using a private key.",
              "nested_params": [
                {
                  "name": "ClientVersion",
                  "type": "string",
                  "required": false,
                  "description": "Defines the minimum client compatibility.",
                  "nested_params": []
                },
                {
                  "name": "ExportableKey",
                  "type": "boolean",
                  "required": false,
                  "description": "Allows the private key to be exported.",
                  "nested_params": []
                },
                {
                  "name": "StrongKeyProtectionRequired",
                  "type": "boolean",
                  "required": false,
                  "description": "Require user input when using the private key for enrollment.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "SubjectNameFlags",
              "type": "dict",
              "required": false,
              "description": "Subject name flags describe the subject name and subject alternate name that is included in a certificate.",
              "nested_params": [
                {
                  "name": "RequireCommonName",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the common name in the subject name.",
                  "nested_params": []
                },
                {
                  "name": "RequireDirectoryPath",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the directory path in the subject name.",
                  "nested_params": []
                },
                {
                  "name": "RequireDnsAsCn",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the DNS as common name in the subject name.",
                  "nested_params": []
                },
                {
                  "name": "RequireEmail",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the subject's email in the subject name.",
                  "nested_params": []
                },
                {
                  "name": "SanRequireDirectoryGuid",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the globally unique identifier (GUID) in the subject alternate name.",
                  "nested_params": []
                },
                {
                  "name": "SanRequireDns",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the DNS in the subject alternate name.",
                  "nested_params": []
                },
                {
                  "name": "SanRequireDomainDns",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the domain DNS in the subject alternate name.",
                  "nested_params": []
                },
                {
                  "name": "SanRequireEmail",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the subject's email in the subject alternate name.",
                  "nested_params": []
                },
                {
                  "name": "SanRequireSpn",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the service principal name (SPN) in the subject alternate name.",
                  "nested_params": []
                },
                {
                  "name": "SanRequireUpn",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the user principal name (UPN) in the subject alternate name.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "SupersededTemplates",
              "type": "list",
              "required": false,
              "description": "List of templates in Active Directory that are superseded by this template.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "TemplateV3",
          "type": "dict",
          "required": false,
          "description": "Template configuration to define the information included in certificates. Define certificate validity and renewal periods, certificate request handling and enrollment options, key usage extensions, application policies, and cryptography settings.",
          "nested_params": [
            {
              "name": "CertificateValidity",
              "type": "dict",
              "required": false,
              "description": "Certificate validity describes the validity and renewal periods of a certificate.",
              "nested_params": [
                {
                  "name": "RenewalPeriod",
                  "type": "dict",
                  "required": false,
                  "description": "Renewal period is the period of time before certificate expiration when a new certificate will be requested.",
                  "nested_params": [
                    {
                      "name": "Period",
                      "type": "integer",
                      "required": false,
                      "description": "The numeric value for the validity period.",
                      "nested_params": []
                    },
                    {
                      "name": "PeriodType",
                      "type": "string",
                      "required": false,
                      "description": "The unit of time. You can select hours, days, weeks, months, and years.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "ValidityPeriod",
                  "type": "dict",
                  "required": false,
                  "description": "Information describing the end of the validity period of the certificate. This parameter sets the 'Not After' date for the certificate. Certificate validity is the period of time during which a certificate is valid. Validity can be expressed as an explicit date and time when the certificate expires, or as a span of time after issuance, stated in days, months, or years. For more information, see Validity in RFC 5280. This value is unaffected when ValidityNotBefore is also specified. For example, if Validity is set to 20 days in the future, the certificate will expire 20 days from issuance time regardless of the ValidityNotBefore value.",
                  "nested_params": [
                    {
                      "name": "Period",
                      "type": "integer",
                      "required": false,
                      "description": "The numeric value for the validity period.",
                      "nested_params": []
                    },
                    {
                      "name": "PeriodType",
                      "type": "string",
                      "required": false,
                      "description": "The unit of time. You can select hours, days, weeks, months, and years.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "EnrollmentFlags",
              "type": "dict",
              "required": false,
              "description": "Enrollment flags describe the enrollment settings for certificates such as using the existing private key and deleting expired or revoked certificates.",
              "nested_params": [
                {
                  "name": "EnableKeyReuseOnNtTokenKeysetStorageFull",
                  "type": "boolean",
                  "required": false,
                  "description": "Allow renewal using the same key.",
                  "nested_params": []
                },
                {
                  "name": "IncludeSymmetricAlgorithms",
                  "type": "boolean",
                  "required": false,
                  "description": "Include symmetric algorithms allowed by the subject.",
                  "nested_params": []
                },
                {
                  "name": "NoSecurityExtension",
                  "type": "boolean",
                  "required": false,
                  "description": "This flag instructs the CA to not include the security extension szOID_NTDS_CA_SECURITY_EXT (OID:1.3.6.1.4.1.311.25.2), as specified in [MS-WCCE] sections 2.2.2.7.7.4 and 3.2.2.6.2.1.4.5.9, in the issued certificate. This addresses a Windows Kerberos elevation-of-privilege vulnerability.",
                  "nested_params": []
                },
                {
                  "name": "RemoveInvalidCertificateFromPersonalStore",
                  "type": "boolean",
                  "required": false,
                  "description": "Delete expired or revoked certificates instead of archiving them.",
                  "nested_params": []
                },
                {
                  "name": "UserInteractionRequired",
                  "type": "boolean",
                  "required": false,
                  "description": "Require user interaction when the subject is enrolled and the private key associated with the certificate is used.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Extensions",
              "type": "dict",
              "required": false,
              "description": "Extensions describe the key usage extensions and application policies for a template.",
              "nested_params": [
                {
                  "name": "ApplicationPolicies",
                  "type": "dict",
                  "required": false,
                  "description": "Application policies specify what the certificate is used for and its purpose.",
                  "nested_params": [
                    {
                      "name": "Critical",
                      "type": "boolean",
                      "required": false,
                      "description": "Marks the application policy extension as critical.",
                      "nested_params": []
                    },
                    {
                      "name": "Policies",
                      "type": "list",
                      "required": false,
                      "description": "Application policies describe what the certificate can be used for.",
                      "nested_params": [
                        {
                          "name": "PolicyObjectIdentifier",
                          "type": "string",
                          "required": false,
                          "description": "The object identifier (OID) of an application policy.",
                          "nested_params": []
                        },
                        {
                          "name": "PolicyType",
                          "type": "string",
                          "required": false,
                          "description": "The type of application policy.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "KeyUsage",
                  "type": "dict",
                  "required": false,
                  "description": "The key usage extension defines the purpose (e.g., encipherment, signature, certificate signing) of the key contained in the certificate.",
                  "nested_params": [
                    {
                      "name": "Critical",
                      "type": "boolean",
                      "required": false,
                      "description": "Sets the key usage extension to critical.",
                      "nested_params": []
                    },
                    {
                      "name": "UsageFlags",
                      "type": "dict",
                      "required": false,
                      "description": "The key usage flags represent the purpose (e.g., encipherment, signature) of the key contained in the certificate.",
                      "nested_params": [
                        {
                          "name": "DataEncipherment",
                          "type": "boolean",
                          "required": false,
                          "description": "DataEncipherment is asserted when the subject public key is used for directly enciphering raw user data without the use of an intermediate symmetric cipher.",
                          "nested_params": []
                        },
                        {
                          "name": "DigitalSignature",
                          "type": "boolean",
                          "required": false,
                          "description": "The digitalSignature is asserted when the subject public key is used for verifying digital signatures.",
                          "nested_params": []
                        },
                        {
                          "name": "KeyAgreement",
                          "type": "boolean",
                          "required": false,
                          "description": "KeyAgreement is asserted when the subject public key is used for key agreement.",
                          "nested_params": []
                        },
                        {
                          "name": "KeyEncipherment",
                          "type": "boolean",
                          "required": false,
                          "description": "KeyEncipherment is asserted when the subject public key is used for enciphering private or secret keys, i.e., for key transport.",
                          "nested_params": []
                        },
                        {
                          "name": "NonRepudiation",
                          "type": "boolean",
                          "required": false,
                          "description": "NonRepudiation is asserted when the subject public key is used to verify digital signatures.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "GeneralFlags",
              "type": "dict",
              "required": false,
              "description": "General flags describe whether the template is used for computers or users and if the template can be used with autoenrollment.",
              "nested_params": [
                {
                  "name": "AutoEnrollment",
                  "type": "boolean",
                  "required": false,
                  "description": "Allows certificate issuance using autoenrollment. Set to TRUE to allow autoenrollment.",
                  "nested_params": []
                },
                {
                  "name": "MachineType",
                  "type": "boolean",
                  "required": false,
                  "description": "Defines if the template is for machines or users. Set to TRUE if the template is for machines. Set to FALSE if the template is for users.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "HashAlgorithm",
              "type": "string",
              "required": false,
              "description": "Specifies the hash algorithm used to hash the private key.",
              "nested_params": []
            },
            {
              "name": "PrivateKeyAttributes",
              "type": "dict",
              "required": false,
              "description": "Private key attributes allow you to specify the algorithm, minimal key length, key spec, key usage, and cryptographic providers for the private key of a certificate for v3 templates. V3 templates allow you to use Key Storage Providers.",
              "nested_params": [
                {
                  "name": "Algorithm",
                  "type": "string",
                  "required": false,
                  "description": "Defines the algorithm used to generate the private key.",
                  "nested_params": []
                },
                {
                  "name": "CryptoProviders",
                  "type": "list",
                  "required": false,
                  "description": "Defines the cryptographic providers used to generate the private key.",
                  "nested_params": []
                },
                {
                  "name": "KeySpec",
                  "type": "string",
                  "required": false,
                  "description": "Defines the purpose of the private key. Set it to 'KEY_EXCHANGE' or 'SIGNATURE' value.",
                  "nested_params": []
                },
                {
                  "name": "KeyUsageProperty",
                  "type": "dict",
                  "required": false,
                  "description": "The key usage property defines the purpose of the private key contained in the certificate. You can specify specific purposes using property flags or all by using property type ALL.",
                  "nested_params": [
                    {
                      "name": "PropertyFlags",
                      "type": "dict",
                      "required": false,
                      "description": "You can specify key usage for encryption, key agreement, and signature. You can use property flags or property type but not both.",
                      "nested_params": [
                        {
                          "name": "Decrypt",
                          "type": "boolean",
                          "required": false,
                          "description": "Allows key for encryption and decryption.",
                          "nested_params": []
                        },
                        {
                          "name": "KeyAgreement",
                          "type": "boolean",
                          "required": false,
                          "description": "Allows key exchange without encryption.",
                          "nested_params": []
                        },
                        {
                          "name": "Sign",
                          "type": "boolean",
                          "required": false,
                          "description": "Allow key use for digital signature.",
                          "nested_params": []
                        }
                      ]
                    },
                    {
                      "name": "PropertyType",
                      "type": "string",
                      "required": false,
                      "description": "You can specify all key usages using property type ALL. You can use property type or property flags but not both.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "MinimalKeyLength",
                  "type": "integer",
                  "required": false,
                  "description": "Set the minimum key length of the private key.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "PrivateKeyFlags",
              "type": "dict",
              "required": false,
              "description": "Private key flags for v3 templates specify the client compatibility, if the private key can be exported, if user input is required when using a private key, and if an alternate signature algorithm should be used.",
              "nested_params": [
                {
                  "name": "ClientVersion",
                  "type": "string",
                  "required": false,
                  "description": "Defines the minimum client compatibility.",
                  "nested_params": []
                },
                {
                  "name": "ExportableKey",
                  "type": "boolean",
                  "required": false,
                  "description": "Allows the private key to be exported.",
                  "nested_params": []
                },
                {
                  "name": "RequireAlternateSignatureAlgorithm",
                  "type": "boolean",
                  "required": false,
                  "description": "Reguires the PKCS #1 v2.1 signature format for certificates. You should verify that your CA, objects, and applications can accept this signature format.",
                  "nested_params": []
                },
                {
                  "name": "StrongKeyProtectionRequired",
                  "type": "boolean",
                  "required": false,
                  "description": "Requirer user input when using the private key for enrollment.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "SubjectNameFlags",
              "type": "dict",
              "required": false,
              "description": "Subject name flags describe the subject name and subject alternate name that is included in a certificate.",
              "nested_params": [
                {
                  "name": "RequireCommonName",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the common name in the subject name.",
                  "nested_params": []
                },
                {
                  "name": "RequireDirectoryPath",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the directory path in the subject name.",
                  "nested_params": []
                },
                {
                  "name": "RequireDnsAsCn",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the DNS as common name in the subject name.",
                  "nested_params": []
                },
                {
                  "name": "RequireEmail",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the subject's email in the subject name.",
                  "nested_params": []
                },
                {
                  "name": "SanRequireDirectoryGuid",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the globally unique identifier (GUID) in the subject alternate name.",
                  "nested_params": []
                },
                {
                  "name": "SanRequireDns",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the DNS in the subject alternate name.",
                  "nested_params": []
                },
                {
                  "name": "SanRequireDomainDns",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the domain DNS in the subject alternate name.",
                  "nested_params": []
                },
                {
                  "name": "SanRequireEmail",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the subject's email in the subject alternate name.",
                  "nested_params": []
                },
                {
                  "name": "SanRequireSpn",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the service principal name (SPN) in the subject alternate name.",
                  "nested_params": []
                },
                {
                  "name": "SanRequireUpn",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the user principal name (UPN) in the subject alternate name.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "SupersededTemplates",
              "type": "list",
              "required": false,
              "description": "List of templates in Active Directory that are superseded by this template.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "TemplateV4",
          "type": "dict",
          "required": false,
          "description": "Template configuration to define the information included in certificates. Define certificate validity and renewal periods, certificate request handling and enrollment options, key usage extensions, application policies, and cryptography settings.",
          "nested_params": [
            {
              "name": "CertificateValidity",
              "type": "dict",
              "required": false,
              "description": "Certificate validity describes the validity and renewal periods of a certificate.",
              "nested_params": [
                {
                  "name": "RenewalPeriod",
                  "type": "dict",
                  "required": false,
                  "description": "Renewal period is the period of time before certificate expiration when a new certificate will be requested.",
                  "nested_params": [
                    {
                      "name": "Period",
                      "type": "integer",
                      "required": false,
                      "description": "The numeric value for the validity period.",
                      "nested_params": []
                    },
                    {
                      "name": "PeriodType",
                      "type": "string",
                      "required": false,
                      "description": "The unit of time. You can select hours, days, weeks, months, and years.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "ValidityPeriod",
                  "type": "dict",
                  "required": false,
                  "description": "Information describing the end of the validity period of the certificate. This parameter sets the 'Not After' date for the certificate. Certificate validity is the period of time during which a certificate is valid. Validity can be expressed as an explicit date and time when the certificate expires, or as a span of time after issuance, stated in days, months, or years. For more information, see Validity in RFC 5280. This value is unaffected when ValidityNotBefore is also specified. For example, if Validity is set to 20 days in the future, the certificate will expire 20 days from issuance time regardless of the ValidityNotBefore value.",
                  "nested_params": [
                    {
                      "name": "Period",
                      "type": "integer",
                      "required": false,
                      "description": "The numeric value for the validity period.",
                      "nested_params": []
                    },
                    {
                      "name": "PeriodType",
                      "type": "string",
                      "required": false,
                      "description": "The unit of time. You can select hours, days, weeks, months, and years.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "EnrollmentFlags",
              "type": "dict",
              "required": false,
              "description": "Enrollment flags describe the enrollment settings for certificates using the existing private key and deleting expired or revoked certificates.",
              "nested_params": [
                {
                  "name": "EnableKeyReuseOnNtTokenKeysetStorageFull",
                  "type": "boolean",
                  "required": false,
                  "description": "Allow renewal using the same key.",
                  "nested_params": []
                },
                {
                  "name": "IncludeSymmetricAlgorithms",
                  "type": "boolean",
                  "required": false,
                  "description": "Include symmetric algorithms allowed by the subject.",
                  "nested_params": []
                },
                {
                  "name": "NoSecurityExtension",
                  "type": "boolean",
                  "required": false,
                  "description": "This flag instructs the CA to not include the security extension szOID_NTDS_CA_SECURITY_EXT (OID:1.3.6.1.4.1.311.25.2), as specified in [MS-WCCE] sections 2.2.2.7.7.4 and 3.2.2.6.2.1.4.5.9, in the issued certificate. This addresses a Windows Kerberos elevation-of-privilege vulnerability.",
                  "nested_params": []
                },
                {
                  "name": "RemoveInvalidCertificateFromPersonalStore",
                  "type": "boolean",
                  "required": false,
                  "description": "Delete expired or revoked certificates instead of archiving them.",
                  "nested_params": []
                },
                {
                  "name": "UserInteractionRequired",
                  "type": "boolean",
                  "required": false,
                  "description": "Require user interaction when the subject is enrolled and the private key associated with the certificate is used.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "Extensions",
              "type": "dict",
              "required": false,
              "description": "Extensions describe the key usage extensions and application policies for a template.",
              "nested_params": [
                {
                  "name": "ApplicationPolicies",
                  "type": "dict",
                  "required": false,
                  "description": "Application policies specify what the certificate is used for and its purpose.",
                  "nested_params": [
                    {
                      "name": "Critical",
                      "type": "boolean",
                      "required": false,
                      "description": "Marks the application policy extension as critical.",
                      "nested_params": []
                    },
                    {
                      "name": "Policies",
                      "type": "list",
                      "required": false,
                      "description": "Application policies describe what the certificate can be used for.",
                      "nested_params": [
                        {
                          "name": "PolicyObjectIdentifier",
                          "type": "string",
                          "required": false,
                          "description": "The object identifier (OID) of an application policy.",
                          "nested_params": []
                        },
                        {
                          "name": "PolicyType",
                          "type": "string",
                          "required": false,
                          "description": "The type of application policy.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "KeyUsage",
                  "type": "dict",
                  "required": false,
                  "description": "The key usage extension defines the purpose (e.g., encipherment, signature) of the key contained in the certificate.",
                  "nested_params": [
                    {
                      "name": "Critical",
                      "type": "boolean",
                      "required": false,
                      "description": "Sets the key usage extension to critical.",
                      "nested_params": []
                    },
                    {
                      "name": "UsageFlags",
                      "type": "dict",
                      "required": false,
                      "description": "The key usage flags represent the purpose (e.g., encipherment, signature) of the key contained in the certificate.",
                      "nested_params": [
                        {
                          "name": "DataEncipherment",
                          "type": "boolean",
                          "required": false,
                          "description": "DataEncipherment is asserted when the subject public key is used for directly enciphering raw user data without the use of an intermediate symmetric cipher.",
                          "nested_params": []
                        },
                        {
                          "name": "DigitalSignature",
                          "type": "boolean",
                          "required": false,
                          "description": "The digitalSignature is asserted when the subject public key is used for verifying digital signatures.",
                          "nested_params": []
                        },
                        {
                          "name": "KeyAgreement",
                          "type": "boolean",
                          "required": false,
                          "description": "KeyAgreement is asserted when the subject public key is used for key agreement.",
                          "nested_params": []
                        },
                        {
                          "name": "KeyEncipherment",
                          "type": "boolean",
                          "required": false,
                          "description": "KeyEncipherment is asserted when the subject public key is used for enciphering private or secret keys, i.e., for key transport.",
                          "nested_params": []
                        },
                        {
                          "name": "NonRepudiation",
                          "type": "boolean",
                          "required": false,
                          "description": "NonRepudiation is asserted when the subject public key is used to verify digital signatures.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "GeneralFlags",
              "type": "dict",
              "required": false,
              "description": "General flags describe whether the template is used for computers or users and if the template can be used with autoenrollment.",
              "nested_params": [
                {
                  "name": "AutoEnrollment",
                  "type": "boolean",
                  "required": false,
                  "description": "Allows certificate issuance using autoenrollment. Set to TRUE to allow autoenrollment.",
                  "nested_params": []
                },
                {
                  "name": "MachineType",
                  "type": "boolean",
                  "required": false,
                  "description": "Defines if the template is for machines or users. Set to TRUE if the template is for machines. Set to FALSE if the template is for users.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "HashAlgorithm",
              "type": "string",
              "required": false,
              "description": "Specifies the hash algorithm used to hash the private key. Hash algorithm can only be specified when using Key Storage Providers.",
              "nested_params": []
            },
            {
              "name": "PrivateKeyAttributes",
              "type": "dict",
              "required": false,
              "description": "Private key attributes allow you to specify the minimal key length, key spec, key usage, and cryptographic providers for the private key of a certificate for v4 templates. V4 templates allow you to use either Key Storage Providers or Legacy Cryptographic Service Providers. You specify the cryptography provider category in private key flags.",
              "nested_params": [
                {
                  "name": "Algorithm",
                  "type": "string",
                  "required": false,
                  "description": "Defines the algorithm used to generate the private key.",
                  "nested_params": []
                },
                {
                  "name": "CryptoProviders",
                  "type": "list",
                  "required": false,
                  "description": "Defines the cryptographic providers used to generate the private key.",
                  "nested_params": []
                },
                {
                  "name": "KeySpec",
                  "type": "string",
                  "required": false,
                  "description": "Defines the purpose of the private key. Set it to 'KEY_EXCHANGE' or 'SIGNATURE' value.",
                  "nested_params": []
                },
                {
                  "name": "KeyUsageProperty",
                  "type": "dict",
                  "required": false,
                  "description": "The key usage property defines the purpose of the private key contained in the certificate. You can specify specific purposes using property flags or all by using property type ALL.",
                  "nested_params": [
                    {
                      "name": "PropertyFlags",
                      "type": "dict",
                      "required": false,
                      "description": "You can specify key usage for encryption, key agreement, and signature. You can use property flags or property type but not both.",
                      "nested_params": [
                        {
                          "name": "Decrypt",
                          "type": "boolean",
                          "required": false,
                          "description": "Allows key for encryption and decryption.",
                          "nested_params": []
                        },
                        {
                          "name": "KeyAgreement",
                          "type": "boolean",
                          "required": false,
                          "description": "Allows key exchange without encryption.",
                          "nested_params": []
                        },
                        {
                          "name": "Sign",
                          "type": "boolean",
                          "required": false,
                          "description": "Allow key use for digital signature.",
                          "nested_params": []
                        }
                      ]
                    },
                    {
                      "name": "PropertyType",
                      "type": "string",
                      "required": false,
                      "description": "You can specify all key usages using property type ALL. You can use property type or property flags but not both.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "MinimalKeyLength",
                  "type": "integer",
                  "required": false,
                  "description": "Set the minimum key length of the private key.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "PrivateKeyFlags",
              "type": "dict",
              "required": false,
              "description": "Private key flags for v4 templates specify the client compatibility, if the private key can be exported, if user input is required when using a private key, if an alternate signature algorithm should be used, and if certificates are renewed using the same private key.",
              "nested_params": [
                {
                  "name": "ClientVersion",
                  "type": "string",
                  "required": false,
                  "description": "Defines the minimum client compatibility.",
                  "nested_params": []
                },
                {
                  "name": "ExportableKey",
                  "type": "boolean",
                  "required": false,
                  "description": "Allows the private key to be exported.",
                  "nested_params": []
                },
                {
                  "name": "RequireAlternateSignatureAlgorithm",
                  "type": "boolean",
                  "required": false,
                  "description": "Requires the PKCS #1 v2.1 signature format for certificates. You should verify that your CA, objects, and applications can accept this signature format.",
                  "nested_params": []
                },
                {
                  "name": "RequireSameKeyRenewal",
                  "type": "boolean",
                  "required": false,
                  "description": "Renew certificate using the same private key.",
                  "nested_params": []
                },
                {
                  "name": "StrongKeyProtectionRequired",
                  "type": "boolean",
                  "required": false,
                  "description": "Require user input when using the private key for enrollment.",
                  "nested_params": []
                },
                {
                  "name": "UseLegacyProvider",
                  "type": "boolean",
                  "required": false,
                  "description": "Specifies the cryptographic service provider category used to generate private keys. Set to TRUE to use Legacy Cryptographic Service Providers and FALSE to use Key Storage Providers.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "SubjectNameFlags",
              "type": "dict",
              "required": false,
              "description": "Subject name flags describe the subject name and subject alternate name that is included in a certificate.",
              "nested_params": [
                {
                  "name": "RequireCommonName",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the common name in the subject name.",
                  "nested_params": []
                },
                {
                  "name": "RequireDirectoryPath",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the directory path in the subject name.",
                  "nested_params": []
                },
                {
                  "name": "RequireDnsAsCn",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the DNS as common name in the subject name.",
                  "nested_params": []
                },
                {
                  "name": "RequireEmail",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the subject's email in the subject name.",
                  "nested_params": []
                },
                {
                  "name": "SanRequireDirectoryGuid",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the globally unique identifier (GUID) in the subject alternate name.",
                  "nested_params": []
                },
                {
                  "name": "SanRequireDns",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the DNS in the subject alternate name.",
                  "nested_params": []
                },
                {
                  "name": "SanRequireDomainDns",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the domain DNS in the subject alternate name.",
                  "nested_params": []
                },
                {
                  "name": "SanRequireEmail",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the subject's email in the subject alternate name.",
                  "nested_params": []
                },
                {
                  "name": "SanRequireSpn",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the service principal name (SPN) in the subject alternate name.",
                  "nested_params": []
                },
                {
                  "name": "SanRequireUpn",
                  "type": "boolean",
                  "required": false,
                  "description": "Include the user principal name (UPN) in the subject alternate name.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "SupersededTemplates",
              "type": "list",
              "required": false,
              "description": "List of templates in Active Directory that are superseded by this template.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "Name of the template. The template name must be unique.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "dict",
      "required": false,
      "description": "Metadata assigned to a template consisting of a key-value pair. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "TemplateArn",
          "type": "string",
          "description": "If successful, the Amazon Resource Name (ARN) of the template.",
          "nested_items": []
        }
      ]
    }
  ]
}