{
  "method_name": "create_backup",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/opsworkscm/client/create_backup.html",
  "description": "Creates an application-level backup of a server. While the server is in the BACKING_UP state, the server cannot be changed, and no additional backup can be created. Backups can be created for servers in RUNNING, HEALTHY, and UNHEALTHY states. By default, you can create a maximum of 50 manual backups. This operation is asynchronous. A LimitExceededException is thrown when the maximum number of manual backups is reached. An InvalidStateException is thrown when the server is not in any of the following states: RUNNING, HEALTHY, or UNHEALTHY. A ResourceNotFoundException is thrown when the server is not found. A ValidationException is thrown when parameters of the request are not valid.",
  "parameters": [
    {
      "name": "ServerName",
      "type": "string",
      "required": true,
      "description": "The name of the server that you want to back up.",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "A map that contains tag keys and tag values to attach to an OpsWorks CM server backup. The key cannot be empty. The key can be a maximum of 127 characters, and can contain only Unicode letters, numbers, or separators, or the following special characters: + - = . _ : / The value can be a maximum 255 characters, and contain only Unicode letters, numbers, or separators, or the following special characters: + - = . _ : / Leading and trailing white spaces are trimmed from both the key and value. A maximum of 50 user-applied tags is allowed for tag-supported OpsWorks CM resources. (dict) --- A map that contains tag keys and tag values to attach to an OpsWorks for Chef Automate or OpsWorks for Puppet Enterprise server. Leading and trailing spaces are trimmed from both the key and value. A tag key, such as Stage or Name. A tag key cannot be empty. _ : / An optional tag value, such as Production or test-owcm-server. The value can be a maximum of 255 characters, and contain only Unicode letters, numbers, or separators, or the following special characters: + - = . _ : /",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "BackupArn",
              "type": "string",
              "description": "The ARN of the backup.",
              "nested_items": []
            },
            {
              "name": "BackupId",
              "type": "string",
              "description": "The generated ID of the backup. Example: myServerName-yyyyMMddHHmmssSSS.",
              "nested_items": []
            },
            {
              "name": "BackupType",
              "type": "string",
              "description": "The backup type. Valid values are automated or manual.",
              "nested_items": []
            },
            {
              "name": "CreatedAt",
              "type": "datetime",
              "description": "The time stamp when the backup was created in the database. Example: 2016-07-29T13:38:47.520Z.",
              "nested_items": []
            },
            {
              "name": "Description",
              "type": "string",
              "description": "A user-provided description for a manual backup. This field is empty for automated backups.",
              "nested_items": []
            },
            {
              "name": "Engine",
              "type": "string",
              "description": "The engine type that is obtained from the server when the backup is created.",
              "nested_items": []
            },
            {
              "name": "EngineModel",
              "type": "string",
              "description": "The engine model that is obtained from the server when the backup is created.",
              "nested_items": []
            },
            {
              "name": "EngineVersion",
              "type": "string",
              "description": "The engine version that is obtained from the server when the backup is created.",
              "nested_items": []
            },
            {
              "name": "InstanceProfileArn",
              "type": "string",
              "description": "The EC2 instance profile ARN that is obtained from the server when the backup is created. Because this value is stored, you are not required to provide the InstanceProfileArn again if you restore a backup.",
              "nested_items": []
            },
            {
              "name": "InstanceType",
              "type": "string",
              "description": "The instance type that is obtained from the server when the backup is created.",
              "nested_items": []
            },
            {
              "name": "KeyPair",
              "type": "string",
              "description": "The key pair that is obtained from the server when the backup is created.",
              "nested_items": []
            },
            {
              "name": "PreferredBackupWindow",
              "type": "string",
              "description": "The preferred backup period that is obtained from the server when the backup is created.",
              "nested_items": []
            },
            {
              "name": "PreferredMaintenanceWindow",
              "type": "string",
              "description": "The preferred maintenance period that is obtained from the server when the backup is created.",
              "nested_items": []
            },
            {
              "name": "S3DataSize",
              "type": "integer",
              "description": "This field is deprecated and is no longer used.",
              "nested_items": []
            },
            {
              "name": "S3DataUrl",
              "type": "string",
              "description": "This field is deprecated and is no longer used.",
              "nested_items": []
            },
            {
              "name": "S3LogUrl",
              "type": "string",
              "description": "The Amazon S3 URL of the backup's log file.",
              "nested_items": []
            },
            {
              "name": "SecurityGroupIds",
              "type": "list",
              "description": "The security group IDs that are obtained from the server when the backup is created.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "ServerName",
              "type": "string",
              "description": "The name of the server from which the backup was made.",
              "nested_items": []
            },
            {
              "name": "ServiceRoleArn",
              "type": "string",
              "description": "The service role ARN that is obtained from the server when the backup is created.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The status of a backup while in progress.",
              "nested_items": []
            },
            {
              "name": "StatusDescription",
              "type": "string",
              "description": "An informational message about backup status.",
              "nested_items": []
            },
            {
              "name": "SubnetIds",
              "type": "list",
              "description": "The subnet IDs that are obtained from the server when the backup is created.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "ToolsVersion",
              "type": "string",
              "description": "The version of OpsWorks CM-specific tools that is obtained from the server when the backup is created.",
              "nested_items": []
            },
            {
              "name": "UserArn",
              "type": "string",
              "description": "The user ARN of the requester for manual backups. This field is empty for automated backups.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}