{
  "method_name": "create_server",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/opsworkscm/client/create_server.html",
  "description": "Creates and immedately starts a new server. The server is ready to use when it is in the HEALTHY state. By default, you can create a maximum of 10 servers. This operation is asynchronous. A LimitExceededException is thrown when you have created the maximum number of servers (10). A ResourceAlreadyExistsException is thrown when a server with the same name already exists in the account. A ResourceNotFoundException is thrown when you specify a backup ID that is not valid or is for a backup that does not exist. A ValidationException is thrown when parameters of the request are not valid. If you do not specify a security group by adding the SecurityGroupIds parameter, OpsWorks creates a new security group. Chef Automate: The default security group opens the Chef server to the world on TCP port 443. If a KeyName is present, OpsWorks enables SSH access. SSH is also open to the world on TCP port 22. Puppet Enterprise: The default security group opens TCP ports 22, 443, 4433, 8140, 8142, 8143, and 8170. If a KeyName is present, OpsWorks enables SSH access. SSH is also open to the world on TCP port 22. By default, your server is accessible from any IP address. We recommend that you update your security group rules to allow access from known IP addresses and address ranges only. To edit security group rules, open Security Groups in the navigation pane of the EC2 management console. To specify your own domain for a server, and provide your own self-signed or CA-signed certificate and private key, specify values for CustomDomain, CustomCertificate, and CustomPrivateKey.",
  "parameters": [
    {
      "name": "AssociatePublicIpAddress",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "CustomDomain",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "CustomCertificate",
      "type": "string",
      "required": false,
      "description": "A PEM-formatted HTTPS certificate. The value can be be a single, self-signed certificate, or a certificate chain. If you specify a custom certificate, you must also specify values for CustomDomain and CustomPrivateKey. The following are requirements for the CustomCertificate value: You can provide either a self-signed, custom certificate, or the full certificate chain. The certificate must be a valid X509 certificate, or a certificate chain in PEM format. The certificate must be valid at the time of upload. A certificate can't be used before its validity period begins (the certificate's NotBefore date), or after it expires (the certificate's NotAfter date). The certificate's common name or subject alternative names (SANs), if present, must match the value of CustomDomain. The certificate must match the value of CustomPrivateKey.",
      "nested_params": []
    },
    {
      "name": "CustomPrivateKey",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DisableAutomatedBackup",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Engine",
      "type": "string",
      "required": true,
      "description": "The configuration management engine to use. Valid values include ChefAutomate and Puppet.",
      "nested_params": []
    },
    {
      "name": "EngineModel",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "EngineVersion",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "EngineAttributes",
      "type": "list",
      "required": false,
      "description": "Optional engine attributes on a specified server. CHEF_AUTOMATE_PIVOTAL_KEY: A base64-encoded RSA public key. The corresponding private key is required to access the Chef API. When no CHEF_AUTOMATE_PIVOTAL_KEY is set, a private key is generated and returned in the response. CHEF_AUTOMATE_ADMIN_PASSWORD: The password for the administrative user in the Chef Automate web-based dashboard. The password length is a minimum of eight characters, and a maximum of 32. The password can contain letters, numbers, and special characters (!/@#$%^&+=_). The password must contain at least one lower case letter, one upper case letter, one number, and one special character. When no CHEF_AUTOMATE_ADMIN_PASSWORD is set, one is generated and returned in the response. PUPPET_ADMIN_PASSWORD: To work with the Puppet Enterprise console, a password must use ASCII characters. PUPPET_R10K_REMOTE: The r10k remote is the URL of your control repository (for example, ssh://git@your.git-repo.com:user/control-repo.git). Specifying an r10k remote opens TCP port 8170. PUPPET_R10K_PRIVATE_KEY: If you are using a private Git repository, add PUPPET_R10K_PRIVATE_KEY to specify a PEM-encoded private SSH key. (dict) --- A name and value pair that is specific to the engine of the server. Name (string) --- The name of the engine attribute. Value (string) --- The value of the engine attribute.",
      "nested_params": []
    },
    {
      "name": "BackupRetentionCount",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ServerName",
      "type": "string",
      "required": true,
      "description": "The name of the server. The server name must be unique within your Amazon Web Services account, within each region. Server names must start with a letter; then letters, numbers, or hyphens (-) are allowed, up to a maximum of 40 characters.",
      "nested_params": []
    },
    {
      "name": "InstanceProfileArn",
      "type": "string",
      "required": true,
      "description": "The ARN of the instance profile that your Amazon EC2 instances use. The OpsWorks console typically creates the instance profile for you.",
      "nested_params": []
    },
    {
      "name": "InstanceType",
      "type": "string",
      "required": true,
      "description": "The Amazon EC2 instance type to use. For example, m5.large.",
      "nested_params": []
    },
    {
      "name": "KeyPair",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "PreferredMaintenanceWindow",
      "type": "string",
      "required": false,
      "description": "The start time for a one-hour period each week during which OpsWorks CM performs maintenance on the instance. Valid values must be specified in the following format: DDD:HH:MM. MM must be specified as 00. The specified time is in coordinated universal time (UTC). The default value is a random one-hour period on Tuesday, Wednesday, or Friday. See TimeWindowDefinition for more information. Example: Mon:08:00, which represents a start time of every Monday at 08:00 UTC. (8:00 a.m.)",
      "nested_params": []
    },
    {
      "name": "PreferredBackupWindow",
      "type": "string",
      "required": false,
      "description": "The start time for a one-hour period during which OpsWorks CM backs up application-level data on your server if automated backups are enabled. Valid values must be specified in one of the following formats: HH:MM for daily backups DDD:HH:MM for weekly backups MM must be specified as 00. The specified time is in coordinated universal time (UTC). The default value is a random, daily start time. Example: 08:00, which represents a daily start time of 08:00 UTC. Example: Mon:08:00, which represents a start time of every Monday at 08:00 UTC. (8:00 a.m.)",
      "nested_params": []
    },
    {
      "name": "SecurityGroupIds",
      "type": "list",
      "required": false,
      "description": "A list of security group IDs to attach to the Amazon EC2 instance. If you add this parameter, the specified security groups must be within the VPC that is specified by SubnetIds. If you do not specify this parameter, OpsWorks CM creates one new security group that uses TCP ports 22 and 443, open to 0.0.0.0/0 (everyone). (string) ---",
      "nested_params": []
    },
    {
      "name": "ServiceRoleArn",
      "type": "string",
      "required": true,
      "description": "The service role that the OpsWorks CM service backend uses to work with your account.",
      "nested_params": []
    },
    {
      "name": "SubnetIds",
      "type": "list",
      "required": false,
      "description": "The IDs of subnets in which to launch the server EC2 instance. Amazon EC2-Classic customers: This field is required. All servers must run within a VPC. The VPC must have 'Auto Assign Public IP' enabled. EC2-VPC customers: This field is optional. If you do not specify subnet IDs, your EC2 instances are created in a default subnet that is selected by Amazon EC2. If you specify subnet IDs, the VPC must have 'Auto Assign Public IP' enabled. For more information about supported Amazon EC2 platforms, see Supported Platforms. (string) ---",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "A map that contains tag keys and tag values to attach to an OpsWorks for Chef Automate or OpsWorks for Puppet Enterprise server. The key cannot be empty. The key can be a maximum of 127 characters, and can contain only Unicode letters, numbers, or separators, or the following special characters: + - = . _ : / @ The value can be a maximum 255 characters, and contain only Unicode letters, numbers, or separators, or the following special characters: + - = . _ : / @ Leading and trailing spaces are trimmed from both the key and value. A maximum of 50 user-applied tags is allowed for any OpsWorks CM server. (dict) --- A map that contains tag keys and tag values to attach to an OpsWorks for Chef Automate or OpsWorks for Puppet Enterprise server. Leading and trailing spaces are trimmed from both the key and value. A maximum of 50 user-applied tags is allowed for tag-supported OpsWorks CM resources. A tag key, such as Stage or Name. A tag key cannot be empty. _ : / An optional tag value, such as Production or test-owcm-server. The value can be a maximum of 255 characters, and contain only Unicode letters, numbers, or separators, or the following special characters: + - = . _ : /",
      "nested_params": []
    },
    {
      "name": "BackupId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "AssociatePublicIpAddress",
              "type": "boolean",
              "description": "Associate a public IP address with a server that you are launching.",
              "nested_items": []
            },
            {
              "name": "BackupRetentionCount",
              "type": "integer",
              "description": "The number of automated backups to keep.",
              "nested_items": []
            },
            {
              "name": "ServerName",
              "type": "string",
              "description": "The name of the server.",
              "nested_items": []
            },
            {
              "name": "CreatedAt",
              "type": "datetime",
              "description": "Time stamp of server creation. Example 2016-07-29T13:38:47.520Z.",
              "nested_items": []
            },
            {
              "name": "CloudFormationStackArn",
              "type": "string",
              "description": "The ARN of the CloudFormation stack that was used to create the server.",
              "nested_items": []
            },
            {
              "name": "CustomDomain",
              "type": "string",
              "description": "An optional public endpoint of a server, such as https://aws.my-company.com. You cannot access the server by using the Endpoint value if the server has a CustomDomain specified.",
              "nested_items": []
            },
            {
              "name": "DisableAutomatedBackup",
              "type": "boolean",
              "description": "Disables automated backups. The number of stored backups is dependent on the value of PreferredBackupCount.",
              "nested_items": []
            },
            {
              "name": "Endpoint",
              "type": "string",
              "description": "A DNS name that can be used to access the engine. Example: myserver-asdfghjkl.us-east-1.opsworks.io. You cannot access the server by using the Endpoint value if the server has a CustomDomain specified.",
              "nested_items": []
            },
            {
              "name": "Engine",
              "type": "string",
              "description": "The engine type of the server. Valid values in this release include ChefAutomate and Puppet.",
              "nested_items": []
            },
            {
              "name": "EngineModel",
              "type": "string",
              "description": "The engine model of the server. Valid values in this release include Monolithic for Puppet and Single for Chef.",
              "nested_items": []
            },
            {
              "name": "EngineAttributes",
              "type": "list",
              "description": "The response of a createServer() request returns the master credential to access the server in EngineAttributes. These credentials are not stored by OpsWorks CM; they are returned only as part of the result of createServer().",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "CHEF_AUTOMATE_PIVOTAL_KEY: A base64-encoded RSA private key that is generated by OpsWorks for Chef Automate. This private key is required to access the Chef API.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "CHEF_STARTER_KIT: A base64-encoded ZIP file. The ZIP file contains a Chef starter kit, which includes a README, a configuration file, and the required RSA private key. Save this file, unzip it, and then change to the directory where you've unzipped the file contents. From this directory, you can run Knife commands.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "EngineVersion",
              "type": "string",
              "description": "The engine version of the server. For a Chef server, the valid value for EngineVersion is currently 2. For a Puppet server, specify either 2019 or 2017.",
              "nested_items": []
            },
            {
              "name": "InstanceProfileArn",
              "type": "string",
              "description": "The instance profile ARN of the server.",
              "nested_items": []
            },
            {
              "name": "InstanceType",
              "type": "string",
              "description": "The instance type for the server, as specified in the CloudFormation stack. This might not be the same instance type that is shown in the EC2 console.",
              "nested_items": []
            },
            {
              "name": "KeyPair",
              "type": "string",
              "description": "The key pair associated with the server.",
              "nested_items": []
            },
            {
              "name": "MaintenanceStatus",
              "type": "string",
              "description": "The status of the most recent server maintenance run. Shows SUCCESS or FAILED.",
              "nested_items": []
            },
            {
              "name": "PreferredMaintenanceWindow",
              "type": "string",
              "description": "The preferred maintenance period specified for the server.",
              "nested_items": []
            },
            {
              "name": "PreferredBackupWindow",
              "type": "string",
              "description": "The preferred backup period specified for the server.",
              "nested_items": []
            },
            {
              "name": "SecurityGroupIds",
              "type": "list",
              "description": "The security group IDs for the server, as specified in the CloudFormation stack. These might not be the same security groups that are shown in the EC2 console.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "ServiceRoleArn",
              "type": "string",
              "description": "The service role ARN used to create the server.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The server's status. This field displays the states of actions in progress, such as creating, running, or backing up the server, as well as the server's health state.",
              "nested_items": []
            },
            {
              "name": "StatusReason",
              "type": "string",
              "description": "Depending on the server status, this field has either a human-readable message (such as a create or backup error), or an escaped block of JSON (used for health check results).",
              "nested_items": []
            },
            {
              "name": "SubnetIds",
              "type": "list",
              "description": "The subnet IDs specified in a CreateServer request.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "ServerArn",
              "type": "string",
              "description": "The ARN of the server.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}