{
  "method_name": "export_server_engine_attribute",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/opsworkscm/client/export_server_engine_attribute.html",
  "description": "Exports a specified server engine attribute as a base64-encoded string. For example, you can export user data that you can use in EC2 to associate nodes with a server. This operation is synchronous. A ValidationException is raised when parameters of the request are not valid. A ResourceNotFoundException is thrown when the server does not exist. An InvalidStateException is thrown when the server is in any of the following states: CREATING, TERMINATED, FAILED or DELETING.",
  "parameters": [
    {
      "name": "ExportAttributeName",
      "type": "string",
      "required": true,
      "description": "The name of the export attribute. Currently, the supported export attribute is Userdata. This exports a user data script that includes parameters and values provided in the InputAttributes list.",
      "nested_params": []
    },
    {
      "name": "ServerName",
      "type": "string",
      "required": true,
      "description": "The name of the server from which you are exporting the attribute.",
      "nested_params": []
    },
    {
      "name": "InputAttributes",
      "type": "list",
      "required": false,
      "description": "The list of engine attributes. The list type is EngineAttribute. An EngineAttribute list item is a pair that includes an attribute name and its value. For the Userdata ExportAttributeName, the following are supported engine attribute names. RunList In Chef, a list of roles or recipes that are run in the specified order. In Puppet, this parameter is ignored. OrganizationName In Chef, an organization name. OpsWorks for Chef Automate always creates the organization default. NodeEnvironment In Chef, a node environment (for example, development, staging, or one-box). NodeClientVersion In Chef, the version of the Chef engine (three numbers separated by dots, such as 13.8.5). If this attribute is empty, OpsWorks for Chef Automate uses the most current version. (dict) --- A name and value pair that is specific to the engine of the server. Name (string) --- The name of the engine attribute. Value (string) --- The value of the engine attribute.",
      "nested_params": [
        {
          "name": "RunList",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "OrganizationName",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "NodeEnvironment",
          "type": "for example, development, staging, or one-box",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "NodeClientVersion",
          "type": "three numbers separated by dots, such as 13.8.5",
          "required": false,
          "description": "",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "EngineAttribute",
          "type": "dict",
          "description": "The requested engine attribute pair with attribute name and value.",
          "nested_items": [
            {
              "name": "Name",
              "type": "string",
              "description": "The name of the engine attribute.",
              "nested_items": []
            },
            {
              "name": "Value",
              "type": "string",
              "description": "The value of the engine attribute.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "ServerName",
          "type": "string",
          "description": "The server name used in the request.",
          "nested_items": []
        }
      ]
    }
  ]
}