{
  "method_name": "register_connector",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/appflow/client/register_connector.html",
  "description": "Registers a new custom connector with your Amazon Web Services account. Before you can register the connector, you must deploy the associated AWS lambda function in your account.",
  "parameters": [
    {
      "name": "connectorLabel",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "connectorProvisioningType",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "connectorProvisioningConfig",
      "type": "dict",
      "required": true,
      "description": "The provisioning type of the connector. Currently the only supported value is LAMBDA. lambda (dict) --- Contains information about the configuration of the lambda which is being registered as the connector. Lambda ARN of the connector being registered.",
      "nested_params": [
        {
          "name": "lambda",
          "type": "dict",
          "required": false,
          "description": "Contains information about the configuration of the lambda which is being registered as the connector.",
          "nested_params": [
            {
              "name": "lambdaArn",
              "type": "string",
              "required": false,
              "description": "Lambda ARN of the connector being registered.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "clientToken",
      "type": "string",
      "required": false,
      "description": "The clientToken parameter is an idempotency token. It ensures that your RegisterConnector request completes only once. You choose the value to pass. For example, if you don't receive a response from your request, you can safely retry the request with the same clientToken parameter value. If you omit a clientToken value, the Amazon Web Services SDK that you are using inserts a value for you. This way, the SDK can safely retry requests multiple times after a network error. You must provide your own value for other use cases. If you specify input parameters that differ from your first request, an error occurs. If you use a different value for clientToken, Amazon AppFlow considers it a new call to RegisterConnector. The token is active for 8 hours. This field is autopopulated if not provided.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "connectorArn",
          "type": "string",
          "description": "The ARN of the connector being registered.",
          "nested_items": []
        }
      ]
    }
  ]
}