{
  "method_name": "assign_opportunity",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/partnercentral-selling/client/assign_opportunity.html",
  "description": "Enables you to reassign an existing Opportunity to another user within your Partner Central account. The specified user receives the opportunity, and it appears on their Partner Central dashboard, allowing them to take necessary actions or proceed with the opportunity. This is useful for distributing opportunities to the appropriate team members or departments within your organization, ensuring that each opportunity is handled by the right person. By default, the opportunity owner is the one who creates it. Currently, there's no API to enumerate the list of available users.",
  "parameters": [
    {
      "name": "Assignee",
      "type": "dict",
      "required": true,
      "description": "Specifies the user or team member responsible for managing the assigned opportunity. This field identifies the Assignee based on the partner's internal team structure. Ensure that the email address is associated with a registered user in your Partner Central account. Specifies the business title of the assignee managing the opportunity. This helps clarify the individual's role and responsibilities within the organization. Use the value PartnerAccountManager to update details of the opportunity owner. Provides the email address of the assignee. This email is used for communications and notifications related to the opportunity. Specifies the first name of the assignee managing the opportunity. The system automatically retrieves this value from the user profile by referencing the associated email address. Specifies the last name of the assignee managing the opportunity. The system automatically retrieves this value from the user profile by referencing the associated email address.",
      "nested_params": [
        {
          "name": "BusinessTitle",
          "type": "string",
          "required": false,
          "description": "Specifies the business title of the assignee managing the opportunity. This helps clarify the individual's role and responsibilities within the organization. Use the value PartnerAccountManager to update details of the opportunity owner.",
          "nested_params": []
        },
        {
          "name": "Email",
          "type": "string",
          "required": false,
          "description": "Provides the email address of the assignee. This email is used for communications and notifications related to the opportunity.",
          "nested_params": []
        },
        {
          "name": "FirstName",
          "type": "string",
          "required": false,
          "description": "Specifies the first name of the assignee managing the opportunity. The system automatically retrieves this value from the user profile by referencing the associated email address.",
          "nested_params": []
        },
        {
          "name": "LastName",
          "type": "string",
          "required": false,
          "description": "Specifies the last name of the assignee managing the opportunity. The system automatically retrieves this value from the user profile by referencing the associated email address.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Catalog",
      "type": "string",
      "required": true,
      "description": "Specifies the catalog associated with the request. This field takes a string value from a predefined list: AWS or Sandbox. The catalog determines which environment the opportunity is assigned in. Use AWS to assign real opportunities in the Amazon Web Services catalog, and Sandbox for testing in secure, isolated environments.",
      "nested_params": []
    },
    {
      "name": "Identifier",
      "type": "string",
      "required": true,
      "description": "Requires the Opportunity's unique identifier when you want to assign it to another user. Provide the correct identifier so the intended opportunity is reassigned.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}