{
  "method_name": "associate_opportunity",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/partnercentral-selling/client/associate_opportunity.html",
  "description": "Enables you to create a formal association between an Opportunity and various related entities, enriching the context and details of the opportunity for better collaboration and decision making. You can associate an opportunity with the following entity types: To obtain identifiers for these entities, use the following methods:",
  "parameters": [
    {
      "name": "Catalog",
      "type": "string",
      "required": true,
      "description": "Specifies the catalog associated with the request. This field takes a string value from a predefined list: AWS or Sandbox. The catalog determines which environment the opportunity association is made in. Use AWS to associate opportunities in the Amazon Web Services catalog, and Sandbox for testing in secure, isolated environments.",
      "nested_params": []
    },
    {
      "name": "OpportunityIdentifier",
      "type": "string",
      "required": true,
      "description": "Requires the Opportunity's unique identifier when you want to associate it with a related entity. Provide the correct identifier so the intended opportunity is updated with the association.",
      "nested_params": []
    },
    {
      "name": "RelatedEntityIdentifier",
      "type": "string",
      "required": true,
      "description": "Requires the related entity's unique identifier when you want to associate it with the Opportunity. For Amazon Web Services Marketplace entities, provide the Amazon Resource Name (ARN). Use the Amazon Web Services Marketplace API to obtain the ARN.",
      "nested_params": []
    },
    {
      "name": "RelatedEntityType",
      "type": "string",
      "required": true,
      "description": "Specifies the entity type that you're associating with the Opportunity. This helps to categorize and properly process the association.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}