{
  "method_name": "create_engagement_invitation",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/partnercentral-selling/client/create_engagement_invitation.html",
  "description": "This action creates an invitation from a sender to a single receiver to join an engagement.",
  "parameters": [
    {
      "name": "Catalog",
      "type": "string",
      "required": true,
      "description": "Specifies the catalog related to the engagement. Accepted values are AWS and Sandbox, which determine the environment in which the engagement is managed.",
      "nested_params": []
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": true,
      "description": "Specifies a unique, client-generated UUID to ensure that the request is handled exactly once. This token helps prevent duplicate invitation creations. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "EngagementIdentifier",
      "type": "string",
      "required": true,
      "description": "The unique identifier of the Engagement associated with the invitation. This parameter ensures the invitation is created within the correct Engagement context.",
      "nested_params": []
    },
    {
      "name": "Invitation",
      "type": "dict",
      "required": true,
      "description": "The Invitation object all information necessary to initiate an engagement invitation to a partner. It contains a personalized message from the sender, the invitation's receiver, and a payload. The Payload can be the OpportunityInvitation, which includes detailed structures for sender contacts, partner responsibilities, customer information, and project details. A message accompanying the invitation. Contains the data payload associated with the Engagement Invitation. This payload includes essential details related to the AWS opportunity and is used by partners to evaluate whether to accept or reject the engagement. OpportunityInvitation (dict) --- Specifies the details of the opportunity invitation within the Engagement Invitation payload. This data helps partners understand the context, scope, and expected involvement for the opportunity from AWS. Contains information about the customer related to the opportunity in the Engagement Invitation. This data helps partners understand the customer's profile and requirements. Represents the name of the customer's company associated with the Engagement Invitation. This field is used to identify the customer. Indicates the country in which the customer's company operates. This field is useful for understanding regional requirements or compliance needs. Specifies the industry to which the customer's company belongs. This field helps categorize the opportunity based on the customer's business sector. Provides the website URL of the customer's company. This field helps partners verify the legitimacy and size of the customer organization. Describes the project details associated with the opportunity, including the customer's needs and the scope of work expected to be performed. Describes the business problem that the project aims to solve. This information is crucial for understanding the project's goals and objectives. Contains revenue estimates for the partner related to the project. This field provides an idea of the financial potential of the opportunity for the partner. (dict) --- Provides an estimate of the revenue that the partner is expected to generate from the opportunity. This information helps partners assess the financial value of the project. Represents the estimated monthly revenue that the partner expects to earn from the opportunity. This helps in forecasting financial returns. Indicates the currency in which the revenue estimate is provided. This helps in understanding the financial impact across different markets. EstimationUrl (string) --- A URL providing additional information or context about the spend estimation. Indicates how frequently the customer is expected to spend the projected amount. This can include values such as Monthly, Quarterly, or Annually. The default value is Monthly, representing recurring monthly spend. Specifies the name of the partner company that is expected to generate revenue from the opportunity. This field helps track the partner's involvement in the opportunity. Specifies the estimated date of project completion. This field helps track the project timeline and manage expectations. Specifies the title of the project. This title helps partners quickly identify and understand the focus of the project. Outlines the responsibilities or expectations of the receiver in the context of the invitation. (string) --- SenderContacts (list) --- Represents the contact details of the AWS representatives involved in sending the Engagement Invitation. These contacts are opportunity stakeholders. (dict) --- An object that contains the details of the sender-provided contact person for the EngagementInvitation. BusinessTitle (string) --- The sender-provided contact's title (job title or role) associated with the EngagementInvitation. The sender-provided contact's email address associated with the EngagementInvitation. FirstName (string) --- The sender-provided contact's last name associated with the EngagementInvitation. LastName (string) --- The sender-provided contact's first name associated with the EngagementInvitation. Phone (string) --- The sender-provided contact's phone number associated with the EngagementInvitation. Represents the entity that received the Engagement Invitation, including account and company details. This field is essential for tracking the partner who is being invited to collaborate. Account (dict) --- Specifies the AWS account of the partner who received the Engagement Invitation. This field is used to track the invitation recipient within the AWS ecosystem. Alias (string) --- Represents the alias of the partner account receiving the Engagement Invitation, making it easier to identify and track the recipient in reports or logs. Indicates the AWS account ID of the partner who received the Engagement Invitation. This is a unique identifier for managing engagements with specific AWS accounts.",
      "nested_params": [
        {
          "name": "Message",
          "type": "string",
          "required": false,
          "description": "A message accompanying the invitation.",
          "nested_params": []
        },
        {
          "name": "Payload",
          "type": "dict",
          "required": false,
          "description": "Contains the data payload associated with the Engagement Invitation. This payload includes essential details related to the AWS opportunity and is used by partners to evaluate whether to accept or reject the engagement.",
          "nested_params": [
            {
              "name": "OpportunityInvitation",
              "type": "dict",
              "required": false,
              "description": "Specifies the details of the opportunity invitation within the Engagement Invitation payload. This data helps partners understand the context, scope, and expected involvement for the opportunity from AWS.",
              "nested_params": [
                {
                  "name": "Customer",
                  "type": "dict",
                  "required": false,
                  "description": "Contains information about the customer related to the opportunity in the Engagement Invitation. This data helps partners understand the customer's profile and requirements.",
                  "nested_params": [
                    {
                      "name": "CompanyName",
                      "type": "string",
                      "required": false,
                      "description": "Represents the name of the customer's company associated with the Engagement Invitation. This field is used to identify the customer.",
                      "nested_params": []
                    },
                    {
                      "name": "CountryCode",
                      "type": "string",
                      "required": false,
                      "description": "Indicates the country in which the customer's company operates. This field is useful for understanding regional requirements or compliance needs.",
                      "nested_params": []
                    },
                    {
                      "name": "Industry",
                      "type": "string",
                      "required": false,
                      "description": "Specifies the industry to which the customer's company belongs. This field helps categorize the opportunity based on the customer's business sector.",
                      "nested_params": []
                    },
                    {
                      "name": "WebsiteUrl",
                      "type": "string",
                      "required": false,
                      "description": "Provides the website URL of the customer's company. This field helps partners verify the legitimacy and size of the customer organization.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "Project",
                  "type": "dict",
                  "required": false,
                  "description": "Describes the project details associated with the opportunity, including the customer's needs and the scope of work expected to be performed.",
                  "nested_params": [
                    {
                      "name": "BusinessProblem",
                      "type": "string",
                      "required": false,
                      "description": "Describes the business problem that the project aims to solve. This information is crucial for understanding the project's goals and objectives.",
                      "nested_params": []
                    },
                    {
                      "name": "ExpectedCustomerSpend",
                      "type": "list",
                      "required": false,
                      "description": "Contains revenue estimates for the partner related to the project. This field provides an idea of the financial potential of the opportunity for the partner.",
                      "nested_params": [
                        {
                          "name": "Amount",
                          "type": "string",
                          "required": false,
                          "description": "Represents the estimated monthly revenue that the partner expects to earn from the opportunity. This helps in forecasting financial returns.",
                          "nested_params": []
                        },
                        {
                          "name": "CurrencyCode",
                          "type": "string",
                          "required": false,
                          "description": "Indicates the currency in which the revenue estimate is provided. This helps in understanding the financial impact across different markets.",
                          "nested_params": []
                        },
                        {
                          "name": "EstimationUrl",
                          "type": "string",
                          "required": false,
                          "description": "A URL providing additional information or context about the spend estimation.",
                          "nested_params": []
                        },
                        {
                          "name": "Frequency",
                          "type": "string",
                          "required": false,
                          "description": "Indicates how frequently the customer is expected to spend the projected amount. This can include values such as Monthly, Quarterly, or Annually. The default value is Monthly, representing recurring monthly spend.",
                          "nested_params": []
                        },
                        {
                          "name": "TargetCompany",
                          "type": "string",
                          "required": false,
                          "description": "Specifies the name of the partner company that is expected to generate revenue from the opportunity. This field helps track the partner's involvement in the opportunity.",
                          "nested_params": []
                        }
                      ]
                    },
                    {
                      "name": "TargetCompletionDate",
                      "type": "string",
                      "required": false,
                      "description": "Specifies the estimated date of project completion. This field helps track the project timeline and manage expectations.",
                      "nested_params": []
                    },
                    {
                      "name": "Title",
                      "type": "string",
                      "required": false,
                      "description": "Specifies the title of the project. This title helps partners quickly identify and understand the focus of the project.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "ReceiverResponsibilities",
                  "type": "list",
                  "required": false,
                  "description": "Outlines the responsibilities or expectations of the receiver in the context of the invitation.",
                  "nested_params": []
                },
                {
                  "name": "SenderContacts",
                  "type": "list",
                  "required": false,
                  "description": "Represents the contact details of the AWS representatives involved in sending the Engagement Invitation. These contacts are opportunity stakeholders.",
                  "nested_params": [
                    {
                      "name": "BusinessTitle",
                      "type": "string",
                      "required": false,
                      "description": "The sender-provided contact's title (job title or role) associated with the EngagementInvitation.",
                      "nested_params": []
                    },
                    {
                      "name": "Email",
                      "type": "string",
                      "required": false,
                      "description": "The sender-provided contact's email address associated with the EngagementInvitation.",
                      "nested_params": []
                    },
                    {
                      "name": "FirstName",
                      "type": "string",
                      "required": false,
                      "description": "The sender-provided contact's last name associated with the EngagementInvitation.",
                      "nested_params": []
                    },
                    {
                      "name": "LastName",
                      "type": "string",
                      "required": false,
                      "description": "The sender-provided contact's first name associated with the EngagementInvitation.",
                      "nested_params": []
                    },
                    {
                      "name": "Phone",
                      "type": "string",
                      "required": false,
                      "description": "The sender-provided contact's phone number associated with the EngagementInvitation.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Receiver",
          "type": "dict",
          "required": false,
          "description": "Represents the entity that received the Engagement Invitation, including account and company details. This field is essential for tracking the partner who is being invited to collaborate.",
          "nested_params": [
            {
              "name": "Account",
              "type": "dict",
              "required": false,
              "description": "Specifies the AWS account of the partner who received the Engagement Invitation. This field is used to track the invitation recipient within the AWS ecosystem.",
              "nested_params": [
                {
                  "name": "Alias",
                  "type": "string",
                  "required": false,
                  "description": "Represents the alias of the partner account receiving the Engagement Invitation, making it easier to identify and track the recipient in reports or logs.",
                  "nested_params": []
                },
                {
                  "name": "AwsAccountId",
                  "type": "string",
                  "required": false,
                  "description": "Indicates the AWS account ID of the partner who received the Engagement Invitation. This is a unique identifier for managing engagements with specific AWS accounts.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Arn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) that uniquely identifies the engagement invitation.",
          "nested_items": []
        },
        {
          "name": "Id",
          "type": "string",
          "description": "Unique identifier assigned to the newly created engagement invitation.",
          "nested_items": []
        }
      ]
    }
  ]
}