{
  "method_name": "create_engagement",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/partnercentral-selling/client/create_engagement.html",
  "description": "The CreateEngagement action allows you to create an Engagement, which serves as a collaborative space between different parties such as AWS Partners and AWS Sellers. This action automatically adds the caller's AWS account as an active member of the newly created Engagement.",
  "parameters": [
    {
      "name": "Catalog",
      "type": "string",
      "required": true,
      "description": "The CreateEngagementRequest$Catalog parameter specifies the catalog related to the engagement. Accepted values are AWS and Sandbox, which determine the environment in which the engagement is managed.",
      "nested_params": []
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": true,
      "description": "The CreateEngagementRequest$ClientToken parameter specifies a unique, case-sensitive identifier to ensure that the request is handled exactly once. The value must not exceed sixty-four alphanumeric characters. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "Contexts",
      "type": "list",
      "required": true,
      "description": "The Contexts field is a required array of objects, with a maximum of 5 contexts allowed, specifying detailed information about customer projects associated with the Engagement. Each context object contains a Type field indicating the context type, which must be CustomerProject in this version, and a Payload field containing the CustomerProject details. The CustomerProject object is composed of two main components: Customer and Project. The Customer object includes information such as CompanyName, WebsiteUrl, Industry, and CountryCode, providing essential details about the customer. The Project object contains Title, BusinessProblem, and TargetCompletionDate, offering insights into the specific project associated with the customer. This structure allows comprehensive context to be included within the Engagement, facilitating effective collaboration between parties by providing relevant customer and project information. (dict) --- Provides detailed context information for an Engagement. This structure allows for specifying the type of context and its associated payload. Payload (dict) --- Contains the specific details of the Engagement context. The structure of this payload varies depending on the Type field. CustomerProject (dict) --- Contains detailed information about a customer project when the context type is 'CustomerProject'. This field is present only when the Type in EngagementContextDetails is set to 'CustomerProject'. Customer (dict) --- Contains details about the customer associated with the Engagement Invitation, including company information and industry. Represents the name of the customer's company associated with the Engagement Invitation. This field is used to identify the customer. Indicates the country in which the customer's company operates. This field is useful for understanding regional requirements or compliance needs. Specifies the industry to which the customer's company belongs. This field helps categorize the opportunity based on the customer's business sector. Provides the website URL of the customer's company. This field helps partners verify the legitimacy and size of the customer organization. Project (dict) --- Information about the customer project associated with the Engagement. A description of the business problem the project aims to solve. The target completion date for the customer's project. The title of the project. Specifies the type of Engagement context. Valid values are 'CustomerProject' or 'Document', indicating whether the context relates to a customer project or a document respectively.",
      "nested_params": [
        {
          "name": "Payload",
          "type": "dict",
          "required": false,
          "description": "Contains the specific details of the Engagement context. The structure of this payload varies depending on the Type field.",
          "nested_params": [
            {
              "name": "CustomerProject",
              "type": "dict",
              "required": false,
              "description": "Contains detailed information about a customer project when the context type is 'CustomerProject'. This field is present only when the Type in EngagementContextDetails is set to 'CustomerProject'.",
              "nested_params": [
                {
                  "name": "Customer",
                  "type": "dict",
                  "required": false,
                  "description": "Contains details about the customer associated with the Engagement Invitation, including company information and industry.",
                  "nested_params": [
                    {
                      "name": "CompanyName",
                      "type": "string",
                      "required": false,
                      "description": "Represents the name of the customer's company associated with the Engagement Invitation. This field is used to identify the customer.",
                      "nested_params": []
                    },
                    {
                      "name": "CountryCode",
                      "type": "string",
                      "required": false,
                      "description": "Indicates the country in which the customer's company operates. This field is useful for understanding regional requirements or compliance needs.",
                      "nested_params": []
                    },
                    {
                      "name": "Industry",
                      "type": "string",
                      "required": false,
                      "description": "Specifies the industry to which the customer's company belongs. This field helps categorize the opportunity based on the customer's business sector.",
                      "nested_params": []
                    },
                    {
                      "name": "WebsiteUrl",
                      "type": "string",
                      "required": false,
                      "description": "Provides the website URL of the customer's company. This field helps partners verify the legitimacy and size of the customer organization.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "Project",
                  "type": "dict",
                  "required": false,
                  "description": "Information about the customer project associated with the Engagement.",
                  "nested_params": [
                    {
                      "name": "BusinessProblem",
                      "type": "string",
                      "required": false,
                      "description": "A description of the business problem the project aims to solve.",
                      "nested_params": []
                    },
                    {
                      "name": "TargetCompletionDate",
                      "type": "string",
                      "required": false,
                      "description": "The target completion date for the customer's project.",
                      "nested_params": []
                    },
                    {
                      "name": "Title",
                      "type": "string",
                      "required": false,
                      "description": "The title of the project.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Type",
          "type": "string",
          "required": false,
          "description": "Specifies the type of Engagement context. Valid values are 'CustomerProject' or 'Document', indicating whether the context relates to a customer project or a document respectively.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Description",
      "type": "string",
      "required": true,
      "description": "Provides a description of the Engagement.",
      "nested_params": []
    },
    {
      "name": "Title",
      "type": "string",
      "required": true,
      "description": "Specifies the title of the Engagement.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Arn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) that identifies the engagement.",
          "nested_items": []
        },
        {
          "name": "Id",
          "type": "string",
          "description": "Unique identifier assigned to the newly created engagement.",
          "nested_items": []
        }
      ]
    }
  ]
}