{
  "method_name": "create_resource_snapshot",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/partnercentral-selling/client/create_resource_snapshot.html",
  "description": "This action allows you to create an immutable snapshot of a specific resource, such as an opportunity, within the context of an engagement. The snapshot captures a subset of the resource's data based on the schema defined by the provided template.",
  "parameters": [
    {
      "name": "Catalog",
      "type": "string",
      "required": true,
      "description": "Specifies the catalog where the snapshot is created. Valid values are AWS and Sandbox.",
      "nested_params": []
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": true,
      "description": "Specifies a unique, client-generated UUID to ensure that the request is handled exactly once. This token helps prevent duplicate snapshot creations. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "EngagementIdentifier",
      "type": "string",
      "required": true,
      "description": "The unique identifier of the engagement associated with this snapshot. This field links the snapshot to a specific engagement context.",
      "nested_params": []
    },
    {
      "name": "ResourceIdentifier",
      "type": "string",
      "required": true,
      "description": "The unique identifier of the specific resource to be snapshotted. The format and constraints of this identifier depend on the ResourceType specified. For example: For Opportunity type, it will be an opportunity ID.",
      "nested_params": []
    },
    {
      "name": "ResourceSnapshotTemplateIdentifier",
      "type": "string",
      "required": true,
      "description": "The name of the template that defines the schema for the snapshot. This template determines which subset of the resource data will be included in the snapshot. Must correspond to an existing and valid template for the specified ResourceType.",
      "nested_params": []
    },
    {
      "name": "ResourceType",
      "type": "string",
      "required": true,
      "description": "Specifies the type of resource for which the snapshot is being created. This field determines the structure and content of the snapshot. Must be one of the supported resource types, such as: Opportunity.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Arn",
          "type": "string",
          "description": "Specifies the Amazon Resource Name (ARN) that uniquely identifies the snapshot created.",
          "nested_items": []
        },
        {
          "name": "Revision",
          "type": "integer",
          "description": "Specifies the revision number of the created snapshot. This field provides important information about the snapshot's place in the sequence of snapshots for the given resource.",
          "nested_items": []
        }
      ]
    }
  ]
}