{
  "method_name": "get_engagement_invitation",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/partnercentral-selling/client/get_engagement_invitation.html",
  "description": "Retrieves the details of an engagement invitation shared by AWS with a partner. The information includes aspects such as customer, project details, and lifecycle information. To connect an engagement invitation with an opportunity, match the invitation's Payload.Project.Title with opportunity Project.Title.",
  "parameters": [
    {
      "name": "Catalog",
      "type": "string",
      "required": true,
      "description": "Specifies the catalog associated with the request. The field accepts values from the predefined set: AWS for live operations or Sandbox for testing environments.",
      "nested_params": []
    },
    {
      "name": "Identifier",
      "type": "string",
      "required": true,
      "description": "Specifies the unique identifier for the retrieved engagement invitation.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Arn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) that identifies the engagement invitation.",
          "nested_items": []
        },
        {
          "name": "Catalog",
          "type": "string",
          "description": "Indicates the catalog from which the engagement invitation details are retrieved. This field helps in identifying the appropriate catalog (e.g., AWS or Sandbox) used in the request.",
          "nested_items": []
        },
        {
          "name": "EngagementDescription",
          "type": "string",
          "description": "The description of the engagement associated with this invitation.",
          "nested_items": []
        },
        {
          "name": "EngagementId",
          "type": "string",
          "description": "The identifier of the engagement associated with this invitation.This ID links the invitation to its corresponding engagement.",
          "nested_items": []
        },
        {
          "name": "EngagementTitle",
          "type": "string",
          "description": "The title of the engagement invitation, summarizing the purpose or objectives of the opportunity shared by AWS.",
          "nested_items": []
        },
        {
          "name": "ExistingMembers",
          "type": "list",
          "description": "A list of active members currently part of the Engagement. This array contains a maximum of 10 members, each represented by an object with the following properties.",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "CompanyName: The name of the member's company.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "WebsiteUrl: The website URL of the member's company.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "ExpirationDate",
          "type": "datetime",
          "description": "Indicates the date on which the engagement invitation will expire if not accepted by the partner.",
          "nested_items": []
        },
        {
          "name": "Id",
          "type": "string",
          "description": "Unique identifier assigned to the engagement invitation being retrieved.",
          "nested_items": []
        },
        {
          "name": "InvitationDate",
          "type": "datetime",
          "description": "The date when the engagement invitation was sent to the partner.",
          "nested_items": []
        },
        {
          "name": "InvitationMessage",
          "type": "string",
          "description": "The message sent to the invited partner when the invitation was created.",
          "nested_items": []
        },
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "OpportunityInvitation",
              "type": "dict",
              "description": "Specifies the details of the opportunity invitation within the Engagement Invitation payload. This data helps partners understand the context, scope, and expected involvement for the opportunity from AWS.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "CompanyName",
                      "type": "string",
                      "description": "Represents the name of the customer's company associated with the Engagement Invitation. This field is used to identify the customer.",
                      "nested_items": []
                    },
                    {
                      "name": "CountryCode",
                      "type": "string",
                      "description": "Indicates the country in which the customer's company operates. This field is useful for understanding regional requirements or compliance needs.",
                      "nested_items": []
                    },
                    {
                      "name": "Industry",
                      "type": "string",
                      "description": "Specifies the industry to which the customer's company belongs. This field helps categorize the opportunity based on the customer's business sector.",
                      "nested_items": []
                    },
                    {
                      "name": "WebsiteUrl",
                      "type": "string",
                      "description": "Provides the website URL of the customer's company. This field helps partners verify the legitimacy and size of the customer organization.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "BusinessProblem",
                      "type": "string",
                      "description": "Describes the business problem that the project aims to solve. This information is crucial for understanding the project's goals and objectives.",
                      "nested_items": []
                    },
                    {
                      "name": "ExpectedCustomerSpend",
                      "type": "list",
                      "description": "Contains revenue estimates for the partner related to the project. This field provides an idea of the financial potential of the opportunity for the partner.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "Amount",
                              "type": "string",
                              "description": "Represents the estimated monthly revenue that the partner expects to earn from the opportunity. This helps in forecasting financial returns.",
                              "nested_items": []
                            },
                            {
                              "name": "CurrencyCode",
                              "type": "string",
                              "description": "Indicates the currency in which the revenue estimate is provided. This helps in understanding the financial impact across different markets.",
                              "nested_items": []
                            },
                            {
                              "name": "EstimationUrl",
                              "type": "string",
                              "description": "A URL providing additional information or context about the spend estimation.",
                              "nested_items": []
                            },
                            {
                              "name": "Frequency",
                              "type": "string",
                              "description": "Indicates how frequently the customer is expected to spend the projected amount. This can include values such as Monthly, Quarterly, or Annually. The default value is Monthly, representing recurring monthly spend.",
                              "nested_items": []
                            },
                            {
                              "name": "TargetCompany",
                              "type": "string",
                              "description": "Specifies the name of the partner company that is expected to generate revenue from the opportunity. This field helps track the partner's involvement in the opportunity.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "TargetCompletionDate",
                      "type": "string",
                      "description": "Specifies the estimated date of project completion. This field helps track the project timeline and manage expectations.",
                      "nested_items": []
                    },
                    {
                      "name": "Title",
                      "type": "string",
                      "description": "Specifies the title of the project. This title helps partners quickly identify and understand the focus of the project.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "ReceiverResponsibilities",
                  "type": "list",
                  "description": "Outlines the responsibilities or expectations of the receiver in the context of the invitation.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "SenderContacts",
                  "type": "list",
                  "description": "Represents the contact details of the AWS representatives involved in sending the Engagement Invitation. These contacts are opportunity stakeholders.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "BusinessTitle",
                          "type": "string",
                          "description": "The sender-provided contact's title (job title or role) associated with the EngagementInvitation.",
                          "nested_items": []
                        },
                        {
                          "name": "Email",
                          "type": "string",
                          "description": "The sender-provided contact's email address associated with the EngagementInvitation.",
                          "nested_items": []
                        },
                        {
                          "name": "FirstName",
                          "type": "string",
                          "description": "The sender-provided contact's last name associated with the EngagementInvitation.",
                          "nested_items": []
                        },
                        {
                          "name": "LastName",
                          "type": "string",
                          "description": "The sender-provided contact's first name associated with the EngagementInvitation.",
                          "nested_items": []
                        },
                        {
                          "name": "Phone",
                          "type": "string",
                          "description": "The sender-provided contact's phone number associated with the EngagementInvitation.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "PayloadType",
          "type": "string",
          "description": "The type of payload contained in the engagement invitation, indicating what data or context the payload covers.",
          "nested_items": []
        },
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Alias",
                  "type": "string",
                  "description": "Represents the alias of the partner account receiving the Engagement Invitation, making it easier to identify and track the recipient in reports or logs.",
                  "nested_items": []
                },
                {
                  "name": "AwsAccountId",
                  "type": "string",
                  "description": "Indicates the AWS account ID of the partner who received the Engagement Invitation. This is a unique identifier for managing engagements with specific AWS accounts.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "RejectionReason",
          "type": "string",
          "description": "If the engagement invitation was rejected, this field specifies the reason provided by the partner for the rejection.",
          "nested_items": []
        },
        {
          "name": "SenderAwsAccountId",
          "type": "string",
          "description": "Specifies the AWS Account ID of the sender, which identifies the AWS team responsible for sharing the engagement invitation.",
          "nested_items": []
        },
        {
          "name": "SenderCompanyName",
          "type": "string",
          "description": "The name of the AWS organization or team that sent the engagement invitation.",
          "nested_items": []
        },
        {
          "name": "Status",
          "type": "string",
          "description": "The current status of the engagement invitation.",
          "nested_items": []
        }
      ]
    }
  ]
}