{
  "method_name": "list_engagement_from_opportunity_tasks",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/partnercentral-selling/client/list_engagement_from_opportunity_tasks.html",
  "description": "Lists all in-progress, completed, or failed EngagementFromOpportunity tasks that were initiated by the caller's account.",
  "parameters": [
    {
      "name": "Catalog",
      "type": "string",
      "required": true,
      "description": "Specifies the catalog related to the request. Valid values are: AWS: Retrieves the request from the production AWS environment. Sandbox: Retrieves the request from a sandbox environment used for testing or development purposes.",
      "nested_params": []
    },
    {
      "name": "EngagementIdentifier",
      "type": "list",
      "required": false,
      "description": "Filters tasks by the identifiers of the engagements they created or are associated with. (string) ---",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "OpportunityIdentifier",
      "type": "list",
      "required": false,
      "description": "The identifier of the original opportunity associated with this task. (string) ---",
      "nested_params": []
    },
    {
      "name": "Sort",
      "type": "dict",
      "required": true,
      "description": "Specifies the sorting criteria for the returned results. This allows you to order the tasks based on specific attributes. Specifies the field by which the task list should be sorted. Determines the order in which the sorted results are presented.",
      "nested_params": [
        {
          "name": "SortBy",
          "type": "string",
          "required": false,
          "description": "Specifies the field by which the task list should be sorted.",
          "nested_params": []
        },
        {
          "name": "SortOrder",
          "type": "string",
          "required": false,
          "description": "Determines the order in which the sorted results are presented.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "TaskIdentifier",
      "type": "list",
      "required": false,
      "description": "Filters tasks by their unique identifiers. Use this when you want to retrieve information about specific tasks. (string) ---",
      "nested_params": []
    },
    {
      "name": "TaskStatus",
      "type": "list",
      "required": false,
      "description": "Filters the tasks based on their current status. This allows you to focus on tasks in specific states. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "NextToken",
          "type": "string",
          "description": "A token used for pagination to retrieve the next page of results. If there are more results available, this field will contain a token that can be used in a subsequent API call to retrieve the next page. If there are no more results, this field will be null or an empty string.",
          "nested_items": []
        },
        {
          "name": "TaskSummaries",
          "type": "list",
          "description": "TaskSummaries An array of TaskSummary objects containing details about each task.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "EngagementId",
                  "type": "string",
                  "description": "The unique identifier of the engagement created as a result of the task. This field is populated when the task is completed successfully.",
                  "nested_items": []
                },
                {
                  "name": "EngagementInvitationId",
                  "type": "string",
                  "description": "The unique identifier of the Engagement Invitation.",
                  "nested_items": []
                },
                {
                  "name": "Message",
                  "type": "string",
                  "description": "A detailed message providing additional information about the task, especially useful in case of failures. This field may contain error details or other relevant information about the task's execution.",
                  "nested_items": []
                },
                {
                  "name": "OpportunityId",
                  "type": "string",
                  "description": "The unique identifier of the original Opportunity from which the Engagement is being created. This field helps track the source of the Engagement creation task.",
                  "nested_items": []
                },
                {
                  "name": "ReasonCode",
                  "type": "string",
                  "description": "A code indicating the specific reason for a task failure. This field is populated when the task status is FAILED and provides a categorized reason for the failure.",
                  "nested_items": []
                },
                {
                  "name": "ResourceSnapshotJobId",
                  "type": "string",
                  "description": "The identifier of the resource snapshot job associated with this task, if a snapshot was created as part of the Engagement creation process.",
                  "nested_items": []
                },
                {
                  "name": "StartTime",
                  "type": "datetime",
                  "description": "The timestamp indicating when the task was initiated, in RFC 3339 5.6 date-time format.",
                  "nested_items": []
                },
                {
                  "name": "TaskArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) uniquely identifying this task within AWS. This ARN can be used for referencing the task in other AWS services or APIs.",
                  "nested_items": []
                },
                {
                  "name": "TaskId",
                  "type": "string",
                  "description": "A unique identifier for a specific task.",
                  "nested_items": []
                },
                {
                  "name": "TaskStatus",
                  "type": "string",
                  "description": "The current status of the task.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}