{
  "method_name": "list_solutions",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/partnercentral-selling/client/list_solutions.html",
  "description": "Retrieves a list of Partner Solutions that the partner registered on Partner Central. This API is used to generate a list of solutions that an end user selects from for association with an opportunity.",
  "parameters": [
    {
      "name": "Catalog",
      "type": "string",
      "required": true,
      "description": "Specifies the catalog associated with the request. This field takes a string value from a predefined list: AWS or Sandbox. The catalog determines which environment the solutions are listed in. Use AWS to list solutions in the Amazon Web Services catalog, and Sandbox to list solutions in a secure and isolated testing environment.",
      "nested_params": []
    },
    {
      "name": "Category",
      "type": "list",
      "required": false,
      "description": "Filters the solutions based on the category to which they belong. This allows partners to search for solutions within specific categories, such as Software, Consulting, or Managed Services. (string) ---",
      "nested_params": []
    },
    {
      "name": "Identifier",
      "type": "list",
      "required": false,
      "description": "Filters the solutions based on their unique identifier. Use this filter to retrieve specific solutions by providing the solution's identifier for accurate results. (string) ---",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "The maximum number of results returned by a single call. This value must be provided in the next call to retrieve the next set of results. Default: 20",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Sort",
      "type": "dict",
      "required": true,
      "description": "Object that configures sorting done on the response. Default Sort.SortBy is Identifier. Specifies the attribute to sort by, such as Name, CreatedDate, or Status. Specifies the sorting order, either Ascending or Descending. The default is Descending.",
      "nested_params": [
        {
          "name": "SortBy",
          "type": "string",
          "required": false,
          "description": "Specifies the attribute to sort by, such as Name, CreatedDate, or Status.",
          "nested_params": []
        },
        {
          "name": "SortOrder",
          "type": "string",
          "required": false,
          "description": "Specifies the sorting order, either Ascending or Descending. The default is Descending.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Status",
      "type": "list",
      "required": false,
      "description": "Filters solutions based on their status. This filter helps partners manage their solution portfolios effectively. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "NextToken",
          "type": "string",
          "description": "A pagination token used to retrieve the next set of results in subsequent calls. This token is included in the response only if there are additional result pages available.",
          "nested_items": []
        },
        {
          "name": "SolutionSummaries",
          "type": "list",
          "description": "An array with minimal details for solutions matching the request criteria.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Arn",
                  "type": "string",
                  "description": "The SolutionBase structure provides essential information about a solution.",
                  "nested_items": []
                },
                {
                  "name": "Catalog",
                  "type": "string",
                  "description": "Specifies the catalog in which the solution is hosted, either AWS or Sandbox. This helps partners differentiate between live solutions and those in testing environments.",
                  "nested_items": []
                },
                {
                  "name": "Category",
                  "type": "string",
                  "description": "Specifies the solution category, which helps to categorize and organize the solutions partners offer. Valid values: Software Product | Consulting Service | Hardware Product | Communications Product | Professional Service | Managed Service | Value-Added Resale Amazon Web Services Service | Distribution Service | Training Service | Merger and Acquisition Advising Service.",
                  "nested_items": []
                },
                {
                  "name": "CreatedDate",
                  "type": "datetime",
                  "description": "Indicates the solution creation date. This is useful to track and audit.",
                  "nested_items": []
                },
                {
                  "name": "Id",
                  "type": "string",
                  "description": "Enables the association of solutions (offerings) to opportunities.",
                  "nested_items": []
                },
                {
                  "name": "Name",
                  "type": "string",
                  "description": "Specifies the solution name.",
                  "nested_items": []
                },
                {
                  "name": "Status",
                  "type": "string",
                  "description": "Specifies the solution's current status, which indicates its state in the system. Valid values: Active | Inactive | Draft. The status helps partners and Amazon Web Services track the solution's lifecycle and availability. Filter for Active solutions for association to an opportunity.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}