{
  "method_name": "list_engagement_invitations",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/partnercentral-selling/client/list_engagement_invitations.html",
  "description": "Retrieves a list of engagement invitations sent to the partner. This allows partners to view all pending or past engagement invitations, helping them track opportunities shared by AWS.",
  "parameters": [
    {
      "name": "Catalog",
      "type": "string",
      "required": true,
      "description": "Specifies the catalog from which to list the engagement invitations. Use AWS for production invitations or Sandbox for testing environments.",
      "nested_params": []
    },
    {
      "name": "EngagementIdentifier",
      "type": "list",
      "required": false,
      "description": "Retrieves a list of engagement invitation summaries based on specified filters. The ListEngagementInvitations operation allows you to view all invitations that you have sent or received. You must specify the ParticipantType to filter invitations where you are either the SENDER or the RECEIVER. Invitations will automatically expire if not accepted within 15 days. (string) ---",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ParticipantType",
      "type": "string",
      "required": true,
      "description": "Specifies the type of participant for which to list engagement invitations. Identifies the role of the participant.",
      "nested_params": []
    },
    {
      "name": "PayloadType",
      "type": "list",
      "required": false,
      "description": "Defines the type of payload associated with the engagement invitations to be listed. The attributes in this payload help decide on acceptance or rejection of the invitation. (string) ---",
      "nested_params": []
    },
    {
      "name": "SenderAwsAccountId",
      "type": "list",
      "required": false,
      "description": "List of sender AWS account IDs to filter the invitations. (string) ---",
      "nested_params": []
    },
    {
      "name": "Sort",
      "type": "dict",
      "required": true,
      "description": "Specifies the sorting options for listing engagement invitations. Invitations can be sorted by fields such as InvitationDate or Status to help partners view results in their preferred order. Specifies the field by which the Engagement Invitations are sorted. Common values include InvitationDate and Status. Defines the order in which the Engagement Invitations are sorted. The values can be ASC (ascending) or DESC (descending).",
      "nested_params": [
        {
          "name": "SortBy",
          "type": "string",
          "required": false,
          "description": "Specifies the field by which the Engagement Invitations are sorted. Common values include InvitationDate and Status.",
          "nested_params": []
        },
        {
          "name": "SortOrder",
          "type": "string",
          "required": false,
          "description": "Defines the order in which the Engagement Invitations are sorted. The values can be ASC (ascending) or DESC (descending).",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Status",
      "type": "list",
      "required": false,
      "description": "Status values to filter the invitations. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "EngagementInvitationSummaries",
          "type": "list",
          "description": "An array containing summaries of engagement invitations. Each summary includes information such as the invitation title, invitation date, and the current status of the invitation.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Arn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the Engagement Invitation. The ARN is a unique identifier that allows partners to reference the invitation in their system and manage its lifecycle.",
                  "nested_items": []
                },
                {
                  "name": "Catalog",
                  "type": "string",
                  "description": "Specifies the catalog in which the Engagement Invitation resides. This can be either the AWS or Sandbox catalog, indicating whether the opportunity is live or being tested.",
                  "nested_items": []
                },
                {
                  "name": "EngagementId",
                  "type": "string",
                  "description": "The identifier of the Engagement associated with this invitation. This links the invitation to its parent Engagement.",
                  "nested_items": []
                },
                {
                  "name": "EngagementTitle",
                  "type": "string",
                  "description": "Provides a short title or description of the Engagement Invitation. This title helps partners quickly identify and differentiate between multiple engagement opportunities.",
                  "nested_items": []
                },
                {
                  "name": "ExpirationDate",
                  "type": "datetime",
                  "description": "Indicates the date and time when the Engagement Invitation will expire. After this date, the invitation can no longer be accepted, and the opportunity will be unavailable to the partner.",
                  "nested_items": []
                },
                {
                  "name": "Id",
                  "type": "string",
                  "description": "Represents the unique identifier of the Engagement Invitation. This identifier is used to track the invitation and to manage responses like acceptance or rejection.",
                  "nested_items": []
                },
                {
                  "name": "InvitationDate",
                  "type": "datetime",
                  "description": "Indicates the date when the Engagement Invitation was sent to the partner. This provides context for when the opportunity was shared and helps in tracking the timeline for engagement.",
                  "nested_items": []
                },
                {
                  "name": "ParticipantType",
                  "type": "string",
                  "description": "Identifies the role of the caller in the engagement invitation.",
                  "nested_items": []
                },
                {
                  "name": "PayloadType",
                  "type": "string",
                  "description": "Describes the type of payload associated with the Engagement Invitation, such as Opportunity or MarketplaceOffer. This helps partners understand the nature of the engagement request from AWS.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Alias",
                          "type": "string",
                          "description": "Represents the alias of the partner account receiving the Engagement Invitation, making it easier to identify and track the recipient in reports or logs.",
                          "nested_items": []
                        },
                        {
                          "name": "AwsAccountId",
                          "type": "string",
                          "description": "Indicates the AWS account ID of the partner who received the Engagement Invitation. This is a unique identifier for managing engagements with specific AWS accounts.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "SenderAwsAccountId",
                  "type": "string",
                  "description": "Specifies the AWS account ID of the sender who initiated the Engagement Invitation. This allows the partner to identify the AWS entity or representative responsible for sharing the opportunity.",
                  "nested_items": []
                },
                {
                  "name": "SenderCompanyName",
                  "type": "string",
                  "description": "Indicates the name of the company or AWS division that sent the Engagement Invitation. This information is useful for partners to know which part of AWS is requesting engagement.",
                  "nested_items": []
                },
                {
                  "name": "Status",
                  "type": "string",
                  "description": "Represents the current status of the Engagement Invitation, such as Pending, Accepted, or Rejected. The status helps track the progress and response to the invitation.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "A pagination token returned when there are more results available than can be returned in a single call. Use this token to retrieve additional pages of engagement invitation summaries.",
          "nested_items": []
        }
      ]
    }
  ]
}