{
  "method_name": "start_engagement_by_accepting_invitation_task",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/partnercentral-selling/client/start_engagement_by_accepting_invitation_task.html",
  "description": "This action starts the engagement by accepting an EngagementInvitation. The task is asynchronous and involves the following steps: accepting the invitation, creating an opportunity in the partner's account from the AWS opportunity, and copying details for tracking. When completed, an Opportunity Created event is generated, indicating that the opportunity has been successfully created in the partner's account.",
  "parameters": [
    {
      "name": "Catalog",
      "type": "string",
      "required": true,
      "description": "Specifies the catalog related to the task. Use AWS for production engagements and Sandbox for testing scenarios.",
      "nested_params": []
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": true,
      "description": "A unique, case-sensitive identifier provided by the client that helps to ensure the idempotency of the request. This can be a random or meaningful string but must be unique for each request. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "Identifier",
      "type": "string",
      "required": true,
      "description": "Specifies the unique identifier of the EngagementInvitation to be accepted. Providing the correct identifier helps ensure that the correct engagement is processed.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "A map of the key-value pairs of the tag or tags to assign. (dict) --- The key-value pair assigned to a specified resource. The key in the tag. The value in the tag.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key in the tag.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value in the tag.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "EngagementInvitationId",
          "type": "string",
          "description": "Returns the identifier of the engagement invitation that was accepted and used to create the opportunity.",
          "nested_items": []
        },
        {
          "name": "Message",
          "type": "string",
          "description": "If the task fails, this field contains a detailed message describing the failure and possible recovery steps.",
          "nested_items": []
        },
        {
          "name": "OpportunityId",
          "type": "string",
          "description": "Returns the original opportunity identifier passed in the request. This is the unique identifier for the opportunity.",
          "nested_items": []
        },
        {
          "name": "ReasonCode",
          "type": "string",
          "description": "Indicates the reason for task failure using an enumerated code.",
          "nested_items": []
        },
        {
          "name": "ResourceSnapshotJobId",
          "type": "string",
          "description": "The identifier of the Resource Snapshot Job created as part of this task.",
          "nested_items": []
        },
        {
          "name": "StartTime",
          "type": "datetime",
          "description": "The timestamp indicating when the task was initiated. The format follows RFC 3339 section 5.6.",
          "nested_items": []
        },
        {
          "name": "TaskArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the task, used for tracking and managing the task within AWS.",
          "nested_items": []
        },
        {
          "name": "TaskId",
          "type": "string",
          "description": "The unique identifier of the task, used to track the task's progress.",
          "nested_items": []
        },
        {
          "name": "TaskStatus",
          "type": "string",
          "description": "Indicates the current status of the task.",
          "nested_items": []
        }
      ]
    }
  ]
}