{
  "method_name": "submit_opportunity",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/partnercentral-selling/client/submit_opportunity.html",
  "description": "Use this action to submit an Opportunity that was previously created by partner for AWS review. After you perform this action, the Opportunity becomes non-editable until it is reviewed by AWS and has LifeCycle.ReviewStatus as either Approved or Action Required.",
  "parameters": [
    {
      "name": "Catalog",
      "type": "string",
      "required": true,
      "description": "Specifies the catalog related to the request. Valid values are: AWS: Submits the opportunity request from the production AWS environment. Sandbox: Submits the opportunity request from a sandbox environment used for testing or development purposes.",
      "nested_params": []
    },
    {
      "name": "Identifier",
      "type": "string",
      "required": true,
      "description": "The identifier of the Opportunity previously created by partner and needs to be submitted.",
      "nested_params": []
    },
    {
      "name": "InvolvementType",
      "type": "string",
      "required": true,
      "description": "Specifies the level of AWS sellers' involvement on the opportunity. Valid values: Co-sell: Indicates the user wants to co-sell with AWS. Share the opportunity with AWS to receive deal assistance and support. For Visibility Only: Indicates that the user does not need support from AWS Sales Rep. Share this opportunity with AWS for visibility only, you will not receive deal assistance and support.",
      "nested_params": []
    },
    {
      "name": "Visibility",
      "type": "string",
      "required": false,
      "description": "Determines whether to restrict visibility of the opportunity from AWS sales. Default value is Full. Valid values: Full: The opportunity is fully visible to AWS sales. Limited: The opportunity has restricted visibility to AWS sales.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}