{
  "method_name": "list_protected_resources",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/backup/client/list_protected_resources.html",
  "description": "Returns an array of resources successfully backed up by Backup, including the time the resource was saved, an Amazon Resource Name (ARN) of the resource, and a resource type.",
  "parameters": [
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Results",
          "type": "list",
          "description": "An array of resources successfully backed up by Backup including the time the resource was saved, an Amazon Resource Name (ARN) of the resource, and a resource type.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ResourceArn",
                  "type": "string",
                  "description": "An Amazon Resource Name (ARN) that uniquely identifies a resource. The format of the ARN depends on the resource type.",
                  "nested_items": []
                },
                {
                  "name": "ResourceType",
                  "type": "string",
                  "description": "The type of Amazon Web Services resource; for example, an Amazon Elastic Block Store (Amazon EBS) volume or an Amazon Relational Database Service (Amazon RDS) database. For Windows Volume Shadow Copy Service (VSS) backups, the only supported resource type is Amazon EC2.",
                  "nested_items": []
                },
                {
                  "name": "LastBackupTime",
                  "type": "datetime",
                  "description": "The date and time a resource was last backed up, in Unix format and Coordinated Universal Time (UTC). The value of LastBackupTime is accurate to milliseconds. For example, the value 1516925490.087 represents Friday, January 26, 2018 12:11:30.087 AM.",
                  "nested_items": []
                },
                {
                  "name": "ResourceName",
                  "type": "string",
                  "description": "The non-unique name of the resource that belongs to the specified backup.",
                  "nested_items": []
                },
                {
                  "name": "LastBackupVaultArn",
                  "type": "string",
                  "description": "The ARN (Amazon Resource Name) of the backup vault that contains the most recent backup recovery point.",
                  "nested_items": []
                },
                {
                  "name": "LastRecoveryPointArn",
                  "type": "string",
                  "description": "The ARN (Amazon Resource Name) of the most recent recovery point.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The next item following a partial list of returned items. For example, if a request is made to return MaxResults number of items, NextToken allows you to return more items in your list starting at the location pointed to by the next token.",
          "nested_items": []
        }
      ]
    }
  ]
}