{
  "method_name": "start_restore_job",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/backup/client/start_restore_job.html",
  "description": "Recovers the saved resource identified by an Amazon Resource Name (ARN).",
  "parameters": [
    {
      "name": "RecoveryPointArn",
      "type": "string",
      "required": true,
      "description": "An ARN that uniquely identifies a recovery point; for example, arn:aws:backup:us-east-1:123456789012:recovery-point:1EB3B5E7-9EB0-435A-A80B-108B488B0D45.",
      "nested_params": []
    },
    {
      "name": "Metadata",
      "type": "dict",
      "required": true,
      "description": "A set of metadata key-value pairs. You can get configuration metadata about a resource at the time it was backed up by calling GetRecoveryPointRestoreMetadata. However, values in addition to those provided by GetRecoveryPointRestoreMetadata might be required to restore a resource. For example, you might need to provide a new resource name if the original already exists. For more information about the metadata for each resource, see the following: Metadata for Amazon Aurora Metadata for Amazon DocumentDB Metadata for CloudFormation Metadata for Amazon DynamoDB Metadata for Amazon EBS Metadata for Amazon EC2 Metadata for Amazon EFS Metadata for Amazon FSx Metadata for Amazon Neptune Metadata for Amazon RDS Metadata for Amazon Redshift Metadata for Storage Gateway Metadata for Amazon S3 Metadata for Amazon Timestream Metadata for virtual machines (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "IamRoleArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "IdempotencyToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ResourceType",
      "type": "string",
      "required": false,
      "description": "Starts a job to restore a recovery point for one of the following resources: Aurora - Amazon Aurora DocumentDB - Amazon DocumentDB CloudFormation - CloudFormation DynamoDB - Amazon DynamoDB EBS - Amazon Elastic Block Store EC2 - Amazon Elastic Compute Cloud EFS - Amazon Elastic File System FSx - Amazon FSx Neptune - Amazon Neptune RDS - Amazon Relational Database Service Redshift - Amazon Redshift Storage Gateway - Storage Gateway S3 - Amazon Simple Storage Service Timestream - Amazon Timestream VirtualMachine - Virtual machines.",
      "nested_params": []
    },
    {
      "name": "CopySourceTagsToRestoredResource",
      "type": "boolean",
      "required": false,
      "description": "This is an optional parameter. If this equals True, tags included in the backup will be copied to the restored resource. This can only be applied to backups created through Backup.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "RestoreJobId",
          "type": "string",
          "description": "Uniquely identifies the job that restores a recovery point.",
          "nested_items": []
        }
      ]
    }
  ]
}