{
  "method_name": "batch_get_secret_value",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/secretsmanager/client/batch_get_secret_value.html",
  "description": "Retrieves the contents of the encrypted fields SecretString or SecretBinary for up to 20 secrets. To retrieve a single secret, call  GetSecretValue. To choose which secrets to retrieve, you can specify a list of secrets by name or ARN, or you can use filters. If Secrets Manager encounters errors such as AccessDeniedException while attempting to retrieve any of the secrets, you can see the errors in Errors in the response. Secrets Manager generates CloudTrail GetSecretValue log entries for each secret you request when you call this action. Do not include sensitive information in request parameters because it might be logged. For more information, see Logging Secrets Manager events with CloudTrail. Required permissions: secretsmanager:BatchGetSecretValue, and you must have secretsmanager:GetSecretValue for each secret. If you use filters, you must also have secretsmanager:ListSecrets. If the secrets are encrypted using customer-managed keys instead of the Amazon Web Services managed key aws/secretsmanager, then you also need kms:Decrypt permissions for the keys. For more information, see IAM policy actions for Secrets Manager and Authentication and access control in Secrets Manager.",
  "parameters": [
    {
      "name": "SecretIdList",
      "type": "list",
      "required": false,
      "description": "The ARN or names of the secrets to retrieve. You must include Filters or SecretIdList, but not both. (string) ---",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": false,
      "description": "The filters to choose which secrets to retrieve. You must include Filters or SecretIdList, but not both. (dict) --- Allows you to add filters when you use the search function in Secrets Manager. For more information, see Find secrets in Secrets Manager. Key (string) --- The following are keys you can use: description: Prefix match, not case-sensitive. name: Prefix match, case-sensitive. tag-key: Prefix match, case-sensitive. tag-value: Prefix match, case-sensitive. primary-region: Prefix match, case-sensitive. owning-service: Prefix match, case-sensitive. all: Breaks the filter value string into words and then searches all attributes for matches. Not case-sensitive. Values (list) --- The keyword to filter for. You can prefix your search value with an exclamation mark ( !) in order to perform negation filters. (string) ---",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The following are keys you can use:",
          "nested_params": [
            {
              "name": "description",
              "type": "",
              "required": false,
              "description": "",
              "nested_params": []
            },
            {
              "name": "name",
              "type": "",
              "required": false,
              "description": "",
              "nested_params": []
            },
            {
              "name": "tag-key",
              "type": "",
              "required": false,
              "description": "",
              "nested_params": []
            },
            {
              "name": "tag-value",
              "type": "",
              "required": false,
              "description": "",
              "nested_params": []
            },
            {
              "name": "primary-region",
              "type": "",
              "required": false,
              "description": "",
              "nested_params": []
            },
            {
              "name": "owning-service",
              "type": "",
              "required": false,
              "description": "",
              "nested_params": []
            },
            {
              "name": "all",
              "type": "",
              "required": false,
              "description": "",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Values",
          "type": "list",
          "required": false,
          "description": "The keyword to filter for. You can prefix your search value with an exclamation mark ( !) in order to perform negation filters.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "The number of results to include in the response. If there are more results available, in the response, Secrets Manager includes NextToken. To get the next results, call BatchGetSecretValue again with the value from NextToken. To use this parameter, you must also use the Filters parameter.",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "SecretValues",
          "type": "list",
          "description": "A list of secret values.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ARN",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the secret.",
                  "nested_items": []
                },
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The friendly name of the secret.",
                  "nested_items": []
                },
                {
                  "name": "VersionId",
                  "type": "string",
                  "description": "The unique version identifier of this version of the secret.",
                  "nested_items": []
                },
                {
                  "name": "SecretBinary",
                  "type": "bytes",
                  "description": "The decrypted secret value, if the secret value was originally provided as binary data in the form of a byte array. The parameter represents the binary data as a base64-encoded string.",
                  "nested_items": []
                },
                {
                  "name": "SecretString",
                  "type": "string",
                  "description": "The decrypted secret value, if the secret value was originally provided as a string or through the Secrets Manager console.",
                  "nested_items": []
                },
                {
                  "name": "VersionStages",
                  "type": "list",
                  "description": "A list of all of the staging labels currently attached to this version of the secret.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "CreatedDate",
                  "type": "datetime",
                  "description": "The date the secret was created.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "Secrets Manager includes this value if there's more output available than what is included in the current response. This can occur even when the response includes no values at all, such as when you ask for a filtered view of a long list. To get the next results, call BatchGetSecretValue again with this value.",
          "nested_items": []
        },
        {
          "name": "Errors",
          "type": "list",
          "description": "A list of errors Secrets Manager encountered while attempting to retrieve individual secrets.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "SecretId",
                  "type": "string",
                  "description": "The ARN or name of the secret.",
                  "nested_items": []
                },
                {
                  "name": "ErrorCode",
                  "type": "string",
                  "description": "The error Secrets Manager encountered while retrieving an individual secret as part of  BatchGetSecretValue, for example ResourceNotFoundException, InvalidParameterException, InvalidRequestException, DecryptionFailure, or AccessDeniedException.",
                  "nested_items": []
                },
                {
                  "name": "Message",
                  "type": "string",
                  "description": "A message describing the error.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}