{
  "method_name": "describe_secret",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/secretsmanager/client/describe_secret.html",
  "description": "Retrieves the details of a secret. It does not include the encrypted secret value. Secrets Manager only returns fields that have a value in the response. Secrets Manager generates a CloudTrail log entry when you call this action. Do not include sensitive information in request parameters because it might be logged. For more information, see Logging Secrets Manager events with CloudTrail. Required permissions: secretsmanager:DescribeSecret. For more information, see IAM policy actions for Secrets Manager and Authentication and access control in Secrets Manager.",
  "parameters": [
    {
      "name": "SecretId",
      "type": "string",
      "required": true,
      "description": "The ARN or name of the secret. For an ARN, we recommend that you specify a complete ARN rather than a partial ARN. See Finding a secret from a partial ARN.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ARN",
          "type": "string",
          "description": "The ARN of the secret.",
          "nested_items": []
        },
        {
          "name": "Name",
          "type": "string",
          "description": "The name of the secret.",
          "nested_items": []
        },
        {
          "name": "Description",
          "type": "string",
          "description": "The description of the secret.",
          "nested_items": []
        },
        {
          "name": "KmsKeyId",
          "type": "string",
          "description": "The key ID or alias ARN of the KMS key that Secrets Manager uses to encrypt the secret value. If the secret is encrypted with the Amazon Web Services managed key aws/secretsmanager, this field is omitted. Secrets created using the console use an KMS key ID.",
          "nested_items": []
        },
        {
          "name": "RotationEnabled",
          "type": "boolean",
          "description": "Specifies whether automatic rotation is turned on for this secret. If the secret has never been configured for rotation, Secrets Manager returns null.",
          "nested_items": []
        },
        {
          "name": "RotationLambdaARN",
          "type": "string",
          "description": "The ARN of the Lambda function that Secrets Manager invokes to rotate the secret.",
          "nested_items": []
        },
        {
          "name": "RotationRules",
          "type": "dict",
          "description": "The rotation schedule and Lambda function for this secret. If the secret previously had rotation turned on, but it is now turned off, this field shows the previous rotation schedule and rotation function. If the secret never had rotation turned on, this field is omitted.",
          "nested_items": [
            {
              "name": "AutomaticallyAfterDays",
              "type": "integer",
              "description": "The number of days between rotations of the secret. You can use this value to check that your secret meets your compliance guidelines for how often secrets must be rotated. If you use this field to set the rotation schedule, Secrets Manager calculates the next rotation date based on the previous rotation. Manually updating the secret value by calling PutSecretValue or UpdateSecret is considered a valid rotation.",
              "nested_items": []
            },
            {
              "name": "Duration",
              "type": "string",
              "description": "The length of the rotation window in hours, for example 3h for a three hour window. Secrets Manager rotates your secret at any time during this window. The window must not extend into the next rotation window or the next UTC day. The window starts according to the ScheduleExpression. If you don't specify a Duration, for a ScheduleExpression in hours, the window automatically closes after one hour. For a ScheduleExpression in days, the window automatically closes at the end of the UTC day. For more information, including examples, see Schedule expressions in Secrets Manager rotation in the Secrets Manager Users Guide.",
              "nested_items": []
            },
            {
              "name": "ScheduleExpression",
              "type": "string",
              "description": "A cron() or rate() expression that defines the schedule for rotating your secret. Secrets Manager rotation schedules use UTC time zone. Secrets Manager rotates your secret any time during a rotation window.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "LastRotatedDate",
          "type": "datetime",
          "description": "The last date and time that Secrets Manager rotated the secret. If the secret isn't configured for rotation or rotation has been disabled, Secrets Manager returns null.",
          "nested_items": []
        },
        {
          "name": "LastChangedDate",
          "type": "datetime",
          "description": "The last date and time that this secret was modified in any way.",
          "nested_items": []
        },
        {
          "name": "LastAccessedDate",
          "type": "datetime",
          "description": "The date that the secret was last accessed in the Region. This field is omitted if the secret has never been retrieved in the Region.",
          "nested_items": []
        },
        {
          "name": "DeletedDate",
          "type": "datetime",
          "description": "The date the secret is scheduled for deletion. If it is not scheduled for deletion, this field is omitted. When you delete a secret, Secrets Manager requires a recovery window of at least 7 days before deleting the secret. Some time after the deleted date, Secrets Manager deletes the secret, including all of its versions.",
          "nested_items": []
        },
        {
          "name": "NextRotationDate",
          "type": "datetime",
          "description": "The next rotation is scheduled to occur on or before this date. If the secret isn't configured for rotation or rotation has been disabled, Secrets Manager returns null. If rotation fails, Secrets Manager retries the entire rotation process multiple times. If rotation is unsuccessful, this date may be in the past.",
          "nested_items": []
        },
        {
          "name": "Tags",
          "type": "list",
          "description": "The list of tags attached to the secret. To add tags to a secret, use  TagResource. To remove tags, use  UntagResource.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Key",
                  "type": "string",
                  "description": "The key identifier, or name, of the tag.",
                  "nested_items": []
                },
                {
                  "name": "Value",
                  "type": "string",
                  "description": "The string value associated with the key of the tag.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "VersionIdsToStages",
          "type": "dict",
          "description": "A list of the versions of the secret that have staging labels attached. Versions that don't have staging labels are considered deprecated and Secrets Manager can delete them.",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "AWSCURRENT, which indicates the current version of the secret.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "AWSPENDING, which indicates the version of the secret that contains new secret information that will become the next current version when rotation finishes. During rotation, Secrets Manager creates an AWSPENDING version ID before creating the new secret version. To check if a secret version exists, call  GetSecretValue.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "AWSPREVIOUS, which indicates the previous current version of the secret. You can use this as the last known good version.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "OwningService",
          "type": "string",
          "description": "The ID of the service that created this secret. For more information, see Secrets managed by other Amazon Web Services services.",
          "nested_items": []
        },
        {
          "name": "CreatedDate",
          "type": "datetime",
          "description": "The date the secret was created.",
          "nested_items": []
        },
        {
          "name": "PrimaryRegion",
          "type": "string",
          "description": "The Region the secret is in. If a secret is replicated to other Regions, the replicas are listed in ReplicationStatus.",
          "nested_items": []
        },
        {
          "name": "ReplicationStatus",
          "type": "list",
          "description": "A list of the replicas of this secret and their status:",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "Failed, which indicates that the replica was not created.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "InProgress, which indicates that Secrets Manager is in the process of creating the replica.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "InSync, which indicates that the replica was created.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}