{
  "method_name": "get_secret_value",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/secretsmanager/client/get_secret_value.html",
  "description": "Retrieves the contents of the encrypted fields SecretString or SecretBinary from the specified version of a secret, whichever contains content. To retrieve the values for a group of secrets, call  BatchGetSecretValue. We recommend that you cache your secret values by using client-side caching. Caching secrets improves speed and reduces your costs. For more information, see Cache secrets for your applications. To retrieve the previous version of a secret, use VersionStage and specify AWSPREVIOUS. To revert to the previous version of a secret, call UpdateSecretVersionStage. Secrets Manager generates a CloudTrail log entry when you call this action. Do not include sensitive information in request parameters because it might be logged. For more information, see Logging Secrets Manager events with CloudTrail. Required permissions: secretsmanager:GetSecretValue. If the secret is encrypted using a customer-managed key instead of the Amazon Web Services managed key aws/secretsmanager, then you also need kms:Decrypt permissions for that key. For more information, see IAM policy actions for Secrets Manager and Authentication and access control in Secrets Manager.",
  "parameters": [
    {
      "name": "SecretId",
      "type": "string",
      "required": true,
      "description": "The ARN or name of the secret to retrieve. To retrieve a secret from another account, you must use an ARN. For an ARN, we recommend that you specify a complete ARN rather than a partial ARN. See Finding a secret from a partial ARN.",
      "nested_params": []
    },
    {
      "name": "VersionId",
      "type": "string",
      "required": false,
      "description": "The unique identifier of the version of the secret to retrieve. If you include both this parameter and VersionStage, the two parameters must refer to the same secret version. If you don't specify either a VersionStage or VersionId, then Secrets Manager returns the AWSCURRENT version. This value is typically a UUID-type value with 32 hexadecimal digits.",
      "nested_params": []
    },
    {
      "name": "VersionStage",
      "type": "string",
      "required": false,
      "description": "The staging label of the version of the secret to retrieve. Secrets Manager uses staging labels to keep track of different versions during the rotation process. If you include both this parameter and VersionId, the two parameters must refer to the same secret version. If you don't specify either a VersionStage or VersionId, Secrets Manager returns the AWSCURRENT version.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ARN",
          "type": "string",
          "description": "The ARN of the secret.",
          "nested_items": []
        },
        {
          "name": "Name",
          "type": "string",
          "description": "The friendly name of the secret.",
          "nested_items": []
        },
        {
          "name": "VersionId",
          "type": "string",
          "description": "The unique identifier of this version of the secret.",
          "nested_items": []
        },
        {
          "name": "SecretBinary",
          "type": "bytes",
          "description": "The decrypted secret value, if the secret value was originally provided as binary data in the form of a byte array. When you retrieve a SecretBinary using the HTTP API, the Python SDK, or the Amazon Web Services CLI, the value is Base64-encoded. Otherwise, it is not encoded.",
          "nested_items": []
        },
        {
          "name": "SecretString",
          "type": "string",
          "description": "The decrypted secret value, if the secret value was originally provided as a string or through the Secrets Manager console.",
          "nested_items": []
        },
        {
          "name": "VersionStages",
          "type": "list",
          "description": "A list of all of the staging labels currently attached to this version of the secret.",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": []
            }
          ]
        },
        {
          "name": "CreatedDate",
          "type": "datetime",
          "description": "The date and time that this version of the secret was created. If you don't specify which version in VersionId or VersionStage, then Secrets Manager uses the AWSCURRENT version.",
          "nested_items": []
        }
      ]
    }
  ]
}