{
  "method_name": "create_parallel_data",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/translate/client/create_parallel_data.html",
  "description": "Creates a parallel data resource in Amazon Translate by importing an input file from Amazon S3. Parallel data files contain examples that show how you want segments of text to be translated. By adding parallel data, you can influence the style, tone, and word choice in your translation output.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "A custom name for the parallel data resource in Amazon Translate. You must assign a name that is unique in the account and region.",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ParallelDataConfig",
      "type": "dict",
      "required": true,
      "description": "Specifies the format and S3 location of the parallel data input file. S3Uri (string) --- The URI of the Amazon S3 folder that contains the parallel data input file. The folder must be in the same Region as the API endpoint you are calling. Format (string) --- The format of the parallel data input file.",
      "nested_params": [
        {
          "name": "S3Uri",
          "type": "string",
          "required": false,
          "description": "The URI of the Amazon S3 folder that contains the parallel data input file. The folder must be in the same Region as the API endpoint you are calling.",
          "nested_params": []
        },
        {
          "name": "Format",
          "type": "string",
          "required": false,
          "description": "The format of the parallel data input file.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "EncryptionKey",
      "type": "dict",
      "required": true,
      "description": "The encryption key used to encrypt this object. The type of encryption key used by Amazon Translate to encrypt this object. The Amazon Resource Name (ARN) of the encryption key being used to encrypt this object.",
      "nested_params": [
        {
          "name": "Type",
          "type": "string",
          "required": false,
          "description": "The type of encryption key used by Amazon Translate to encrypt this object.",
          "nested_params": []
        },
        {
          "name": "Id",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the encryption key being used to encrypt this object.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": true,
      "description": "A unique identifier for the request. This token is automatically generated when you use Amazon Translate through an AWS SDK. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "Tags to be associated with this resource. A tag is a key-value pair that adds metadata to a resource. Each tag key for the resource must be unique. For more information, see Tagging your resources. (dict) --- A key-value pair that adds as a metadata to a resource used by Amazon Translate. The initial part of a key-value pair that forms a tag associated with a given resource. The second part of a key-value pair that forms a tag associated with a given resource.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The initial part of a key-value pair that forms a tag associated with a given resource.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The second part of a key-value pair that forms a tag associated with a given resource.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Name",
          "type": "string",
          "description": "The custom name that you assigned to the parallel data resource.",
          "nested_items": []
        },
        {
          "name": "Status",
          "type": "string",
          "description": "The status of the parallel data resource. When the resource is ready for you to use, the status is ACTIVE.",
          "nested_items": []
        }
      ]
    }
  ]
}