{
  "method_name": "import_terminology",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/translate/client/import_terminology.html",
  "description": "Creates or updates a custom terminology, depending on whether one already exists for the given terminology name. Importing a terminology with the same name as an existing one will merge the terminologies based on the chosen merge strategy. The only supported merge strategy is OVERWRITE, where the imported terminology overwrites the existing terminology of the same name. If you import a terminology that overwrites an existing one, the new terminology takes up to 10 minutes to fully propagate. After that, translations have access to the new terminology.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "The name of the custom terminology being imported.",
      "nested_params": []
    },
    {
      "name": "MergeStrategy",
      "type": "string",
      "required": true,
      "description": "The merge strategy of the custom terminology being imported. Currently, only the OVERWRITE merge strategy is supported. In this case, the imported terminology will overwrite an existing terminology of the same name.",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "TerminologyData",
      "type": "dict",
      "required": true,
      "description": "The terminology data for the custom terminology being imported. The file containing the custom terminology data. Your version of the AWS SDK performs a Base64-encoding on this field before sending a request to the AWS service. Users of the SDK should not perform Base64-encoding themselves. The data format of the custom terminology. Directionality (string) --- The directionality of your terminology resource indicates whether it has one source language (uni-directional) or multiple (multi-directional). UNI The terminology resource has one source language (for example, the first column in a CSV file), and all of its other languages are target languages. MULTI Any language in the terminology resource can be the source language or a target language. A single multi-directional terminology resource can be used for jobs that translate different language pairs. For example, if the terminology contains English and Spanish terms, it can be used for jobs that translate English to Spanish and Spanish to English. When you create a custom terminology resource without specifying the directionality, it behaves as uni-directional terminology, although this parameter will have a null value.",
      "nested_params": [
        {
          "name": "File",
          "type": "bytes",
          "required": false,
          "description": "The file containing the custom terminology data. Your version of the AWS SDK performs a Base64-encoding on this field before sending a request to the AWS service. Users of the SDK should not perform Base64-encoding themselves.",
          "nested_params": []
        },
        {
          "name": "Format",
          "type": "string",
          "required": false,
          "description": "The data format of the custom terminology.",
          "nested_params": []
        },
        {
          "name": "Directionality",
          "type": "string",
          "required": false,
          "description": "The directionality of your terminology resource indicates whether it has one source language (uni-directional) or multiple (multi-directional). The terminology resource has one source language (for example, the first column in a CSV file), and all of its other languages are target languages. Any language in the terminology resource can be the source language or a target language. A single multi-directional terminology resource can be used for jobs that translate different language pairs. For example, if the terminology contains English and Spanish terms, it can be used for jobs that translate English to Spanish and Spanish to English. When you create a custom terminology resource without specifying the directionality, it behaves as uni-directional terminology, although this parameter will have a null value.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "EncryptionKey",
      "type": "dict",
      "required": true,
      "description": "The encryption key for the custom terminology being imported. The type of encryption key used by Amazon Translate to encrypt this object. The Amazon Resource Name (ARN) of the encryption key being used to encrypt this object.",
      "nested_params": [
        {
          "name": "Type",
          "type": "string",
          "required": false,
          "description": "The type of encryption key used by Amazon Translate to encrypt this object.",
          "nested_params": []
        },
        {
          "name": "Id",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the encryption key being used to encrypt this object.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "Tags to be associated with this resource. A tag is a key-value pair that adds metadata to a resource. Each tag key for the resource must be unique. For more information, see Tagging your resources. (dict) --- A key-value pair that adds as a metadata to a resource used by Amazon Translate. The initial part of a key-value pair that forms a tag associated with a given resource. The second part of a key-value pair that forms a tag associated with a given resource.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The initial part of a key-value pair that forms a tag associated with a given resource.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The second part of a key-value pair that forms a tag associated with a given resource.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "TerminologyProperties",
          "type": "dict",
          "description": "The properties of the custom terminology being imported.",
          "nested_items": [
            {
              "name": "Name",
              "type": "string",
              "description": "The name of the custom terminology.",
              "nested_items": []
            },
            {
              "name": "Description",
              "type": "string",
              "description": "The description of the custom terminology properties.",
              "nested_items": []
            },
            {
              "name": "Arn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the custom terminology.",
              "nested_items": []
            },
            {
              "name": "SourceLanguageCode",
              "type": "string",
              "description": "The language code for the source text of the translation request for which the custom terminology is being used.",
              "nested_items": []
            },
            {
              "name": "TargetLanguageCodes",
              "type": "list",
              "description": "The language codes for the target languages available with the custom terminology resource. All possible target languages are returned in array.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "EncryptionKey",
              "type": "dict",
              "description": "The encryption key for the custom terminology.",
              "nested_items": [
                {
                  "name": "Type",
                  "type": "string",
                  "description": "The type of encryption key used by Amazon Translate to encrypt this object.",
                  "nested_items": []
                },
                {
                  "name": "Id",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the encryption key being used to encrypt this object.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "SizeBytes",
              "type": "integer",
              "description": "The size of the file used when importing a custom terminology.",
              "nested_items": []
            },
            {
              "name": "TermCount",
              "type": "integer",
              "description": "The number of terms included in the custom terminology.",
              "nested_items": []
            },
            {
              "name": "CreatedAt",
              "type": "datetime",
              "description": "The time at which the custom terminology was created, based on the timestamp.",
              "nested_items": []
            },
            {
              "name": "LastUpdatedAt",
              "type": "datetime",
              "description": "The time at which the custom terminology was last update, based on the timestamp.",
              "nested_items": []
            },
            {
              "name": "Directionality",
              "type": "string",
              "description": "The directionality of your terminology resource indicates whether it has one source language (uni-directional) or multiple (multi-directional).",
              "nested_items": []
            },
            {
              "name": "Message",
              "type": "string",
              "description": "Additional information from Amazon Translate about the terminology resource.",
              "nested_items": []
            },
            {
              "name": "SkippedTermCount",
              "type": "integer",
              "description": "The number of terms in the input file that Amazon Translate skipped when you created or updated the terminology resource.",
              "nested_items": []
            },
            {
              "name": "Format",
              "type": "string",
              "description": "The format of the custom terminology input file.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "AuxiliaryDataLocation",
          "type": "dict",
          "description": "The Amazon S3 location of a file that provides any errors or warnings that were produced by your input file. This file was created when Amazon Translate attempted to create a terminology resource. The location is returned as a presigned URL to that has a 30 minute expiration.",
          "nested_items": [
            {
              "name": "RepositoryType",
              "type": "string",
              "description": "The repository type for the custom terminology data.",
              "nested_items": []
            },
            {
              "name": "Location",
              "type": "string",
              "description": "The Amazon S3 location of the most recent custom terminology input file that was successfully imported into Amazon Translate. The location is returned as a presigned URL that has a 30-minute expiration .",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}