{
  "method_name": "batch_put_message",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iotevents-data/client/batch_put_message.html",
  "description": "Sends a set of messages to the IoT Events system. Each message payload is transformed into the input you specify ( \"inputName\") and ingested into any detectors that monitor that input. If multiple messages are sent, the order in which the messages are processed isn't guaranteed. To guarantee ordering, you must send messages one at a time and wait for a successful response.",
  "parameters": [
    {
      "name": "messages",
      "type": "list",
      "required": true,
      "description": "The list of messages to send. Each message has the following format: '{ \"messageId\": \"string\", \"inputName\": \"string\", \"payload\": \"string\"}' (dict) --- Information about a message. messageId (string) --- The ID to assign to the message. Within each batch sent, each \"messageId\" must be unique. inputName (string) --- The name of the input into which the message payload is transformed. payload (bytes) --- The payload of the message. This can be a JSON string or a Base-64-encoded string representing binary data (in which case you must decode it). timestamp (dict) --- The timestamp associated with the message. timeInMillis (integer) --- The value of the timestamp, in the Unix epoch format.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "BatchPutMessageErrorEntries",
          "type": "list",
          "description": "A list of any errors encountered when sending the messages.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "messageId",
                  "type": "string",
                  "description": "The ID of the message that caused the error. (See the value corresponding to the \"messageId\" key in the \"message\" object.)",
                  "nested_items": []
                },
                {
                  "name": "errorCode",
                  "type": "string",
                  "description": "The error code.",
                  "nested_items": []
                },
                {
                  "name": "errorMessage",
                  "type": "string",
                  "description": "A message that describes the error.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}