{
  "method_name": "batch_update_detector",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iotevents-data/client/batch_update_detector.html",
  "description": "Updates the state, variable values, and timer settings of one or more detectors (instances) of a specified detector model.",
  "parameters": [
    {
      "name": "detectors",
      "type": "list",
      "required": true,
      "description": "The list of detectors (instances) to update, along with the values to update. (dict) --- Information used to update the detector (instance). messageId (string) --- The ID to assign to the detector update \"message\". Each \"messageId\" must be unique within each batch sent. detectorModelName (string) --- The name of the detector model that created the detectors (instances). keyValue (string) --- The value of the input key attribute (identifying the device or system) that caused the creation of this detector (instance). state (dict) --- The new state, variable values, and timer settings of the detector (instance). stateName (string) --- The name of the new state of the detector (instance). variables (list) --- The new values of the detector's variables. Any variable whose value isn't specified is cleared. (dict) --- The new value of the variable. name (string) --- The name of the variable. value (string) --- The new value of the variable. timers (list) --- The new values of the detector's timers. Any timer whose value isn't specified is cleared, and its timeout event won't occur. (dict) --- The new setting of a timer. name (string) --- The name of the timer. seconds (integer) --- The new setting of the timer (the number of seconds before the timer elapses).",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "batchUpdateDetectorErrorEntries",
          "type": "list",
          "description": "A list of those detector updates that resulted in errors. (If an error is listed here, the specific update did not occur.)",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "messageId",
                  "type": "string",
                  "description": "The \"messageId\" of the update request that caused the error. (The value of the \"messageId\" in the update request \"Detector\" object.)",
                  "nested_items": []
                },
                {
                  "name": "errorCode",
                  "type": "string",
                  "description": "The error code.",
                  "nested_items": []
                },
                {
                  "name": "errorMessage",
                  "type": "string",
                  "description": "A message that describes the error.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}