{
  "method_name": "associate_source_resource",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/mgh/client/associate_source_resource.html",
  "description": "Associates a source resource with a migration task. For example, the source resource can be a source server, an application, or a migration wave.",
  "parameters": [
    {
      "name": "ProgressUpdateStream",
      "type": "string",
      "required": true,
      "description": "The name of the progress-update stream, which is used for access control as well as a namespace for migration-task names that is implicitly linked to your AWS account. The progress-update stream must uniquely identify the migration tool as it is used for all updates made by the tool; however, it does not need to be unique for each AWS account because it is scoped to the AWS account.",
      "nested_params": []
    },
    {
      "name": "MigrationTaskName",
      "type": "string",
      "required": true,
      "description": "A unique identifier that references the migration task. Do not include sensitive data in this field.",
      "nested_params": []
    },
    {
      "name": "SourceResource",
      "type": "dict",
      "required": true,
      "description": "The source resource that you want to associate. This is the name that you want to use to identify the resource. If the resource is an AWS resource, we recommend that you set this parameter to the ARN of the resource. Description (string) --- A description that can be free-form text to record additional detail about the resource for clarity or later reference. StatusDetail (string) --- A free-form description of the status of the resource.",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "This is the name that you want to use to identify the resource. If the resource is an AWS resource, we recommend that you set this parameter to the ARN of the resource.",
          "nested_params": []
        },
        {
          "name": "Description",
          "type": "string",
          "required": false,
          "description": "A description that can be free-form text to record additional detail about the resource for clarity or later reference.",
          "nested_params": []
        },
        {
          "name": "StatusDetail",
          "type": "string",
          "required": false,
          "description": "A free-form description of the status of the resource.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}