{
  "method_name": "list_source_resources",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/mgh/client/list_source_resources.html",
  "description": "Lists all the source resource that are associated with the specified MigrationTaskName and ProgressUpdateStream.",
  "parameters": [
    {
      "name": "ProgressUpdateStream",
      "type": "string",
      "required": true,
      "description": "The name of the progress-update stream, which is used for access control as well as a namespace for migration-task names that is implicitly linked to your AWS account. The progress-update stream must uniquely identify the migration tool as it is used for all updates made by the tool; however, it does not need to be unique for each AWS account because it is scoped to the AWS account.",
      "nested_params": []
    },
    {
      "name": "MigrationTaskName",
      "type": "string",
      "required": true,
      "description": "A unique identifier that references the migration task. Do not store confidential data in this field.",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "NextToken",
          "type": "string",
          "description": "If the response includes a NextToken value, that means that there are more results available. The value of NextToken is a unique pagination token for each page. To retrieve the next page of results, call this API again and specify this NextToken value in the request. Keep all other arguments unchanged. Each pagination token expires after 24 hours. Using an expired pagination token will return an HTTP 400 InvalidToken error.",
          "nested_items": []
        },
        {
          "name": "SourceResourceList",
          "type": "list",
          "description": "The list of source resources.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Name",
                  "type": "string",
                  "description": "This is the name that you want to use to identify the resource. If the resource is an AWS resource, we recommend that you set this parameter to the ARN of the resource.",
                  "nested_items": []
                },
                {
                  "name": "Description",
                  "type": "string",
                  "description": "A description that can be free-form text to record additional detail about the resource for clarity or later reference.",
                  "nested_items": []
                },
                {
                  "name": "StatusDetail",
                  "type": "string",
                  "description": "A free-form description of the status of the resource.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}