{
  "method_name": "create_predictor_backtest_export_job",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/forecast/client/create_predictor_backtest_export_job.html",
  "description": "Exports backtest forecasts and accuracy metrics generated by the  CreateAutoPredictor or  CreatePredictor operations. Two folders containing CSV or Parquet files are exported to your specified S3 bucket. The export file names will match the following conventions: <ExportJobName>_<ExportTimestamp>_<PartNumber>.csv. The <ExportTimestamp> component is in Java SimpleDate format (yyyy-MM-ddTHH-mm-ssZ). You must specify a  DataDestination object that includes an Amazon S3 bucket and an Identity and Access Management (IAM) role that Amazon Forecast can assume to access the Amazon S3 bucket. For more information, see  aws-forecast-iam-roles.",
  "parameters": [
    {
      "name": "PredictorBacktestExportJobName",
      "type": "string",
      "required": true,
      "description": "The name for the backtest export job.",
      "nested_params": []
    },
    {
      "name": "PredictorArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the predictor that you want to export.",
      "nested_params": []
    },
    {
      "name": "Destination",
      "type": "dict",
      "required": true,
      "description": "The destination for an export job. Provide an S3 path, an Identity and Access Management (IAM) role that allows Amazon Forecast to access the location, and an Key Management Service (KMS) key (optional). The path to an Amazon Simple Storage Service (Amazon S3) bucket along with the credentials to access the bucket. The path to an Amazon Simple Storage Service (Amazon S3) bucket or file(s) in an Amazon S3 bucket. The ARN of the Identity and Access Management (IAM) role that Amazon Forecast can assume to access the Amazon S3 bucket or files. If you provide a value for the KMSKeyArn key, the role must allow access to the key. Passing a role across Amazon Web Services accounts is not allowed. If you pass a role that isn't in your account, you get an InvalidInputException error. KMSKeyArn (string) --- The Amazon Resource Name (ARN) of an Key Management Service (KMS) key.",
      "nested_params": [
        {
          "name": "S3Config",
          "type": "dict",
          "required": false,
          "description": "The path to an Amazon Simple Storage Service (Amazon S3) bucket along with the credentials to access the bucket.",
          "nested_params": [
            {
              "name": "Path",
              "type": "string",
              "required": false,
              "description": "The path to an Amazon Simple Storage Service (Amazon S3) bucket or file(s) in an Amazon S3 bucket.",
              "nested_params": []
            },
            {
              "name": "RoleArn",
              "type": "string",
              "required": false,
              "description": "The ARN of the Identity and Access Management (IAM) role that Amazon Forecast can assume to access the Amazon S3 bucket or files. If you provide a value for the KMSKeyArn key, the role must allow access to the key. Passing a role across Amazon Web Services accounts is not allowed. If you pass a role that isn't in your account, you get an InvalidInputException error.",
              "nested_params": []
            },
            {
              "name": "KMSKeyArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of an Key Management Service (KMS) key.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "Optional metadata to help you categorize and organize your backtests. Each tag consists of a key and an optional value, both of which you define. Tag keys and values are case sensitive. The following restrictions apply to tags: For each resource, each tag key must be unique and each tag key must have one value. Maximum number of tags per resource: 50. Maximum key length: 128 Unicode characters in UTF-8. Maximum value length: 256 Unicode characters in UTF-8. Accepted characters: all letters and numbers, spaces representable in UTF-8, and + - = . _ : / @. If your tagging schema is used across other services and resources, the character restrictions of those services also apply. Key prefixes cannot include any upper or lowercase combination of aws: or AWS:. Values can have this prefix. If a tag value has aws as its prefix but the key does not, Forecast considers it to be a user tag and will count against the limit of 50 tags. Tags with only the key prefix of aws do not count against your tags per resource limit. You cannot edit or delete tag keys with this prefix. (dict) --- The optional metadata that you apply to a resource to help you categorize and organize them. The following basic restrictions apply to tags: Maximum number of tags per resource - 50. For each resource, each tag key must be unique, and each tag key can have only one value. Maximum key length - 128 Unicode characters in UTF-8. Maximum value length - 256 Unicode characters in UTF-8. If your tagging schema is used across multiple services and resources, remember that other services may have restrictions on allowed characters. Generally allowed characters are: letters, numbers, and spaces representable in UTF-8, and the following characters: + - = . Do not use aws:, AWS:, or any upper or lowercase combination of such as a prefix for keys as it is reserved for Amazon Web Services use. If a tag value has aws as its prefix but the key does not, then Forecast considers it to be a user tag and will count against the limit of 50 tags. One part of a key-value pair that makes up a tag. A key is a general label that acts like a category for more specific tag values. The optional part of a key-value pair that makes up a tag. A value acts as a descriptor within a tag category (key).",
      "nested_params": []
    },
    {
      "name": "Format",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "PredictorBacktestExportJobArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the predictor backtest export job that you want to export.",
          "nested_items": []
        }
      ]
    }
  ]
}