{
  "method_name": "create_dataset_import_job",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/forecast/client/create_dataset_import_job.html",
  "description": "Imports your training data to an Amazon Forecast dataset. You provide the location of your training data in an Amazon Simple Storage Service (Amazon S3) bucket and the Amazon Resource Name (ARN) of the dataset that you want to import the data to. You must specify a DataSource object that includes an Identity and Access Management (IAM) role that Amazon Forecast can assume to access the data, as Amazon Forecast makes a copy of your data and processes it in an internal Amazon Web Services system. For more information, see Set up permissions. The training data must be in CSV or Parquet format. The delimiter must be a comma (,). You can specify the path to a specific file, the S3 bucket, or to a folder in the S3 bucket. For the latter two cases, Amazon Forecast imports all files up to the limit of 10,000 files. Because dataset imports are not aggregated, your most recent dataset import is the one that is used when training a predictor or generating a forecast. Make sure that your most recent dataset import contains all of the data you want to model off of, and not just the new data collected since the previous import. To get a list of all your dataset import jobs, filtered by specified criteria, use the ListDatasetImportJobs operation.",
  "parameters": [
    {
      "name": "DatasetImportJobName",
      "type": "string",
      "required": true,
      "description": "The name for the dataset import job. We recommend including the current timestamp in the name, for example, 20190721DatasetImport. This can help you avoid getting a ResourceAlreadyExistsException exception.",
      "nested_params": []
    },
    {
      "name": "DatasetArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the Amazon Forecast dataset that you want to import data to.",
      "nested_params": []
    },
    {
      "name": "DataSource",
      "type": "dict",
      "required": true,
      "description": "The location of the training data to import and an Identity and Access Management (IAM) role that Amazon Forecast can assume to access the data. The training data must be stored in an Amazon S3 bucket. If encryption is used, DataSource must include an Key Management Service (KMS) key and the IAM role must allow Amazon Forecast permission to access the key. The KMS key and IAM role must match those specified in the EncryptionConfig parameter of the CreateDataset operation. The path to the data stored in an Amazon Simple Storage Service (Amazon S3) bucket along with the credentials to access the data. The path to an Amazon Simple Storage Service (Amazon S3) bucket or file(s) in an Amazon S3 bucket. The ARN of the Identity and Access Management (IAM) role that Amazon Forecast can assume to access the Amazon S3 bucket or files. If you provide a value for the KMSKeyArn key, the role must allow access to the key. Passing a role across Amazon Web Services accounts is not allowed. If you pass a role that isn't in your account, you get an InvalidInputException error. KMSKeyArn (string) --- The Amazon Resource Name (ARN) of an Key Management Service (KMS) key.",
      "nested_params": [
        {
          "name": "S3Config",
          "type": "dict",
          "required": false,
          "description": "The path to the data stored in an Amazon Simple Storage Service (Amazon S3) bucket along with the credentials to access the data.",
          "nested_params": [
            {
              "name": "Path",
              "type": "string",
              "required": false,
              "description": "The path to an Amazon Simple Storage Service (Amazon S3) bucket or file(s) in an Amazon S3 bucket.",
              "nested_params": []
            },
            {
              "name": "RoleArn",
              "type": "string",
              "required": false,
              "description": "The ARN of the Identity and Access Management (IAM) role that Amazon Forecast can assume to access the Amazon S3 bucket or files. If you provide a value for the KMSKeyArn key, the role must allow access to the key. Passing a role across Amazon Web Services accounts is not allowed. If you pass a role that isn't in your account, you get an InvalidInputException error.",
              "nested_params": []
            },
            {
              "name": "KMSKeyArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of an Key Management Service (KMS) key.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "TimestampFormat",
      "type": "string",
      "required": false,
      "description": "The format of timestamps in the dataset. The format that you specify depends on the DataFrequency specified when the dataset was created. The following formats are supported 'yyyy-MM-dd' For the following data frequencies: Y, M, W, and D 'yyyy-MM-dd HH:mm:ss' For the following data frequencies: H, 30min, 15min, and 1min; and optionally, for: Y, M, W, and D If the format isn't specified, Amazon Forecast expects the format to be 'yyyy-MM-dd HH:mm:ss'.",
      "nested_params": []
    },
    {
      "name": "TimeZone",
      "type": "string",
      "required": false,
      "description": "A single time zone for every item in your dataset. This option is ideal for datasets with all timestamps within a single time zone, or if all timestamps are normalized to a single time zone. Refer to the Joda-Time API for a complete list of valid time zone names.",
      "nested_params": []
    },
    {
      "name": "UseGeolocationForTimeZone",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "GeolocationFormat",
      "type": "string",
      "required": false,
      "description": "The format of the geolocation attribute. The geolocation attribute can be formatted in one of two ways: LAT_LONG - the latitude and longitude in decimal format (Example: 47.61_-122.33). CC_POSTALCODE (US Only) - the country code (US), followed by the 5-digit ZIP code (Example: US_98121).",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "The optional metadata that you apply to the dataset import job to help you categorize and organize them. Each tag consists of a key and an optional value, both of which you define. The following basic restrictions apply to tags: Maximum number of tags per resource - 50. For each resource, each tag key must be unique, and each tag key can have only one value. Maximum key length - 128 Unicode characters in UTF-8. Maximum value length - 256 Unicode characters in UTF-8. If your tagging schema is used across multiple services and resources, remember that other services may have restrictions on allowed characters. Generally allowed characters are: letters, numbers, and spaces representable in UTF-8, and the following characters: + - = . _ : / @. Tag keys and values are case sensitive. Do not use aws:, AWS:, or any upper or lowercase combination of such as a prefix for keys as it is reserved for Amazon Web Services use. You cannot edit or delete tag keys with this prefix. Values can have this prefix. If a tag value has aws as its prefix but the key does not, then Forecast considers it to be a user tag and will count against the limit of 50 tags. Tags with only the key prefix of aws do not count against your tags per resource limit. (dict) --- The optional metadata that you apply to a resource to help you categorize and organize them. One part of a key-value pair that makes up a tag. A key is a general label that acts like a category for more specific tag values. The optional part of a key-value pair that makes up a tag. A value acts as a descriptor within a tag category (key).",
      "nested_params": []
    },
    {
      "name": "Format",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ImportMode",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "DatasetImportJobArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the dataset import job.",
          "nested_items": []
        }
      ]
    }
  ]
}