{
  "method_name": "batch_update_member_ec2_deep_inspection_status",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/inspector2/client/batch_update_member_ec2_deep_inspection_status.html",
  "description": "Activates or deactivates Amazon Inspector deep inspection for the provided member accounts in your organization. You must be the delegated administrator of an organization in Amazon Inspector to use this API.",
  "parameters": [
    {
      "name": "accountIds",
      "type": "list",
      "required": true,
      "description": "The unique identifiers for the Amazon Web Services accounts to change Amazon Inspector deep inspection status for. (dict) --- An object that contains details about the status of Amazon Inspector deep inspection for a member account in your organization. accountId (string) --- The unique identifier for the Amazon Web Services account of the organization member. activateDeepInspection (boolean) --- Whether Amazon Inspector deep inspection is active in the account. If TRUE Amazon Inspector deep inspection is active, if FALSE it is not active.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "accountIds",
          "type": "list",
          "description": "An array of objects that provide details for each of the accounts that Amazon Inspector deep inspection status was successfully changed for.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "accountId",
                  "type": "string",
                  "description": "The unique identifier for the Amazon Web Services account of the organization member.",
                  "nested_items": []
                },
                {
                  "name": "errorMessage",
                  "type": "string",
                  "description": "The error message explaining why the account failed to activate Amazon Inspector deep inspection.",
                  "nested_items": []
                },
                {
                  "name": "status",
                  "type": "string",
                  "description": "The state of Amazon Inspector deep inspection in the member account.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "failedAccountIds",
          "type": "list",
          "description": "An array of objects that provide details for each of the accounts that Amazon Inspector deep inspection status could not be successfully changed for.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "accountId",
                  "type": "string",
                  "description": "The unique identifier for the Amazon Web Services account of the organization member that failed to activate Amazon Inspector deep inspection.",
                  "nested_items": []
                },
                {
                  "name": "ec2ScanStatus",
                  "type": "string",
                  "description": "The status of EC2 scanning in the account that failed to activate Amazon Inspector deep inspection.",
                  "nested_items": []
                },
                {
                  "name": "errorMessage",
                  "type": "string",
                  "description": "The error message explaining why the account failed to activate Amazon Inspector deep inspection.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}