{
  "method_name": "create_rule",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/elbv2/client/create_rule.html",
  "description": "Creates a rule for the specified listener. The listener must be associated with an Application Load Balancer. Each rule consists of a priority, one or more actions, and one or more conditions. Rules are evaluated in priority order, from the lowest value to the highest value. When the conditions for a rule are met, its actions are performed. If the conditions for no rules are met, the actions for the default rule are performed. For more information, see Listener rules in the Application Load Balancers Guide.",
  "parameters": [
    {
      "name": "ListenerArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the listener.",
      "nested_params": []
    },
    {
      "name": "Conditions",
      "type": "list",
      "required": true,
      "description": "The conditions. (dict) --- Information about a condition for a rule. Each rule can optionally include up to one of each of the following conditions: http-request-method, host-header, path-pattern, and source-ip. Each rule can also optionally include one or more of each of the following conditions: http-header and query-string. Note that the value for a condition can't be empty. For more information, see Quotas for your Application Load Balancers. Field (string) --- The field in the HTTP request. The following are the possible values: http-header http-request-method host-header path-pattern query-string source-ip Values (list) --- The condition value. Specify only when Field is host-header or path-pattern. Alternatively, to specify multiple host names or multiple path patterns, use HostHeaderConfig or PathPatternConfig. If Field is host-header and you are not using HostHeaderConfig, you can specify a single host name (for example, my.example.com) in Values. A host name is case insensitive, can be up to 128 characters in length, and can contain any of the following characters. A-Z, a-z, 0-9 . (matches 0 or more characters) ? (matches exactly 1 character) If Field is path-pattern and you are not using PathPatternConfig, you can specify a single path pattern (for example, /img/*) in Values. A path pattern is case-sensitive, can be up to 128 characters in length, and can contain any of the following characters. A-Z, a-z, 0-9 _ - . $ / ~ ' --\u0098 @ : + & (using &) (matches 0 or more characters) ? (matches exactly 1 character) (string) --- HostHeaderConfig (dict) --- Information for a host header condition. Specify only when Field is host-header. Values (list) --- The host names. The maximum size of each name is 128 characters. The comparison is case insensitive. The following wildcard characters are supported: * (matches 0 or more characters) and ? (matches exactly 1 character). If you specify multiple strings, the condition is satisfied if one of the strings matches the host name. (string) --- PathPatternConfig (dict) --- Information for a path pattern condition. Specify only when Field is path-pattern. Values (list) --- The path patterns to compare against the request URL. The maximum size of each string is 128 characters. The comparison is case sensitive. If you specify multiple strings, the condition is satisfied if one of them matches the request URL. The path pattern is compared only to the path of the URL, not to its query string. To compare against the query string, use  QueryStringConditionConfig. (string) --- HttpHeaderConfig (dict) --- Information for an HTTP header condition. Specify only when Field is http-header. HttpHeaderName (string) --- The name of the HTTP header field. The maximum size is 40 characters. The header name is case insensitive. The allowed characters are specified by RFC 7230. Wildcards are not supported. You can't use an HTTP header condition to specify the host header. Use  HostHeaderConditionConfig to specify a host header condition. Values (list) --- The strings to compare against the value of the HTTP header. The comparison strings are case insensitive. If the same header appears multiple times in the request, we search them in order until a match is found. If you specify multiple strings, the condition is satisfied if one of the strings matches the value of the HTTP header. To require that all of the strings are a match, create one condition per string. (string) --- QueryStringConfig (dict) --- Information for a query string condition. Specify only when Field is query-string. Values (list) --- The key/value pairs or values to find in the query string. To search for a literal --\u0098*' or --\u0098?' character in a query string, you must escape these characters in Values using a --\u0098' character. If you specify multiple key/value pairs or values, the condition is satisfied if one of them is found in the query string. (dict) --- Information about a key/value pair. Key (string) --- The key. You can omit the key. Value (string) --- The value. HttpRequestMethodConfig (dict) --- Information for an HTTP method condition. Specify only when Field is http-request-method. Values (list) --- The name of the request method. The allowed characters are A-Z, hyphen (-), and underscore (_). Wildcards are not supported; therefore, the method name must be an exact match. If you specify multiple strings, the condition is satisfied if one of the strings matches the HTTP request method. We recommend that you route GET and HEAD requests in the same way, because the response to a HEAD request may be cached. (string) --- SourceIpConfig (dict) --- Information for a source IP condition. Specify only when Field is source-ip. Values (list) --- The source IP addresses, in CIDR format. You can use both IPv4 and IPv6 addresses. If you specify multiple addresses, the condition is satisfied if the source IP address of the request matches one of the CIDR blocks. This condition is not satisfied by the addresses in the X-Forwarded-For header. To search for addresses in the X-Forwarded-For header, use  HttpHeaderConditionConfig. The total number of values must be less than, or equal to five. (string) ---",
      "nested_params": [
        {
          "name": "Field",
          "type": "string",
          "required": false,
          "description": "The field in the HTTP request. The following are the possible values:",
          "nested_params": []
        },
        {
          "name": "Values",
          "type": "list",
          "required": false,
          "description": "The condition value. Specify only when Field is host-header or path-pattern. Alternatively, to specify multiple host names or multiple path patterns, use HostHeaderConfig or PathPatternConfig. If Field is host-header and you are not using HostHeaderConfig, you can specify a single host name (for example, my.example.com) in Values. A host name is case insensitive, can be up to 128 characters in length, and can contain any of the following characters.",
          "nested_params": []
        },
        {
          "name": "HostHeaderConfig",
          "type": "dict",
          "required": false,
          "description": "Information for a host header condition. Specify only when Field is host-header.",
          "nested_params": [
            {
              "name": "Values",
              "type": "list",
              "required": false,
              "description": "The host names. The maximum size of each name is 128 characters. The comparison is case insensitive. The following wildcard characters are supported: * (matches 0 or more characters) and ? (matches exactly 1 character). If you specify multiple strings, the condition is satisfied if one of the strings matches the host name.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "PathPatternConfig",
          "type": "dict",
          "required": false,
          "description": "Information for a path pattern condition. Specify only when Field is path-pattern.",
          "nested_params": [
            {
              "name": "Values",
              "type": "list",
              "required": false,
              "description": "The path patterns to compare against the request URL. The maximum size of each string is 128 characters. The comparison is case sensitive. The following wildcard characters are supported: * (matches 0 or more characters) and ? (matches exactly 1 character). If you specify multiple strings, the condition is satisfied if one of them matches the request URL. The path pattern is compared only to the path of the URL, not to its query string. To compare against the query string, use  QueryStringConditionConfig.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "HttpHeaderConfig",
          "type": "dict",
          "required": false,
          "description": "Information for an HTTP header condition. Specify only when Field is http-header.",
          "nested_params": [
            {
              "name": "HttpHeaderName",
              "type": "string",
              "required": false,
              "description": "The name of the HTTP header field. The maximum size is 40 characters. The header name is case insensitive. The allowed characters are specified by RFC 7230. Wildcards are not supported. You can't use an HTTP header condition to specify the host header. Use  HostHeaderConditionConfig to specify a host header condition.",
              "nested_params": []
            },
            {
              "name": "Values",
              "type": "list",
              "required": false,
              "description": "The strings to compare against the value of the HTTP header. The maximum size of each string is 128 characters. The comparison strings are case insensitive. The following wildcard characters are supported: * (matches 0 or more characters) and ? (matches exactly 1 character). If the same header appears multiple times in the request, we search them in order until a match is found. If you specify multiple strings, the condition is satisfied if one of the strings matches the value of the HTTP header. To require that all of the strings are a match, create one condition per string.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "QueryStringConfig",
          "type": "dict",
          "required": false,
          "description": "Information for a query string condition. Specify only when Field is query-string.",
          "nested_params": [
            {
              "name": "Values",
              "type": "list",
              "required": false,
              "description": "The key/value pairs or values to find in the query string. The maximum size of each string is 128 characters. The comparison is case insensitive. The following wildcard characters are supported: * (matches 0 or more characters) and ? (matches exactly 1 character). To search for a literal --\u0098*' or --\u0098?' character in a query string, you must escape these characters in Values using a --\u0098' character. If you specify multiple key/value pairs or values, the condition is satisfied if one of them is found in the query string.",
              "nested_params": [
                {
                  "name": "Key",
                  "type": "string",
                  "required": false,
                  "description": "The key. You can omit the key.",
                  "nested_params": []
                },
                {
                  "name": "Value",
                  "type": "string",
                  "required": false,
                  "description": "The value.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "HttpRequestMethodConfig",
          "type": "dict",
          "required": false,
          "description": "Information for an HTTP method condition. Specify only when Field is http-request-method.",
          "nested_params": [
            {
              "name": "Values",
              "type": "list",
              "required": false,
              "description": "The name of the request method. The maximum size is 40 characters. The allowed characters are A-Z, hyphen (-), and underscore (_). The comparison is case sensitive. Wildcards are not supported; therefore, the method name must be an exact match. If you specify multiple strings, the condition is satisfied if one of the strings matches the HTTP request method. We recommend that you route GET and HEAD requests in the same way, because the response to a HEAD request may be cached.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "SourceIpConfig",
          "type": "dict",
          "required": false,
          "description": "Information for a source IP condition. Specify only when Field is source-ip.",
          "nested_params": [
            {
              "name": "Values",
              "type": "list",
              "required": false,
              "description": "The source IP addresses, in CIDR format. You can use both IPv4 and IPv6 addresses. Wildcards are not supported. If you specify multiple addresses, the condition is satisfied if the source IP address of the request matches one of the CIDR blocks. This condition is not satisfied by the addresses in the X-Forwarded-For header. To search for addresses in the X-Forwarded-For header, use  HttpHeaderConditionConfig. The total number of values must be less than, or equal to five.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "Priority",
      "type": "integer",
      "required": true,
      "description": "The rule priority. A listener can't have multiple rules with the same priority.",
      "nested_params": []
    },
    {
      "name": "Actions",
      "type": "list",
      "required": true,
      "description": "The actions. (dict) --- Information about an action. Each rule must include exactly one of the following types of actions: forward, fixed-response, or redirect, and it must be the last action to be performed. The type of action. TargetGroupArn (string) --- The Amazon Resource Name (ARN) of the target group. Specify only when Type is forward and you want to route to a single target group. To route to one or more target groups, use ForwardConfig instead. AuthenticateOidcConfig (dict) --- [HTTPS listeners] Information about an identity provider that is compliant with OpenID Connect (OIDC). Specify only when Type is authenticate-oidc. The OIDC issuer identifier of the IdP. This must be a full URL, including the HTTPS protocol, the domain, and the path. The authorization endpoint of the IdP. The token endpoint of the IdP. The user info endpoint of the IdP. The OAuth 2.0 client identifier. ClientSecret (string) --- The OAuth 2.0 client secret. This parameter is required if you are creating a rule. If you are modifying a rule, you can omit this parameter if you set UseExistingClientSecret to true. SessionCookieName (string) --- The name of the cookie used to maintain session information. The default is AWSELBAuthSessionCookie. Scope (string) --- The set of user claims to be requested from the IdP. The default is openid. To verify which scope values your IdP supports and how to separate multiple values, see the documentation for your IdP. SessionTimeout (integer) --- The maximum duration of the authentication session, in seconds. The default is 604800 seconds (7 days). AuthenticationRequestExtraParams (dict) --- The query parameters (up to 10) to include in the redirect request to the authorization endpoint. (string) --- (string) --- OnUnauthenticatedRequest (string) --- The behavior if the user is not authenticated. The following are possible values: deny  - Return an HTTP 401 Unauthorized error. allow  - Allow the request to be forwarded to the target. authenticate  - Redirect the request to the IdP authorization endpoint. This is the default value. UseExistingClientSecret (boolean) --- Indicates whether to use the existing client secret when modifying a rule. If you are creating a rule, you can omit this parameter or set it to false. AuthenticateCognitoConfig (dict) --- [HTTPS listeners] Information for using Amazon Cognito to authenticate users. Specify only when Type is authenticate-cognito. The Amazon Resource Name (ARN) of the Amazon Cognito user pool. The ID of the Amazon Cognito user pool client. The domain prefix or fully-qualified domain name of the Amazon Cognito user pool. Order (integer) --- The order for the action. This value is required for rules with multiple actions. The action with the lowest value for order is performed first. RedirectConfig (dict) --- [Application Load Balancer] Information for creating a redirect action. Specify only when Type is redirect. Protocol (string) --- The protocol. You can specify HTTP, HTTPS, or #{protocol}. You can redirect HTTP to HTTP, HTTP to HTTPS, and HTTPS to HTTPS. You can't redirect HTTPS to HTTP. Port (string) --- The port. You can specify a value from 1 to 65535 or #{port}. Host (string) --- The hostname. This component is not percent-encoded. The hostname can contain #{host}. Path (string) --- The absolute path, starting with the leading '/'. The path can contain #{host}, #{path}, and #{port}. Query (string) --- The query parameters, URL-encoded when necessary, but not percent-encoded. Do not include the leading '?', as it is automatically added. You can specify any of the reserved keywords. The HTTP redirect code. The redirect is either permanent (HTTP 301) or temporary (HTTP 302). FixedResponseConfig (dict) --- [Application Load Balancer] Information for creating an action that returns a custom HTTP response. Specify only when Type is fixed-response. MessageBody (string) --- The message. The HTTP response code (2XX, 4XX, or 5XX). ContentType (string) --- The content type. Valid Values: text/plain | text/css | text/html | application/javascript | application/json ForwardConfig (dict) --- Information for creating an action that distributes requests among one or more target groups. For Network Load Balancers, you can specify a single target group. Specify only when Type is forward. If you specify both ForwardConfig and TargetGroupArn, you can specify only one target group using ForwardConfig and it must be the same target group specified in TargetGroupArn. TargetGroups (list) --- The target groups. (dict) --- Information about how traffic will be distributed between multiple target groups in a forward rule. Weight (integer) --- The weight. The range is 0 to 999. TargetGroupStickinessConfig (dict) --- The target group stickiness for the rule. Enabled (boolean) --- Indicates whether target group stickiness is enabled. DurationSeconds (integer) --- The time period, in seconds, during which requests from a client should be routed to the same target group. The range is 1-604800 seconds (7 days).",
      "nested_params": [
        {
          "name": "Type",
          "type": "string",
          "required": false,
          "description": "The type of action.",
          "nested_params": []
        },
        {
          "name": "TargetGroupArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the target group. Specify only when Type is forward and you want to route to a single target group. To route to one or more target groups, use ForwardConfig instead.",
          "nested_params": []
        },
        {
          "name": "AuthenticateOidcConfig",
          "type": "dict",
          "required": false,
          "description": "[HTTPS listeners] Information about an identity provider that is compliant with OpenID Connect (OIDC). Specify only when Type is authenticate-oidc.",
          "nested_params": [
            {
              "name": "Issuer",
              "type": "string",
              "required": false,
              "description": "The OIDC issuer identifier of the IdP. This must be a full URL, including the HTTPS protocol, the domain, and the path.",
              "nested_params": []
            },
            {
              "name": "AuthorizationEndpoint",
              "type": "string",
              "required": false,
              "description": "The authorization endpoint of the IdP. This must be a full URL, including the HTTPS protocol, the domain, and the path.",
              "nested_params": []
            },
            {
              "name": "TokenEndpoint",
              "type": "string",
              "required": false,
              "description": "The token endpoint of the IdP. This must be a full URL, including the HTTPS protocol, the domain, and the path.",
              "nested_params": []
            },
            {
              "name": "UserInfoEndpoint",
              "type": "string",
              "required": false,
              "description": "The user info endpoint of the IdP. This must be a full URL, including the HTTPS protocol, the domain, and the path.",
              "nested_params": []
            },
            {
              "name": "ClientId",
              "type": "string",
              "required": false,
              "description": "The OAuth 2.0 client identifier.",
              "nested_params": []
            },
            {
              "name": "ClientSecret",
              "type": "string",
              "required": false,
              "description": "The OAuth 2.0 client secret. This parameter is required if you are creating a rule. If you are modifying a rule, you can omit this parameter if you set UseExistingClientSecret to true.",
              "nested_params": []
            },
            {
              "name": "SessionCookieName",
              "type": "string",
              "required": false,
              "description": "The name of the cookie used to maintain session information. The default is AWSELBAuthSessionCookie.",
              "nested_params": []
            },
            {
              "name": "Scope",
              "type": "string",
              "required": false,
              "description": "The set of user claims to be requested from the IdP. The default is openid. To verify which scope values your IdP supports and how to separate multiple values, see the documentation for your IdP.",
              "nested_params": []
            },
            {
              "name": "SessionTimeout",
              "type": "integer",
              "required": false,
              "description": "The maximum duration of the authentication session, in seconds. The default is 604800 seconds (7 days).",
              "nested_params": []
            },
            {
              "name": "AuthenticationRequestExtraParams",
              "type": "dict",
              "required": false,
              "description": "The query parameters (up to 10) to include in the redirect request to the authorization endpoint.",
              "nested_params": []
            },
            {
              "name": "OnUnauthenticatedRequest",
              "type": "string",
              "required": false,
              "description": "The behavior if the user is not authenticated. The following are possible values:",
              "nested_params": []
            },
            {
              "name": "UseExistingClientSecret",
              "type": "boolean",
              "required": false,
              "description": "Indicates whether to use the existing client secret when modifying a rule. If you are creating a rule, you can omit this parameter or set it to false.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "AuthenticateCognitoConfig",
          "type": "dict",
          "required": false,
          "description": "[HTTPS listeners] Information for using Amazon Cognito to authenticate users. Specify only when Type is authenticate-cognito.",
          "nested_params": [
            {
              "name": "UserPoolArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of the Amazon Cognito user pool.",
              "nested_params": []
            },
            {
              "name": "UserPoolClientId",
              "type": "string",
              "required": false,
              "description": "The ID of the Amazon Cognito user pool client.",
              "nested_params": []
            },
            {
              "name": "UserPoolDomain",
              "type": "string",
              "required": false,
              "description": "The domain prefix or fully-qualified domain name of the Amazon Cognito user pool.",
              "nested_params": []
            },
            {
              "name": "SessionCookieName",
              "type": "string",
              "required": false,
              "description": "The name of the cookie used to maintain session information. The default is AWSELBAuthSessionCookie.",
              "nested_params": []
            },
            {
              "name": "Scope",
              "type": "string",
              "required": false,
              "description": "The set of user claims to be requested from the IdP. The default is openid. To verify which scope values your IdP supports and how to separate multiple values, see the documentation for your IdP.",
              "nested_params": []
            },
            {
              "name": "SessionTimeout",
              "type": "integer",
              "required": false,
              "description": "The maximum duration of the authentication session, in seconds. The default is 604800 seconds (7 days).",
              "nested_params": []
            },
            {
              "name": "AuthenticationRequestExtraParams",
              "type": "dict",
              "required": false,
              "description": "The query parameters (up to 10) to include in the redirect request to the authorization endpoint.",
              "nested_params": []
            },
            {
              "name": "OnUnauthenticatedRequest",
              "type": "string",
              "required": false,
              "description": "The behavior if the user is not authenticated. The following are possible values:",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Order",
          "type": "integer",
          "required": false,
          "description": "The order for the action. This value is required for rules with multiple actions. The action with the lowest value for order is performed first.",
          "nested_params": []
        },
        {
          "name": "RedirectConfig",
          "type": "dict",
          "required": false,
          "description": "[Application Load Balancer] Information for creating a redirect action. Specify only when Type is redirect.",
          "nested_params": [
            {
              "name": "Protocol",
              "type": "string",
              "required": false,
              "description": "The protocol. You can specify HTTP, HTTPS, or #{protocol}. You can redirect HTTP to HTTP, HTTP to HTTPS, and HTTPS to HTTPS. You can't redirect HTTPS to HTTP.",
              "nested_params": []
            },
            {
              "name": "Port",
              "type": "string",
              "required": false,
              "description": "The port. You can specify a value from 1 to 65535 or #{port}.",
              "nested_params": []
            },
            {
              "name": "Host",
              "type": "string",
              "required": false,
              "description": "The hostname. This component is not percent-encoded. The hostname can contain #{host}.",
              "nested_params": []
            },
            {
              "name": "Path",
              "type": "string",
              "required": false,
              "description": "The absolute path, starting with the leading '/'. This component is not percent-encoded. The path can contain #{host}, #{path}, and #{port}.",
              "nested_params": []
            },
            {
              "name": "Query",
              "type": "string",
              "required": false,
              "description": "The query parameters, URL-encoded when necessary, but not percent-encoded. Do not include the leading '?', as it is automatically added. You can specify any of the reserved keywords.",
              "nested_params": []
            },
            {
              "name": "StatusCode",
              "type": "string",
              "required": false,
              "description": "The HTTP redirect code. The redirect is either permanent (HTTP 301) or temporary (HTTP 302).",
              "nested_params": []
            }
          ]
        },
        {
          "name": "FixedResponseConfig",
          "type": "dict",
          "required": false,
          "description": "[Application Load Balancer] Information for creating an action that returns a custom HTTP response. Specify only when Type is fixed-response.",
          "nested_params": [
            {
              "name": "MessageBody",
              "type": "string",
              "required": false,
              "description": "The message.",
              "nested_params": []
            },
            {
              "name": "StatusCode",
              "type": "string",
              "required": false,
              "description": "The HTTP response code (2XX, 4XX, or 5XX).",
              "nested_params": []
            },
            {
              "name": "ContentType",
              "type": "string",
              "required": false,
              "description": "The content type. Valid Values: text/plain | text/css | text/html | application/javascript | application/json.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ForwardConfig",
          "type": "dict",
          "required": false,
          "description": "Information for creating an action that distributes requests among one or more target groups. For Network Load Balancers, you can specify a single target group. Specify only when Type is forward. If you specify both ForwardConfig and TargetGroupArn, you can specify only one target group using ForwardConfig and it must be the same target group specified in TargetGroupArn.",
          "nested_params": [
            {
              "name": "TargetGroups",
              "type": "list",
              "required": false,
              "description": "The target groups. For Network Load Balancers, you can specify a single target group.",
              "nested_params": [
                {
                  "name": "TargetGroupArn",
                  "type": "string",
                  "required": false,
                  "description": "The Amazon Resource Name (ARN) of the target group.",
                  "nested_params": []
                },
                {
                  "name": "Weight",
                  "type": "integer",
                  "required": false,
                  "description": "The weight. The range is 0 to 999.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "TargetGroupStickinessConfig",
              "type": "dict",
              "required": false,
              "description": "The target group stickiness for the rule.",
              "nested_params": [
                {
                  "name": "Enabled",
                  "type": "boolean",
                  "required": false,
                  "description": "Indicates whether target group stickiness is enabled.",
                  "nested_params": []
                },
                {
                  "name": "DurationSeconds",
                  "type": "integer",
                  "required": false,
                  "description": "The time period, in seconds, during which requests from a client should be routed to the same target group. The range is 1-604800 seconds (7 days).",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "The tags to assign to the rule. (dict) --- Information about a tag. The key of the tag. Value (string) --- The value of the tag.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key of the tag.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value of the tag.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Rules",
          "type": "list",
          "description": "Information about the rule.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "RuleArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the rule.",
                  "nested_items": []
                },
                {
                  "name": "Priority",
                  "type": "string",
                  "description": "The priority.",
                  "nested_items": []
                },
                {
                  "name": "Conditions",
                  "type": "list",
                  "description": "The conditions. Each rule can include zero or one of the following conditions: http-request-method, host-header, path-pattern, and source-ip, and zero or more of the following conditions: http-header and query-string.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Field",
                          "type": "string",
                          "description": "The field in the HTTP request. The following are the possible values:",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "",
                              "description": "http-header.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "http-request-method.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "host-header.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "path-pattern.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "query-string.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "source-ip.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "Values",
                          "type": "list",
                          "description": "The condition value. Specify only when Field is host-header or path-pattern. Alternatively, to specify multiple host names or multiple path patterns, use HostHeaderConfig or PathPatternConfig.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "",
                              "description": "A-Z, a-z, 0-9",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": ".",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "",
                                  "description": ".",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "",
                              "type": "matches 0 or more characters",
                              "description": "(matches 0 or more characters)",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "matches 0 or more characters",
                                  "description": "(matches 0 or more characters)",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "",
                              "type": "matches exactly 1 character",
                              "description": "? (matches exactly 1 character)",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "HostHeaderConfig",
                          "type": "dict",
                          "description": "Information for a host header condition. Specify only when Field is host-header.",
                          "nested_items": [
                            {
                              "name": "Values",
                              "type": "list",
                              "description": "The host names. The maximum size of each name is 128 characters. The comparison is case insensitive. The following wildcard characters are supported: * (matches 0 or more characters) and ? (matches exactly 1 character).",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "string",
                                  "description": "(string) ---",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "name": "PathPatternConfig",
                          "type": "dict",
                          "description": "Information for a path pattern condition. Specify only when Field is path-pattern.",
                          "nested_items": [
                            {
                              "name": "Values",
                              "type": "list",
                              "description": "The path patterns to compare against the request URL. The maximum size of each string is 128 characters. The comparison is case sensitive. The following wildcard characters are supported: * (matches 0 or more characters) and ? (matches exactly 1 character).",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "string",
                                  "description": "(string) ---",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "name": "HttpHeaderConfig",
                          "type": "dict",
                          "description": "Information for an HTTP header condition. Specify only when Field is http-header.",
                          "nested_items": [
                            {
                              "name": "HttpHeaderName",
                              "type": "string",
                              "description": "The name of the HTTP header field. The maximum size is 40 characters. The header name is case insensitive. The allowed characters are specified by RFC 7230. Wildcards are not supported.",
                              "nested_items": []
                            },
                            {
                              "name": "Values",
                              "type": "list",
                              "description": "The strings to compare against the value of the HTTP header. The maximum size of each string is 128 characters. The comparison strings are case insensitive. The following wildcard characters are supported: * (matches 0 or more characters) and ? (matches exactly 1 character).",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "string",
                                  "description": "(string) ---",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "name": "QueryStringConfig",
                          "type": "dict",
                          "description": "Information for a query string condition. Specify only when Field is query-string.",
                          "nested_items": [
                            {
                              "name": "Values",
                              "type": "list",
                              "description": "The key/value pairs or values to find in the query string. The maximum size of each string is 128 characters. The comparison is case insensitive. The following wildcard characters are supported: * (matches 0 or more characters) and ? (matches exactly 1 character). To search for a literal --\u0098*' or --\u0098?' character in a query string, you must escape these characters in Values using a --\u0098' character.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "Key",
                                      "type": "string",
                                      "description": "The key. You can omit the key.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Value",
                                      "type": "string",
                                      "description": "The value.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "name": "HttpRequestMethodConfig",
                          "type": "dict",
                          "description": "Information for an HTTP method condition. Specify only when Field is http-request-method.",
                          "nested_items": [
                            {
                              "name": "Values",
                              "type": "list",
                              "description": "The name of the request method. The maximum size is 40 characters. The allowed characters are A-Z, hyphen (-), and underscore (_). The comparison is case sensitive. Wildcards are not supported; therefore, the method name must be an exact match.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "string",
                                  "description": "(string) ---",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "name": "SourceIpConfig",
                          "type": "dict",
                          "description": "Information for a source IP condition. Specify only when Field is source-ip.",
                          "nested_items": [
                            {
                              "name": "Values",
                              "type": "list",
                              "description": "The source IP addresses, in CIDR format. You can use both IPv4 and IPv6 addresses. Wildcards are not supported.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "string",
                                  "description": "(string) ---",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "Actions",
                  "type": "list",
                  "description": "The actions. Each rule must include exactly one of the following types of actions: forward, redirect, or fixed-response, and it must be the last action to be performed.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Type",
                          "type": "string",
                          "description": "The type of action.",
                          "nested_items": []
                        },
                        {
                          "name": "TargetGroupArn",
                          "type": "string",
                          "description": "The Amazon Resource Name (ARN) of the target group. Specify only when Type is forward and you want to route to a single target group. To route to one or more target groups, use ForwardConfig instead.",
                          "nested_items": []
                        },
                        {
                          "name": "AuthenticateOidcConfig",
                          "type": "dict",
                          "description": "[HTTPS listeners] Information about an identity provider that is compliant with OpenID Connect (OIDC). Specify only when Type is authenticate-oidc.",
                          "nested_items": [
                            {
                              "name": "Issuer",
                              "type": "string",
                              "description": "The OIDC issuer identifier of the IdP. This must be a full URL, including the HTTPS protocol, the domain, and the path.",
                              "nested_items": []
                            },
                            {
                              "name": "AuthorizationEndpoint",
                              "type": "string",
                              "description": "The authorization endpoint of the IdP. This must be a full URL, including the HTTPS protocol, the domain, and the path.",
                              "nested_items": []
                            },
                            {
                              "name": "TokenEndpoint",
                              "type": "string",
                              "description": "The token endpoint of the IdP. This must be a full URL, including the HTTPS protocol, the domain, and the path.",
                              "nested_items": []
                            },
                            {
                              "name": "UserInfoEndpoint",
                              "type": "string",
                              "description": "The user info endpoint of the IdP. This must be a full URL, including the HTTPS protocol, the domain, and the path.",
                              "nested_items": []
                            },
                            {
                              "name": "ClientId",
                              "type": "string",
                              "description": "The OAuth 2.0 client identifier.",
                              "nested_items": []
                            },
                            {
                              "name": "ClientSecret",
                              "type": "string",
                              "description": "The OAuth 2.0 client secret. This parameter is required if you are creating a rule. If you are modifying a rule, you can omit this parameter if you set UseExistingClientSecret to true.",
                              "nested_items": []
                            },
                            {
                              "name": "SessionCookieName",
                              "type": "string",
                              "description": "The name of the cookie used to maintain session information. The default is AWSELBAuthSessionCookie.",
                              "nested_items": []
                            },
                            {
                              "name": "Scope",
                              "type": "string",
                              "description": "The set of user claims to be requested from the IdP. The default is openid.",
                              "nested_items": []
                            },
                            {
                              "name": "SessionTimeout",
                              "type": "integer",
                              "description": "The maximum duration of the authentication session, in seconds. The default is 604800 seconds (7 days).",
                              "nested_items": []
                            },
                            {
                              "name": "AuthenticationRequestExtraParams",
                              "type": "dict",
                              "description": "The query parameters (up to 10) to include in the redirect request to the authorization endpoint.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "string",
                                  "description": "(string) ---",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "string",
                                      "description": "(string) ---",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "OnUnauthenticatedRequest",
                              "type": "string",
                              "description": "The behavior if the user is not authenticated. The following are possible values:",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "deny  - Return an HTTP 401 Unauthorized error.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "allow  - Allow the request to be forwarded to the target.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "authenticate  - Redirect the request to the IdP authorization endpoint. This is the default value.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "UseExistingClientSecret",
                              "type": "boolean",
                              "description": "Indicates whether to use the existing client secret when modifying a rule. If you are creating a rule, you can omit this parameter or set it to false.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "AuthenticateCognitoConfig",
                          "type": "dict",
                          "description": "[HTTPS listeners] Information for using Amazon Cognito to authenticate users. Specify only when Type is authenticate-cognito.",
                          "nested_items": [
                            {
                              "name": "UserPoolArn",
                              "type": "string",
                              "description": "The Amazon Resource Name (ARN) of the Amazon Cognito user pool.",
                              "nested_items": []
                            },
                            {
                              "name": "UserPoolClientId",
                              "type": "string",
                              "description": "The ID of the Amazon Cognito user pool client.",
                              "nested_items": []
                            },
                            {
                              "name": "UserPoolDomain",
                              "type": "string",
                              "description": "The domain prefix or fully-qualified domain name of the Amazon Cognito user pool.",
                              "nested_items": []
                            },
                            {
                              "name": "SessionCookieName",
                              "type": "string",
                              "description": "The name of the cookie used to maintain session information. The default is AWSELBAuthSessionCookie.",
                              "nested_items": []
                            },
                            {
                              "name": "Scope",
                              "type": "string",
                              "description": "The set of user claims to be requested from the IdP. The default is openid.",
                              "nested_items": []
                            },
                            {
                              "name": "SessionTimeout",
                              "type": "integer",
                              "description": "The maximum duration of the authentication session, in seconds. The default is 604800 seconds (7 days).",
                              "nested_items": []
                            },
                            {
                              "name": "AuthenticationRequestExtraParams",
                              "type": "dict",
                              "description": "The query parameters (up to 10) to include in the redirect request to the authorization endpoint.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "string",
                                  "description": "(string) ---",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "string",
                                      "description": "(string) ---",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "OnUnauthenticatedRequest",
                              "type": "string",
                              "description": "The behavior if the user is not authenticated. The following are possible values:",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "deny  - Return an HTTP 401 Unauthorized error.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "allow  - Allow the request to be forwarded to the target.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "authenticate  - Redirect the request to the IdP authorization endpoint. This is the default value.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "name": "Order",
                          "type": "integer",
                          "description": "The order for the action. This value is required for rules with multiple actions. The action with the lowest value for order is performed first.",
                          "nested_items": []
                        },
                        {
                          "name": "RedirectConfig",
                          "type": "dict",
                          "description": "[Application Load Balancer] Information for creating a redirect action. Specify only when Type is redirect.",
                          "nested_items": [
                            {
                              "name": "Protocol",
                              "type": "string",
                              "description": "The protocol. You can specify HTTP, HTTPS, or #{protocol}. You can redirect HTTP to HTTP, HTTP to HTTPS, and HTTPS to HTTPS. You can't redirect HTTPS to HTTP.",
                              "nested_items": []
                            },
                            {
                              "name": "Port",
                              "type": "string",
                              "description": "The port. You can specify a value from 1 to 65535 or #{port}.",
                              "nested_items": []
                            },
                            {
                              "name": "Host",
                              "type": "string",
                              "description": "The hostname. This component is not percent-encoded. The hostname can contain #{host}.",
                              "nested_items": []
                            },
                            {
                              "name": "Path",
                              "type": "string",
                              "description": "The absolute path, starting with the leading '/'. This component is not percent-encoded. The path can contain #{host}, #{path}, and #{port}.",
                              "nested_items": []
                            },
                            {
                              "name": "Query",
                              "type": "string",
                              "description": "The query parameters, URL-encoded when necessary, but not percent-encoded. Do not include the leading '?', as it is automatically added. You can specify any of the reserved keywords.",
                              "nested_items": []
                            },
                            {
                              "name": "StatusCode",
                              "type": "string",
                              "description": "The HTTP redirect code. The redirect is either permanent (HTTP 301) or temporary (HTTP 302).",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "FixedResponseConfig",
                          "type": "dict",
                          "description": "[Application Load Balancer] Information for creating an action that returns a custom HTTP response. Specify only when Type is fixed-response.",
                          "nested_items": [
                            {
                              "name": "MessageBody",
                              "type": "string",
                              "description": "The message.",
                              "nested_items": []
                            },
                            {
                              "name": "StatusCode",
                              "type": "string",
                              "description": "The HTTP response code (2XX, 4XX, or 5XX).",
                              "nested_items": []
                            },
                            {
                              "name": "ContentType",
                              "type": "string",
                              "description": "The content type.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "ForwardConfig",
                          "type": "dict",
                          "description": "Information for creating an action that distributes requests among one or more target groups. For Network Load Balancers, you can specify a single target group. Specify only when Type is forward. If you specify both ForwardConfig and TargetGroupArn, you can specify only one target group using ForwardConfig and it must be the same target group specified in TargetGroupArn.",
                          "nested_items": [
                            {
                              "name": "TargetGroups",
                              "type": "list",
                              "description": "The target groups. For Network Load Balancers, you can specify a single target group.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "TargetGroupArn",
                                      "type": "string",
                                      "description": "The Amazon Resource Name (ARN) of the target group.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Weight",
                                      "type": "integer",
                                      "description": "The weight. The range is 0 to 999.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "TargetGroupStickinessConfig",
                              "type": "dict",
                              "description": "The target group stickiness for the rule.",
                              "nested_items": [
                                {
                                  "name": "Enabled",
                                  "type": "boolean",
                                  "description": "Indicates whether target group stickiness is enabled.",
                                  "nested_items": []
                                },
                                {
                                  "name": "DurationSeconds",
                                  "type": "integer",
                                  "description": "The time period, in seconds, during which requests from a client should be routed to the same target group. The range is 1-604800 seconds (7 days).",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "IsDefault",
                  "type": "boolean",
                  "description": "Indicates whether this is the default rule.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}