{
  "method_name": "list_shared_report_groups",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/codebuild/client/list_shared_report_groups.html",
  "description": "Gets a list of report groups that are shared with other Amazon Web Services accounts or users.",
  "parameters": [
    {
      "name": "sortOrder",
      "type": "string",
      "required": false,
      "description": "The order in which to list shared report groups. Valid values include: ASCENDING: List in ascending order. DESCENDING: List in descending order.",
      "nested_params": []
    },
    {
      "name": "sortBy",
      "type": "string",
      "required": false,
      "description": "The criterion to be used to list report groups shared with the current Amazon Web Services account or user. Valid values include: ARN: List based on the ARN. MODIFIED_TIME: List based on when information about the shared report group was last changed.",
      "nested_params": []
    },
    {
      "name": "nextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "maxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "nextToken",
          "type": "string",
          "description": "During a previous call, the maximum number of items that can be returned is the value specified in maxResults. If there more items in the list, then a unique string called a nextToken is returned. To get the next batch of items in the list, call this operation again, adding the next token to the call. To get all of the items in the list, keep calling this operation with each subsequent next token that is returned, until no more next tokens are returned.",
          "nested_items": []
        },
        {
          "name": "reportGroups",
          "type": "list",
          "description": "The list of ARNs for the report groups shared with the current Amazon Web Services account or user.",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}