{
  "method_name": "put_session",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/lex-runtime/client/put_session.html",
  "description": "Creates a new session or modifies an existing session with an Amazon Lex bot. Use this operation to enable your application to set the state of the bot. For more information, see Managing Sessions.",
  "parameters": [
    {
      "name": "botName",
      "type": "string",
      "required": true,
      "description": "The name of the bot that contains the session data.",
      "nested_params": []
    },
    {
      "name": "botAlias",
      "type": "string",
      "required": true,
      "description": "The alias in use for the bot that contains the session data.",
      "nested_params": []
    },
    {
      "name": "userId",
      "type": "string",
      "required": true,
      "description": "The ID of the client application user. Amazon Lex uses this to identify a user's conversation with your bot.",
      "nested_params": []
    },
    {
      "name": "sessionAttributes",
      "type": "dict",
      "required": false,
      "description": "Map of key/value pairs representing the session-specific context information. It contains application information passed between Amazon Lex and a client application. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "dialogAction",
      "type": "dict",
      "required": true,
      "description": "Sets the next action that the bot should take to fulfill the conversation. The next action that the bot should take in its interaction with the user. The possible values are: ConfirmIntent - The next action is asking the user if the intent is complete and ready to be fulfilled. This is a yes/no question such as 'Place the order?' Close - Indicates that the there will not be a response from the user. For example, the statement 'Your order has been placed' does not require a response. Delegate - The next action is determined by Amazon Lex. ElicitIntent - The next action is to determine the intent that the user wants to fulfill. ElicitSlot - The next action is to elicit a slot value from the user. intentName (string) --- The name of the intent. slots (dict) --- Map of the slots that have been gathered and their values. (string) --- (string) --- slotToElicit (string) --- The name of the slot that should be elicited from the user. fulfillmentState (string) --- The fulfillment state of the intent. The possible values are: Failed - The Lambda function associated with the intent failed to fulfill the intent. Fulfilled - The intent has fulfilled by the Lambda function associated with the intent. ReadyForFulfillment - All of the information necessary for the intent is present and the intent ready to be fulfilled by the client application. message (string) --- The message that should be shown to the user. If you don't specify a message, Amazon Lex will use the message configured for the intent. messageFormat (string) --- PlainText - The message contains plain UTF-8 text. CustomPayload - The message is a custom format for the client. SSML - The message contains text formatted for voice output. Composite - The message contains an escaped JSON object containing one or more messages. For more information, see Message Groups.",
      "nested_params": [
        {
          "name": "type",
          "type": "string",
          "required": false,
          "description": "The next action that the bot should take in its interaction with the user. The possible values are:",
          "nested_params": []
        },
        {
          "name": "intentName",
          "type": "string",
          "required": false,
          "description": "The name of the intent.",
          "nested_params": []
        },
        {
          "name": "slots",
          "type": "dict",
          "required": false,
          "description": "Map of the slots that have been gathered and their values.",
          "nested_params": []
        },
        {
          "name": "slotToElicit",
          "type": "string",
          "required": false,
          "description": "The name of the slot that should be elicited from the user.",
          "nested_params": []
        },
        {
          "name": "fulfillmentState",
          "type": "string",
          "required": false,
          "description": "The fulfillment state of the intent. The possible values are:",
          "nested_params": []
        },
        {
          "name": "message",
          "type": "string",
          "required": false,
          "description": "The message that should be shown to the user. If you don't specify a message, Amazon Lex will use the message configured for the intent.",
          "nested_params": []
        },
        {
          "name": "messageFormat",
          "type": "string",
          "required": false,
          "description": "",
          "nested_params": []
        }
      ]
    },
    {
      "name": "recentIntentSummaryView",
      "type": "list",
      "required": true,
      "description": "A summary of the recent intents for the bot. You can use the intent summary view to set a checkpoint label on an intent and modify attributes of intents. You can also use it to remove or add intent summary objects to the list. An intent that you modify or add to the list must make sense for the bot. For example, the intent name must be valid for the bot. You must provide valid values for: intentName slot names slotToElict If you send the recentIntentSummaryView parameter in a PutSession request, the contents of the new summary view replaces the old summary view. For example, if a GetSession request returns three intents in the summary view and you call PutSession with one intent in the summary view, the next call to GetSession will only return one intent. (dict) --- Provides information about the state of an intent. You can use this information to get the current state of an intent so that you can process the intent, or so that you can return the intent to its previous state. intentName (string) --- The name of the intent. checkpointLabel (string) --- A user-defined label that identifies a particular intent. You can use this label to return to a previous intent. Use the checkpointLabelFilter parameter of the GetSessionRequest operation to filter the intents returned by the operation to those with only the specified label. slots (dict) --- Map of the slots that have been gathered and their values. (string) --- (string) --- confirmationStatus (string) --- The status of the intent after the user responds to the confirmation prompt. If the user confirms the intent, Amazon Lex sets this field to Confirmed. If the user denies the intent, Amazon Lex sets this value to Denied. The possible values are: Confirmed - The user has responded 'Yes' to the confirmation prompt, confirming that the intent is complete and that it is ready to be fulfilled. Denied - The user has responded 'No' to the confirmation prompt. None - The user has never been prompted for confirmation; or, the user was prompted but did not confirm or deny the prompt. The next action that the bot should take in its interaction with the user. The possible values are: ConfirmIntent - The next action is asking the user if the intent is complete and ready to be fulfilled. This is a yes/no question such as 'Place the order?' Close - Indicates that the there will not be a response from the user. For example, the statement 'Your order has been placed' does not require a response. ElicitIntent - The next action is to determine the intent that the user wants to fulfill. ElicitSlot - The next action is to elicit a slot value from the user. fulfillmentState (string) --- The fulfillment state of the intent. The possible values are: Failed - The Lambda function associated with the intent failed to fulfill the intent. Fulfilled - The intent has fulfilled by the Lambda function associated with the intent. ReadyForFulfillment - All of the information necessary for the intent is present and the intent ready to be fulfilled by the client application. slotToElicit (string) --- The next slot to elicit from the user. If there is not slot to elicit, the field is blank.",
      "nested_params": []
    },
    {
      "name": "accept",
      "type": "string",
      "required": false,
      "description": "The message that Amazon Lex returns in the response can be either text or speech based depending on the value of this field. If the value is text/plain; charset=utf-8, Amazon Lex returns text in the response. If the value begins with audio/, Amazon Lex returns speech in the response. Amazon Lex uses Amazon Polly to generate the speech in the configuration that you specify. For example, if you specify audio/mpeg as the value, Amazon Lex returns speech in the MPEG format. If the value is audio/pcm, the speech is returned as audio/pcm in 16-bit, little endian format. The following are the accepted values: audio/mpeg audio/ogg audio/pcm audio/* (defaults to mpeg) text/plain; charset=utf-8",
      "nested_params": []
    },
    {
      "name": "activeContexts",
      "type": "list",
      "required": true,
      "description": "A list of contexts active for the request. A context can be activated when a previous intent is fulfilled, or by including the context in the request, If you don't specify a list of contexts, Amazon Lex will use the current list of contexts for the session. If you specify an empty list, all contexts for the session are cleared. (dict) --- A context is a variable that contains information about the current state of the conversation between a user and Amazon Lex. Context can be set automatically by Amazon Lex when an intent is fulfilled, or it can be set at runtime using the PutContent, PutText, or PutSession operation. The name of the context. The length of time or number of turns that a context remains active. timeToLiveInSeconds (integer) --- The number of seconds that the context should be active after it is first sent in a PostContent or PostText response. You can set the value between 5 and 86,400 seconds (24 hours). turnsToLive (integer) --- The number of conversation turns that the context should be active. A conversation turn is one PostContent or PostText request and the corresponding response from Amazon Lex. State variables for the current context. You can use these values as default values for slots in subsequent events. (string) --- (string) ---",
      "nested_params": [
        {
          "name": "name",
          "type": "string",
          "required": false,
          "description": "The name of the context.",
          "nested_params": []
        },
        {
          "name": "timeToLive",
          "type": "dict",
          "required": false,
          "description": "The length of time or number of turns that a context remains active.",
          "nested_params": [
            {
              "name": "timeToLiveInSeconds",
              "type": "integer",
              "required": false,
              "description": "The number of seconds that the context should be active after it is first sent in a PostContent or PostText response. You can set the value between 5 and 86,400 seconds (24 hours).",
              "nested_params": []
            },
            {
              "name": "turnsToLive",
              "type": "integer",
              "required": false,
              "description": "The number of conversation turns that the context should be active. A conversation turn is one PostContent or PostText request and the corresponding response from Amazon Lex.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "parameters",
          "type": "dict",
          "required": false,
          "description": "State variables for the current context. You can use these values as default values for slots in subsequent events.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "contentType",
          "type": "string",
          "description": "Content type as specified in the Accept HTTP header in the request.",
          "nested_items": []
        },
        {
          "name": "intentName",
          "type": "string",
          "description": "The name of the current intent.",
          "nested_items": []
        },
        {
          "name": "slots",
          "type": "JSON serializable",
          "description": "Map of zero or more intent slots Amazon Lex detected from the user input during the conversation.",
          "nested_items": []
        },
        {
          "name": "sessionAttributes",
          "type": "JSON serializable",
          "description": "Map of key/value pairs representing session-specific context information.",
          "nested_items": []
        },
        {
          "name": "message",
          "type": "string",
          "description": "The next message that should be presented to the user.",
          "nested_items": []
        },
        {
          "name": "encodedMessage",
          "type": "string",
          "description": "The next message that should be presented to the user.",
          "nested_items": []
        },
        {
          "name": "messageFormat",
          "type": "string",
          "description": "The format of the response message. One of the following values:",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "PlainText - The message contains plain UTF-8 text.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "CustomPayload - The message is a custom format for the client.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "SSML - The message contains text formatted for voice output.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "Composite - The message contains an escaped JSON object containing one or more messages from the groups that messages were assigned to when the intent was created.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "dialogState",
          "type": "string",
          "description": "ConfirmIntent - Amazon Lex is expecting a 'yes' or 'no' response to confirm the intent before fulfilling an intent.",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "ConfirmIntent - Amazon Lex is expecting a 'yes' or 'no' response to confirm the intent before fulfilling an intent.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "ElicitIntent - Amazon Lex wants to elicit the user's intent.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "ElicitSlot - Amazon Lex is expecting the value of a slot for the current intent.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "Failed - Conveys that the conversation with the user has failed. This can happen for various reasons, including the user does not provide an appropriate response to prompts from the service, or if the Lambda function fails to fulfill the intent.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "Fulfilled - Conveys that the Lambda function has sucessfully fulfilled the intent.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "ReadyForFulfillment - Conveys that the client has to fulfill the intent.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "slotToElicit",
          "type": "string",
          "description": "If the dialogState is ElicitSlot, returns the name of the slot for which Amazon Lex is eliciting a value.",
          "nested_items": []
        },
        {
          "name": "audioStream",
          "type": "StreamingBody",
          "description": "The audio version of the message to convey to the user.",
          "nested_items": []
        },
        {
          "name": "sessionId",
          "type": "string",
          "description": "A unique identifier for the session.",
          "nested_items": []
        },
        {
          "name": "activeContexts",
          "type": "JSON serializable",
          "description": "A list of active contexts for the session.",
          "nested_items": []
        }
      ]
    }
  ]
}