{
  "method_name": "admin_disable_provider_for_user",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cognito-idp/client/admin_disable_provider_for_user.html",
  "description": "Prevents the user from signing in with the specified external (SAML or social) identity provider (IdP). If the user that you want to deactivate is a Amazon Cognito user pools native username + password user, they can't use their password to sign in. If the user to deactivate is a linked external IdP user, any link between that user and an existing user is removed. When the external user signs in again, and the user is no longer attached to the previously linked DestinationUser, the user must create a new user account. The value of ProviderName must match the name of a user pool IdP. To deactivate a local user, set ProviderName to Cognito and the ProviderAttributeName to Cognito_Subject. The ProviderAttributeValue must be user's local username. The ProviderAttributeName must always be Cognito_Subject for social IdPs. The ProviderAttributeValue must always be the exact subject that was used when the user was originally linked as a source user. For de-linking a SAML identity, there are two scenarios. If the linked identity has not yet been used to sign in, the ProviderAttributeName and ProviderAttributeValue must be the same values that were used for the SourceUser when the identities were originally linked using AdminLinkProviderForUser call. This is also true if the linking was done with ProviderAttributeName set to Cognito_Subject. If the user has already signed in, the ProviderAttributeName must be Cognito_Subject and ProviderAttributeValue must be the NameID from their SAML assertion.",
  "parameters": [
    {
      "name": "UserPoolId",
      "type": "string",
      "required": true,
      "description": "The ID of the user pool where you want to delete the user's linked identities.",
      "nested_params": []
    },
    {
      "name": "User",
      "type": "dict",
      "required": true,
      "description": "The user profile that you want to delete a linked identity from. ProviderName (string) --- The name of the provider, such as Facebook, Google, or Login with Amazon. ProviderAttributeName (string) --- The name of the provider attribute to link to, such as NameID. ProviderAttributeValue (string) --- The value of the provider attribute to link to, such as xxxxx_account.",
      "nested_params": [
        {
          "name": "ProviderName",
          "type": "string",
          "required": false,
          "description": "The name of the provider, such as Facebook, Google, or Login with Amazon.",
          "nested_params": []
        },
        {
          "name": "ProviderAttributeName",
          "type": "string",
          "required": false,
          "description": "The name of the provider attribute to link to, such as NameID.",
          "nested_params": []
        },
        {
          "name": "ProviderAttributeValue",
          "type": "string",
          "required": false,
          "description": "The value of the provider attribute to link to, such as xxxxx_account.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}