{
  "method_name": "describe_user_pool_client",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cognito-idp/client/describe_user_pool_client.html",
  "description": "Given an app client ID, returns configuration information. This operation is useful when you want to inspect an existing app client and programmatically replicate the configuration to another app client. For more information about app clients, see App clients.",
  "parameters": [
    {
      "name": "UserPoolId",
      "type": "string",
      "required": true,
      "description": "The ID of the user pool that contains the app client you want to describe.",
      "nested_params": []
    },
    {
      "name": "ClientId",
      "type": "string",
      "required": true,
      "description": "The ID of the app client that you want to describe.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "UserPoolClient",
          "type": "dict",
          "description": "The details of the request app client.",
          "nested_items": [
            {
              "name": "UserPoolId",
              "type": "string",
              "description": "The ID of the user pool associated with the app client.",
              "nested_items": []
            },
            {
              "name": "ClientName",
              "type": "string",
              "description": "The name of the app client.",
              "nested_items": []
            },
            {
              "name": "ClientId",
              "type": "string",
              "description": "The ID of the app client.",
              "nested_items": []
            },
            {
              "name": "ClientSecret",
              "type": "string",
              "description": "The app client secret.",
              "nested_items": []
            },
            {
              "name": "LastModifiedDate",
              "type": "datetime",
              "description": "The date and time when the item was modified. Amazon Cognito returns this timestamp in UNIX epoch time format. Your SDK might render the output in a human-readable format like ISO 8601 or a Java Date object.",
              "nested_items": []
            },
            {
              "name": "CreationDate",
              "type": "datetime",
              "description": "The date and time when the item was created. Amazon Cognito returns this timestamp in UNIX epoch time format. Your SDK might render the output in a human-readable format like ISO 8601 or a Java Date object.",
              "nested_items": []
            },
            {
              "name": "RefreshTokenValidity",
              "type": "integer",
              "description": "The refresh token time limit. After this limit expires, your user can't use their refresh token. To specify the time unit for RefreshTokenValidity as seconds, minutes, hours, or days, set a TokenValidityUnits value in your API request.",
              "nested_items": []
            },
            {
              "name": "AccessTokenValidity",
              "type": "integer",
              "description": "The access token time limit. After this limit expires, your user can't use their access token. To specify the time unit for AccessTokenValidity as seconds, minutes, hours, or days, set a TokenValidityUnits value in your API request.",
              "nested_items": []
            },
            {
              "name": "IdTokenValidity",
              "type": "integer",
              "description": "The ID token time limit. After this limit expires, your user can't use their ID token. To specify the time unit for IdTokenValidity as seconds, minutes, hours, or days, set a TokenValidityUnits value in your API request.",
              "nested_items": []
            },
            {
              "name": "TokenValidityUnits",
              "type": "dict",
              "description": "The time units that, with IdTokenValidity, AccessTokenValidity, and RefreshTokenValidity, set and display the duration of ID, access, and refresh tokens for an app client. You can assign a separate token validity unit to each type of token.",
              "nested_items": [
                {
                  "name": "AccessToken",
                  "type": "string",
                  "description": "A time unit for the value that you set in the AccessTokenValidity parameter. The default AccessTokenValidity time unit is hours. AccessTokenValidity duration can range from five minutes to one day.",
                  "nested_items": []
                },
                {
                  "name": "IdToken",
                  "type": "string",
                  "description": "A time unit for the value that you set in the IdTokenValidity parameter. The default IdTokenValidity time unit is hours. IdTokenValidity duration can range from five minutes to one day.",
                  "nested_items": []
                },
                {
                  "name": "RefreshToken",
                  "type": "string",
                  "description": "A time unit for the value that you set in the RefreshTokenValidity parameter. The default RefreshTokenValidity time unit is days. RefreshTokenValidity duration can range from 60 minutes to 10 years.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "ReadAttributes",
              "type": "list",
              "description": "The list of user attributes that you want your app client to have read access to. After your user authenticates in your app, their access token authorizes them to read their own attribute value for any attribute in this list.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "WriteAttributes",
              "type": "list",
              "description": "The list of user attributes that you want your app client to have write access to. After your user authenticates in your app, their access token authorizes them to set or modify their own attribute value for any attribute in this list.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "ExplicitAuthFlows",
              "type": "list",
              "description": "The authentication flows that you want your user pool client to support. For each app client in your user pool, you can sign in your users with any combination of one or more flows, including with a user name and Secure Remote Password (SRP), a user name and password, or a custom authentication process that you define with Lambda functions.",
              "nested_items": [
                {
                  "name": "",
                  "type": "SRP",
                  "description": "ALLOW_USER_AUTH: Enable selection-based sign-in with USER_AUTH. This setting covers username-password, secure remote password (SRP), passwordless, and passkey authentication. This authentiation flow can do username-password and SRP authentication without other ExplicitAuthFlows permitting them. For example users can complete an SRP challenge through USER_AUTH without the flow USER_SRP_AUTH being active for the app client. This flow doesn't include CUSTOM_AUTH. To activate this setting, your user pool must be in the Essentials tier or higher.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "SRP",
                  "description": "ALLOW_ADMIN_USER_PASSWORD_AUTH: Enable admin based user password authentication flow ADMIN_USER_PASSWORD_AUTH. This setting replaces the ADMIN_NO_SRP_AUTH setting. With this authentication flow, your app passes a user name and password to Amazon Cognito in the request, instead of using the Secure Remote Password (SRP) protocol to securely transmit the password.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "ALLOW_CUSTOM_AUTH: Enable Lambda trigger based authentication.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "ALLOW_USER_PASSWORD_AUTH: Enable user password-based authentication. In this flow, Amazon Cognito receives the password in the request instead of using the SRP protocol to verify passwords.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "ALLOW_USER_SRP_AUTH: Enable SRP-based authentication.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "ALLOW_REFRESH_TOKEN_AUTH: Enable authflow to refresh tokens.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "SupportedIdentityProviders",
              "type": "list",
              "description": "A list of provider names for the identity providers (IdPs) that are supported on this client. The following are supported: COGNITO, Facebook, Google, SignInWithApple, and LoginWithAmazon. You can also specify the names that you configured for the SAML and OIDC IdPs in your user pool, for example MySAMLIdP or MyOIDCIdP.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "CallbackURLs",
              "type": "list",
              "description": "A list of allowed redirect (callback) URLs for the IdPs.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "Be an absolute URI.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Be registered with the authorization server.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Not include a fragment component.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "LogoutURLs",
              "type": "list",
              "description": "A list of allowed logout URLs for the IdPs.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "DefaultRedirectURI",
              "type": "string",
              "description": "The default redirect URI. Must be in the CallbackURLs list.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "Be an absolute URI.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Be registered with the authorization server.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Not include a fragment component.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "AllowedOAuthFlows",
              "type": "list",
              "description": "The OAuth grant types that you want your app client to generate. To create an app client that generates client credentials grants, you must add client_credentials as the only allowed OAuth flow.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "AllowedOAuthScopes",
              "type": "list",
              "description": "The OAuth 2.0 scopes that you want your app client to support. Can include standard OAuth scopes like phone, email, openid, and profile. Can also include the aws.cognito.signin.user.admin scope that authorizes user profile self-service operations and custom scopes from resource servers.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "AllowedOAuthFlowsUserPoolClient",
              "type": "boolean",
              "description": "Set to true to use OAuth 2.0 authorization server features in your app client.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "CallBackURLs: Callback URLs.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "LogoutURLs: Sign-out redirect URLs.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "AllowedOAuthScopes: OAuth 2.0 scopes.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "AllowedOAuthFlows: Support for authorization code, implicit, and client credentials OAuth 2.0 grants.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "AnalyticsConfiguration",
              "type": "dict",
              "description": "The user pool analytics configuration for collecting metrics and sending them to your Amazon Pinpoint campaign.",
              "nested_items": [
                {
                  "name": "ApplicationId",
                  "type": "string",
                  "description": "Your Amazon Pinpoint project ID.",
                  "nested_items": []
                },
                {
                  "name": "ApplicationArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of an Amazon Pinpoint project that you want to connect to your user pool app client. Amazon Cognito publishes events to the Amazon Pinpoint project that ApplicationArn declares. You can also configure your application to pass an endpoint ID in the AnalyticsMetadata parameter of sign-in operations. The endpoint ID is information about the destination for push notifications.",
                  "nested_items": []
                },
                {
                  "name": "RoleArn",
                  "type": "string",
                  "description": "The ARN of an Identity and Access Management role that has the permissions required for Amazon Cognito to publish events to Amazon Pinpoint analytics.",
                  "nested_items": []
                },
                {
                  "name": "ExternalId",
                  "type": "string",
                  "description": "The external ID of the role that Amazon Cognito assumes to send analytics data to Amazon Pinpoint.",
                  "nested_items": []
                },
                {
                  "name": "UserDataShared",
                  "type": "boolean",
                  "description": "If UserDataShared is true, Amazon Cognito includes user data in the events that it publishes to Amazon Pinpoint analytics.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "PreventUserExistenceErrors",
              "type": "string",
              "description": "When ENABLED, suppresses messages that might indicate a valid user exists when someone attempts sign-in. This parameters sets your preference for the errors and responses that you want Amazon Cognito APIs to return during authentication, account confirmation, and password recovery when the user doesn't exist in the user pool. When set to ENABLED and the user doesn't exist, authentication returns an error indicating either the username or password was incorrect. Account confirmation and password recovery return a response indicating a code was sent to a simulated destination. When set to LEGACY, those APIs return a UserNotFoundException exception if the user doesn't exist in the user pool.",
              "nested_items": []
            },
            {
              "name": "EnableTokenRevocation",
              "type": "boolean",
              "description": "Indicates whether token revocation is activated for the user pool client. When you create a new user pool client, token revocation is activated by default.",
              "nested_items": []
            },
            {
              "name": "EnablePropagateAdditionalUserContextData",
              "type": "boolean",
              "description": "When EnablePropagateAdditionalUserContextData is true, Amazon Cognito accepts an IpAddress value that you send in the UserContextData parameter. The UserContextData parameter sends information to Amazon Cognito threat protection for risk analysis. You can send UserContextData when you sign in Amazon Cognito native users with the InitiateAuth and RespondToAuthChallenge API operations.",
              "nested_items": []
            },
            {
              "name": "AuthSessionValidity",
              "type": "integer",
              "description": "Amazon Cognito creates a session token for each API request in an authentication flow. AuthSessionValidity is the duration, in minutes, of that session token. Your user pool native user must respond to each authentication challenge before the session expires.",
              "nested_items": []
            },
            {
              "name": "RefreshTokenRotation",
              "type": "dict",
              "description": "The configuration of your app client for refresh token rotation. When enabled, your app client issues new ID, access, and refresh tokens when users renew their sessions with refresh tokens. When disabled, token refresh issues only ID and access tokens.",
              "nested_items": [
                {
                  "name": "Feature",
                  "type": "string",
                  "description": "The state of refresh token rotation for the current app client.",
                  "nested_items": []
                },
                {
                  "name": "RetryGracePeriodSeconds",
                  "type": "integer",
                  "description": "When you request a token refresh with GetTokensFromRefreshToken, the original refresh token that you're rotating out can remain valid for a period of time of up to 60 seconds. This allows for client-side retries. When RetryGracePeriodSeconds is 0, the grace period is disabled and a successful request immediately invalidates the submitted refresh token.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}