{
  "method_name": "describe_user_pool",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cognito-idp/client/describe_user_pool.html",
  "description": "Given a user pool ID, returns configuration information. This operation is useful when you want to inspect an existing user pool and programmatically replicate the configuration to another user pool.",
  "parameters": [
    {
      "name": "UserPoolId",
      "type": "string",
      "required": true,
      "description": "The ID of the user pool you want to describe.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "Id",
              "type": "string",
              "description": "The ID of the user pool.",
              "nested_items": []
            },
            {
              "name": "Name",
              "type": "string",
              "description": "The name of the user pool.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "PasswordPolicy",
                  "type": "dict",
                  "description": "The password policy settings for a user pool, including complexity, history, and length requirements.",
                  "nested_items": [
                    {
                      "name": "MinimumLength",
                      "type": "integer",
                      "description": "The minimum length of the password in the policy that you have set. This value can't be less than 6.",
                      "nested_items": []
                    },
                    {
                      "name": "RequireUppercase",
                      "type": "boolean",
                      "description": "The requirement in a password policy that users must include at least one uppercase letter in their password.",
                      "nested_items": []
                    },
                    {
                      "name": "RequireLowercase",
                      "type": "boolean",
                      "description": "The requirement in a password policy that users must include at least one lowercase letter in their password.",
                      "nested_items": []
                    },
                    {
                      "name": "RequireNumbers",
                      "type": "boolean",
                      "description": "The requirement in a password policy that users must include at least one number in their password.",
                      "nested_items": []
                    },
                    {
                      "name": "RequireSymbols",
                      "type": "boolean",
                      "description": "The requirement in a password policy that users must include at least one symbol in their password.",
                      "nested_items": []
                    },
                    {
                      "name": "PasswordHistorySize",
                      "type": "integer",
                      "description": "The number of previous passwords that you want Amazon Cognito to restrict each user from reusing. Users can't set a password that matches any of n previous passwords, where n is the value of PasswordHistorySize.",
                      "nested_items": []
                    },
                    {
                      "name": "TemporaryPasswordValidityDays",
                      "type": "integer",
                      "description": "The number of days a temporary password is valid in the password policy. If the user doesn't sign in during this time, an administrator must reset their password. Defaults to 7. If you submit a value of 0, Amazon Cognito treats it as a null value and sets TemporaryPasswordValidityDays to its default value.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "SignInPolicy",
                  "type": "dict",
                  "description": "The policy for allowed types of authentication in a user pool.",
                  "nested_items": [
                    {
                      "name": "AllowedFirstAuthFactors",
                      "type": "list",
                      "description": "The sign-in methods that a user pool supports as the first factor. You can permit users to start authentication with a standard username and password, or with other one-time password and hardware factors.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "DeletionProtection",
              "type": "string",
              "description": "When active, DeletionProtection prevents accidental deletion of your user pool. Before you can delete a user pool that you have protected against deletion, you must deactivate this feature.",
              "nested_items": []
            },
            {
              "name": "LambdaConfig",
              "type": "dict",
              "description": "A collection of user pool Lambda triggers. Amazon Cognito invokes triggers at several possible stages of user pool operations. Triggers can modify the outcome of the operations that invoked them.",
              "nested_items": [
                {
                  "name": "PreSignUp",
                  "type": "string",
                  "description": "The configuration of a pre sign-up Lambda trigger in a user pool. This trigger evaluates new users and can bypass confirmation, link a federated user profile, or block sign-up requests.",
                  "nested_items": []
                },
                {
                  "name": "CustomMessage",
                  "type": "string",
                  "description": "A custom message Lambda trigger. This trigger is an opportunity to customize all SMS and email messages from your user pool. When a custom message trigger is active, your user pool routes all messages to a Lambda function that returns a runtime-customized message subject and body for your user pool to deliver to a user.",
                  "nested_items": []
                },
                {
                  "name": "PostConfirmation",
                  "type": "string",
                  "description": "The configuration of a post confirmation Lambda trigger in a user pool. This trigger can take custom actions after a user confirms their user account and their email address or phone number.",
                  "nested_items": []
                },
                {
                  "name": "PreAuthentication",
                  "type": "string",
                  "description": "The configuration of a pre authentication trigger in a user pool. This trigger can evaluate and modify user sign-in events.",
                  "nested_items": []
                },
                {
                  "name": "PostAuthentication",
                  "type": "string",
                  "description": "The configuration of a post authentication Lambda trigger in a user pool. This trigger can take custom actions after a user signs in.",
                  "nested_items": []
                },
                {
                  "name": "DefineAuthChallenge",
                  "type": "string",
                  "description": "The configuration of a define auth challenge Lambda trigger, one of three triggers in the sequence of the custom authentication challenge triggers.",
                  "nested_items": []
                },
                {
                  "name": "CreateAuthChallenge",
                  "type": "string",
                  "description": "The configuration of a create auth challenge Lambda trigger, one of three triggers in the sequence of the custom authentication challenge triggers.",
                  "nested_items": []
                },
                {
                  "name": "VerifyAuthChallengeResponse",
                  "type": "string",
                  "description": "The configuration of a verify auth challenge Lambda trigger, one of three triggers in the sequence of the custom authentication challenge triggers.",
                  "nested_items": []
                },
                {
                  "name": "PreTokenGeneration",
                  "type": "string",
                  "description": "The legacy configuration of a pre token generation Lambda trigger in a user pool.",
                  "nested_items": []
                },
                {
                  "name": "UserMigration",
                  "type": "string",
                  "description": "The configuration of a migrate user Lambda trigger in a user pool. This trigger can create user profiles when users sign in or attempt to reset their password with credentials that don't exist yet.",
                  "nested_items": []
                },
                {
                  "name": "PreTokenGenerationConfig",
                  "type": "dict",
                  "description": "The detailed configuration of a pre token generation Lambda trigger in a user pool. If you also set an ARN in PreTokenGeneration, its value must be identical to PreTokenGenerationConfig.",
                  "nested_items": [
                    {
                      "name": "LambdaVersion",
                      "type": "string",
                      "description": "The user pool trigger version of the request that Amazon Cognito sends to your Lambda function. Higher-numbered versions add fields that support new features.",
                      "nested_items": []
                    },
                    {
                      "name": "LambdaArn",
                      "type": "string",
                      "description": "The Amazon Resource Name (ARN) of the function that you want to assign to your Lambda trigger.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "CustomSMSSender",
                  "type": "dict",
                  "description": "The configuration of a custom SMS sender Lambda trigger. This trigger routes all SMS notifications from a user pool to a Lambda function that delivers the message using custom logic.",
                  "nested_items": [
                    {
                      "name": "LambdaVersion",
                      "type": "string",
                      "description": "The user pool trigger version of the request that Amazon Cognito sends to your Lambda function. Higher-numbered versions add fields that support new features.",
                      "nested_items": []
                    },
                    {
                      "name": "LambdaArn",
                      "type": "string",
                      "description": "The Amazon Resource Name (ARN) of the function that you want to assign to your Lambda trigger.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "CustomEmailSender",
                  "type": "dict",
                  "description": "The configuration of a custom email sender Lambda trigger. This trigger routes all email notifications from a user pool to a Lambda function that delivers the message using custom logic.",
                  "nested_items": [
                    {
                      "name": "LambdaVersion",
                      "type": "string",
                      "description": "The user pool trigger version of the request that Amazon Cognito sends to your Lambda function. Higher-numbered versions add fields that support new features.",
                      "nested_items": []
                    },
                    {
                      "name": "LambdaArn",
                      "type": "string",
                      "description": "The Amazon Resource Name (ARN) of the function that you want to assign to your Lambda trigger.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "KMSKeyID",
                  "type": "string",
                  "description": "The ARN of an KMS key. Amazon Cognito uses the key to encrypt codes and temporary passwords sent to custom sender Lambda triggers.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Status",
              "type": "string",
              "description": "This parameter is no longer used.",
              "nested_items": []
            },
            {
              "name": "LastModifiedDate",
              "type": "datetime",
              "description": "The date and time when the item was modified. Amazon Cognito returns this timestamp in UNIX epoch time format. Your SDK might render the output in a human-readable format like ISO 8601 or a Java Date object.",
              "nested_items": []
            },
            {
              "name": "CreationDate",
              "type": "datetime",
              "description": "The date and time when the item was created. Amazon Cognito returns this timestamp in UNIX epoch time format. Your SDK might render the output in a human-readable format like ISO 8601 or a Java Date object.",
              "nested_items": []
            },
            {
              "name": "SchemaAttributes",
              "type": "list",
              "description": "A list of the user attributes and their properties in your user pool. The attribute schema contains standard attributes, custom attributes with a custom: prefix, and developer attributes with a dev: prefix. For more information, see User pool attributes.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Name",
                      "type": "string",
                      "description": "The name of your user pool attribute. When you create or update a user pool, adding a schema attribute creates a custom or developer-only attribute. When you add an attribute with a Name value of MyAttribute, Amazon Cognito creates the custom attribute custom:MyAttribute. When DeveloperOnlyAttribute is true, Amazon Cognito creates your attribute as dev:MyAttribute. In an operation that describes a user pool, Amazon Cognito returns this value as value for standard attributes, custom:value for custom attributes, and dev:value for developer-only attributes..",
                      "nested_items": []
                    },
                    {
                      "name": "AttributeDataType",
                      "type": "string",
                      "description": "The data format of the values for your attribute. When you choose an AttributeDataType, Amazon Cognito validates the input against the data type. A custom attribute value in your user's ID token is always a string, for example \"custom:isMember\" : \"true\" or \"custom:YearsAsMember\" : \"12\".",
                      "nested_items": []
                    },
                    {
                      "name": "DeveloperOnlyAttribute",
                      "type": "boolean",
                      "description": "Specifies whether the attribute type is developer only. This attribute can only be modified by an administrator. Users won't be able to modify this attribute using their access token. For example, DeveloperOnlyAttribute can be modified using AdminUpdateUserAttributes but can't be updated using UpdateUserAttributes.",
                      "nested_items": []
                    },
                    {
                      "name": "Mutable",
                      "type": "boolean",
                      "description": "Specifies whether the value of the attribute can be changed.",
                      "nested_items": []
                    },
                    {
                      "name": "Required",
                      "type": "boolean",
                      "description": "Specifies whether a user pool attribute is required. If the attribute is required and the user doesn't provide a value, registration or sign-in will fail.",
                      "nested_items": []
                    },
                    {
                      "name": "NumberAttributeConstraints",
                      "type": "dict",
                      "description": "Specifies the constraints for an attribute of the number type.",
                      "nested_items": [
                        {
                          "name": "MinValue",
                          "type": "string",
                          "description": "The minimum value of an attribute that is of the number data type.",
                          "nested_items": []
                        },
                        {
                          "name": "MaxValue",
                          "type": "string",
                          "description": "The maximum length of a number attribute value. Must be a number less than or equal to 2^1023, represented as a string with a length of 131072 characters or fewer.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "StringAttributeConstraints",
                      "type": "dict",
                      "description": "Specifies the constraints for an attribute of the string type.",
                      "nested_items": [
                        {
                          "name": "MinLength",
                          "type": "string",
                          "description": "The minimum length of a string attribute value.",
                          "nested_items": []
                        },
                        {
                          "name": "MaxLength",
                          "type": "string",
                          "description": "The maximum length of a string attribute value. Must be a number less than or equal to 2^1023, represented as a string with a length of 131072 characters or fewer.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "AutoVerifiedAttributes",
              "type": "list",
              "description": "The attributes that are auto-verified in a user pool.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "AliasAttributes",
              "type": "list",
              "description": "Attributes supported as an alias for this user pool. An alias is an attribute that users can enter as an alternative username. Possible values: phone_number, email, or preferred_username.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "UsernameAttributes",
              "type": "list",
              "description": "Specifies whether a user can use an email address or phone number as a username when they sign up.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "SmsVerificationMessage",
              "type": "string",
              "description": "This parameter is no longer used.",
              "nested_items": []
            },
            {
              "name": "EmailVerificationMessage",
              "type": "string",
              "description": "This parameter is no longer used.",
              "nested_items": []
            },
            {
              "name": "EmailVerificationSubject",
              "type": "string",
              "description": "This parameter is no longer used.",
              "nested_items": []
            },
            {
              "name": "VerificationMessageTemplate",
              "type": "dict",
              "description": "The template for the verification message that your user pool delivers to users who set an email address or phone number attribute.",
              "nested_items": [
                {
                  "name": "SmsMessage",
                  "type": "string",
                  "description": "The template for SMS messages that Amazon Cognito sends to your users.",
                  "nested_items": []
                },
                {
                  "name": "EmailMessage",
                  "type": "string",
                  "description": "The template for email messages that Amazon Cognito sends to your users. You can set an EmailMessage template only if the value of EmailSendingAccount is DEVELOPER. When your EmailSendingAccount is DEVELOPER, your user pool sends email messages with your own Amazon SES configuration.",
                  "nested_items": []
                },
                {
                  "name": "EmailSubject",
                  "type": "string",
                  "description": "The subject line for the email message template. You can set an EmailSubject template only if the value of EmailSendingAccount is DEVELOPER. When your EmailSendingAccount is DEVELOPER, your user pool sends email messages with your own Amazon SES configuration.",
                  "nested_items": []
                },
                {
                  "name": "EmailMessageByLink",
                  "type": "string",
                  "description": "The email message template for sending a confirmation link to the user. You can set an EmailMessageByLink template only if the value of EmailSendingAccount is DEVELOPER. When your EmailSendingAccount is DEVELOPER, your user pool sends email messages with your own Amazon SES configuration.",
                  "nested_items": []
                },
                {
                  "name": "EmailSubjectByLink",
                  "type": "string",
                  "description": "The subject line for the email message template for sending a confirmation link to the user. You can set an EmailSubjectByLink template only if the value of EmailSendingAccount is DEVELOPER. When your EmailSendingAccount is DEVELOPER, your user pool sends email messages with your own Amazon SES configuration.",
                  "nested_items": []
                },
                {
                  "name": "DefaultEmailOption",
                  "type": "string",
                  "description": "The configuration of verification emails to contain a clickable link or a verification code.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "SmsAuthenticationMessage",
              "type": "string",
              "description": "The contents of the SMS authentication message.",
              "nested_items": []
            },
            {
              "name": "UserAttributeUpdateSettings",
              "type": "dict",
              "description": "The settings for updates to user attributes. These settings include the property AttributesRequireVerificationBeforeUpdate, a user-pool setting that tells Amazon Cognito how to handle changes to the value of your users' email address and phone number attributes. For more information, see Verifying updates to email addresses and phone numbers.",
              "nested_items": [
                {
                  "name": "AttributesRequireVerificationBeforeUpdate",
                  "type": "list",
                  "description": "Requires that your user verifies their email address, phone number, or both before Amazon Cognito updates the value of that attribute. When you update a user attribute that has this option activated, Amazon Cognito sends a verification message to the new phone number or email address. Amazon Cognito doesn't change the value of the attribute until your user responds to the verification message and confirms the new value.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "MfaConfiguration",
              "type": "string",
              "description": "Can be one of the following values:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "OFF - MFA tokens aren't required and can't be specified during user registration.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "ON - MFA tokens are required for all user registrations. You can only specify required when you're initially creating a user pool.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "OPTIONAL - Users have the option when registering to create an MFA token.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "DeviceConfiguration",
              "type": "dict",
              "description": "The device-remembering configuration for a user pool. A null value indicates that you have deactivated device remembering in your user pool.",
              "nested_items": [
                {
                  "name": "ChallengeRequiredOnNewDevice",
                  "type": "boolean",
                  "description": "When true, a remembered device can sign in with device authentication instead of SMS and time-based one-time password (TOTP) factors for multi-factor authentication (MFA).",
                  "nested_items": []
                },
                {
                  "name": "DeviceOnlyRememberedOnUserPrompt",
                  "type": "boolean",
                  "description": "When true, Amazon Cognito doesn't automatically remember a user's device when your app sends a ConfirmDevice API request. In your app, create a prompt for your user to choose whether they want to remember their device. Return the user's choice in an UpdateDeviceStatus API request.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "EstimatedNumberOfUsers",
              "type": "integer",
              "description": "A number estimating the size of the user pool.",
              "nested_items": []
            },
            {
              "name": "EmailConfiguration",
              "type": "dict",
              "description": "The email configuration of your user pool. The email configuration type sets your preferred sending method, Amazon Web Services Region, and sender for messages from your user pool.",
              "nested_items": [
                {
                  "name": "SourceArn",
                  "type": "string",
                  "description": "The ARN of a verified email address or an address from a verified domain in Amazon SES. You can set a SourceArn email from a verified domain only with an API request. You can set a verified email address, but not an address in a verified domain, in the Amazon Cognito console. Amazon Cognito uses the email address that you provide in one of the following ways, depending on the value that you specify for the EmailSendingAccount parameter:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "If you specify COGNITO_DEFAULT, Amazon Cognito uses this address as the custom FROM address when it emails your users using its built-in email account.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "If you specify DEVELOPER, Amazon Cognito emails your users with this address by calling Amazon SES on your behalf.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "ReplyToEmailAddress",
                  "type": "string",
                  "description": "The destination to which the receiver of the email should reply.",
                  "nested_items": []
                },
                {
                  "name": "EmailSendingAccount",
                  "type": "string",
                  "description": "Specifies whether Amazon Cognito uses its built-in functionality to send your users email messages, or uses your Amazon Simple Email Service email configuration. Specify one of the following values:",
                  "nested_items": []
                },
                {
                  "name": "From",
                  "type": "string",
                  "description": "Either the sender's email address or the sender's name with their email address. For example, testuser@example.com or Test User <testuser@example.com>. This address appears before the body of the email.",
                  "nested_items": []
                },
                {
                  "name": "ConfigurationSet",
                  "type": "string",
                  "description": "The set of configuration rules that can be applied to emails sent using Amazon Simple Email Service. A configuration set is applied to an email by including a reference to the configuration set in the headers of the email. Once applied, all of the rules in that configuration set are applied to the email. Configuration sets can be used to apply the following types of rules to emails:",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "SmsConfiguration",
              "type": "dict",
              "description": "User pool configuration for delivery of SMS messages with Amazon Simple Notification Service. To send SMS messages with Amazon SNS in the Amazon Web Services Region that you want, the Amazon Cognito user pool uses an Identity and Access Management (IAM) role in your Amazon Web Services account.",
              "nested_items": [
                {
                  "name": "SnsCallerArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the Amazon SNS caller. This is the ARN of the IAM role in your Amazon Web Services account that Amazon Cognito will use to send SMS messages. SMS messages are subject to a spending limit.",
                  "nested_items": []
                },
                {
                  "name": "ExternalId",
                  "type": "string",
                  "description": "The external ID provides additional security for your IAM role. You can use an ExternalId with the IAM role that you use with Amazon SNS to send SMS messages for your user pool. If you provide an ExternalId, your Amazon Cognito user pool includes it in the request to assume your IAM role. You can configure the role trust policy to require that Amazon Cognito, and any principal, provide the ExternalID. If you use the Amazon Cognito Management Console to create a role for SMS multi-factor authentication (MFA), Amazon Cognito creates a role with the required permissions and a trust policy that demonstrates use of the ExternalId.",
                  "nested_items": []
                },
                {
                  "name": "SnsRegion",
                  "type": "string",
                  "description": "The Amazon Web Services Region to use with Amazon SNS integration. You can choose the same Region as your user pool, or a supported Legacy Amazon SNS alternate Region.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "UserPoolTags",
              "type": "dict",
              "description": "The tags that are assigned to the user pool. A tag is a label that you can apply to user pools to categorize and manage them in different ways, such as by purpose, owner, environment, or other criteria.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "SmsConfigurationFailure",
              "type": "string",
              "description": "The reason why the SMS configuration can't send the messages to your users.",
              "nested_items": []
            },
            {
              "name": "EmailConfigurationFailure",
              "type": "string",
              "description": "Deprecated. Review error codes from API requests with EventSource:cognito-idp.amazonaws.com in CloudTrail for information about problems with user pool email configuration.",
              "nested_items": []
            },
            {
              "name": "Domain",
              "type": "string",
              "description": "The domain prefix, if the user pool has a domain associated with it.",
              "nested_items": []
            },
            {
              "name": "CustomDomain",
              "type": "string",
              "description": "A custom domain name that you provide to Amazon Cognito. This parameter applies only if you use a custom domain to host the sign-up and sign-in pages for your application. An example of a custom domain name might be auth.example.com.",
              "nested_items": []
            },
            {
              "name": "AdminCreateUserConfig",
              "type": "dict",
              "description": "The configuration for AdminCreateUser requests.",
              "nested_items": [
                {
                  "name": "AllowAdminCreateUserOnly",
                  "type": "boolean",
                  "description": "The setting for allowing self-service sign-up. When true, only administrators can create new user profiles. When false, users can register themselves and create a new user profile with the SignUp operation.",
                  "nested_items": []
                },
                {
                  "name": "UnusedAccountValidityDays",
                  "type": "integer",
                  "description": "This parameter is no longer in use.",
                  "nested_items": []
                },
                {
                  "name": "InviteMessageTemplate",
                  "type": "dict",
                  "description": "The template for the welcome message to new users. This template must include the {####} temporary password placeholder if you are creating users with passwords. If your users don't have passwords, you can omit the placeholder.",
                  "nested_items": [
                    {
                      "name": "SMSMessage",
                      "type": "string",
                      "description": "The message template for SMS messages.",
                      "nested_items": []
                    },
                    {
                      "name": "EmailMessage",
                      "type": "string",
                      "description": "The message template for email messages. EmailMessage is allowed only if EmailSendingAccount is DEVELOPER.",
                      "nested_items": []
                    },
                    {
                      "name": "EmailSubject",
                      "type": "string",
                      "description": "The subject line for email messages. EmailSubject is allowed only if EmailSendingAccount is DEVELOPER.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "UserPoolAddOns",
              "type": "dict",
              "description": "Contains settings for activation of threat protection, including the operating mode and additional authentication types. To log user security information but take no action, set to AUDIT. To configure automatic security responses to potentially unwanted traffic to your user pool, set to ENFORCED.",
              "nested_items": [
                {
                  "name": "AdvancedSecurityMode",
                  "type": "string",
                  "description": "The operating mode of threat protection for standard authentication types in your user pool, including username-password and secure remote password (SRP) authentication.",
                  "nested_items": []
                },
                {
                  "name": "AdvancedSecurityAdditionalFlows",
                  "type": "dict",
                  "description": "Threat protection configuration options for additional authentication types in your user pool, including custom authentication.",
                  "nested_items": [
                    {
                      "name": "CustomAuthMode",
                      "type": "string",
                      "description": "The operating mode of threat protection in custom authentication with Custom authentication challenge Lambda triggers.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "UsernameConfiguration",
              "type": "dict",
              "description": "Case sensitivity of the username input for the selected sign-in option. When case sensitivity is set to False (case insensitive), users can sign in with any combination of capital and lowercase letters. For example, username, USERNAME, or UserName, or for email, email@example.com or EMaiL@eXamplE.Com. For most use cases, set case sensitivity to False (case insensitive) as a best practice. When usernames and email addresses are case insensitive, Amazon Cognito treats any variation in case as the same user, and prevents a case variation from being assigned to the same attribute for a different user.",
              "nested_items": [
                {
                  "name": "CaseSensitive",
                  "type": "boolean",
                  "description": "Specifies whether user name case sensitivity will be applied for all users in the user pool through Amazon Cognito APIs. For most use cases, set case sensitivity to False (case insensitive) as a best practice. When usernames and email addresses are case insensitive, users can sign in as the same user when they enter a different capitalization of their user name.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Arn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the user pool.",
              "nested_items": []
            },
            {
              "name": "AccountRecoverySetting",
              "type": "dict",
              "description": "The available verified method a user can use to recover their password when they call ForgotPassword. You can use this setting to define a preferred method when a user has more than one method available. With this setting, SMS doesn't qualify for a valid password recovery mechanism if the user also has SMS multi-factor authentication (MFA) activated. In the absence of this setting, Amazon Cognito uses the legacy behavior to determine the recovery method where SMS is preferred through email.",
              "nested_items": [
                {
                  "name": "RecoveryMechanisms",
                  "type": "list",
                  "description": "The list of options and priorities for user message delivery in forgot-password operations. Sets or displays user pool preferences for email or SMS message priority, whether users should fall back to a second delivery method, and whether passwords should only be reset by administrators.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Priority",
                          "type": "integer",
                          "description": "Your priority preference for using the specified attribute in account recovery. The highest priority is 1.",
                          "nested_items": []
                        },
                        {
                          "name": "Name",
                          "type": "string",
                          "description": "The recovery method that this object sets a recovery option for.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "UserPoolTier",
              "type": "string",
              "description": "The user pool feature plan, or tier. This parameter determines the eligibility of the user pool for features like managed login, access-token customization, and threat protection. Defaults to ESSENTIALS.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}