{
  "method_name": "get_user_attribute_verification_code",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cognito-idp/client/get_user_attribute_verification_code.html",
  "description": "Given an attribute name, sends a user attribute verification code for the specified attribute name to the currently signed-in user. Authorize this action with a signed-in user's access token. It must include the scope aws.cognito.signin.user.admin.",
  "parameters": [
    {
      "name": "AccessToken",
      "type": "string",
      "required": true,
      "description": "A valid access token that Amazon Cognito issued to the currently signed-in user. Must include a scope claim for aws.cognito.signin.user.admin.",
      "nested_params": []
    },
    {
      "name": "AttributeName",
      "type": "string",
      "required": true,
      "description": "The name of the attribute that the user wants to verify, for example email.",
      "nested_params": []
    },
    {
      "name": "ClientMetadata",
      "type": "dict",
      "required": false,
      "description": "A map of custom key-value pairs that you can provide as input for any custom workflows that this action triggers. You create custom workflows by assigning Lambda functions to user pool triggers. When you use the GetUserAttributeVerificationCode API action, Amazon Cognito invokes the function that is assigned to the custom message trigger. When Amazon Cognito invokes this function, it passes a JSON payload, which the function receives as input. This payload contains a clientMetadata attribute, which provides the data that you assigned to the ClientMetadata parameter in your GetUserAttributeVerificationCode request. In your function code in Lambda, you can process the clientMetadata value to enhance your workflow for your specific needs. For more information, see Using Lambda triggers in the Amazon Cognito Developer Guide. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "CodeDeliveryDetails",
          "type": "dict",
          "description": "Information about the delivery destination of the user attribute verification code.",
          "nested_items": [
            {
              "name": "Destination",
              "type": "string",
              "description": "The email address or phone number destination where Amazon Cognito sent the code.",
              "nested_items": []
            },
            {
              "name": "DeliveryMedium",
              "type": "string",
              "description": "The method that Amazon Cognito used to send the code.",
              "nested_items": []
            },
            {
              "name": "AttributeName",
              "type": "string",
              "description": "The name of the attribute that Amazon Cognito verifies with the code.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}