{
  "method_name": "list_identity_providers",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cognito-idp/client/list_identity_providers.html",
  "description": "Given a user pool ID, returns information about configured identity providers (IdPs). For more information about IdPs, see Third-party IdP sign-in.",
  "parameters": [
    {
      "name": "UserPoolId",
      "type": "string",
      "required": true,
      "description": "The ID of the user pool where you want to list IdPs.",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Providers",
          "type": "list",
          "description": "An array of the IdPs in your user pool. For each, the response includes identifiers, the IdP name and type, and trust-relationship details like the issuer URL.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ProviderName",
                  "type": "string",
                  "description": "The name of the IdP, for example MySAMLProvider.",
                  "nested_items": []
                },
                {
                  "name": "ProviderType",
                  "type": "string",
                  "description": "The type of the provider, for example SAML. Amazon Cognito supports SAML 2.0, OIDC, and social IdPs. User pools list supported social IdPs by name in this response parameter: Facebook, Google, Login with Amazon, and Sign in with Apple.",
                  "nested_items": []
                },
                {
                  "name": "LastModifiedDate",
                  "type": "datetime",
                  "description": "The date and time when the item was modified. Amazon Cognito returns this timestamp in UNIX epoch time format. Your SDK might render the output in a human-readable format like ISO 8601 or a Java Date object.",
                  "nested_items": []
                },
                {
                  "name": "CreationDate",
                  "type": "datetime",
                  "description": "The date and time when the item was created. Amazon Cognito returns this timestamp in UNIX epoch time format. Your SDK might render the output in a human-readable format like ISO 8601 or a Java Date object.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The identifier that Amazon Cognito returned with the previous request to this operation. When you include a pagination token in your request, Amazon Cognito returns the next set of items in the list. By use of this token, you can paginate through the full list of items.",
          "nested_items": []
        }
      ]
    }
  ]
}