{
  "method_name": "list_users",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cognito-idp/client/list_users.html",
  "description": "Given a user pool ID, returns a list of users and their basic details in a user pool.",
  "parameters": [
    {
      "name": "UserPoolId",
      "type": "string",
      "required": true,
      "description": "The ID of the user pool where you want to display or search for users.",
      "nested_params": []
    },
    {
      "name": "AttributesToGet",
      "type": "list",
      "required": false,
      "description": "A JSON array of user attribute names, for example given_name, that you want Amazon Cognito to include in the response for each user. When you don't provide an AttributesToGet parameter, Amazon Cognito returns all attributes for each user. Use AttributesToGet with required attributes in your user pool, or in conjunction with Filter. Amazon Cognito returns an error if not all users in the results have set a value for the attribute you request. Attributes that you can't filter on, including custom attributes, must have a value set in every user profile before an AttributesToGet parameter returns results. (string) ---",
      "nested_params": []
    },
    {
      "name": "Limit",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "PaginationToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Filter",
      "type": "string",
      "required": false,
      "description": "A filter string of the form \"AttributeName Filter-Type \"AttributeValue\". Quotation marks within the filter string must be escaped using the backslash ( \\) character. For example, \"family_name = \\\"Reddy\\\"\". AttributeName: The name of the attribute to search for. You can only search for one attribute at a time. Filter-Type: For an exact match, use =, for example, ' given_name = \\\"Jon\\\"'. For a prefix ('starts with') match, use ^=, for example, ' given_name ^= \\\"Jon\\\"'. AttributeValue: The attribute value that must be matched for each user. If the filter string is empty, ListUsers returns all users in the user pool. You can only search for the following standard attributes: username (case-sensitive) email phone_number name given_name family_name preferred_username cognito:user_status (called Status in the Console) (case-insensitive) status (called **Enabled** in the Console) (case-sensitive) sub Custom attributes aren't searchable. For more information, see Searching for Users Using the ListUsers API and Examples of Using the ListUsers API in the Amazon Cognito Developer Guide.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Users",
          "type": "list",
          "description": "An array of user pool users who match your query, and their attributes.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Username",
                  "type": "string",
                  "description": "The user's username.",
                  "nested_items": []
                },
                {
                  "name": "Attributes",
                  "type": "list",
                  "description": "Names and values of a user's attributes, for example email.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Name",
                          "type": "string",
                          "description": "The name of the attribute.",
                          "nested_items": []
                        },
                        {
                          "name": "Value",
                          "type": "string",
                          "description": "The value of the attribute.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "UserCreateDate",
                  "type": "datetime",
                  "description": "The date and time when the item was created. Amazon Cognito returns this timestamp in UNIX epoch time format. Your SDK might render the output in a human-readable format like ISO 8601 or a Java Date object.",
                  "nested_items": []
                },
                {
                  "name": "UserLastModifiedDate",
                  "type": "datetime",
                  "description": "The date and time when the item was modified. Amazon Cognito returns this timestamp in UNIX epoch time format. Your SDK might render the output in a human-readable format like ISO 8601 or a Java Date object.",
                  "nested_items": []
                },
                {
                  "name": "Enabled",
                  "type": "boolean",
                  "description": "Indicates whether the user's account is enabled or disabled.",
                  "nested_items": []
                },
                {
                  "name": "UserStatus",
                  "type": "string",
                  "description": "The user status. This can be one of the following:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "UNCONFIRMED: User has been created but not confirmed.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "CONFIRMED: User has been confirmed.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "EXTERNAL_PROVIDER: User signed in with a third-party IdP.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "RESET_REQUIRED: User is confirmed, but the user must request a code and reset their password before they can sign in.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "FORCE_CHANGE_PASSWORD: The user is confirmed and the user can sign in using a temporary password, but on first sign-in, the user must change their password to a new value before doing anything else.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "MFAOptions",
                  "type": "list",
                  "description": "The user's MFA configuration.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "DeliveryMedium",
                          "type": "string",
                          "description": "The delivery medium to send the MFA code. You can use this parameter to set only the SMS delivery medium value.",
                          "nested_items": []
                        },
                        {
                          "name": "AttributeName",
                          "type": "string",
                          "description": "The attribute name of the MFA option type. The only valid value is phone_number.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "PaginationToken",
          "type": "string",
          "description": "The identifier that Amazon Cognito returned with the previous request to this operation. When you include a pagination token in your request, Amazon Cognito returns the next set of items in the list. By use of this token, you can paginate through the full list of items.",
          "nested_items": []
        }
      ]
    }
  ]
}