{
  "method_name": "list_groups",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cognito-idp/client/list_groups.html",
  "description": "Given a user pool ID, returns user pool groups and their details.",
  "parameters": [
    {
      "name": "UserPoolId",
      "type": "string",
      "required": true,
      "description": "The ID of the user pool where you want to list user groups.",
      "nested_params": []
    },
    {
      "name": "Limit",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Groups",
          "type": "list",
          "description": "An array of groups and their details. Each entry that's returned includes description, precedence, and IAM role values.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "GroupName",
                  "type": "string",
                  "description": "The name of the group.",
                  "nested_items": []
                },
                {
                  "name": "UserPoolId",
                  "type": "string",
                  "description": "The ID of the user pool that contains the group.",
                  "nested_items": []
                },
                {
                  "name": "Description",
                  "type": "string",
                  "description": "A friendly description of the group.",
                  "nested_items": []
                },
                {
                  "name": "RoleArn",
                  "type": "string",
                  "description": "The ARN of the IAM role associated with the group. If a group has the highest priority of a user's groups, users who authenticate with an identity pool get credentials for the RoleArn that's associated with the group.",
                  "nested_items": []
                },
                {
                  "name": "Precedence",
                  "type": "integer",
                  "description": "A non-negative integer value that specifies the precedence of this group relative to the other groups that a user can belong to in the user pool. Zero is the highest precedence value. Groups with lower Precedence values take precedence over groups with higher ornull Precedence values. If a user belongs to two or more groups, it is the group with the lowest precedence value whose role ARN is given in the user's tokens for the cognito:roles and cognito:preferred_role claims.",
                  "nested_items": []
                },
                {
                  "name": "LastModifiedDate",
                  "type": "datetime",
                  "description": "The date and time when the item was modified. Amazon Cognito returns this timestamp in UNIX epoch time format. Your SDK might render the output in a human-readable format like ISO 8601 or a Java Date object.",
                  "nested_items": []
                },
                {
                  "name": "CreationDate",
                  "type": "datetime",
                  "description": "The date and time when the item was created. Amazon Cognito returns this timestamp in UNIX epoch time format. Your SDK might render the output in a human-readable format like ISO 8601 or a Java Date object.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The identifier that Amazon Cognito returned with the previous request to this operation. When you include a pagination token in your request, Amazon Cognito returns the next set of items in the list. By use of this token, you can paginate through the full list of items.",
          "nested_items": []
        }
      ]
    }
  ]
}