{
  "method_name": "list_user_pools",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cognito-idp/client/list_user_pools.html",
  "description": "Lists user pools and their details in the current Amazon Web Services account.",
  "parameters": [
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": true,
      "description": "The maximum number of user pools that you want Amazon Cognito to return in the response.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "UserPools",
          "type": "list",
          "description": "An array of user pools and their configuration details.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Id",
                  "type": "string",
                  "description": "The user pool ID.",
                  "nested_items": []
                },
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The user pool name.",
                  "nested_items": []
                },
                {
                  "name": "LambdaConfig",
                  "type": "dict",
                  "description": "A collection of user pool Lambda triggers. Amazon Cognito invokes triggers at several possible stages of user pool operations. Triggers can modify the outcome of the operations that invoked them.",
                  "nested_items": [
                    {
                      "name": "PreSignUp",
                      "type": "string",
                      "description": "The configuration of a pre sign-up Lambda trigger in a user pool. This trigger evaluates new users and can bypass confirmation, link a federated user profile, or block sign-up requests.",
                      "nested_items": []
                    },
                    {
                      "name": "CustomMessage",
                      "type": "string",
                      "description": "A custom message Lambda trigger. This trigger is an opportunity to customize all SMS and email messages from your user pool. When a custom message trigger is active, your user pool routes all messages to a Lambda function that returns a runtime-customized message subject and body for your user pool to deliver to a user.",
                      "nested_items": []
                    },
                    {
                      "name": "PostConfirmation",
                      "type": "string",
                      "description": "The configuration of a post confirmation Lambda trigger in a user pool. This trigger can take custom actions after a user confirms their user account and their email address or phone number.",
                      "nested_items": []
                    },
                    {
                      "name": "PreAuthentication",
                      "type": "string",
                      "description": "The configuration of a pre authentication trigger in a user pool. This trigger can evaluate and modify user sign-in events.",
                      "nested_items": []
                    },
                    {
                      "name": "PostAuthentication",
                      "type": "string",
                      "description": "The configuration of a post authentication Lambda trigger in a user pool. This trigger can take custom actions after a user signs in.",
                      "nested_items": []
                    },
                    {
                      "name": "DefineAuthChallenge",
                      "type": "string",
                      "description": "The configuration of a define auth challenge Lambda trigger, one of three triggers in the sequence of the custom authentication challenge triggers.",
                      "nested_items": []
                    },
                    {
                      "name": "CreateAuthChallenge",
                      "type": "string",
                      "description": "The configuration of a create auth challenge Lambda trigger, one of three triggers in the sequence of the custom authentication challenge triggers.",
                      "nested_items": []
                    },
                    {
                      "name": "VerifyAuthChallengeResponse",
                      "type": "string",
                      "description": "The configuration of a verify auth challenge Lambda trigger, one of three triggers in the sequence of the custom authentication challenge triggers.",
                      "nested_items": []
                    },
                    {
                      "name": "PreTokenGeneration",
                      "type": "string",
                      "description": "The legacy configuration of a pre token generation Lambda trigger in a user pool.",
                      "nested_items": []
                    },
                    {
                      "name": "UserMigration",
                      "type": "string",
                      "description": "The configuration of a migrate user Lambda trigger in a user pool. This trigger can create user profiles when users sign in or attempt to reset their password with credentials that don't exist yet.",
                      "nested_items": []
                    },
                    {
                      "name": "PreTokenGenerationConfig",
                      "type": "dict",
                      "description": "The detailed configuration of a pre token generation Lambda trigger in a user pool. If you also set an ARN in PreTokenGeneration, its value must be identical to PreTokenGenerationConfig.",
                      "nested_items": [
                        {
                          "name": "LambdaVersion",
                          "type": "string",
                          "description": "The user pool trigger version of the request that Amazon Cognito sends to your Lambda function. Higher-numbered versions add fields that support new features.",
                          "nested_items": []
                        },
                        {
                          "name": "LambdaArn",
                          "type": "string",
                          "description": "The Amazon Resource Name (ARN) of the function that you want to assign to your Lambda trigger.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "CustomSMSSender",
                      "type": "dict",
                      "description": "The configuration of a custom SMS sender Lambda trigger. This trigger routes all SMS notifications from a user pool to a Lambda function that delivers the message using custom logic.",
                      "nested_items": [
                        {
                          "name": "LambdaVersion",
                          "type": "string",
                          "description": "The user pool trigger version of the request that Amazon Cognito sends to your Lambda function. Higher-numbered versions add fields that support new features.",
                          "nested_items": []
                        },
                        {
                          "name": "LambdaArn",
                          "type": "string",
                          "description": "The Amazon Resource Name (ARN) of the function that you want to assign to your Lambda trigger.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "CustomEmailSender",
                      "type": "dict",
                      "description": "The configuration of a custom email sender Lambda trigger. This trigger routes all email notifications from a user pool to a Lambda function that delivers the message using custom logic.",
                      "nested_items": [
                        {
                          "name": "LambdaVersion",
                          "type": "string",
                          "description": "The user pool trigger version of the request that Amazon Cognito sends to your Lambda function. Higher-numbered versions add fields that support new features.",
                          "nested_items": []
                        },
                        {
                          "name": "LambdaArn",
                          "type": "string",
                          "description": "The Amazon Resource Name (ARN) of the function that you want to assign to your Lambda trigger.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "KMSKeyID",
                      "type": "string",
                      "description": "The ARN of an KMS key. Amazon Cognito uses the key to encrypt codes and temporary passwords sent to custom sender Lambda triggers.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Status",
                  "type": "string",
                  "description": "The user pool status.",
                  "nested_items": []
                },
                {
                  "name": "LastModifiedDate",
                  "type": "datetime",
                  "description": "The date and time when the item was modified. Amazon Cognito returns this timestamp in UNIX epoch time format. Your SDK might render the output in a human-readable format like ISO 8601 or a Java Date object.",
                  "nested_items": []
                },
                {
                  "name": "CreationDate",
                  "type": "datetime",
                  "description": "The date and time when the item was created. Amazon Cognito returns this timestamp in UNIX epoch time format. Your SDK might render the output in a human-readable format like ISO 8601 or a Java Date object.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The identifier that Amazon Cognito returned with the previous request to this operation. When you include a pagination token in your request, Amazon Cognito returns the next set of items in the list. By use of this token, you can paginate through the full list of items.",
          "nested_items": []
        }
      ]
    }
  ]
}