{
  "method_name": "set_user_settings",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cognito-idp/client/set_user_settings.html",
  "description": "This action is no longer supported. You can use it to configure only SMS MFA. You can't use it to configure time-based one-time password (TOTP) software token or email MFA. Authorize this action with a signed-in user's access token. It must include the scope aws.cognito.signin.user.admin.",
  "parameters": [
    {
      "name": "AccessToken",
      "type": "string",
      "required": true,
      "description": "A valid access token that Amazon Cognito issued to the currently signed-in user. Must include a scope claim for aws.cognito.signin.user.admin.",
      "nested_params": []
    },
    {
      "name": "MFAOptions",
      "type": "list",
      "required": true,
      "description": "You can use this parameter only to set an SMS configuration that uses SMS for delivery. (dict) --- This data type is no longer supported. Applies only to SMS multi-factor authentication (MFA) configurations. Does not apply to time-based one-time password (TOTP) software token MFA configurations. DeliveryMedium (string) --- The delivery medium to send the MFA code. You can use this parameter to set only the SMS delivery medium value. AttributeName (string) --- The attribute name of the MFA option type. The only valid value is phone_number.",
      "nested_params": [
        {
          "name": "DeliveryMedium",
          "type": "string",
          "required": false,
          "description": "The delivery medium to send the MFA code. You can use this parameter to set only the SMS delivery medium value.",
          "nested_params": []
        },
        {
          "name": "AttributeName",
          "type": "string",
          "required": false,
          "description": "The attribute name of the MFA option type. The only valid value is phone_number.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}