{
  "method_name": "create_trusted_token_issuer",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sso-admin/client/create_trusted_token_issuer.html",
  "description": "Creates a connection to a trusted token issuer in an instance of IAM Identity Center. A trusted token issuer enables trusted identity propagation to be used with applications that authenticate outside of Amazon Web Services. This trusted token issuer describes an external identity provider (IdP) that can generate claims or assertions in the form of access tokens for a user. Applications enabled for IAM Identity Center can use these tokens for authentication.",
  "parameters": [
    {
      "name": "InstanceArn",
      "type": "string",
      "required": true,
      "description": "Specifies the ARN of the instance of IAM Identity Center to contain the new trusted token issuer configuration.",
      "nested_params": []
    },
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "Specifies the name of the new trusted token issuer configuration.",
      "nested_params": []
    },
    {
      "name": "TrustedTokenIssuerType",
      "type": "string",
      "required": true,
      "description": "Specifies the type of the new trusted token issuer.",
      "nested_params": []
    },
    {
      "name": "TrustedTokenIssuerConfiguration",
      "type": "dict",
      "required": true,
      "description": "Specifies settings that apply to the new trusted token issuer configuration. The settings that are available depend on what TrustedTokenIssuerType you specify. OidcJwtConfiguration (dict) --- A structure that describes the settings for a trusted token issuer that works with OpenID Connect (OIDC) by using JSON Web Tokens (JWT). The URL that IAM Identity Center uses for OpenID Discovery. OpenID Discovery is used to obtain the information required to verify the tokens that the trusted token issuer generates. The path of the source attribute in the JWT from the trusted token issuer. The attribute mapped by this JMESPath expression is compared against the attribute mapped by IdentityStoreAttributePath when a trusted token issuer token is exchanged for an IAM Identity Center token. The path of the destination attribute in a JWT from IAM Identity Center. The attribute mapped by this JMESPath expression is compared against the attribute mapped by ClaimAttributePath when a trusted token issuer token is exchanged for an IAM Identity Center token. The method that the trusted token issuer can use to retrieve the JSON Web Key Set used to verify a JWT.",
      "nested_params": [
        {
          "name": "OidcJwtConfiguration",
          "type": "dict",
          "required": false,
          "description": "A structure that describes the settings for a trusted token issuer that works with OpenID Connect (OIDC) by using JSON Web Tokens (JWT).",
          "nested_params": [
            {
              "name": "IssuerUrl",
              "type": "string",
              "required": false,
              "description": "The URL that IAM Identity Center uses for OpenID Discovery. OpenID Discovery is used to obtain the information required to verify the tokens that the trusted token issuer generates.",
              "nested_params": []
            },
            {
              "name": "ClaimAttributePath",
              "type": "string",
              "required": false,
              "description": "The path of the source attribute in the JWT from the trusted token issuer. The attribute mapped by this JMESPath expression is compared against the attribute mapped by IdentityStoreAttributePath when a trusted token issuer token is exchanged for an IAM Identity Center token.",
              "nested_params": []
            },
            {
              "name": "IdentityStoreAttributePath",
              "type": "string",
              "required": false,
              "description": "The path of the destination attribute in a JWT from IAM Identity Center. The attribute mapped by this JMESPath expression is compared against the attribute mapped by ClaimAttributePath when a trusted token issuer token is exchanged for an IAM Identity Center token.",
              "nested_params": []
            },
            {
              "name": "JwksRetrievalOption",
              "type": "string",
              "required": false,
              "description": "The method that the trusted token issuer can use to retrieve the JSON Web Key Set used to verify a JWT.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": false,
      "description": "Specifies a unique, case-sensitive ID that you provide to ensure the idempotency of the request. This lets you safely retry the request without accidentally performing the same operation a second time. Passing the same value to a later call to an operation requires that you also pass the same value for all other parameters. We recommend that you use a UUID type of value.. If you don't provide this value, then Amazon Web Services generates a random one for you. If you retry the operation with the same ClientToken, but with different parameters, the retry fails with an IdempotentParameterMismatch error. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "Specifies tags to be attached to the new trusted token issuer configuration. (dict) --- A set of key-value pairs that are used to manage the resource. Tags can only be applied to permission sets and cannot be applied to corresponding roles that IAM Identity Center creates in Amazon Web Services accounts. The key for the tag. The value of the tag.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key for the tag.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value of the tag.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "TrustedTokenIssuerArn",
          "type": "string",
          "description": "The ARN of the new trusted token issuer configuration.",
          "nested_items": []
        }
      ]
    }
  ]
}