{
  "method_name": "describe_trusted_token_issuer",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/sso-admin/client/describe_trusted_token_issuer.html",
  "description": "Retrieves details about a trusted token issuer configuration stored in an instance of IAM Identity Center. Details include the name of the trusted token issuer, the issuer URL, and the path of the source attribute and the destination attribute for a trusted token issuer configuration.",
  "parameters": [
    {
      "name": "TrustedTokenIssuerArn",
      "type": "string",
      "required": true,
      "description": "Specifies the ARN of the trusted token issuer configuration that you want details about.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "TrustedTokenIssuerArn",
          "type": "string",
          "description": "The ARN of the trusted token issuer configuration.",
          "nested_items": []
        },
        {
          "name": "Name",
          "type": "string",
          "description": "The name of the trusted token issuer configuration.",
          "nested_items": []
        },
        {
          "name": "TrustedTokenIssuerType",
          "type": "string",
          "description": "The type of the trusted token issuer.",
          "nested_items": []
        },
        {
          "name": "TrustedTokenIssuerConfiguration",
          "type": "dict",
          "description": "A structure the describes the settings that apply of this trusted token issuer.",
          "nested_items": [
            {
              "name": "OidcJwtConfiguration",
              "type": "dict",
              "description": "A structure that describes the settings for a trusted token issuer that works with OpenID Connect (OIDC) by using JSON Web Tokens (JWT).",
              "nested_items": [
                {
                  "name": "IssuerUrl",
                  "type": "string",
                  "description": "The URL that IAM Identity Center uses for OpenID Discovery. OpenID Discovery is used to obtain the information required to verify the tokens that the trusted token issuer generates.",
                  "nested_items": []
                },
                {
                  "name": "ClaimAttributePath",
                  "type": "string",
                  "description": "The path of the source attribute in the JWT from the trusted token issuer. The attribute mapped by this JMESPath expression is compared against the attribute mapped by IdentityStoreAttributePath when a trusted token issuer token is exchanged for an IAM Identity Center token.",
                  "nested_items": []
                },
                {
                  "name": "IdentityStoreAttributePath",
                  "type": "string",
                  "description": "The path of the destination attribute in a JWT from IAM Identity Center. The attribute mapped by this JMESPath expression is compared against the attribute mapped by ClaimAttributePath when a trusted token issuer token is exchanged for an IAM Identity Center token.",
                  "nested_items": []
                },
                {
                  "name": "JwksRetrievalOption",
                  "type": "string",
                  "description": "The method that the trusted token issuer can use to retrieve the JSON Web Key Set used to verify a JWT.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}