{
  "service_name": "ivschat",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ivschat.html",
  "client": {
    "description": "A low-level client representing Amazon Interactive Video Service Chat (ivschat) The Amazon IVS Chat control-plane API enables you to create and manage Amazon IVS Chat resources. You also need to integrate with the Amazon IVS Chat Messaging API, to enable users to interact with chat rooms in real time. The API is an AWS regional service. For a list of supported regions and Amazon IVS Chat HTTPS service endpoints, see the Amazon IVS Chat information on the Amazon IVS page in the AWS General Reference. This document describes HTTP operations. There is a separate messaging API for managing Chat resources; see the Amazon IVS Chat Messaging API Reference. You create service applications using the Amazon IVS Chat API. We refer to these as applications. You create front-end client applications (browser and Android/iOS apps) using the Amazon IVS Chat Messaging API. We refer to these as clients. The following resources are part of Amazon IVS Chat: LoggingConfiguration --\u0094 A configuration that allows customers to store and record sent messages in a chat room. See the Logging Configuration endpoints for more information. Room --\u0094 The central Amazon IVS Chat resource through which clients connect to and exchange chat messages. See the Room endpoints for more information. A tag is a metadata label that you assign to an AWS resource. A tag comprises a key and a value, both set by you. For example, you might set a tag as topic:nature to label a particular video category. See Best practices and strategies in Tagging Amazon Web Services Resources and Tag Editor for details, including restrictions that apply to tags and 'Tag naming limits and requirements'; Amazon IVS Chat has no service-specific constraints beyond what is documented there. Tags can help you identify and organize your AWS resources. For example, you can use the same tag for different resources to indicate that they are related. You can also use tags to manage access (see Access Tags). The Amazon IVS Chat API has these tag-related operations:  TagResource,  UntagResource, and  ListTagsForResource. The following resource supports tagging: Room. At most 50 tags can be applied to a resource. Your Amazon IVS Chat applications (service applications and clients) must be authenticated and authorized to access Amazon IVS Chat resources. Note the differences between these concepts: Authentication is about verifying identity. Requests to the Amazon IVS Chat API must be signed to verify your identity. Authorization is about granting permissions. Your IAM roles need to have permissions for Amazon IVS Chat API requests. Users (viewers) connect to a room using secure access tokens that you create using the  CreateChatToken operation through the AWS SDK. You call CreateChatToken for every user's chat session, passing identity and authorization information about the user. HTTP API requests must be signed with an AWS SigV4 signature using your AWS security credentials. The AWS Command Line Interface (CLI) and the AWS SDKs take care of signing the underlying API calls for you. However, if your application calls the Amazon IVS Chat HTTP API directly, it's your responsibility to sign the requests. You generate a signature using valid AWS credentials for an IAM role that has permission to perform the requested action. For example, DeleteMessage requests must be made using an IAM role that has the ivschat:DeleteMessage permission. For more information: Authentication and generating signatures --\u0094 See Authenticating Requests (Amazon Web Services Signature Version 4) in the Amazon Web Services General Reference. Managing Amazon IVS permissions --\u0094 See Identity and Access Management on the Security page of the Amazon IVS User Guide. ARNs uniquely identify AWS resources. An ARN is required when you need to specify a resource unambiguously across all of AWS, such as in IAM policies and API calls. For more information, see Amazon Resource Names in the AWS General Reference.",
    "methods_names": [
      "can_paginate",
      "close",
      "create_chat_token",
      "create_logging_configuration",
      "create_room",
      "delete_logging_configuration",
      "delete_message",
      "delete_room",
      "disconnect_user",
      "get_logging_configuration",
      "get_paginator",
      "get_room",
      "get_waiter",
      "list_logging_configurations",
      "list_rooms",
      "list_tags_for_resource",
      "send_event",
      "tag_resource",
      "untag_resource",
      "update_logging_configuration",
      "update_room"
    ],
    "methods_links": [
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ivschat/client/can_paginate.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ivschat/client/close.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ivschat/client/create_chat_token.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ivschat/client/create_logging_configuration.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ivschat/client/create_room.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ivschat/client/delete_logging_configuration.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ivschat/client/delete_message.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ivschat/client/delete_room.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ivschat/client/disconnect_user.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ivschat/client/get_logging_configuration.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ivschat/client/get_paginator.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ivschat/client/get_room.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ivschat/client/get_waiter.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ivschat/client/list_logging_configurations.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ivschat/client/list_rooms.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ivschat/client/list_tags_for_resource.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ivschat/client/send_event.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ivschat/client/tag_resource.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ivschat/client/untag_resource.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ivschat/client/update_logging_configuration.html",
      "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ivschat/client/update_room.html"
    ]
  },
  "paginators": {
    "paginators_names": [],
    "paginators_links": []
  }
}