{
  "method_name": "confirm_public_virtual_interface",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/directconnect/client/confirm_public_virtual_interface.html",
  "description": "Accepts ownership of a public virtual interface created by another Amazon Web Services account. After the virtual interface owner makes this call, the specified virtual interface is created and made available to handle traffic.",
  "parameters": [
    {
      "name": "virtualInterfaceId",
      "type": "string",
      "required": true,
      "description": "The ID of the virtual interface.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "virtualInterfaceState",
          "type": "string",
          "description": "The state of the virtual interface. The following are the possible values:",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "confirming: The creation of the virtual interface is pending confirmation from the virtual interface owner. If the owner of the virtual interface is different from the owner of the connection on which it is provisioned, then the virtual interface will remain in this state until it is confirmed by the virtual interface owner.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "verifying: This state only applies to public virtual interfaces. Each public virtual interface needs validation before the virtual interface can be created.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "pending: A virtual interface is in this state from the time that it is created until the virtual interface is ready to forward traffic.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "available: A virtual interface that is able to forward traffic.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "down: A virtual interface that is BGP down.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "testing: A virtual interface is in this state immediately after calling  StartBgpFailoverTest and remains in this state during the duration of the test.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "deleting: A virtual interface is in this state immediately after calling  DeleteVirtualInterface until it can no longer forward traffic.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "deleted: A virtual interface that cannot forward traffic.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "rejected: The virtual interface owner has declined creation of the virtual interface. If a virtual interface in the Confirming state is deleted by the virtual interface owner, the virtual interface enters the Rejected state.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "unknown: The state of the virtual interface is not available.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}