{
  "method_name": "create_store_image_task",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/create_store_image_task.html",
  "description": "Stores an AMI as a single object in an Amazon S3 bucket. To use this API, you must have the required permissions. For more information, see Permissions for storing and restoring AMIs using Amazon S3 in the Amazon EC2 User Guide. For more information, see Store and restore an AMI using Amazon S3 in the Amazon EC2 User Guide.",
  "parameters": [
    {
      "name": "ImageId",
      "type": "string",
      "required": true,
      "description": "The ID of the AMI.",
      "nested_params": []
    },
    {
      "name": "Bucket",
      "type": "string",
      "required": true,
      "description": "The name of the Amazon S3 bucket in which the AMI object will be stored. The bucket must be in the Region in which the request is being made. The AMI object appears in the bucket only after the upload task has completed.",
      "nested_params": []
    },
    {
      "name": "S3ObjectTags",
      "type": "list",
      "required": false,
      "description": "The tags to apply to the AMI object that will be stored in the Amazon S3 bucket. (dict) --- The tags to apply to the AMI object that will be stored in the Amazon S3 bucket. For more information, see Categorizing your storage using tags in the Amazon Simple Storage Service User Guide. Key (string) --- The key of the tag. Constraints: Tag keys are case-sensitive and can be up to 128 Unicode characters in length. May not begin with aws:. Value (string) --- The value of the tag. Constraints: Tag values are case-sensitive and can be up to 256 Unicode characters in length.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key of the tag. Constraints: Tag keys are case-sensitive and can be up to 128 Unicode characters in length. May not begin with aws:.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value of the tag. Constraints: Tag values are case-sensitive and can be up to 256 Unicode characters in length.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ObjectKey",
          "type": "string",
          "description": "The name of the stored AMI object in the S3 bucket.",
          "nested_items": []
        }
      ]
    }
  ]
}