{
  "method_name": "create_security_group",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/create_security_group.html",
  "description": "Creates a security group. A security group acts as a virtual firewall for your instance to control inbound and outbound traffic. For more information, see Amazon EC2 security groups in the Amazon EC2 User Guide and Security groups for your VPC in the Amazon VPC User Guide. When you create a security group, you specify a friendly name of your choice. You can't have two security groups for the same VPC with the same name. You have a default security group for use in your VPC. If you don't specify a security group when you launch an instance, the instance is launched into the appropriate default security group. A default security group includes a default rule that grants instances unrestricted network access to each other. You can add or remove rules from your security groups using  AuthorizeSecurityGroupIngress,  AuthorizeSecurityGroupEgress,  RevokeSecurityGroupIngress, and  RevokeSecurityGroupEgress. For more information about VPC security group limits, see Amazon VPC Limits.",
  "parameters": [
    {
      "name": "Description",
      "type": "string",
      "required": true,
      "description": "A description for the security group. Constraints: Up to 255 characters in length Valid characters: a-z, A-Z, 0-9, spaces, and ._-:/()#,@[]+=&;{}!$*",
      "nested_params": []
    },
    {
      "name": "GroupName",
      "type": "string",
      "required": true,
      "description": "The name of the security group. Names are case-insensitive and must be unique within the VPC. Constraints: Up to 255 characters in length. Can't start with sg-. Valid characters: a-z, A-Z, 0-9, spaces, and ._-:/()#,@[]+=&;{}!$*",
      "nested_params": []
    },
    {
      "name": "VpcId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "TagSpecifications",
      "type": "list",
      "required": false,
      "description": "The tags to assign to the security group. (dict) --- The tags to apply to a resource when the resource is being created. When you specify a tag, you must specify the resource type to tag, otherwise the request will fail. ResourceType (string) --- The type of resource to tag on creation. Tags (list) --- The tags to apply to the resource. (dict) --- Describes a tag. Key (string) --- The key of the tag. Constraints: Tag keys are case-sensitive and accept a maximum of 127 Unicode characters. May not begin with aws:. Value (string) --- The value of the tag. Constraints: Tag values are case-sensitive and accept a maximum of 256 Unicode characters.",
      "nested_params": [
        {
          "name": "ResourceType",
          "type": "string",
          "required": false,
          "description": "The type of resource to tag on creation.",
          "nested_params": []
        },
        {
          "name": "Tags",
          "type": "list",
          "required": false,
          "description": "The tags to apply to the resource.",
          "nested_params": [
            {
              "name": "Key",
              "type": "string",
              "required": false,
              "description": "The key of the tag. Constraints: Tag keys are case-sensitive and accept a maximum of 127 Unicode characters. May not begin with aws:.",
              "nested_params": []
            },
            {
              "name": "Value",
              "type": "string",
              "required": false,
              "description": "The value of the tag. Constraints: Tag values are case-sensitive and accept a maximum of 256 Unicode characters.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "GroupId",
          "type": "string",
          "description": "The ID of the security group.",
          "nested_items": []
        },
        {
          "name": "Tags",
          "type": "list",
          "description": "The tags assigned to the security group.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Key",
                  "type": "string",
                  "description": "The key of the tag.",
                  "nested_items": []
                },
                {
                  "name": "Value",
                  "type": "string",
                  "description": "The value of the tag.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "SecurityGroupArn",
          "type": "string",
          "description": "The security group ARN.",
          "nested_items": []
        }
      ]
    }
  ]
}