{
  "method_name": "create_capacity_reservation_fleet",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/create_capacity_reservation_fleet.html",
  "description": "Creates a Capacity Reservation Fleet. For more information, see Create a Capacity Reservation Fleet in the Amazon EC2 User Guide.",
  "parameters": [
    {
      "name": "AllocationStrategy",
      "type": "string",
      "required": false,
      "description": "The strategy used by the Capacity Reservation Fleet to determine which of the specified instance types to use. Currently, only the prioritized allocation strategy is supported. For more information, see Allocation strategy in the Amazon EC2 User Guide. Valid values: prioritized.",
      "nested_params": []
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": false,
      "description": "Unique, case-sensitive identifier that you provide to ensure the idempotency of the request. For more information, see Ensure Idempotency. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "InstanceTypeSpecifications",
      "type": "list",
      "required": true,
      "description": "Information about the instance types for which to reserve the capacity. (dict) --- Information about an instance type to use in a Capacity Reservation Fleet. InstanceType (string) --- The instance type for which the Capacity Reservation Fleet reserves capacity. InstancePlatform (string) --- The type of operating system for which the Capacity Reservation Fleet reserves capacity. Weight (float) --- The number of capacity units provided by the specified instance type. This value, together with the total target capacity that you specify for the Fleet determine the number of instances for which the Fleet reserves capacity. Both values are based on units that make sense for your workload. For more information, see Total target capacity in the Amazon EC2 User Guide. AvailabilityZone (string) --- The Availability Zone in which the Capacity Reservation Fleet reserves the capacity. A Capacity Reservation Fleet can't span Availability Zones. All instance type specifications that you specify for the Fleet must use the same Availability Zone. AvailabilityZoneId (string) --- The ID of the Availability Zone in which the Capacity Reservation Fleet reserves the capacity. EbsOptimized (boolean) --- Indicates whether the Capacity Reservation Fleet supports EBS-optimized instances types. This optimization provides dedicated throughput to Amazon EBS and an optimized configuration stack to provide optimal I/O performance. This optimization isn't available with all instance types. Additional usage charges apply when using EBS-optimized instance types. Priority (integer) --- The priority to assign to the instance type. This value is used to determine which of the instance types specified for the Fleet should be prioritized for use. A lower value indicates a high priority. For more information, see Instance type priority in the Amazon EC2 User Guide.",
      "nested_params": [
        {
          "name": "InstanceType",
          "type": "string",
          "required": false,
          "description": "The instance type for which the Capacity Reservation Fleet reserves capacity.",
          "nested_params": []
        },
        {
          "name": "InstancePlatform",
          "type": "string",
          "required": false,
          "description": "The type of operating system for which the Capacity Reservation Fleet reserves capacity.",
          "nested_params": []
        },
        {
          "name": "Weight",
          "type": "float",
          "required": false,
          "description": "The number of capacity units provided by the specified instance type. This value, together with the total target capacity that you specify for the Fleet determine the number of instances for which the Fleet reserves capacity. Both values are based on units that make sense for your workload. For more information, see Total target capacity in the Amazon EC2 User Guide.",
          "nested_params": []
        },
        {
          "name": "AvailabilityZone",
          "type": "string",
          "required": false,
          "description": "The Availability Zone in which the Capacity Reservation Fleet reserves the capacity. A Capacity Reservation Fleet can't span Availability Zones. All instance type specifications that you specify for the Fleet must use the same Availability Zone.",
          "nested_params": []
        },
        {
          "name": "AvailabilityZoneId",
          "type": "string",
          "required": false,
          "description": "The ID of the Availability Zone in which the Capacity Reservation Fleet reserves the capacity. A Capacity Reservation Fleet can't span Availability Zones. All instance type specifications that you specify for the Fleet must use the same Availability Zone.",
          "nested_params": []
        },
        {
          "name": "EbsOptimized",
          "type": "boolean",
          "required": false,
          "description": "Indicates whether the Capacity Reservation Fleet supports EBS-optimized instances types. This optimization provides dedicated throughput to Amazon EBS and an optimized configuration stack to provide optimal I/O performance. This optimization isn't available with all instance types. Additional usage charges apply when using EBS-optimized instance types.",
          "nested_params": []
        },
        {
          "name": "Priority",
          "type": "integer",
          "required": false,
          "description": "The priority to assign to the instance type. This value is used to determine which of the instance types specified for the Fleet should be prioritized for use. A lower value indicates a high priority. For more information, see Instance type priority in the Amazon EC2 User Guide.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Tenancy",
      "type": "string",
      "required": false,
      "description": "Indicates the tenancy of the Capacity Reservation Fleet. All Capacity Reservations in the Fleet inherit this tenancy. The Capacity Reservation Fleet can have one of the following tenancy settings: default - The Capacity Reservation Fleet is created on hardware that is shared with other Amazon Web Services accounts. dedicated - The Capacity Reservations are created on single-tenant hardware that is dedicated to a single Amazon Web Services account.",
      "nested_params": []
    },
    {
      "name": "TotalTargetCapacity",
      "type": "integer",
      "required": true,
      "description": "The total number of capacity units to be reserved by the Capacity Reservation Fleet. This value, together with the instance type weights that you assign to each instance type used by the Fleet determine the number of instances for which the Fleet reserves capacity. Both values are based on units that make sense for your workload. For more information, see Total target capacity in the Amazon EC2 User Guide.",
      "nested_params": []
    },
    {
      "name": "EndDate",
      "type": "datetime",
      "required": false,
      "description": "The date and time at which the Capacity Reservation Fleet expires. When the Capacity Reservation Fleet expires, its state changes to expired and all of the Capacity Reservations in the Fleet expire. The Capacity Reservation Fleet expires within an hour after the specified time. For example, if you specify 5/31/2019, 13:30:55, the Capacity Reservation Fleet is guaranteed to expire between 13:30:55 and 14:30:55 on 5/31/2019.",
      "nested_params": []
    },
    {
      "name": "InstanceMatchCriteria",
      "type": "string",
      "required": false,
      "description": "Indicates the type of instance launches that the Capacity Reservation Fleet accepts. All Capacity Reservations in the Fleet inherit this instance matching criteria. Currently, Capacity Reservation Fleets support open instance matching criteria only. This means that instances that have matching attributes (instance type, platform, and Availability Zone) run in the Capacity Reservations automatically. Instances do not need to explicitly target a Capacity Reservation Fleet to use its reserved capacity.",
      "nested_params": []
    },
    {
      "name": "TagSpecifications",
      "type": "list",
      "required": false,
      "description": "The tags to assign to the Capacity Reservation Fleet. The tags are automatically assigned to the Capacity Reservations in the Fleet. (dict) --- The tags to apply to a resource when the resource is being created. When you specify a tag, you must specify the resource type to tag, otherwise the request will fail. ResourceType (string) --- The type of resource to tag on creation. Tags (list) --- The tags to apply to the resource. (dict) --- Describes a tag. Key (string) --- The key of the tag. Constraints: Tag keys are case-sensitive and accept a maximum of 127 Unicode characters. May not begin with aws:. Value (string) --- The value of the tag. Constraints: Tag values are case-sensitive and accept a maximum of 256 Unicode characters.",
      "nested_params": [
        {
          "name": "ResourceType",
          "type": "string",
          "required": false,
          "description": "The type of resource to tag on creation.",
          "nested_params": []
        },
        {
          "name": "Tags",
          "type": "list",
          "required": false,
          "description": "The tags to apply to the resource.",
          "nested_params": [
            {
              "name": "Key",
              "type": "string",
              "required": false,
              "description": "The key of the tag. Constraints: Tag keys are case-sensitive and accept a maximum of 127 Unicode characters. May not begin with aws:.",
              "nested_params": []
            },
            {
              "name": "Value",
              "type": "string",
              "required": false,
              "description": "The value of the tag. Constraints: Tag values are case-sensitive and accept a maximum of 256 Unicode characters.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "CapacityReservationFleetId",
          "type": "string",
          "description": "The ID of the Capacity Reservation Fleet.",
          "nested_items": []
        },
        {
          "name": "State",
          "type": "string",
          "description": "The status of the Capacity Reservation Fleet.",
          "nested_items": []
        },
        {
          "name": "TotalTargetCapacity",
          "type": "integer",
          "description": "The total number of capacity units for which the Capacity Reservation Fleet reserves capacity.",
          "nested_items": []
        },
        {
          "name": "TotalFulfilledCapacity",
          "type": "float",
          "description": "The requested capacity units that have been successfully reserved.",
          "nested_items": []
        },
        {
          "name": "InstanceMatchCriteria",
          "type": "string",
          "description": "The instance matching criteria for the Capacity Reservation Fleet.",
          "nested_items": []
        },
        {
          "name": "AllocationStrategy",
          "type": "string",
          "description": "The allocation strategy used by the Capacity Reservation Fleet.",
          "nested_items": []
        },
        {
          "name": "CreateTime",
          "type": "datetime",
          "description": "The date and time at which the Capacity Reservation Fleet was created.",
          "nested_items": []
        },
        {
          "name": "EndDate",
          "type": "datetime",
          "description": "The date and time at which the Capacity Reservation Fleet expires.",
          "nested_items": []
        },
        {
          "name": "Tenancy",
          "type": "string",
          "description": "Indicates the tenancy of Capacity Reservation Fleet.",
          "nested_items": []
        },
        {
          "name": "FleetCapacityReservations",
          "type": "list",
          "description": "Information about the individual Capacity Reservations in the Capacity Reservation Fleet.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "CapacityReservationId",
                  "type": "string",
                  "description": "The ID of the Capacity Reservation.",
                  "nested_items": []
                },
                {
                  "name": "AvailabilityZoneId",
                  "type": "string",
                  "description": "The ID of the Availability Zone in which the Capacity Reservation reserves capacity.",
                  "nested_items": []
                },
                {
                  "name": "InstanceType",
                  "type": "string",
                  "description": "The instance type for which the Capacity Reservation reserves capacity.",
                  "nested_items": []
                },
                {
                  "name": "InstancePlatform",
                  "type": "string",
                  "description": "The type of operating system for which the Capacity Reservation reserves capacity.",
                  "nested_items": []
                },
                {
                  "name": "AvailabilityZone",
                  "type": "string",
                  "description": "The Availability Zone in which the Capacity Reservation reserves capacity.",
                  "nested_items": []
                },
                {
                  "name": "TotalInstanceCount",
                  "type": "integer",
                  "description": "The total number of instances for which the Capacity Reservation reserves capacity.",
                  "nested_items": []
                },
                {
                  "name": "FulfilledCapacity",
                  "type": "float",
                  "description": "The number of capacity units fulfilled by the Capacity Reservation. For more information, see Total target capacity in the Amazon EC2 User Guide.",
                  "nested_items": []
                },
                {
                  "name": "EbsOptimized",
                  "type": "boolean",
                  "description": "Indicates whether the Capacity Reservation reserves capacity for EBS-optimized instance types.",
                  "nested_items": []
                },
                {
                  "name": "CreateDate",
                  "type": "datetime",
                  "description": "The date and time at which the Capacity Reservation was created.",
                  "nested_items": []
                },
                {
                  "name": "Weight",
                  "type": "float",
                  "description": "The weight of the instance type in the Capacity Reservation Fleet. For more information, see Instance type weight in the Amazon EC2 User Guide.",
                  "nested_items": []
                },
                {
                  "name": "Priority",
                  "type": "integer",
                  "description": "The priority of the instance type in the Capacity Reservation Fleet. For more information, see Instance type priority in the Amazon EC2 User Guide.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "Tags",
          "type": "list",
          "description": "The tags assigned to the Capacity Reservation Fleet.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Key",
                  "type": "string",
                  "description": "The key of the tag.",
                  "nested_items": []
                },
                {
                  "name": "Value",
                  "type": "string",
                  "description": "The value of the tag.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}