{
  "method_name": "create_traffic_mirror_session",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/create_traffic_mirror_session.html",
  "description": "Creates a Traffic Mirror session. A Traffic Mirror session actively copies packets from a Traffic Mirror source to a Traffic Mirror target. Create a filter, and then assign it to the session to define a subset of the traffic to mirror, for example all TCP traffic. The Traffic Mirror source and the Traffic Mirror target (monitoring appliances) can be in the same VPC, or in a different VPC connected via VPC peering or a transit gateway. By default, no traffic is mirrored. Use CreateTrafficMirrorFilter to create filter rules that specify the traffic to mirror.",
  "parameters": [
    {
      "name": "NetworkInterfaceId",
      "type": "string",
      "required": true,
      "description": "The ID of the source network interface.",
      "nested_params": []
    },
    {
      "name": "TrafficMirrorTargetId",
      "type": "string",
      "required": true,
      "description": "The ID of the Traffic Mirror target.",
      "nested_params": []
    },
    {
      "name": "TrafficMirrorFilterId",
      "type": "string",
      "required": true,
      "description": "The ID of the Traffic Mirror filter.",
      "nested_params": []
    },
    {
      "name": "PacketLength",
      "type": "integer",
      "required": false,
      "description": "The number of bytes in each packet to mirror. These are bytes after the VXLAN header. Do not specify this parameter when you want to mirror the entire packet. To mirror a subset of the packet, set this to the length (in bytes) that you want to mirror. For example, if you set this value to 100, then the first 100 bytes that meet the filter criteria are copied to the target. If you do not want to mirror the entire packet, use the PacketLength parameter to specify the number of bytes in each packet to mirror. For sessions with Network Load Balancer (NLB) Traffic Mirror targets the default PacketLength will be set to 8500. Valid values are 1-8500. Setting a PacketLength greater than 8500 will result in an error response.",
      "nested_params": []
    },
    {
      "name": "SessionNumber",
      "type": "integer",
      "required": true,
      "description": "The session number determines the order in which sessions are evaluated when an interface is used by multiple sessions. The first session with a matching filter is the one that mirrors the packets. Valid values are 1-32766.",
      "nested_params": []
    },
    {
      "name": "VirtualNetworkId",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "TagSpecifications",
      "type": "list",
      "required": false,
      "description": "The tags to assign to a Traffic Mirror session. (dict) --- The tags to apply to a resource when the resource is being created. When you specify a tag, you must specify the resource type to tag, otherwise the request will fail. ResourceType (string) --- The type of resource to tag on creation. Tags (list) --- The tags to apply to the resource. (dict) --- Describes a tag. Key (string) --- The key of the tag. Constraints: Tag keys are case-sensitive and accept a maximum of 127 Unicode characters. May not begin with aws:. Value (string) --- The value of the tag. Constraints: Tag values are case-sensitive and accept a maximum of 256 Unicode characters.",
      "nested_params": [
        {
          "name": "ResourceType",
          "type": "string",
          "required": false,
          "description": "The type of resource to tag on creation.",
          "nested_params": []
        },
        {
          "name": "Tags",
          "type": "list",
          "required": false,
          "description": "The tags to apply to the resource.",
          "nested_params": [
            {
              "name": "Key",
              "type": "string",
              "required": false,
              "description": "The key of the tag. Constraints: Tag keys are case-sensitive and accept a maximum of 127 Unicode characters. May not begin with aws:.",
              "nested_params": []
            },
            {
              "name": "Value",
              "type": "string",
              "required": false,
              "description": "The value of the tag. Constraints: Tag values are case-sensitive and accept a maximum of 256 Unicode characters.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": false,
      "description": "Unique, case-sensitive identifier that you provide to ensure the idempotency of the request. For more information, see How to ensure idempotency. This field is autopopulated if not provided.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "TrafficMirrorSession",
          "type": "dict",
          "description": "Information about the Traffic Mirror session.",
          "nested_items": [
            {
              "name": "TrafficMirrorSessionId",
              "type": "string",
              "description": "The ID for the Traffic Mirror session.",
              "nested_items": []
            },
            {
              "name": "TrafficMirrorTargetId",
              "type": "string",
              "description": "The ID of the Traffic Mirror target.",
              "nested_items": []
            },
            {
              "name": "TrafficMirrorFilterId",
              "type": "string",
              "description": "The ID of the Traffic Mirror filter.",
              "nested_items": []
            },
            {
              "name": "NetworkInterfaceId",
              "type": "string",
              "description": "The ID of the Traffic Mirror session's network interface.",
              "nested_items": []
            },
            {
              "name": "OwnerId",
              "type": "string",
              "description": "The ID of the account that owns the Traffic Mirror session.",
              "nested_items": []
            },
            {
              "name": "PacketLength",
              "type": "integer",
              "description": "The number of bytes in each packet to mirror. These are the bytes after the VXLAN header. To mirror a subset, set this to the length (in bytes) to mirror. For example, if you set this value to 100, then the first 100 bytes that meet the filter criteria are copied to the target. Do not specify this parameter when you want to mirror the entire packet.",
              "nested_items": []
            },
            {
              "name": "SessionNumber",
              "type": "integer",
              "description": "The session number determines the order in which sessions are evaluated when an interface is used by multiple sessions. The first session with a matching filter is the one that mirrors the packets.",
              "nested_items": []
            },
            {
              "name": "VirtualNetworkId",
              "type": "integer",
              "description": "The virtual network ID associated with the Traffic Mirror session.",
              "nested_items": []
            },
            {
              "name": "Description",
              "type": "string",
              "description": "The description of the Traffic Mirror session.",
              "nested_items": []
            },
            {
              "name": "Tags",
              "type": "list",
              "description": "The tags assigned to the Traffic Mirror session.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Key",
                      "type": "string",
                      "description": "The key of the tag.",
                      "nested_items": []
                    },
                    {
                      "name": "Value",
                      "type": "string",
                      "description": "The value of the tag.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "ClientToken",
          "type": "string",
          "description": "Unique, case-sensitive identifier that you provide to ensure the idempotency of the request. For more information, see How to ensure idempotency.",
          "nested_items": []
        }
      ]
    }
  ]
}