{
  "method_name": "describe_instance_event_windows",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/describe_instance_event_windows.html",
  "description": "Describes the specified event windows or all event windows. If you specify event window IDs, the output includes information for only the specified event windows. If you specify filters, the output includes information for only those event windows that meet the filter criteria. If you do not specify event windows IDs or filters, the output includes information for all event windows, which can affect performance. We recommend that you use pagination to ensure that the operation returns quickly and successfully. For more information, see Define event windows for scheduled events in the Amazon EC2 User Guide.",
  "parameters": [
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "InstanceEventWindowIds",
      "type": "list",
      "required": false,
      "description": "The IDs of the event windows. (string) ---",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": false,
      "description": "One or more filters. dedicated-host-id - The event windows associated with the specified Dedicated Host ID. event-window-name - The event windows associated with the specified names. instance-id - The event windows associated with the specified instance ID. instance-tag - The event windows associated with the specified tag and value. instance-tag-key - The event windows associated with the specified tag key, regardless of the value. instance-tag-value - The event windows associated with the specified tag value, regardless of the key. tag:<key> - The key/value combination of a tag assigned to the event window. Use the tag key in the filter name and the tag value as the filter value. For example, to find all resources that have a tag with the key Owner and the value CMX, specify tag:Owner for the filter name and CMX for the filter value. tag-key - The key of a tag assigned to the event window. Use this filter to find all event windows that have a tag with a specific key, regardless of the tag value. tag-value - The value of a tag assigned to the event window. Use this filter to find all event windows that have a tag with a specific value, regardless of the tag key. (dict) --- A filter name and value pair that is used to return a more specific list of results from a describe operation. Filters can be used to match a set of resources by specific criteria, such as tags, attributes, or IDs. If you specify multiple filters, the filters are joined with an AND, and the request returns only results that match all of the specified filters. For more information, see List and filter using the CLI and API in the Amazon EC2 User Guide. Name (string) --- The name of the filter. Filter names are case-sensitive. Values (list) --- The filter values. Filter values are case-sensitive. If you specify multiple values for a filter, the values are joined with an OR, and the request returns all results that match any of the specified values. (string) ---",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "InstanceEventWindows",
          "type": "list",
          "description": "Information about the event windows.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "InstanceEventWindowId",
                  "type": "string",
                  "description": "The ID of the event window.",
                  "nested_items": []
                },
                {
                  "name": "TimeRanges",
                  "type": "list",
                  "description": "One or more time ranges defined for the event window.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "StartWeekDay",
                          "type": "string",
                          "description": "The day on which the time range begins.",
                          "nested_items": []
                        },
                        {
                          "name": "StartHour",
                          "type": "integer",
                          "description": "The hour when the time range begins.",
                          "nested_items": []
                        },
                        {
                          "name": "EndWeekDay",
                          "type": "string",
                          "description": "The day on which the time range ends.",
                          "nested_items": []
                        },
                        {
                          "name": "EndHour",
                          "type": "integer",
                          "description": "The hour when the time range ends.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The name of the event window.",
                  "nested_items": []
                },
                {
                  "name": "CronExpression",
                  "type": "string",
                  "description": "The cron expression defined for the event window.",
                  "nested_items": []
                },
                {
                  "name": "AssociationTarget",
                  "type": "dict",
                  "description": "One or more targets associated with the event window.",
                  "nested_items": [
                    {
                      "name": "InstanceIds",
                      "type": "list",
                      "description": "The IDs of the instances associated with the event window.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "Tags",
                      "type": "list",
                      "description": "The instance tags associated with the event window. Any instances associated with the tags will be associated with the event window.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "Key",
                              "type": "string",
                              "description": "The key of the tag.",
                              "nested_items": []
                            },
                            {
                              "name": "Value",
                              "type": "string",
                              "description": "The value of the tag.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "DedicatedHostIds",
                      "type": "list",
                      "description": "The IDs of the Dedicated Hosts associated with the event window.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "State",
                  "type": "string",
                  "description": "The current state of the event window.",
                  "nested_items": []
                },
                {
                  "name": "Tags",
                  "type": "list",
                  "description": "The instance tags associated with the event window.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Key",
                          "type": "string",
                          "description": "The key of the tag.",
                          "nested_items": []
                        },
                        {
                          "name": "Value",
                          "type": "string",
                          "description": "The value of the tag.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The token to use to retrieve the next page of results. This value is null when there are no more results to return.",
          "nested_items": []
        }
      ]
    }
  ]
}