{
  "method_name": "describe_addresses",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/describe_addresses.html",
  "description": "Describes the specified Elastic IP addresses or all of your Elastic IP addresses.",
  "parameters": [
    {
      "name": "PublicIps",
      "type": "list",
      "required": false,
      "description": "One or more Elastic IP addresses. Default: Describes all your Elastic IP addresses. (string) ---",
      "nested_params": []
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": false,
      "description": "One or more filters. Filter names and values are case-sensitive. allocation-id - The allocation ID for the address. association-id - The association ID for the address. instance-id - The ID of the instance the address is associated with, if any. network-border-group - A unique set of Availability Zones, Local Zones, or Wavelength Zones from where Amazon Web Services advertises IP addresses. network-interface-id - The ID of the network interface that the address is associated with, if any. network-interface-owner-id - The Amazon Web Services account ID of the owner. private-ip-address - The private IP address associated with the Elastic IP address. public-ip - The Elastic IP address, or the carrier IP address. tag:<key> - The key/value combination of a tag assigned to the resource. Use the tag key in the filter name and the tag value as the filter value. For example, to find all resources that have a tag with the key Owner and the value TeamA, specify tag:Owner for the filter name and TeamA for the filter value. tag-key - The key of a tag assigned to the resource. Use this filter to find all resources assigned a tag with a specific key, regardless of the tag value. (dict) --- A filter name and value pair that is used to return a more specific list of results from a describe operation. Filters can be used to match a set of resources by specific criteria, such as tags, attributes, or IDs. If you specify multiple filters, the filters are joined with an AND, and the request returns only results that match all of the specified filters. For more information, see List and filter using the CLI and API in the Amazon EC2 User Guide. Name (string) --- The name of the filter. Filter names are case-sensitive. Values (list) --- The filter values. Filter values are case-sensitive. If you specify multiple values for a filter, the values are joined with an OR, and the request returns all results that match any of the specified values. (string) ---",
      "nested_params": []
    },
    {
      "name": "AllocationIds",
      "type": "list",
      "required": false,
      "description": "Information about the allocation IDs. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Addresses",
          "type": "list",
          "description": "Information about the Elastic IP addresses.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "AllocationId",
                  "type": "string",
                  "description": "The ID representing the allocation of the address.",
                  "nested_items": []
                },
                {
                  "name": "AssociationId",
                  "type": "string",
                  "description": "The ID representing the association of the address with an instance.",
                  "nested_items": []
                },
                {
                  "name": "Domain",
                  "type": "string",
                  "description": "The network ( vpc).",
                  "nested_items": []
                },
                {
                  "name": "NetworkInterfaceId",
                  "type": "string",
                  "description": "The ID of the network interface.",
                  "nested_items": []
                },
                {
                  "name": "NetworkInterfaceOwnerId",
                  "type": "string",
                  "description": "The ID of the Amazon Web Services account that owns the network interface.",
                  "nested_items": []
                },
                {
                  "name": "PrivateIpAddress",
                  "type": "string",
                  "description": "The private IP address associated with the Elastic IP address.",
                  "nested_items": []
                },
                {
                  "name": "Tags",
                  "type": "list",
                  "description": "Any tags assigned to the Elastic IP address.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Key",
                          "type": "string",
                          "description": "The key of the tag.",
                          "nested_items": []
                        },
                        {
                          "name": "Value",
                          "type": "string",
                          "description": "The value of the tag.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "PublicIpv4Pool",
                  "type": "string",
                  "description": "The ID of an address pool.",
                  "nested_items": []
                },
                {
                  "name": "NetworkBorderGroup",
                  "type": "string",
                  "description": "The name of the unique set of Availability Zones, Local Zones, or Wavelength Zones from which Amazon Web Services advertises IP addresses.",
                  "nested_items": []
                },
                {
                  "name": "CustomerOwnedIp",
                  "type": "string",
                  "description": "The customer-owned IP address.",
                  "nested_items": []
                },
                {
                  "name": "CustomerOwnedIpv4Pool",
                  "type": "string",
                  "description": "The ID of the customer-owned address pool.",
                  "nested_items": []
                },
                {
                  "name": "CarrierIp",
                  "type": "string",
                  "description": "The carrier IP address associated. This option is only available for network interfaces which reside in a subnet in a Wavelength Zone (for example an EC2 instance).",
                  "nested_items": []
                },
                {
                  "name": "ServiceManaged",
                  "type": "string",
                  "description": "The service that manages the elastic IP address.",
                  "nested_items": []
                },
                {
                  "name": "InstanceId",
                  "type": "string",
                  "description": "The ID of the instance that the address is associated with (if any).",
                  "nested_items": []
                },
                {
                  "name": "PublicIp",
                  "type": "string",
                  "description": "The Elastic IP address.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}