{
  "method_name": "describe_fast_launch_images",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/describe_fast_launch_images.html",
  "description": "Describe details for Windows AMIs that are configured for Windows fast launch.",
  "parameters": [
    {
      "name": "ImageIds",
      "type": "list",
      "required": false,
      "description": "Specify one or more Windows AMI image IDs for the request. (string) ---",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": false,
      "description": "Use the following filters to streamline results. resource-type - The resource type for pre-provisioning. owner-id - The owner ID for the pre-provisioning resource. state - The current state of fast launching for the Windows AMI. (dict) --- A filter name and value pair that is used to return a more specific list of results from a describe operation. Filters can be used to match a set of resources by specific criteria, such as tags, attributes, or IDs. If you specify multiple filters, the filters are joined with an AND, and the request returns only results that match all of the specified filters. For more information, see List and filter using the CLI and API in the Amazon EC2 User Guide. Name (string) --- The name of the filter. Filter names are case-sensitive. Values (list) --- The filter values. Filter values are case-sensitive. If you specify multiple values for a filter, the values are joined with an OR, and the request returns all results that match any of the specified values. (string) ---",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "FastLaunchImages",
          "type": "list",
          "description": "A collection of details about the fast-launch enabled Windows images that meet the requested criteria.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ImageId",
                  "type": "string",
                  "description": "The image ID that identifies the Windows fast launch enabled image.",
                  "nested_items": []
                },
                {
                  "name": "ResourceType",
                  "type": "string",
                  "description": "The resource type that Amazon EC2 uses for pre-provisioning the Windows AMI. Supported values include: snapshot.",
                  "nested_items": []
                },
                {
                  "name": "SnapshotConfiguration",
                  "type": "dict",
                  "description": "A group of parameters that are used for pre-provisioning the associated Windows AMI using snapshots.",
                  "nested_items": [
                    {
                      "name": "TargetResourceCount",
                      "type": "integer",
                      "description": "The number of pre-provisioned snapshots requested to keep on hand for a Windows fast launch enabled AMI.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "LaunchTemplate",
                  "type": "dict",
                  "description": "The launch template that the Windows fast launch enabled AMI uses when it launches Windows instances from pre-provisioned snapshots.",
                  "nested_items": [
                    {
                      "name": "LaunchTemplateId",
                      "type": "string",
                      "description": "The ID of the launch template that the AMI uses for Windows fast launch.",
                      "nested_items": []
                    },
                    {
                      "name": "LaunchTemplateName",
                      "type": "string",
                      "description": "The name of the launch template that the AMI uses for Windows fast launch.",
                      "nested_items": []
                    },
                    {
                      "name": "Version",
                      "type": "string",
                      "description": "The version of the launch template that the AMI uses for Windows fast launch.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "MaxParallelLaunches",
                  "type": "integer",
                  "description": "The maximum number of instances that Amazon EC2 can launch at the same time to create pre-provisioned snapshots for Windows fast launch.",
                  "nested_items": []
                },
                {
                  "name": "OwnerId",
                  "type": "string",
                  "description": "The owner ID for the Windows fast launch enabled AMI.",
                  "nested_items": []
                },
                {
                  "name": "State",
                  "type": "string",
                  "description": "The current state of Windows fast launch for the specified Windows AMI.",
                  "nested_items": []
                },
                {
                  "name": "StateTransitionReason",
                  "type": "string",
                  "description": "The reason that Windows fast launch for the AMI changed to the current state.",
                  "nested_items": []
                },
                {
                  "name": "StateTransitionTime",
                  "type": "datetime",
                  "description": "The time that Windows fast launch for the AMI changed to the current state.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The token to include in another request to get the next page of items. This value is null when there are no more items to return.",
          "nested_items": []
        }
      ]
    }
  ]
}