{
  "method_name": "describe_reserved_instances_modifications",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/describe_reserved_instances_modifications.html",
  "description": "Describes the modifications made to your Reserved Instances. If no parameter is specified, information about all your Reserved Instances modification requests is returned. If a modification ID is specified, only information about the specific modification is returned. For more information, see Modify Reserved Instances in the Amazon EC2 User Guide.",
  "parameters": [
    {
      "name": "ReservedInstancesModificationIds",
      "type": "list",
      "required": false,
      "description": "IDs for the submitted modification request. (string) ---",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": false,
      "description": "One or more filters. client-token - The idempotency token for the modification request. create-date - The time when the modification request was created. effective-date - The time when the modification becomes effective. modification-result.reserved-instances-id - The ID for the Reserved Instances created as part of the modification request. This ID is only available when the status of the modification is fulfilled. modification-result.target-configuration.availability-zone - The Availability Zone for the new Reserved Instances. modification-result.target-configuration.instance-count - The number of new Reserved Instances. modification-result.target-configuration.instance-type - The instance type of the new Reserved Instances. reserved-instances-id - The ID of the Reserved Instances modified. reserved-instances-modification-id - The ID of the modification request. status - The status of the Reserved Instances modification request ( processing | fulfilled | failed). status-message - The reason for the status. update-date - The time when the modification request was last updated. (dict) --- A filter name and value pair that is used to return a more specific list of results from a describe operation. Filters can be used to match a set of resources by specific criteria, such as tags, attributes, or IDs. If you specify multiple filters, the filters are joined with an AND, and the request returns only results that match all of the specified filters. For more information, see List and filter using the CLI and API in the Amazon EC2 User Guide. Name (string) --- The name of the filter. Filter names are case-sensitive. Values (list) --- The filter values. Filter values are case-sensitive. If you specify multiple values for a filter, the values are joined with an OR, and the request returns all results that match any of the specified values. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "NextToken",
          "type": "string",
          "description": "The token to use to retrieve the next page of results. This value is null when there are no more results to return.",
          "nested_items": []
        },
        {
          "name": "ReservedInstancesModifications",
          "type": "list",
          "description": "The Reserved Instance modification information.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ClientToken",
                  "type": "string",
                  "description": "A unique, case-sensitive key supplied by the client to ensure that the request is idempotent. For more information, see Ensuring Idempotency.",
                  "nested_items": []
                },
                {
                  "name": "CreateDate",
                  "type": "datetime",
                  "description": "The time when the modification request was created.",
                  "nested_items": []
                },
                {
                  "name": "EffectiveDate",
                  "type": "datetime",
                  "description": "The time for the modification to become effective.",
                  "nested_items": []
                },
                {
                  "name": "ModificationResults",
                  "type": "list",
                  "description": "Contains target configurations along with their corresponding new Reserved Instance IDs.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "ReservedInstancesId",
                          "type": "string",
                          "description": "The ID for the Reserved Instances that were created as part of the modification request. This field is only available when the modification is fulfilled.",
                          "nested_items": []
                        },
                        {
                          "name": "TargetConfiguration",
                          "type": "dict",
                          "description": "The target Reserved Instances configurations supplied as part of the modification request.",
                          "nested_items": [
                            {
                              "name": "AvailabilityZone",
                              "type": "string",
                              "description": "The Availability Zone for the modified Reserved Instances.",
                              "nested_items": []
                            },
                            {
                              "name": "InstanceCount",
                              "type": "integer",
                              "description": "The number of modified Reserved Instances.",
                              "nested_items": []
                            },
                            {
                              "name": "InstanceType",
                              "type": "string",
                              "description": "The instance type for the modified Reserved Instances.",
                              "nested_items": []
                            },
                            {
                              "name": "Platform",
                              "type": "string",
                              "description": "The network platform of the modified Reserved Instances.",
                              "nested_items": []
                            },
                            {
                              "name": "Scope",
                              "type": "string",
                              "description": "Whether the Reserved Instance is applied to instances in a Region or instances in a specific Availability Zone.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "ReservedInstancesIds",
                  "type": "list",
                  "description": "The IDs of one or more Reserved Instances.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "ReservedInstancesId",
                          "type": "string",
                          "description": "The ID of the Reserved Instance.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "ReservedInstancesModificationId",
                  "type": "string",
                  "description": "A unique ID for the Reserved Instance modification.",
                  "nested_items": []
                },
                {
                  "name": "Status",
                  "type": "string",
                  "description": "The status of the Reserved Instances modification request.",
                  "nested_items": []
                },
                {
                  "name": "StatusMessage",
                  "type": "string",
                  "description": "The reason for the status.",
                  "nested_items": []
                },
                {
                  "name": "UpdateDate",
                  "type": "datetime",
                  "description": "The time when the modification request was last updated.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}