{
  "method_name": "describe_ipam_pools",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/describe_ipam_pools.html",
  "description": "Get information about your IPAM pools.",
  "parameters": [
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": false,
      "description": "One or more filters for the request. For more information about filtering, see Filtering CLI output. (dict) --- A filter name and value pair that is used to return a more specific list of results from a describe operation. Filters can be used to match a set of resources by specific criteria, such as tags, attributes, or IDs. If you specify multiple filters, the filters are joined with an AND, and the request returns only results that match all of the specified filters. For more information, see List and filter using the CLI and API in the Amazon EC2 User Guide. Name (string) --- The name of the filter. Filter names are case-sensitive. Values (list) --- The filter values. Filter values are case-sensitive. If you specify multiple values for a filter, the values are joined with an OR, and the request returns all results that match any of the specified values. (string) ---",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name of the filter. Filter names are case-sensitive.",
          "nested_params": []
        },
        {
          "name": "Values",
          "type": "list",
          "required": false,
          "description": "The filter values. Filter values are case-sensitive. If you specify multiple values for a filter, the values are joined with an OR, and the request returns all results that match any of the specified values.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "IpamPoolIds",
      "type": "list",
      "required": false,
      "description": "The IDs of the IPAM pools you would like information on. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "NextToken",
          "type": "string",
          "description": "The token to use to retrieve the next page of results. This value is null when there are no more results to return.",
          "nested_items": []
        },
        {
          "name": "IpamPools",
          "type": "list",
          "description": "Information about the IPAM pools.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "OwnerId",
                  "type": "string",
                  "description": "The Amazon Web Services account ID of the owner of the IPAM pool.",
                  "nested_items": []
                },
                {
                  "name": "IpamPoolId",
                  "type": "string",
                  "description": "The ID of the IPAM pool.",
                  "nested_items": []
                },
                {
                  "name": "SourceIpamPoolId",
                  "type": "string",
                  "description": "The ID of the source IPAM pool. You can use this option to create an IPAM pool within an existing source pool.",
                  "nested_items": []
                },
                {
                  "name": "IpamPoolArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the IPAM pool.",
                  "nested_items": []
                },
                {
                  "name": "IpamScopeArn",
                  "type": "string",
                  "description": "The ARN of the scope of the IPAM pool.",
                  "nested_items": []
                },
                {
                  "name": "IpamScopeType",
                  "type": "string",
                  "description": "In IPAM, a scope is the highest-level container within IPAM. An IPAM contains two default scopes. Each scope represents the IP space for a single network. The private scope is intended for all private IP address space. The public scope is intended for all public IP address space. Scopes enable you to reuse IP addresses across multiple unconnected networks without causing IP address overlap or conflict.",
                  "nested_items": []
                },
                {
                  "name": "IpamArn",
                  "type": "string",
                  "description": "The ARN of the IPAM.",
                  "nested_items": []
                },
                {
                  "name": "IpamRegion",
                  "type": "string",
                  "description": "The Amazon Web Services Region of the IPAM pool.",
                  "nested_items": []
                },
                {
                  "name": "Locale",
                  "type": "string",
                  "description": "The locale of the IPAM pool.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "An Amazon Web Services Region where you want this IPAM pool to be available for allocations.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "supported Local Zones",
                      "description": "The network border group for an Amazon Web Services Local Zone where you want this IPAM pool to be available for allocations ( supported Local Zones). This option is only available for IPAM IPv4 pools in the public scope.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "PoolDepth",
                  "type": "integer",
                  "description": "The depth of pools in your IPAM pool. The pool depth quota is 10. For more information, see Quotas in IPAM in the Amazon VPC IPAM User Guide.",
                  "nested_items": []
                },
                {
                  "name": "State",
                  "type": "string",
                  "description": "The state of the IPAM pool.",
                  "nested_items": []
                },
                {
                  "name": "StateMessage",
                  "type": "string",
                  "description": "The state message.",
                  "nested_items": []
                },
                {
                  "name": "Description",
                  "type": "string",
                  "description": "The description of the IPAM pool.",
                  "nested_items": []
                },
                {
                  "name": "AutoImport",
                  "type": "boolean",
                  "description": "If selected, IPAM will continuously look for resources within the CIDR range of this pool and automatically import them as allocations into your IPAM. The CIDRs that will be allocated for these resources must not already be allocated to other resources in order for the import to succeed. IPAM will import a CIDR regardless of its compliance with the pool's allocation rules, so a resource might be imported and subsequently marked as noncompliant. If IPAM discovers multiple CIDRs that overlap, IPAM will import the largest CIDR only. If IPAM discovers multiple CIDRs with matching CIDRs, IPAM will randomly import one of them only.",
                  "nested_items": []
                },
                {
                  "name": "PubliclyAdvertisable",
                  "type": "boolean",
                  "description": "Determines if a pool is publicly advertisable. This option is not available for pools with AddressFamily set to ipv4.",
                  "nested_items": []
                },
                {
                  "name": "AddressFamily",
                  "type": "string",
                  "description": "The address family of the pool.",
                  "nested_items": []
                },
                {
                  "name": "AllocationMinNetmaskLength",
                  "type": "integer",
                  "description": "The minimum netmask length required for CIDR allocations in this IPAM pool to be compliant. The minimum netmask length must be less than the maximum netmask length. Possible netmask lengths for IPv4 addresses are 0 - 32. Possible netmask lengths for IPv6 addresses are 0 - 128.",
                  "nested_items": []
                },
                {
                  "name": "AllocationMaxNetmaskLength",
                  "type": "integer",
                  "description": "The maximum netmask length possible for CIDR allocations in this IPAM pool to be compliant. The maximum netmask length must be greater than the minimum netmask length. Possible netmask lengths for IPv4 addresses are 0 - 32. Possible netmask lengths for IPv6 addresses are 0 - 128.",
                  "nested_items": []
                },
                {
                  "name": "AllocationDefaultNetmaskLength",
                  "type": "integer",
                  "description": "The default netmask length for allocations added to this pool. If, for example, the CIDR assigned to this pool is 10.0.0.0/8 and you enter 16 here, new allocations will default to 10.0.0.0/16.",
                  "nested_items": []
                },
                {
                  "name": "AllocationResourceTags",
                  "type": "list",
                  "description": "Tags that are required for resources that use CIDRs from this IPAM pool. Resources that do not have these tags will not be allowed to allocate space from the pool. If the resources have their tags changed after they have allocated space or if the allocation tagging requirements are changed on the pool, the resource may be marked as noncompliant.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Key",
                          "type": "string",
                          "description": "The key of a tag assigned to the resource. Use this filter to find all resources assigned a tag with a specific key, regardless of the tag value.",
                          "nested_items": []
                        },
                        {
                          "name": "Value",
                          "type": "string",
                          "description": "The value of the tag.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "Tags",
                  "type": "list",
                  "description": "The key/value combination of a tag assigned to the resource. Use the tag key in the filter name and the tag value as the filter value. For example, to find all resources that have a tag with the key Owner and the value TeamA, specify tag:Owner for the filter name and TeamA for the filter value.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Key",
                          "type": "string",
                          "description": "The key of the tag.",
                          "nested_items": []
                        },
                        {
                          "name": "Value",
                          "type": "string",
                          "description": "The value of the tag.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "AwsService",
                  "type": "string",
                  "description": "Limits which service in Amazon Web Services that the pool can be used in. 'ec2', for example, allows users to use space for Elastic IP addresses and VPCs.",
                  "nested_items": []
                },
                {
                  "name": "PublicIpSource",
                  "type": "string",
                  "description": "The IP address source for pools in the public scope. Only used for provisioning IP address CIDRs to pools in the public scope. Default is BYOIP. For more information, see Create IPv6 pools in the Amazon VPC IPAM User Guide. By default, you can add only one Amazon-provided IPv6 CIDR block to a top-level IPv6 pool. For information on increasing the default limit, see Quotas for your IPAM in the Amazon VPC IPAM User Guide.",
                  "nested_items": []
                },
                {
                  "name": "SourceResource",
                  "type": "dict",
                  "description": "The resource used to provision CIDRs to a resource planning pool.",
                  "nested_items": [
                    {
                      "name": "ResourceId",
                      "type": "string",
                      "description": "The source resource ID.",
                      "nested_items": []
                    },
                    {
                      "name": "ResourceType",
                      "type": "string",
                      "description": "The source resource type.",
                      "nested_items": []
                    },
                    {
                      "name": "ResourceRegion",
                      "type": "string",
                      "description": "The source resource Region.",
                      "nested_items": []
                    },
                    {
                      "name": "ResourceOwner",
                      "type": "string",
                      "description": "The source resource owner.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}