{
  "method_name": "describe_instance_type_offerings",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/describe_instance_type_offerings.html",
  "description": "Lists the instance types that are offered for the specified location. If no location is specified, the default is to list the instance types that are offered in the current Region.",
  "parameters": [
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "LocationType",
      "type": "string",
      "required": false,
      "description": "The location type. availability-zone - The Availability Zone. When you specify a location filter, it must be an Availability Zone for the current Region. availability-zone-id - The AZ ID. When you specify a location filter, it must be an AZ ID for the current Region. outpost - The Outpost ARN. When you specify a location filter, it must be an Outpost ARN for the current Region. region - The current Region. If you specify a location filter, it must match the current Region.",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": false,
      "description": "One or more filters. Filter names and values are case-sensitive. instance-type - The instance type. For a list of possible values, see Instance. location - The location. For a list of possible identifiers, see Regions and Zones. (dict) --- A filter name and value pair that is used to return a more specific list of results from a describe operation. Filters can be used to match a set of resources by specific criteria, such as tags, attributes, or IDs. If you specify multiple filters, the filters are joined with an AND, and the request returns only results that match all of the specified filters. For more information, see List and filter using the CLI and API in the Amazon EC2 User Guide. Name (string) --- The name of the filter. Filter names are case-sensitive. Values (list) --- The filter values. Filter values are case-sensitive. If you specify multiple values for a filter, the values are joined with an OR, and the request returns all results that match any of the specified values. (string) ---",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "InstanceTypeOfferings",
          "type": "list",
          "description": "The instance types offered in the location.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "InstanceType",
                  "type": "string",
                  "description": "The instance type. For more information, see Instance types in the Amazon EC2 User Guide.",
                  "nested_items": []
                },
                {
                  "name": "LocationType",
                  "type": "string",
                  "description": "The location type.",
                  "nested_items": []
                },
                {
                  "name": "Location",
                  "type": "string",
                  "description": "The identifier for the location. This depends on the location type. For example, if the location type is region, the location is the Region code (for example, us-east-2.)",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The token to include in another request to get the next page of items. This value is null when there are no more items to return.",
          "nested_items": []
        }
      ]
    }
  ]
}