{
  "method_name": "describe_reserved_instances_listings",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/describe_reserved_instances_listings.html",
  "description": "Describes your account's Reserved Instance listings in the Reserved Instance Marketplace. The Reserved Instance Marketplace matches sellers who want to resell Reserved Instance capacity that they no longer need with buyers who want to purchase additional capacity. Reserved Instances bought and sold through the Reserved Instance Marketplace work like any other Reserved Instances. As a seller, you choose to list some or all of your Reserved Instances, and you specify the upfront price to receive for them. Your Reserved Instances are then listed in the Reserved Instance Marketplace and are available for purchase. As a buyer, you specify the configuration of the Reserved Instance to purchase, and the Marketplace matches what you're searching for with what's available. The Marketplace first sells the lowest priced Reserved Instances to you, and continues to sell available Reserved Instance listings to you until your demand is met. You are charged based on the total price of all of the listings that you purchase. For more information, see Sell in the Reserved Instance Marketplace in the Amazon EC2 User Guide.",
  "parameters": [
    {
      "name": "ReservedInstancesId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ReservedInstancesListingId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": false,
      "description": "One or more filters. reserved-instances-id - The ID of the Reserved Instances. reserved-instances-listing-id - The ID of the Reserved Instances listing. status - The status of the Reserved Instance listing ( pending | active | cancelled | closed). status-message - The reason for the status. (dict) --- A filter name and value pair that is used to return a more specific list of results from a describe operation. Filters can be used to match a set of resources by specific criteria, such as tags, attributes, or IDs. If you specify multiple filters, the filters are joined with an AND, and the request returns only results that match all of the specified filters. For more information, see List and filter using the CLI and API in the Amazon EC2 User Guide. Name (string) --- The name of the filter. Filter names are case-sensitive. Values (list) --- The filter values. Filter values are case-sensitive. If you specify multiple values for a filter, the values are joined with an OR, and the request returns all results that match any of the specified values. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ReservedInstancesListings",
          "type": "list",
          "description": "Information about the Reserved Instance listing.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ClientToken",
                  "type": "string",
                  "description": "A unique, case-sensitive key supplied by the client to ensure that the request is idempotent. For more information, see Ensuring Idempotency.",
                  "nested_items": []
                },
                {
                  "name": "CreateDate",
                  "type": "datetime",
                  "description": "The time the listing was created.",
                  "nested_items": []
                },
                {
                  "name": "InstanceCounts",
                  "type": "list",
                  "description": "The number of instances in this state.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "InstanceCount",
                          "type": "integer",
                          "description": "The number of listed Reserved Instances in the state specified by the state.",
                          "nested_items": []
                        },
                        {
                          "name": "State",
                          "type": "string",
                          "description": "The states of the listed Reserved Instances.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "PriceSchedules",
                  "type": "list",
                  "description": "The price of the Reserved Instance listing.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Active",
                          "type": "boolean",
                          "description": "The current price schedule, as determined by the term remaining for the Reserved Instance in the listing.",
                          "nested_items": []
                        },
                        {
                          "name": "CurrencyCode",
                          "type": "string",
                          "description": "The currency for transacting the Reserved Instance resale. At this time, the only supported currency is USD.",
                          "nested_items": []
                        },
                        {
                          "name": "Price",
                          "type": "float",
                          "description": "The fixed price for the term.",
                          "nested_items": []
                        },
                        {
                          "name": "Term",
                          "type": "integer",
                          "description": "The number of months remaining in the reservation. For example, 2 is the second to the last month before the capacity reservation expires.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "ReservedInstancesId",
                  "type": "string",
                  "description": "The ID of the Reserved Instance.",
                  "nested_items": []
                },
                {
                  "name": "ReservedInstancesListingId",
                  "type": "string",
                  "description": "The ID of the Reserved Instance listing.",
                  "nested_items": []
                },
                {
                  "name": "Status",
                  "type": "string",
                  "description": "The status of the Reserved Instance listing.",
                  "nested_items": []
                },
                {
                  "name": "StatusMessage",
                  "type": "string",
                  "description": "The reason for the current status of the Reserved Instance listing. The response can be blank.",
                  "nested_items": []
                },
                {
                  "name": "Tags",
                  "type": "list",
                  "description": "Any tags assigned to the resource.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Key",
                          "type": "string",
                          "description": "The key of the tag.",
                          "nested_items": []
                        },
                        {
                          "name": "Value",
                          "type": "string",
                          "description": "The value of the tag.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "UpdateDate",
                  "type": "datetime",
                  "description": "The last modified timestamp of the listing.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}