{
  "method_name": "describe_instance_image_metadata",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/describe_instance_image_metadata.html",
  "description": "Describes the AMI that was used to launch an instance, even if the AMI is deprecated, deregistered, made private (no longer public or shared with your account), or not allowed. If you specify instance IDs, the output includes information for only the specified instances. If you specify filters, the output includes information for only those instances that meet the filter criteria. If you do not specify instance IDs or filters, the output includes information for all instances, which can affect performance. If you specify an instance ID that is not valid, an instance that doesn't exist, or an instance that you do not own, an error ( InvalidInstanceID.NotFound) is returned. Recently terminated instances might appear in the returned results. This interval is usually less than one hour. In the rare case where an Availability Zone is experiencing a service disruption and you specify instance IDs that are in the affected Availability Zone, or do not specify any instance IDs at all, the call fails. If you specify only instance IDs that are in an unaffected Availability Zone, the call works normally.",
  "parameters": [
    {
      "name": "Filters",
      "type": "list",
      "required": false,
      "description": "The filters. availability-zone - The name of the Availability Zone (for example, us-west-2a) or Local Zone (for example, us-west-2-lax-1b) of the instance. instance-id - The ID of the instance. image-allowed - A Boolean that indicates whether the image meets the criteria specified for Allowed AMIs. instance-state-name - The state of the instance ( pending | running | shutting-down | terminated | stopping | stopped). instance-type - The type of instance (for example, t3.micro). launch-time - The time when the instance was launched, in the ISO 8601 format in the UTC time zone (YYYY-MM-DDThh:mm:ss.sssZ), for example, 2023-09-29T11:04:43.305Z. You can use a wildcard ( *), for example, 2023-09-29T*, which matches an entire day. owner-alias - The owner alias ( amazon | aws-marketplace | aws-backup-vault). The valid aliases are defined in an Amazon-maintained list. This is not the Amazon Web Services account alias that can be set using the IAM console. We recommend that you use the Owner request parameter instead of this filter. owner-id - The Amazon Web Services account ID of the owner. tag:<key> - The key/value combination of a tag assigned to the resource. Use the tag key in the filter name and the tag value as the filter value. For example, to find all resources that have a tag with the key Owner and the value TeamA, specify tag:Owner for the filter name and TeamA for the filter value. tag-key - The key of a tag assigned to the resource. Use this filter to find all resources assigned a tag with a specific key, regardless of the tag value. zone-id - The ID of the Availability Zone (for example, usw2-az2) or Local Zone (for example, usw2-lax1-az1) of the instance. (dict) --- A filter name and value pair that is used to return a more specific list of results from a describe operation. Filters can be used to match a set of resources by specific criteria, such as tags, attributes, or IDs. If you specify multiple filters, the filters are joined with an AND, and the request returns only results that match all of the specified filters. For more information, see List and filter using the CLI and API in the Amazon EC2 User Guide. Name (string) --- The name of the filter. Filter names are case-sensitive. Values (list) --- The filter values. Filter values are case-sensitive. If you specify multiple values for a filter, the values are joined with an OR, and the request returns all results that match any of the specified values. (string) ---",
      "nested_params": []
    },
    {
      "name": "InstanceIds",
      "type": "list",
      "required": false,
      "description": "The instance IDs. If you don't specify an instance ID or filters, the output includes information for all instances. (string) ---",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "The maximum number of items to return for this request. To get the next page of items, make another request with the token returned in the output. For more information, see Pagination. Default: 1000",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "InstanceImageMetadata",
          "type": "list",
          "description": "Information about the instance and the AMI used to launch the instance.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "InstanceId",
                  "type": "string",
                  "description": "The ID of the instance.",
                  "nested_items": []
                },
                {
                  "name": "InstanceType",
                  "type": "string",
                  "description": "The instance type.",
                  "nested_items": []
                },
                {
                  "name": "LaunchTime",
                  "type": "datetime",
                  "description": "The time the instance was launched.",
                  "nested_items": []
                },
                {
                  "name": "AvailabilityZone",
                  "type": "string",
                  "description": "The Availability Zone or Local Zone of the instance.",
                  "nested_items": []
                },
                {
                  "name": "ZoneId",
                  "type": "string",
                  "description": "The ID of the Availability Zone or Local Zone of the instance.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Code",
                      "type": "integer",
                      "description": "The state of the instance as a 16-bit unsigned integer.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "0 : pending.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "16 : running.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "32 : shutting-down.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "48 : terminated.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "64 : stopping.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "80 : stopped.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "Name",
                      "type": "string",
                      "description": "The current state of the instance.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "OwnerId",
                  "type": "string",
                  "description": "The ID of the Amazon Web Services account that owns the instance.",
                  "nested_items": []
                },
                {
                  "name": "Tags",
                  "type": "list",
                  "description": "Any tags assigned to the instance.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Key",
                          "type": "string",
                          "description": "The key of the tag.",
                          "nested_items": []
                        },
                        {
                          "name": "Value",
                          "type": "string",
                          "description": "The value of the tag.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "ImageMetadata",
                  "type": "dict",
                  "description": "Information about the AMI used to launch the instance.",
                  "nested_items": [
                    {
                      "name": "ImageId",
                      "type": "string",
                      "description": "The ID of the AMI.",
                      "nested_items": []
                    },
                    {
                      "name": "Name",
                      "type": "string",
                      "description": "The name of the AMI.",
                      "nested_items": []
                    },
                    {
                      "name": "OwnerId",
                      "type": "string",
                      "description": "The ID of the Amazon Web Services account that owns the AMI.",
                      "nested_items": []
                    },
                    {
                      "name": "State",
                      "type": "string",
                      "description": "The current state of the AMI. If the state is available, the AMI is successfully registered and can be used to launch an instance.",
                      "nested_items": []
                    },
                    {
                      "name": "ImageOwnerAlias",
                      "type": "string",
                      "description": "The alias of the AMI owner.",
                      "nested_items": []
                    },
                    {
                      "name": "CreationDate",
                      "type": "string",
                      "description": "The date and time the AMI was created.",
                      "nested_items": []
                    },
                    {
                      "name": "DeprecationTime",
                      "type": "string",
                      "description": "The deprecation date and time of the AMI, in UTC, in the following format: YYYY-MM-DD*T*HH:MM:*SS*Z.",
                      "nested_items": []
                    },
                    {
                      "name": "ImageAllowed",
                      "type": "boolean",
                      "description": "If true, the AMI satisfies the criteria for Allowed AMIs and can be discovered and used in the account. If false, the AMI can't be discovered or used in the account.",
                      "nested_items": []
                    },
                    {
                      "name": "IsPublic",
                      "type": "boolean",
                      "description": "Indicates whether the AMI has public launch permissions. A value of true means this AMI has public launch permissions, while false means it has only implicit (AMI owner) or explicit (shared with your account) launch permissions.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Managed",
                      "type": "boolean",
                      "description": "If true, the resource is managed by a service provider.",
                      "nested_items": []
                    },
                    {
                      "name": "Principal",
                      "type": "string",
                      "description": "If managed is true, then the principal is returned. The principal is the service provider that manages the resource.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The token to include in another request to get the next page of items. This value is null when there are no more items to return.",
          "nested_items": []
        }
      ]
    }
  ]
}