{
  "method_name": "enable_fast_launch",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/enable_fast_launch.html",
  "description": "When you enable Windows fast launch for a Windows AMI, images are pre-provisioned, using snapshots to launch instances up to 65% faster. To create the optimized Windows image, Amazon EC2 launches an instance and runs through Sysprep steps, rebooting as required. Then it creates a set of reserved snapshots that are used for subsequent launches. The reserved snapshots are automatically replenished as they are used, depending on your settings for launch frequency.",
  "parameters": [
    {
      "name": "ImageId",
      "type": "string",
      "required": true,
      "description": "Specify the ID of the image for which to enable Windows fast launch.",
      "nested_params": []
    },
    {
      "name": "ResourceType",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "SnapshotConfiguration",
      "type": "dict",
      "required": false,
      "description": "Configuration settings for creating and managing the snapshots that are used for pre-provisioning the AMI for Windows fast launch. The associated ResourceType must be snapshot. TargetResourceCount (integer) --- The number of pre-provisioned snapshots to keep on hand for a Windows fast launch enabled AMI.",
      "nested_params": [
        {
          "name": "TargetResourceCount",
          "type": "integer",
          "required": false,
          "description": "The number of pre-provisioned snapshots to keep on hand for a Windows fast launch enabled AMI.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "LaunchTemplate",
      "type": "dict",
      "required": true,
      "description": "The launch template to use when launching Windows instances from pre-provisioned snapshots. Launch template parameters can include either the name or ID of the launch template, but not both. LaunchTemplateId (string) --- Specify the ID of the launch template that the AMI should use for Windows fast launch. LaunchTemplateName (string) --- Specify the name of the launch template that the AMI should use for Windows fast launch. Specify the version of the launch template that the AMI should use for Windows fast launch.",
      "nested_params": [
        {
          "name": "LaunchTemplateId",
          "type": "string",
          "required": false,
          "description": "Specify the ID of the launch template that the AMI should use for Windows fast launch.",
          "nested_params": []
        },
        {
          "name": "LaunchTemplateName",
          "type": "string",
          "required": false,
          "description": "Specify the name of the launch template that the AMI should use for Windows fast launch.",
          "nested_params": []
        },
        {
          "name": "Version",
          "type": "string",
          "required": false,
          "description": "Specify the version of the launch template that the AMI should use for Windows fast launch.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "MaxParallelLaunches",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ImageId",
          "type": "string",
          "description": "The image ID that identifies the AMI for which Windows fast launch was enabled.",
          "nested_items": []
        },
        {
          "name": "ResourceType",
          "type": "string",
          "description": "The type of resource that was defined for pre-provisioning the AMI for Windows fast launch.",
          "nested_items": []
        },
        {
          "name": "SnapshotConfiguration",
          "type": "dict",
          "description": "Settings to create and manage the pre-provisioned snapshots that Amazon EC2 uses for faster launches from the Windows AMI. This property is returned when the associated resourceType is snapshot.",
          "nested_items": [
            {
              "name": "TargetResourceCount",
              "type": "integer",
              "description": "The number of pre-provisioned snapshots requested to keep on hand for a Windows fast launch enabled AMI.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "LaunchTemplate",
          "type": "dict",
          "description": "The launch template that is used when launching Windows instances from pre-provisioned snapshots.",
          "nested_items": [
            {
              "name": "LaunchTemplateId",
              "type": "string",
              "description": "The ID of the launch template that the AMI uses for Windows fast launch.",
              "nested_items": []
            },
            {
              "name": "LaunchTemplateName",
              "type": "string",
              "description": "The name of the launch template that the AMI uses for Windows fast launch.",
              "nested_items": []
            },
            {
              "name": "Version",
              "type": "string",
              "description": "The version of the launch template that the AMI uses for Windows fast launch.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "MaxParallelLaunches",
          "type": "integer",
          "description": "The maximum number of instances that Amazon EC2 can launch at the same time to create pre-provisioned snapshots for Windows fast launch.",
          "nested_items": []
        },
        {
          "name": "OwnerId",
          "type": "string",
          "description": "The owner ID for the AMI for which Windows fast launch was enabled.",
          "nested_items": []
        },
        {
          "name": "State",
          "type": "string",
          "description": "The current state of Windows fast launch for the specified AMI.",
          "nested_items": []
        },
        {
          "name": "StateTransitionReason",
          "type": "string",
          "description": "The reason that the state changed for Windows fast launch for the AMI.",
          "nested_items": []
        },
        {
          "name": "StateTransitionTime",
          "type": "datetime",
          "description": "The time that the state changed for Windows fast launch for the AMI.",
          "nested_items": []
        }
      ]
    }
  ]
}