{
  "method_name": "modify_network_interface_attribute",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/modify_network_interface_attribute.html",
  "description": "Modifies the specified network interface attribute. You can specify only one attribute at a time. You can use this action to attach and detach security groups from an existing EC2 instance.",
  "parameters": [
    {
      "name": "EnaSrdSpecification",
      "type": "dict",
      "required": false,
      "description": "Updates the ENA Express configuration for the network interface that's attached to the instance. EnaSrdEnabled (boolean) --- Indicates whether ENA Express is enabled for the network interface. EnaSrdUdpSpecification (dict) --- Configures ENA Express for UDP network traffic. EnaSrdUdpEnabled (boolean) --- Indicates whether UDP traffic to and from the instance uses ENA Express. To specify this setting, you must first enable ENA Express.",
      "nested_params": [
        {
          "name": "EnaSrdEnabled",
          "type": "boolean",
          "required": false,
          "description": "Indicates whether ENA Express is enabled for the network interface.",
          "nested_params": []
        },
        {
          "name": "EnaSrdUdpSpecification",
          "type": "dict",
          "required": false,
          "description": "Configures ENA Express for UDP network traffic.",
          "nested_params": [
            {
              "name": "EnaSrdUdpEnabled",
              "type": "boolean",
              "required": false,
              "description": "Indicates whether UDP traffic to and from the instance uses ENA Express. To specify this setting, you must first enable ENA Express.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "EnablePrimaryIpv6",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ConnectionTrackingSpecification",
      "type": "dict",
      "required": false,
      "description": "A connection tracking specification. TcpEstablishedTimeout (integer) --- Timeout (in seconds) for idle TCP connections in an established state. Min: 60 seconds. Max: 432000 seconds (5 days). Default: 432000 seconds. Recommended: Less than 432000 seconds. UdpStreamTimeout (integer) --- Timeout (in seconds) for idle UDP flows classified as streams which have seen more than one request-response transaction. Max: 180 seconds (3 minutes). Default: 180 seconds. UdpTimeout (integer) --- Timeout (in seconds) for idle UDP flows that have seen traffic only in a single direction or a single request-response transaction. Min: 30 seconds. Max: 60 seconds. Default: 30 seconds.",
      "nested_params": [
        {
          "name": "TcpEstablishedTimeout",
          "type": "integer",
          "required": false,
          "description": "for idle TCP connections in an established state. Min: 60 seconds. Max: 432000 seconds (5 days). Default: 432000 seconds. Recommended: Less than 432000 seconds.",
          "nested_params": []
        },
        {
          "name": "UdpStreamTimeout",
          "type": "integer",
          "required": false,
          "description": "for idle UDP flows classified as streams which have seen more than one request-response transaction. Min: 60 seconds. Max: 180 seconds (3 minutes). Default: 180 seconds.",
          "nested_params": []
        },
        {
          "name": "UdpTimeout",
          "type": "integer",
          "required": false,
          "description": "for idle UDP flows that have seen traffic only in a single direction or a single request-response transaction. Min: 30 seconds. Max: 60 seconds. Default: 30 seconds.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "AssociatePublicIpAddress",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NetworkInterfaceId",
      "type": "string",
      "required": true,
      "description": "The ID of the network interface.",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "dict",
      "required": false,
      "description": "A description for the network interface. Value (string) --- The attribute value. The value is case-sensitive.",
      "nested_params": [
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The attribute value. The value is case-sensitive.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "SourceDestCheck",
      "type": "dict",
      "required": false,
      "description": "Enable or disable source/destination checks, which ensure that the instance is either the source or the destination of any traffic that it receives. If the value is true, source/destination checks are enabled; otherwise, they are disabled. The default value is true. You must disable source/destination checks if the instance runs services such as network address translation, routing, or firewalls. Value (boolean) --- The attribute value. The valid values are true or false.",
      "nested_params": [
        {
          "name": "Value",
          "type": "boolean",
          "required": false,
          "description": "The attribute value. The valid values are true or false.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Groups",
      "type": "list",
      "required": false,
      "description": "Changes the security groups for the network interface. The new set of groups you specify replaces the current set. You must specify at least one group, even if it's just the default security group in the VPC. You must specify the ID of the security group, not the name. (string) ---",
      "nested_params": []
    },
    {
      "name": "Attachment",
      "type": "dict",
      "required": false,
      "description": "Information about the interface attachment. If modifying the delete on termination attribute, you must specify the ID of the interface attachment. AttachmentId (string) --- The ID of the network interface attachment. DeleteOnTermination (boolean) --- Indicates whether the network interface is deleted when the instance is terminated.",
      "nested_params": [
        {
          "name": "AttachmentId",
          "type": "string",
          "required": false,
          "description": "The ID of the network interface attachment.",
          "nested_params": []
        },
        {
          "name": "DeleteOnTermination",
          "type": "boolean",
          "required": false,
          "description": "Indicates whether the network interface is deleted when the instance is terminated.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}