{
  "method_name": "update_application_maintenance_configuration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kinesisanalyticsv2/client/update_application_maintenance_configuration.html",
  "description": "Updates the maintenance configuration of the Managed Service for Apache Flink application. You can invoke this operation on an application that is in one of the two following states: READY or RUNNING. If you invoke it when the application is in a state other than these two states, it throws a ResourceInUseException. The service makes use of the updated configuration the next time it schedules maintenance for the application. If you invoke this operation after the service schedules maintenance, the service will apply the configuration update the next time it schedules maintenance for the application. This means that you might not see the maintenance configuration update applied to the maintenance process that follows a successful invocation of this operation, but to the following maintenance process instead. To see the current maintenance configuration of your application, invoke the  DescribeApplication operation. For information about application maintenance, see Managed Service for Apache Flink for Apache Flink Maintenance.",
  "parameters": [
    {
      "name": "ApplicationName",
      "type": "string",
      "required": true,
      "description": "The name of the application for which you want to update the maintenance configuration.",
      "nested_params": []
    },
    {
      "name": "ApplicationMaintenanceConfigurationUpdate",
      "type": "dict",
      "required": true,
      "description": "Describes the application maintenance configuration update. The updated start time for the maintenance window.",
      "nested_params": [
        {
          "name": "ApplicationMaintenanceWindowStartTimeUpdate",
          "type": "string",
          "required": false,
          "description": "The updated start time for the maintenance window.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ApplicationARN",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the application.",
          "nested_items": []
        },
        {
          "name": "ApplicationMaintenanceConfigurationDescription",
          "type": "dict",
          "description": "The application maintenance configuration description after the update.",
          "nested_items": [
            {
              "name": "ApplicationMaintenanceWindowStartTime",
              "type": "string",
              "description": "The start time for the maintenance window.",
              "nested_items": []
            },
            {
              "name": "ApplicationMaintenanceWindowEndTime",
              "type": "string",
              "description": "The end time for the maintenance window.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}