{
  "method_name": "get_contact_information",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/account/client/get_contact_information.html",
  "description": "Retrieves the primary contact information of an Amazon Web Services account. For complete details about how to use the primary contact operations, see Update the primary and alternate contact information.",
  "parameters": [
    {
      "name": "AccountId",
      "type": "string",
      "required": false,
      "description": "Specifies the 12-digit account ID number of the Amazon Web Services account that you want to access or modify with this operation. If you don't specify this parameter, it defaults to the Amazon Web Services account of the identity used to call the operation. To use this parameter, the caller must be an identity in the organization's management account or a delegated administrator account. The specified account ID must be a member account in the same organization. The organization must have all features enabled, and the organization must have trusted access enabled for the Account Management service, and optionally a delegated admin account assigned. To call this operation on an account that is not a member of an organization, don't specify this parameter. Instead, call the operation using an identity belonging to the account whose contacts you wish to retrieve or modify.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ContactInformation",
          "type": "dict",
          "description": "Contains the details of the primary contact information associated with an Amazon Web Services account.",
          "nested_items": [
            {
              "name": "AddressLine1",
              "type": "string",
              "description": "The first line of the primary contact address.",
              "nested_items": []
            },
            {
              "name": "AddressLine2",
              "type": "string",
              "description": "The second line of the primary contact address, if any.",
              "nested_items": []
            },
            {
              "name": "AddressLine3",
              "type": "string",
              "description": "The third line of the primary contact address, if any.",
              "nested_items": []
            },
            {
              "name": "City",
              "type": "string",
              "description": "The city of the primary contact address.",
              "nested_items": []
            },
            {
              "name": "CompanyName",
              "type": "string",
              "description": "The name of the company associated with the primary contact information, if any.",
              "nested_items": []
            },
            {
              "name": "CountryCode",
              "type": "string",
              "description": "The ISO-3166 two-letter country code for the primary contact address.",
              "nested_items": []
            },
            {
              "name": "DistrictOrCounty",
              "type": "string",
              "description": "The district or county of the primary contact address, if any.",
              "nested_items": []
            },
            {
              "name": "FullName",
              "type": "string",
              "description": "The full name of the primary contact address.",
              "nested_items": []
            },
            {
              "name": "PhoneNumber",
              "type": "string",
              "description": "The phone number of the primary contact information. The number will be validated and, in some countries, checked for activation.",
              "nested_items": []
            },
            {
              "name": "PostalCode",
              "type": "string",
              "description": "The postal code of the primary contact address.",
              "nested_items": []
            },
            {
              "name": "StateOrRegion",
              "type": "string",
              "description": "The state or region of the primary contact address. If the mailing address is within the United States (US), the value in this field can be either a two character state code (for example, NJ) or the full state name (for example, New Jersey). This field is required in the following countries: US, CA, GB, DE, JP, IN, and BR.",
              "nested_items": []
            },
            {
              "name": "WebsiteUrl",
              "type": "string",
              "description": "The URL of the website associated with the primary contact information, if any.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}