{
  "method_name": "list_resource_scan_related_resources",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/cloudformation/client/list_resource_scan_related_resources.html",
  "description": "Lists the related resources for a list of resources from a resource scan. The response indicates whether each returned resource is already managed by CloudFormation.",
  "parameters": [
    {
      "name": "ResourceScanId",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the resource scan.",
      "nested_params": []
    },
    {
      "name": "Resources",
      "type": "list",
      "required": true,
      "description": "The list of resources for which you want to get the related resources. Up to 100 resources can be provided. (dict) --- Identifies a scanned resource. This is used with the ListResourceScanRelatedResources API action. The type of the resource, such as AWS::DynamoDB::Table. For the list of supported resources, see Resource type support for imports and drift detection In the CloudFormation User Guide. A list of up to 256 key-value pairs that identifies the scanned resource. The key is the name of one of the primary identifiers for the resource. (Primary identifiers are specified in the primaryIdentifier list in the resource schema.) The value is the value of that primary identifier. For example, for a AWS::DynamoDB::Table resource, the primary identifiers is TableName so the key-value pair could be \"TableName\": \"MyDDBTable\". For more information, see primaryIdentifier in the CloudFormation Command Line Interface (CLI) User Guide. (string) --- (string) ---",
      "nested_params": [
        {
          "name": "ResourceType",
          "type": "string",
          "required": false,
          "description": "The type of the resource, such as AWS::DynamoDB::Table. For the list of supported resources, see Resource type support for imports and drift detection In the CloudFormation User Guide.",
          "nested_params": []
        },
        {
          "name": "ResourceIdentifier",
          "type": "dict",
          "required": false,
          "description": "A list of up to 256 key-value pairs that identifies the scanned resource. The key is the name of one of the primary identifiers for the resource. (Primary identifiers are specified in the primaryIdentifier list in the resource schema.) The value is the value of that primary identifier. For example, for a AWS::DynamoDB::Table resource, the primary identifiers is TableName so the key-value pair could be \"TableName\": \"MyDDBTable\". For more information, see primaryIdentifier in the CloudFormation Command Line Interface (CLI) User Guide.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "RelatedResources",
          "type": "list",
          "description": "List of up to MaxResults resources in the specified resource scan related to the specified resources.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ResourceType",
                  "type": "string",
                  "description": "The type of the resource, such as AWS::DynamoDB::Table. For the list of supported resources, see Resource type support for imports and drift detection In the CloudFormation User Guide.",
                  "nested_items": []
                },
                {
                  "name": "ResourceIdentifier",
                  "type": "dict",
                  "description": "A list of up to 256 key-value pairs that identifies for the scanned resource. The key is the name of one of the primary identifiers for the resource. (Primary identifiers are specified in the primaryIdentifier list in the resource schema.) The value is the value of that primary identifier. For example, for a AWS::DynamoDB::Table resource, the primary identifiers is TableName so the key-value pair could be \"TableName\": \"MyDDBTable\". For more information, see primaryIdentifier in the CloudFormation Command Line Interface (CLI) User Guide.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "ManagedByStack",
                  "type": "boolean",
                  "description": "If true, the resource is managed by a CloudFormation stack.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "If the request doesn't return all the remaining results, NextToken is set to a token. To retrieve the next set of results, call ListResourceScanRelatedResources again and use that value for the NextToken parameter. If the request returns all results, NextToken is set to an empty string.",
          "nested_items": []
        }
      ]
    }
  ]
}