{
  "method_name": "get_data_source",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/machinelearning/client/get_data_source.html",
  "description": "Returns a DataSource that includes metadata and data file information, as well as the current status of the DataSource. GetDataSource provides results in normal or verbose format. The verbose format adds the schema description and the list of files pointed to by the DataSource to the normal format.",
  "parameters": [
    {
      "name": "DataSourceId",
      "type": "string",
      "required": true,
      "description": "The ID assigned to the DataSource at creation.",
      "nested_params": []
    },
    {
      "name": "Verbose",
      "type": "boolean",
      "required": false,
      "description": "Specifies whether the GetDataSource operation should return DataSourceSchema. If true, DataSourceSchema is returned. If false, DataSourceSchema is not returned.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "DataSourceId",
          "type": "string",
          "description": "The ID assigned to the DataSource at creation. This value should be identical to the value of the DataSourceId in the request.",
          "nested_items": []
        },
        {
          "name": "DataLocationS3",
          "type": "string",
          "description": "The location of the data file or directory in Amazon Simple Storage Service (Amazon S3).",
          "nested_items": []
        },
        {
          "name": "DataRearrangement",
          "type": "string",
          "description": "A JSON string that represents the splitting and rearrangement requirement used when this DataSource was created.",
          "nested_items": []
        },
        {
          "name": "CreatedByIamUser",
          "type": "string",
          "description": "The AWS user account from which the DataSource was created. The account type can be either an AWS root account or an AWS Identity and Access Management (IAM) user account.",
          "nested_items": []
        },
        {
          "name": "CreatedAt",
          "type": "datetime",
          "description": "The time that the DataSource was created. The time is expressed in epoch time.",
          "nested_items": []
        },
        {
          "name": "LastUpdatedAt",
          "type": "datetime",
          "description": "The time of the most recent edit to the DataSource. The time is expressed in epoch time.",
          "nested_items": []
        },
        {
          "name": "DataSizeInBytes",
          "type": "integer",
          "description": "The total size of observations in the data files.",
          "nested_items": []
        },
        {
          "name": "NumberOfFiles",
          "type": "integer",
          "description": "The number of data files referenced by the DataSource.",
          "nested_items": []
        },
        {
          "name": "Name",
          "type": "string",
          "description": "A user-supplied name or description of the DataSource.",
          "nested_items": []
        },
        {
          "name": "Status",
          "type": "string",
          "description": "The current status of the DataSource. This element can have one of the following values:",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "PENDING - Amazon ML submitted a request to create a DataSource.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "INPROGRESS - The creation process is underway.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "FAILED - The request to create a DataSource did not run to completion. It is not usable.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "COMPLETED - The creation process completed successfully.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "DELETED - The DataSource is marked as deleted. It is not usable.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "LogUri",
          "type": "string",
          "description": "A link to the file containing logs of CreateDataSourceFrom* operations.",
          "nested_items": []
        },
        {
          "name": "Message",
          "type": "string",
          "description": "The user-supplied description of the most recent details about creating the DataSource.",
          "nested_items": []
        },
        {
          "name": "RedshiftMetadata",
          "type": "dict",
          "description": "Describes the DataSource details specific to Amazon Redshift.",
          "nested_items": [
            {
              "name": "RedshiftDatabase",
              "type": "dict",
              "description": "Describes the database details required to connect to an Amazon Redshift database.",
              "nested_items": [
                {
                  "name": "DatabaseName",
                  "type": "string",
                  "description": "The name of a database hosted on an Amazon Redshift cluster.",
                  "nested_items": []
                },
                {
                  "name": "ClusterIdentifier",
                  "type": "string",
                  "description": "The ID of an Amazon Redshift cluster.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "DatabaseUserName",
              "type": "string",
              "description": "A username to be used by Amazon Machine Learning (Amazon ML)to connect to a database on an Amazon Redshift cluster. The username should have sufficient permissions to execute the RedshiftSelectSqlQuery query. The username should be valid for an Amazon Redshift USER.",
              "nested_items": []
            },
            {
              "name": "SelectSqlQuery",
              "type": "string",
              "description": "The SQL query that is specified during  CreateDataSourceFromRedshift. Returns only if Verbose is true in GetDataSourceInput.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "RDSMetadata",
          "type": "dict",
          "description": "The datasource details that are specific to Amazon RDS.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "InstanceIdentifier",
                  "type": "string",
                  "description": "The ID of an RDS DB instance.",
                  "nested_items": []
                },
                {
                  "name": "DatabaseName",
                  "type": "string",
                  "description": "The name of a database hosted on an RDS DB instance.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "DatabaseUserName",
              "type": "string",
              "description": "The username to be used by Amazon ML to connect to database on an Amazon RDS instance. The username should have sufficient permissions to execute an RDSSelectSqlQuery query.",
              "nested_items": []
            },
            {
              "name": "SelectSqlQuery",
              "type": "string",
              "description": "The SQL query that is supplied during  CreateDataSourceFromRDS. Returns only if Verbose is true in GetDataSourceInput.",
              "nested_items": []
            },
            {
              "name": "ResourceRole",
              "type": "string",
              "description": "The role (DataPipelineDefaultResourceRole) assumed by an Amazon EC2 instance to carry out the copy task from Amazon RDS to Amazon S3. For more information, see Role templates for data pipelines.",
              "nested_items": []
            },
            {
              "name": "ServiceRole",
              "type": "string",
              "description": "The role (DataPipelineDefaultRole) assumed by the Data Pipeline service to monitor the progress of the copy task from Amazon RDS to Amazon S3. For more information, see Role templates for data pipelines.",
              "nested_items": []
            },
            {
              "name": "DataPipelineId",
              "type": "string",
              "description": "The ID of the Data Pipeline instance that is used to carry to copy data from Amazon RDS to Amazon S3. You can use the ID to find details about the instance in the Data Pipeline console.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "RoleARN",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of an AWS IAM Role, such as the following: arn:aws:iam::account:role/rolename.",
          "nested_items": []
        },
        {
          "name": "ComputeStatistics",
          "type": "boolean",
          "description": "The parameter is true if statistics need to be generated from the observation data.",
          "nested_items": []
        },
        {
          "name": "ComputeTime",
          "type": "integer",
          "description": "The approximate CPU time in milliseconds that Amazon Machine Learning spent processing the DataSource, normalized and scaled on computation resources. ComputeTime is only available if the DataSource is in the COMPLETED state and the ComputeStatistics is set to true.",
          "nested_items": []
        },
        {
          "name": "FinishedAt",
          "type": "datetime",
          "description": "The epoch time when Amazon Machine Learning marked the DataSource as COMPLETED or FAILED. FinishedAt is only available when the DataSource is in the COMPLETED or FAILED state.",
          "nested_items": []
        },
        {
          "name": "StartedAt",
          "type": "datetime",
          "description": "The epoch time when Amazon Machine Learning marked the DataSource as INPROGRESS. StartedAt isn't available if the DataSource is in the PENDING state.",
          "nested_items": []
        },
        {
          "name": "DataSourceSchema",
          "type": "string",
          "description": "The schema used by all of the data files of this DataSource.",
          "nested_items": []
        }
      ]
    }
  ]
}