{
  "method_name": "create_keyspace",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/keyspaces/client/create_keyspace.html",
  "description": "The CreateKeyspace operation adds a new keyspace to your account. In an Amazon Web Services account, keyspace names must be unique within each Region. CreateKeyspace is an asynchronous operation. You can monitor the creation status of the new keyspace by using the GetKeyspace operation. For more information, see Create a keyspace in the Amazon Keyspaces Developer Guide.",
  "parameters": [
    {
      "name": "keyspaceName",
      "type": "string",
      "required": true,
      "description": "The name of the keyspace to be created.",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "list",
      "required": true,
      "description": "A list of key-value pair tags to be attached to the keyspace. For more information, see Adding tags and labels to Amazon Keyspaces resources in the Amazon Keyspaces Developer Guide. (dict) --- Describes a tag. A tag is a key-value pair. You can add up to 50 tags to a single Amazon Keyspaces resource. Amazon Web Services-assigned tag names and values are automatically assigned the aws: prefix, which the user cannot assign. Amazon Web Services-assigned tag names do not count towards the tag limit of 50. User-assigned tag names have the prefix user: in the Cost Allocation Report. You cannot backdate the application of a tag. The key of the tag. Tag keys are case sensitive. Each Amazon Keyspaces resource can only have up to one tag with the same key. If you try to add an existing tag (same key), the existing tag value will be updated to the new value. The value of the tag. Tag values are case-sensitive and can be null.",
      "nested_params": [
        {
          "name": "key",
          "type": "string",
          "required": false,
          "description": "The key of the tag. Tag keys are case sensitive. Each Amazon Keyspaces resource can only have up to one tag with the same key. If you try to add an existing tag (same key), the existing tag value will be updated to the new value.",
          "nested_params": []
        },
        {
          "name": "value",
          "type": "string",
          "required": false,
          "description": "The value of the tag. Tag values are case-sensitive and can be null.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "replicationSpecification",
      "type": "dict",
      "required": true,
      "description": "The replication specification of the keyspace includes: replicationStrategy - the required value is SINGLE_REGION or MULTI_REGION. regionList - if the replicationStrategy is MULTI_REGION, the regionList requires the current Region and at least one additional Amazon Web Services Region where the keyspace is going to be replicated in. The replicationStrategy of a keyspace, the required value is SINGLE_REGION or MULTI_REGION. regionList (list) --- The regionList contains the Amazon Web Services Regions where the keyspace is replicated in. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "resourceArn",
          "type": "string",
          "description": "The unique identifier of the keyspace in the format of an Amazon Resource Name (ARN).",
          "nested_items": []
        }
      ]
    }
  ]
}