{
  "method_name": "update_keyspace",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/keyspaces/client/update_keyspace.html",
  "description": "Adds a new Amazon Web Services Region to the keyspace. You can add a new Region to a keyspace that is either a single or a multi-Region keyspace. Amazon Keyspaces is going to replicate all tables in the keyspace to the new Region. To successfully replicate all tables to the new Region, they must use client-side timestamps for conflict resolution. To enable client-side timestamps, specify clientSideTimestamps.status = enabled when invoking the API. For more information about client-side timestamps, see Client-side timestamps in Amazon Keyspaces in the Amazon Keyspaces Developer Guide. To add a Region to a keyspace using the UpdateKeyspace API, the IAM principal needs permissions for the following IAM actions: If the keyspace contains a table that is configured in provisioned mode with auto scaling enabled, the following additional IAM actions need to be allowed. To use the UpdateKeyspace API, the IAM principal also needs permissions to create a service-linked role with the following elements: For more information, see Configure the IAM permissions required to add an Amazon Web Services Region to a keyspace in the Amazon Keyspaces Developer Guide.",
  "parameters": [
    {
      "name": "keyspaceName",
      "type": "string",
      "required": true,
      "description": "The name of the keyspace.",
      "nested_params": []
    },
    {
      "name": "replicationSpecification",
      "type": "dict",
      "required": true,
      "description": "The replication specification of the keyspace includes: regionList - the Amazon Web Services Regions where the keyspace is replicated in. replicationStrategy - the required value is SINGLE_REGION or MULTI_REGION. The replicationStrategy of a keyspace, the required value is SINGLE_REGION or MULTI_REGION. regionList (list) --- The regionList contains the Amazon Web Services Regions where the keyspace is replicated in. (string) ---",
      "nested_params": []
    },
    {
      "name": "clientSideTimestamps",
      "type": "dict",
      "required": true,
      "description": "The client-side timestamp setting of the table. For more information, see How it works: Amazon Keyspaces client-side timestamps in the Amazon Keyspaces Developer Guide. Shows how to enable client-side timestamps settings for the specified table.",
      "nested_params": [
        {
          "name": "status",
          "type": "string",
          "required": false,
          "description": "Shows how to enable client-side timestamps settings for the specified table.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "resourceArn",
          "type": "string",
          "description": "The unique identifier of the keyspace in the format of an Amazon Resource Name (ARN).",
          "nested_items": []
        }
      ]
    }
  ]
}