{
  "method_name": "list_services",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/service-quotas/client/list_services.html",
  "description": "Lists the names and codes for the Amazon Web Services services integrated with Service Quotas.",
  "parameters": [
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "Specifies the maximum number of results that you want included on each page of the response. If you do not include this parameter, it defaults to a value appropriate to the operation. If additional items exist beyond those included in the current response, the NextToken response element is present and has a value (is not null). Include that value as the NextToken request parameter in the next call to the operation to get the next part of the results.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "NextToken",
          "type": "string",
          "description": "If present, indicates that more output is available than is included in the current response. Use this value in the NextToken request parameter in a subsequent call to the operation to get the next part of the output. You should repeat this until the NextToken response element comes back as null.",
          "nested_items": []
        },
        {
          "name": "Services",
          "type": "list",
          "description": "The list of the Amazon Web Services service names and service codes.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ServiceCode",
                  "type": "string",
                  "description": "Specifies the service identifier. To find the service code value for an Amazon Web Services service, use the  ListServices operation.",
                  "nested_items": []
                },
                {
                  "name": "ServiceName",
                  "type": "string",
                  "description": "Specifies the service name.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}