{
  "method_name": "create_partner_event_source",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/events/client/create_partner_event_source.html",
  "description": "Called by an SaaS partner to create a partner event source. This operation is not used by Amazon Web Services customers. Each partner event source can be used by one Amazon Web Services account to create a matching partner event bus in that Amazon Web Services account. A SaaS partner must create one partner event source for each Amazon Web Services account that wants to receive those event types. A partner event source creates events based on resources within the SaaS partner's service or application. An Amazon Web Services account that creates a partner event bus that matches the partner event source can use that event bus to receive events from the partner, and then process them using Amazon Web Services Events rules and targets. Partner event source names follow this format: partner_name/event_namespace/event_name. The combination of event_namespace and event_name should help Amazon Web Services customers decide whether to create an event bus to receive these events.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "The name of the partner event source. This name must be unique and must be in the format ``partner_name/event_namespace/event_name ``. The Amazon Web Services account that wants to use this partner event source must create a partner event bus with a name that matches the name of the partner event source.",
      "nested_params": []
    },
    {
      "name": "Account",
      "type": "string",
      "required": true,
      "description": "The Amazon Web Services account ID that is permitted to create a matching partner event bus for this partner event source.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "EventSourceArn",
          "type": "string",
          "description": "The ARN of the partner event source.",
          "nested_items": []
        }
      ]
    }
  ]
}