{
  "method_name": "list_rules",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/events/client/list_rules.html",
  "description": "Lists your Amazon EventBridge rules. You can either list all the rules or you can provide a prefix to match to the rule names. The maximum number of results per page for requests is 100. ListRules does not list the targets of a rule. To see the targets associated with a rule, use ListTargetsByRule.",
  "parameters": [
    {
      "name": "NamePrefix",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "EventBusName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "The token returned by a previous call, which you can use to retrieve the next set of results. The value of nextToken is a unique pagination token for each page. To retrieve the next page of results, make the call again using the returned token. Keep all other arguments unchanged. Using an expired pagination token results in an HTTP 400 InvalidToken error.",
      "nested_params": []
    },
    {
      "name": "Limit",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Rules",
          "type": "list",
          "description": "The rules that match the specified criteria.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The name of the rule.",
                  "nested_items": []
                },
                {
                  "name": "Arn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the rule.",
                  "nested_items": []
                },
                {
                  "name": "EventPattern",
                  "type": "string",
                  "description": "The event pattern of the rule. For more information, see Events and Event Patterns in the Amazon EventBridge User Guide .",
                  "nested_items": []
                },
                {
                  "name": "State",
                  "type": "string",
                  "description": "The state of the rule.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "DISABLED: The rule is disabled. EventBridge does not match any events against the rule.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "ENABLED: The rule is enabled. EventBridge matches events against the rule, except for Amazon Web Services management events delivered through CloudTrail.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "ENABLED_WITH_ALL_CLOUDTRAIL_MANAGEMENT_EVENTS: The rule is enabled for all events, including Amazon Web Services management events delivered through CloudTrail. Management events provide visibility into management operations that are performed on resources in your Amazon Web Services account. These are also known as control plane operations. For more information, see Logging management events in the CloudTrail User Guide, and Filtering management events from Amazon Web Services services in the Amazon EventBridge User Guide . This value is only valid for rules on the default event bus or custom event buses. It does not apply to partner event buses.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Description",
                  "type": "string",
                  "description": "The description of the rule.",
                  "nested_items": []
                },
                {
                  "name": "ScheduleExpression",
                  "type": "string",
                  "description": "The scheduling expression. For example, 'cron(0 20 * * ? *)', 'rate(5 minutes)'. For more information, see Creating an Amazon EventBridge rule that runs on a schedule.",
                  "nested_items": []
                },
                {
                  "name": "RoleArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the role that is used for target invocation.",
                  "nested_items": []
                },
                {
                  "name": "ManagedBy",
                  "type": "string",
                  "description": "If the rule was created on behalf of your account by an Amazon Web Services service, this field displays the principal name of the service that created the rule.",
                  "nested_items": []
                },
                {
                  "name": "EventBusName",
                  "type": "string",
                  "description": "The name or ARN of the event bus associated with the rule. If you omit this, the default event bus is used.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "A token indicating there are more results available. If there are no more results, no token is included in the response.",
          "nested_items": []
        }
      ]
    }
  ]
}