{
  "method_name": "put_events",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/events/client/put_events.html",
  "description": "Sends custom events to Amazon EventBridge so that they can be matched to rules. You can batch multiple event entries into one request for efficiency. However, the total entry size must be less than 256KB. You can calculate the entry size before you send the events. For more information, see Calculating PutEvents event entry size in the Amazon EventBridge User Guide . PutEvents accepts the data in JSON format. For the JSON number (integer) data type, the constraints are: a minimum value of -9,223,372,036,854,775,808 and a maximum value of 9,223,372,036,854,775,807.",
  "parameters": [
    {
      "name": "Entries",
      "type": "list",
      "required": true,
      "description": "The entry that defines an event in your system. You can specify several parameters for the entry such as the source and type of the event, resources associated with the event, and so on. (dict) --- Represents an event to be submitted. Time (datetime) --- The time stamp of the event, per RFC3339. If no time stamp is provided, the time stamp of the PutEvents call is used. Source (string) --- The source of the event. Resources (list) --- Amazon Web Services resources, identified by Amazon Resource Name (ARN), which the event primarily concerns. Any number, including zero, may be present. (string) --- DetailType (string) --- Free-form string, with a maximum of 128 characters, used to decide what fields to expect in the event detail. Detail (string) --- A valid JSON object. There is no other schema imposed. The JSON object may contain fields and nested sub-objects. EventBusName (string) --- The name or ARN of the event bus to receive the event. Only the rules that are associated with this event bus are used to match the event. If you omit this, the default event bus is used. TraceHeader (string) --- An X-Ray trace header, which is an http header (X-Amzn-Trace-Id) that contains the trace-id associated with the event. To learn more about X-Ray trace headers, see Tracing header in the X-Ray Developer Guide.",
      "nested_params": [
        {
          "name": "Time",
          "type": "datetime",
          "required": false,
          "description": "The time stamp of the event, per RFC3339. If no time stamp is provided, the time stamp of the PutEvents call is used.",
          "nested_params": []
        },
        {
          "name": "Source",
          "type": "string",
          "required": false,
          "description": "The source of the event.",
          "nested_params": []
        },
        {
          "name": "Resources",
          "type": "list",
          "required": false,
          "description": "Amazon Web Services resources, identified by Amazon Resource Name (ARN), which the event primarily concerns. Any number, including zero, may be present.",
          "nested_params": []
        },
        {
          "name": "DetailType",
          "type": "string",
          "required": false,
          "description": "Free-form string, with a maximum of 128 characters, used to decide what fields to expect in the event detail.",
          "nested_params": []
        },
        {
          "name": "Detail",
          "type": "string",
          "required": false,
          "description": "A valid JSON object. There is no other schema imposed. The JSON object may contain fields and nested sub-objects.",
          "nested_params": []
        },
        {
          "name": "EventBusName",
          "type": "string",
          "required": false,
          "description": "The name or ARN of the event bus to receive the event. Only the rules that are associated with this event bus are used to match the event. If you omit this, the default event bus is used.",
          "nested_params": []
        },
        {
          "name": "TraceHeader",
          "type": "string",
          "required": false,
          "description": "An X-Ray trace header, which is an http header (X-Amzn-Trace-Id) that contains the trace-id associated with the event. To learn more about X-Ray trace headers, see Tracing header in the X-Ray Developer Guide.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "EndpointId",
      "type": "string",
      "required": false,
      "description": "The URL subdomain of the endpoint. For example, if the URL for Endpoint is https://abcde.veo.endpoints.event.amazonaws.com, then the EndpointId is abcde.veo.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "FailedEntryCount",
          "type": "integer",
          "description": "The number of failed entries.",
          "nested_items": []
        },
        {
          "name": "Entries",
          "type": "list",
          "description": "The successfully and unsuccessfully ingested events results. If the ingestion was successful, the entry has the event ID in it. Otherwise, you can use the error code and error message to identify the problem with the entry.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "EventId",
                  "type": "string",
                  "description": "The ID of the event.",
                  "nested_items": []
                },
                {
                  "name": "ErrorCode",
                  "type": "string",
                  "description": "The error code that indicates why the event submission failed.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "InternalFailure The request processing has failed because of an unknown error, exception or failure.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "ThrottlingException The request was denied due to request throttling.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "ErrorMessage",
                  "type": "string",
                  "description": "The error message that explains why the event submission failed.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}