{
  "method_name": "put_permission",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/events/client/put_permission.html",
  "description": "Running PutPermission permits the specified Amazon Web Services account or Amazon Web Services organization to put events to the specified event bus. Amazon EventBridge rules in your account are triggered by these events arriving to an event bus in your account. For another account to send events to your account, that external account must have an EventBridge rule with your account's event bus as a target. To enable multiple Amazon Web Services accounts to put events to your event bus, run PutPermission once for each of these accounts. Or, if all the accounts are members of the same Amazon Web Services organization, you can run PutPermission once specifying Principal as '*' and specifying the Amazon Web Services organization ID in Condition, to grant permissions to all accounts in that organization. If you grant permissions using an organization, then accounts in that organization must specify a RoleArn with proper permissions when they use PutTarget to add your account's event bus as a target. For more information, see Sending and Receiving Events Between Amazon Web Services Accounts in the Amazon EventBridge User Guide. The permission policy on the event bus cannot exceed 10 KB in size.",
  "parameters": [
    {
      "name": "EventBusName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Action",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Principal",
      "type": "string",
      "required": false,
      "description": "The 12-digit Amazon Web Services account ID that you are permitting to put events to your default event bus. Specify '*' to permit any account to put events to your default event bus. If you specify '*' without specifying Condition, avoid creating rules that may match undesirable events. To create more secure rules, make sure that the event pattern for each rule contains an account field with a specific account ID from which to receive events. Rules with an account field do not match any events sent from other accounts.",
      "nested_params": []
    },
    {
      "name": "StatementId",
      "type": "string",
      "required": false,
      "description": "An identifier string for the external account that you are granting permissions to. If you later want to revoke the permission for this external account, specify this StatementId when you run RemovePermission.",
      "nested_params": []
    },
    {
      "name": "Condition",
      "type": "dict",
      "required": true,
      "description": "This parameter enables you to limit the permission to accounts that fulfill a certain condition, such as being a member of a certain Amazon Web Services organization. For more information about Amazon Web Services Organizations, see What Is Amazon Web Services Organizations in the Amazon Web Services Organizations User Guide. If you specify Condition with an Amazon Web Services organization ID, and specify '*' as the value for Principal, you grant permission to all the accounts in the named organization. The Condition is a JSON string which must contain Type, Key, and Value fields. Specifies the type of condition. Currently the only supported value is StringEquals. Specifies the key for the condition. Currently the only supported key is aws:PrincipalOrgID. Specifies the value for the key. Currently, this must be the ID of the organization.",
      "nested_params": [
        {
          "name": "Type",
          "type": "string",
          "required": false,
          "description": "Specifies the type of condition. Currently the only supported value is StringEquals.",
          "nested_params": []
        },
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "Specifies the key for the condition. Currently the only supported key is aws:PrincipalOrgID.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "Specifies the value for the key. Currently, this must be the ID of the organization.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Policy",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}