{
  "method_name": "start_replay",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/events/client/start_replay.html",
  "description": "Starts the specified replay. Events are not necessarily replayed in the exact same order that they were added to the archive. A replay processes events to replay based on the time in the event, and replays them using 1 minute intervals. If you specify an EventStartTime and an EventEndTime that covers a 20 minute time range, the events are replayed from the first minute of that 20 minute range first. Then the events from the second minute are replayed. You can use DescribeReplay to determine the progress of a replay. The value returned for EventLastReplayedTime indicates the time within the specified time range associated with the last event replayed.",
  "parameters": [
    {
      "name": "ReplayName",
      "type": "string",
      "required": true,
      "description": "The name of the replay to start.",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "EventSourceArn",
      "type": "string",
      "required": true,
      "description": "The ARN of the archive to replay events from.",
      "nested_params": []
    },
    {
      "name": "EventStartTime",
      "type": "datetime",
      "required": true,
      "description": "A time stamp for the time to start replaying events. Only events that occurred between the EventStartTime and EventEndTime are replayed.",
      "nested_params": []
    },
    {
      "name": "EventEndTime",
      "type": "datetime",
      "required": true,
      "description": "A time stamp for the time to stop replaying events. Only events that occurred between the EventStartTime and EventEndTime are replayed.",
      "nested_params": []
    },
    {
      "name": "Destination",
      "type": "dict",
      "required": true,
      "description": "A ReplayDestination object that includes details about the destination for the replay. The ARN of the event bus to replay event to. You can replay events only to the event bus specified to create the archive. FilterArns (list) --- A list of ARNs for rules to replay events to. (string) ---",
      "nested_params": [
        {
          "name": "Arn",
          "type": "string",
          "required": false,
          "description": "The ARN of the event bus to replay event to. You can replay events only to the event bus specified to create the archive.",
          "nested_params": []
        },
        {
          "name": "FilterArns",
          "type": "list",
          "required": false,
          "description": "A list of ARNs for rules to replay events to.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ReplayArn",
          "type": "string",
          "description": "The ARN of the replay.",
          "nested_items": []
        },
        {
          "name": "State",
          "type": "string",
          "description": "The state of the replay.",
          "nested_items": []
        },
        {
          "name": "StateReason",
          "type": "string",
          "description": "The reason that the replay is in the state.",
          "nested_items": []
        },
        {
          "name": "ReplayStartTime",
          "type": "datetime",
          "description": "The time at which the replay started.",
          "nested_items": []
        }
      ]
    }
  ]
}