{
  "method_name": "create_ops_item",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ssm/client/create_ops_item.html",
  "description": "Creates a new OpsItem. You must have permission in Identity and Access Management (IAM) to create a new OpsItem. For more information, see Set up OpsCenter in the Amazon Web Services Systems Manager User Guide. Operations engineers and IT professionals use Amazon Web Services Systems Manager OpsCenter to view, investigate, and remediate operational issues impacting the performance and health of their Amazon Web Services resources. For more information, see Amazon Web Services Systems Manager OpsCenter in the Amazon Web Services Systems Manager User Guide.",
  "parameters": [
    {
      "name": "Description",
      "type": "string",
      "required": true,
      "description": "User-defined text that contains information about the OpsItem, in Markdown format.",
      "nested_params": []
    },
    {
      "name": "OpsItemType",
      "type": "string",
      "required": false,
      "description": "The type of OpsItem to create. Systems Manager supports the following types of OpsItems: /aws/issue This type of OpsItem is used for default OpsItems created by OpsCenter. /aws/changerequest This type of OpsItem is used by Change Manager for reviewing and approving or rejecting change requests. /aws/insight This type of OpsItem is used by OpsCenter for aggregating and reporting on duplicate OpsItems.",
      "nested_params": []
    },
    {
      "name": "OperationalData",
      "type": "dict",
      "required": false,
      "description": "Operational data is custom data that provides useful reference details about the OpsItem. For example, you can specify log files, error strings, license keys, troubleshooting tips, or other relevant data. You enter operational data as key-value pairs. The key has a maximum length of 128 characters. The value has a maximum size of 20 KB. You can choose to make the data searchable by other users in the account or you can restrict search access. Searchable data means that all users with access to the OpsItem Overview page (as provided by the  DescribeOpsItems API operation) can view and search on the specified data. Operational data that isn't searchable is only viewable by users who have access to the OpsItem (as provided by the  GetOpsItem API operation). Use the /aws/resources key in OperationalData to specify a related resource in the request. Use the /aws/automations key in OperationalData to associate an Automation runbook with the OpsItem. To view Amazon Web Services CLI example commands that use these keys, see Create OpsItems manually in the Amazon Web Services Systems Manager User Guide. (string) --- (dict) --- An object that defines the value of the key and its type in the OperationalData map. Value (string) --- The value of the OperationalData key. Type (string) --- The type of key-value pair. Valid types include SearchableString and String.",
      "nested_params": [
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value of the OperationalData key.",
          "nested_params": []
        },
        {
          "name": "Type",
          "type": "string",
          "required": false,
          "description": "The type of key-value pair. Valid types include SearchableString and String.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Notifications",
      "type": "list",
      "required": false,
      "description": "The Amazon Resource Name (ARN) of an SNS topic where notifications are sent when this OpsItem is edited or changed. (dict) --- A notification about the OpsItem. Arn (string) --- The Amazon Resource Name (ARN) of an Amazon Simple Notification Service (Amazon SNS) topic where notifications are sent when this OpsItem is edited or changed.",
      "nested_params": [
        {
          "name": "Arn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of an Amazon Simple Notification Service (Amazon SNS) topic where notifications are sent when this OpsItem is edited or changed.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Priority",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "RelatedOpsItems",
      "type": "list",
      "required": true,
      "description": "One or more OpsItems that share something in common with the current OpsItems. For example, related OpsItems can include OpsItems with similar error messages, impacted resources, or statuses for the impacted resource. (dict) --- An OpsItems that shares something in common with the current OpsItem. The ID of an OpsItem related to the current OpsItem.",
      "nested_params": [
        {
          "name": "OpsItemId",
          "type": "string",
          "required": false,
          "description": "The ID of an OpsItem related to the current OpsItem.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Source",
      "type": "string",
      "required": true,
      "description": "The origin of the OpsItem, such as Amazon EC2 or Systems Manager.",
      "nested_params": []
    },
    {
      "name": "Title",
      "type": "string",
      "required": true,
      "description": "A short heading that describes the nature of the OpsItem and the impacted resource.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "Optional metadata that you assign to a resource. Tags use a key-value pair. For example: Key=Department,Value=Finance (dict) --- Metadata that you assign to your Amazon Web Services resources. Tags enable you to categorize your resources in different ways, for example, by purpose, owner, or environment. In Amazon Web Services Systems Manager, you can apply tags to Systems Manager documents (SSM documents), managed nodes, maintenance windows, parameters, patch baselines, OpsItems, and OpsMetadata. The name of the tag. The value of the tag.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The name of the tag.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value of the tag.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Category",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Severity",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ActualStartTime",
      "type": "datetime",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ActualEndTime",
      "type": "datetime",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "PlannedStartTime",
      "type": "datetime",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "PlannedEndTime",
      "type": "datetime",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "AccountId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "OpsItemId",
          "type": "string",
          "description": "The ID of the OpsItem.",
          "nested_items": []
        },
        {
          "name": "OpsItemArn",
          "type": "string",
          "description": "The OpsItem Amazon Resource Name (ARN).",
          "nested_items": []
        }
      ]
    }
  ]
}