{
  "method_name": "put_compliance_items",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ssm/client/put_compliance_items.html",
  "description": "Registers a compliance type and other compliance details on a designated resource. This operation lets you register custom compliance details with a resource. This call overwrites existing compliance information on the resource, so you must provide a full list of compliance items each time that you send the request. ComplianceType can be one of the following:",
  "parameters": [
    {
      "name": "ResourceId",
      "type": "string",
      "required": true,
      "description": "Specify an ID for this resource. For a managed node, this is the node ID.",
      "nested_params": []
    },
    {
      "name": "ResourceType",
      "type": "string",
      "required": true,
      "description": "Specify the type of resource. ManagedInstance is currently the only supported resource type.",
      "nested_params": []
    },
    {
      "name": "ComplianceType",
      "type": "string",
      "required": true,
      "description": "Specify the compliance type. For example, specify Association (for a State Manager association), Patch, or Custom: string.",
      "nested_params": []
    },
    {
      "name": "ExecutionSummary",
      "type": "dict",
      "required": true,
      "description": "A summary of the call execution that includes an execution ID, the type of execution (for example, Command), and the date/time of the execution using a datetime object that is saved in the following format: yyyy-MM-dd'T'HH:mm:ss'Z' The time the execution ran as a datetime object that is saved in the following format: yyyy-MM-dd'T'HH:mm:ss'Z' ExecutionId (string) --- An ID created by the system when PutComplianceItems was called. For example, CommandID is a valid execution ID. You can use this ID in subsequent calls. ExecutionType (string) --- The type of execution. For example, Command is a valid execution type.",
      "nested_params": [
        {
          "name": "ExecutionTime",
          "type": "datetime",
          "required": false,
          "description": "The time the execution ran as a datetime object that is saved in the following format: yyyy-MM-dd'T'HH:mm:ss'Z'",
          "nested_params": []
        },
        {
          "name": "ExecutionId",
          "type": "string",
          "required": false,
          "description": "An ID created by the system when PutComplianceItems was called. For example, CommandID is a valid execution ID. You can use this ID in subsequent calls.",
          "nested_params": []
        },
        {
          "name": "ExecutionType",
          "type": "string",
          "required": false,
          "description": "The type of execution. For example, Command is a valid execution type.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Items",
      "type": "list",
      "required": true,
      "description": "Information about the compliance as defined by the resource type. For example, for a patch compliance type, Items includes information about the PatchSeverity, Classification, and so on. (dict) --- Information about a compliance item. Id (string) --- The compliance item ID. For example, if the compliance item is a Windows patch, the ID could be the number of the KB article. Title (string) --- The title of the compliance item. For example, if the compliance item is a Windows patch, the title could be the title of the KB article for the patch; for example: Security Update for Active Directory Federation Services. The severity of the compliance status. Severity can be one of the following: Critical, High, Medium, Low, Informational, Unspecified. The status of the compliance item. An item is either COMPLIANT or NON_COMPLIANT. Details (dict) --- A 'Key': 'Value' tag combination for the compliance item. (string) --- (string) ---",
      "nested_params": [
        {
          "name": "Id",
          "type": "string",
          "required": false,
          "description": "The compliance item ID. For example, if the compliance item is a Windows patch, the ID could be the number of the KB article.",
          "nested_params": []
        },
        {
          "name": "Title",
          "type": "string",
          "required": false,
          "description": "The title of the compliance item. For example, if the compliance item is a Windows patch, the title could be the title of the KB article for the patch; for example: Security Update for Active Directory Federation Services.",
          "nested_params": []
        },
        {
          "name": "Severity",
          "type": "string",
          "required": false,
          "description": "The severity of the compliance status. Severity can be one of the following: Critical, High, Medium, Low, Informational, Unspecified.",
          "nested_params": []
        },
        {
          "name": "Status",
          "type": "string",
          "required": false,
          "description": "The status of the compliance item. An item is either COMPLIANT or NON_COMPLIANT.",
          "nested_params": []
        },
        {
          "name": "Details",
          "type": "dict",
          "required": false,
          "description": "A 'Key': 'Value' tag combination for the compliance item.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ItemContentHash",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "UploadType",
      "type": "string",
      "required": false,
      "description": "The mode for uploading compliance items. You can specify COMPLETE or PARTIAL. In COMPLETE mode, the system overwrites all existing compliance information for the resource. You must provide a full list of compliance items each time you send the request. In PARTIAL mode, the system overwrites compliance information for a specific association. The association must be configured with SyncCompliance set to MANUAL. By default, all requests use COMPLETE mode.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}