{
  "method_name": "get_ecs_service_recommendations",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/compute-optimizer/client/get_ecs_service_recommendations.html",
  "description": "Returns Amazon ECS service recommendations. Compute Optimizer generates recommendations for Amazon ECS services on Fargate that meet a specific set of requirements. For more information, see the Supported resources and requirements in the Compute Optimizer User Guide.",
  "parameters": [
    {
      "name": "serviceArns",
      "type": "list",
      "required": false,
      "description": "The ARN that identifies the Amazon ECS service. The following is the format of the ARN: arn:aws:ecs:region:aws_account_id:service/cluster-name/service-name (string) ---",
      "nested_params": []
    },
    {
      "name": "nextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "maxResults",
      "type": "integer",
      "required": false,
      "description": "The maximum number of Amazon ECS service recommendations to return with a single request. To retrieve the remaining results, make another request with the returned nextToken value.",
      "nested_params": []
    },
    {
      "name": "filters",
      "type": "list",
      "required": false,
      "description": "An array of objects to specify a filter that returns a more specific list of Amazon ECS service recommendations. (dict) --- Describes a filter that returns a more specific list of Amazon ECS service recommendations. Use this filter with the  GetECSServiceRecommendations action. name (string) --- The name of the filter. Specify Finding to return recommendations with a specific finding classification. Specify FindingReasonCode to return recommendations with a specific finding reason code. You can filter your Amazon ECS service recommendations by tag:key and tag-key tags. A tag:key is a key and value combination of a tag assigned to your Amazon ECS service recommendations. Use the tag key in the filter name and the tag value as the filter value. For example, to find all Amazon ECS service recommendations that have a tag with the key of Owner and the value of TeamA, specify tag:Owner for the filter name and TeamA for the filter value. A tag-key is the key of a tag assigned to your Amazon ECS service recommendations. Use this filter to find all of your Amazon ECS service recommendations that have a tag with a specific key. This doesn't consider the tag value. For example, you can find your Amazon ECS service recommendations with a tag key value of Owner or without any tag keys assigned. values (list) --- The value of the filter. The valid values for this parameter are as follows: If you specify the name parameter as Finding, specify Optimized, Underprovisioned, or Overprovisioned. If you specify the name parameter as FindingReasonCode, specify CPUUnderprovisioned, CPUOverprovisioned, MemoryUnderprovisioned, or MemoryOverprovisioned. (string) ---",
      "nested_params": [
        {
          "name": "name",
          "type": "string",
          "required": false,
          "description": "The name of the filter. Specify Finding to return recommendations with a specific finding classification. Specify FindingReasonCode to return recommendations with a specific finding reason code. You can filter your Amazon ECS service recommendations by tag:key and tag-key tags. A tag:key is a key and value combination of a tag assigned to your Amazon ECS service recommendations. Use the tag key in the filter name and the tag value as the filter value. For example, to find all Amazon ECS service recommendations that have a tag with the key of Owner and the value of TeamA, specify tag:Owner for the filter name and TeamA for the filter value. A tag-key is the key of a tag assigned to your Amazon ECS service recommendations. Use this filter to find all of your Amazon ECS service recommendations that have a tag with a specific key. This doesn't consider the tag value. For example, you can find your Amazon ECS service recommendations with a tag key value of Owner or without any tag keys assigned.",
          "nested_params": []
        },
        {
          "name": "values",
          "type": "list",
          "required": false,
          "description": "The value of the filter. The valid values for this parameter are as follows:",
          "nested_params": []
        }
      ]
    },
    {
      "name": "accountIds",
      "type": "list",
      "required": false,
      "description": "Return the Amazon ECS service recommendations to the specified Amazon Web Services account IDs. If your account is the management account or the delegated administrator of an organization, use this parameter to return the Amazon ECS service recommendations to specific member accounts. You can only specify one account ID per request. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "nextToken",
          "type": "string",
          "description": "The token to advance to the next page of Amazon ECS service recommendations.",
          "nested_items": []
        },
        {
          "name": "ecsServiceRecommendations",
          "type": "list",
          "description": "An array of objects that describe the Amazon ECS service recommendations.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "serviceArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the current Amazon ECS service.",
                  "nested_items": []
                },
                {
                  "name": "accountId",
                  "type": "string",
                  "description": "The Amazon Web Services account ID of the Amazon ECS service.",
                  "nested_items": []
                },
                {
                  "name": "currentServiceConfiguration",
                  "type": "dict",
                  "description": "The configuration of the current Amazon ECS service.",
                  "nested_items": [
                    {
                      "name": "memory",
                      "type": "integer",
                      "description": "The amount of memory used by the tasks in the Amazon ECS service.",
                      "nested_items": []
                    },
                    {
                      "name": "cpu",
                      "type": "integer",
                      "description": "The number of CPU units used by the tasks in the Amazon ECS service.",
                      "nested_items": []
                    },
                    {
                      "name": "containerConfigurations",
                      "type": "list",
                      "description": "The container configurations within a task of an Amazon ECS service.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "containerName",
                              "type": "string",
                              "description": "The name of the container.",
                              "nested_items": []
                            },
                            {
                              "name": "memorySizeConfiguration",
                              "type": "dict",
                              "description": "The memory size configurations for the container.",
                              "nested_items": [
                                {
                                  "name": "memory",
                                  "type": "integer",
                                  "description": "The amount of memory in the container.",
                                  "nested_items": []
                                },
                                {
                                  "name": "memoryReservation",
                                  "type": "integer",
                                  "description": "The limit of memory reserve for the container.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "cpu",
                              "type": "integer",
                              "description": "The number of CPU units reserved for the container.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "autoScalingConfiguration",
                      "type": "string",
                      "description": "Describes the Auto Scaling configuration methods for an Amazon ECS service. This affects the generated recommendations. For example, if Auto Scaling is configured on a service's CPU, then Compute Optimizer doesn't generate CPU size recommendations.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "TARGET_TRACKING_SCALING_CPU --\u0094 If the Amazon ECS service is configured to use target scaling on CPU, Compute Optimizer doesn't generate CPU recommendations.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "TARGET_TRACKING_SCALING_MEMORY --\u0094 If the Amazon ECS service is configured to use target scaling on memory, Compute Optimizer doesn't generate memory recommendations.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "taskDefinitionArn",
                      "type": "string",
                      "description": "The task definition ARN used by the tasks in the Amazon ECS service.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "utilizationMetrics",
                  "type": "list",
                  "description": "An array of objects that describe the utilization metrics of the Amazon ECS service.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "name",
                          "type": "string",
                          "description": "The name of the utilization metric.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "",
                              "description": "Cpu --\u0094 The amount of CPU capacity that's used in the service.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "Memory --\u0094 The amount of memory that's used in the service.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "statistic",
                          "type": "string",
                          "description": "The statistic of the utilization metric.",
                          "nested_items": []
                        },
                        {
                          "name": "value",
                          "type": "float",
                          "description": "The value of the utilization metric.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "lookbackPeriodInDays",
                  "type": "float",
                  "description": "The number of days the Amazon ECS service utilization metrics were analyzed.",
                  "nested_items": []
                },
                {
                  "name": "launchType",
                  "type": "string",
                  "description": "The launch type the Amazon ECS service is using.",
                  "nested_items": []
                },
                {
                  "name": "lastRefreshTimestamp",
                  "type": "datetime",
                  "description": "The timestamp of when the Amazon ECS service recommendation was last generated.",
                  "nested_items": []
                },
                {
                  "name": "finding",
                  "type": "string",
                  "description": "The finding classification of an Amazon ECS service.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "Underprovisioned --\u0094 When Compute Optimizer detects that there's not enough memory or CPU, an Amazon ECS service is considered under-provisioned. An under-provisioned service might result in poor application performance.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Overprovisioned --\u0094 When Compute Optimizer detects that there's excessive memory or CPU, an Amazon ECS service is considered over-provisioned. An over-provisioned service might result in additional infrastructure costs.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Optimized --\u0094 When both the CPU and memory of your Amazon ECS service meet the performance requirements of your workload, the service is considered optimized.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "findingReasonCodes",
                  "type": "list",
                  "description": "The reason for the finding classification of an Amazon ECS service.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "CPUUnderprovisioned --\u0094 The service CPU configuration can be sized up to enhance the performance of your workload. This is identified by analyzing the CPUUtilization metric of the current service during the look-back period.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "CPUOverprovisioned --\u0094 The service CPU configuration can be sized down while still meeting the performance requirements of your workload. This is identified by analyzing the CPUUtilization metric of the current service during the look-back period.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "MemoryUnderprovisioned --\u0094 The service memory configuration can be sized up to enhance the performance of your workload. This is identified by analyzing the MemoryUtilization metric of the current service during the look-back period.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "MemoryOverprovisioned --\u0094 The service memory configuration can be sized down while still meeting the performance requirements of your workload. This is identified by analyzing the MemoryUtilization metric of the current service during the look-back period.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "serviceRecommendationOptions",
                  "type": "list",
                  "description": "An array of objects that describe the recommendation options for the Amazon ECS service.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "memory",
                          "type": "integer",
                          "description": "The memory size of the Amazon ECS service recommendation option.",
                          "nested_items": []
                        },
                        {
                          "name": "cpu",
                          "type": "integer",
                          "description": "The CPU size of the Amazon ECS service recommendation option.",
                          "nested_items": []
                        },
                        {
                          "name": "savingsOpportunity",
                          "type": "dict",
                          "description": "Describes the savings opportunity for recommendations of a given resource type or for the recommendation option of an individual resource.",
                          "nested_items": [
                            {
                              "name": "savingsOpportunityPercentage",
                              "type": "float",
                              "description": "The estimated monthly savings possible as a percentage of monthly cost by adopting Compute Optimizer recommendations for a given resource.",
                              "nested_items": []
                            },
                            {
                              "name": "estimatedMonthlySavings",
                              "type": "dict",
                              "description": "An object that describes the estimated monthly savings amount possible by adopting Compute Optimizer recommendations for a given resource. This is based on the On-Demand instance pricing..",
                              "nested_items": [
                                {
                                  "name": "currency",
                                  "type": "string",
                                  "description": "The currency of the estimated monthly savings.",
                                  "nested_items": []
                                },
                                {
                                  "name": "value",
                                  "type": "float",
                                  "description": "The value of the estimated monthly savings.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "name": "savingsOpportunityAfterDiscounts",
                          "type": "dict",
                          "description": "Describes the savings opportunity for Amazon ECS service recommendations or for the recommendation option.",
                          "nested_items": [
                            {
                              "name": "savingsOpportunityPercentage",
                              "type": "float",
                              "description": "The estimated monthly savings possible as a percentage of monthly cost by adopting Compute Optimizer's Amazon ECS service recommendations. This includes any applicable Savings Plans discounts.",
                              "nested_items": []
                            },
                            {
                              "name": "estimatedMonthlySavings",
                              "type": "dict",
                              "description": "The estimated monthly savings possible by adopting Compute Optimizer's Amazon ECS service recommendations. This includes any applicable Savings Plans discounts.",
                              "nested_items": [
                                {
                                  "name": "currency",
                                  "type": "string",
                                  "description": "The currency of the estimated monthly savings.",
                                  "nested_items": []
                                },
                                {
                                  "name": "value",
                                  "type": "float",
                                  "description": "The value of the estimated monthly savings for Amazon ECS services.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "name": "projectedUtilizationMetrics",
                          "type": "list",
                          "description": "An array of objects that describe the projected utilization metrics of the Amazon ECS service recommendation option.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "dict",
                              "description": "",
                              "nested_items": [
                                {
                                  "name": "name",
                                  "type": "string",
                                  "description": "The name of the projected utilization metric.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "Cpu --\u0094 The percentage of allocated compute units that are currently in use on the service tasks.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "Memory --\u0094 The percentage of memory that's currently in use on the service tasks.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "statistic",
                                  "type": "string",
                                  "description": "The statistic of the projected utilization metric.",
                                  "nested_items": []
                                },
                                {
                                  "name": "lowerBoundValue",
                                  "type": "float",
                                  "description": "The lower bound values for the projected utilization metrics.",
                                  "nested_items": []
                                },
                                {
                                  "name": "upperBoundValue",
                                  "type": "float",
                                  "description": "The upper bound values for the projected utilization metrics.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "name": "containerRecommendations",
                          "type": "list",
                          "description": "The CPU and memory size recommendations for the containers within the task of your Amazon ECS service.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "dict",
                              "description": "",
                              "nested_items": [
                                {
                                  "name": "containerName",
                                  "type": "string",
                                  "description": "The name of the container.",
                                  "nested_items": []
                                },
                                {
                                  "name": "memorySizeConfiguration",
                                  "type": "dict",
                                  "description": "The recommended memory size configurations for the container.",
                                  "nested_items": [
                                    {
                                      "name": "memory",
                                      "type": "integer",
                                      "description": "The amount of memory in the container.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "memoryReservation",
                                      "type": "integer",
                                      "description": "The limit of memory reserve for the container.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "cpu",
                                  "type": "integer",
                                  "description": "The recommended number of CPU units reserved for the container.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "currentPerformanceRisk",
                  "type": "string",
                  "description": "The risk of the current Amazon ECS service not meeting the performance needs of its workloads. The higher the risk, the more likely the current service can't meet the performance requirements of its workload.",
                  "nested_items": []
                },
                {
                  "name": "effectiveRecommendationPreferences",
                  "type": "dict",
                  "description": "Describes the effective recommendation preferences for Amazon ECS services.",
                  "nested_items": [
                    {
                      "name": "savingsEstimationMode",
                      "type": "dict",
                      "description": "Describes the savings estimation mode preference applied for calculating savings opportunity for Amazon ECS services.",
                      "nested_items": [
                        {
                          "name": "source",
                          "type": "string",
                          "description": "Describes the source for calculating the savings opportunity for Amazon ECS services.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "tags",
                  "type": "list",
                  "description": "A list of tags assigned to your Amazon ECS service recommendations.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "key",
                          "type": "string",
                          "description": "One part of a key-value pair that makes up a tag. A key is a general label that acts like a category for more specific tag values.",
                          "nested_items": []
                        },
                        {
                          "name": "value",
                          "type": "string",
                          "description": "One part of a key-value pair that make up a tag. A value acts as a descriptor within a tag category (key). The value can be empty or null.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "errors",
          "type": "list",
          "description": "An array of objects that describe errors of the request.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "identifier",
                  "type": "string",
                  "description": "The ID of the error.",
                  "nested_items": []
                },
                {
                  "name": "code",
                  "type": "string",
                  "description": "The error code.",
                  "nested_items": []
                },
                {
                  "name": "message",
                  "type": "string",
                  "description": "The message, or reason, for the error.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}