{
  "method_name": "put_resource_policy",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/rum/client/put_resource_policy.html",
  "description": "Use this operation to assign a resource-based policy to a CloudWatch RUM app monitor to control access to it. Each app monitor can have one resource-based policy. The maximum size of the policy is 4 KB. To learn more about using resource policies with RUM, see Using resource-based policies with CloudWatch RUM.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "The name of the app monitor that you want to apply this resource-based policy to. To find the names of your app monitors, you can use the ListAppMonitors operation.",
      "nested_params": []
    },
    {
      "name": "PolicyDocument",
      "type": "string",
      "required": true,
      "description": "The JSON to use as the resource policy. The document can be up to 4 KB in size. For more information about the contents and syntax for this policy, see Using resource-based policies with CloudWatch RUM.",
      "nested_params": []
    },
    {
      "name": "PolicyRevisionId",
      "type": "string",
      "required": false,
      "description": "A string value that you can use to conditionally update your policy. You can provide the revision ID of your existing policy to make mutating requests against that policy. When you assign a policy revision ID, then later requests about that policy will be rejected with an InvalidPolicyRevisionIdException error if they don't provide the correct current revision ID.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "PolicyDocument",
          "type": "string",
          "description": "The JSON policy document that you specified.",
          "nested_items": []
        },
        {
          "name": "PolicyRevisionId",
          "type": "string",
          "description": "The policy revision ID information that you specified.",
          "nested_items": []
        }
      ]
    }
  ]
}