{
  "method_name": "create_data_set_import_task",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/m2/client/create_data_set_import_task.html",
  "description": "Starts a data set import task for a specific application.",
  "parameters": [
    {
      "name": "applicationId",
      "type": "string",
      "required": true,
      "description": "The unique identifier of the application for which you want to import data sets.",
      "nested_params": []
    },
    {
      "name": "clientToken",
      "type": "string",
      "required": false,
      "description": "Unique, case-sensitive identifier you provide to ensure the idempotency of the request to create a data set import. The service generates the clientToken when the API call is triggered. The token expires after one hour, so if you retry the API within this timeframe with the same clientToken, you will get the same response. The service also handles deleting the clientToken after it expires. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "importConfig",
      "type": "dict",
      "required": true,
      "description": "The data set import task configuration. dataSets (list) --- The data sets. (dict) --- Identifies a specific data set to import from an external location. The data set. The logical identifier for a specific data set (in mainframe format). The type of dataset. The only supported value is VSAM. gdg (dict) --- The generation data group of the data set. limit (integer) --- The maximum number of generation data sets, up to 255, in a GDG. rollDisposition (string) --- The disposition of the data set in the catalog. po (dict) --- The details of a PO type data set. encoding (string) --- The character set encoding of the data set. The format of the data set records. An array containing one or more filename extensions, allowing you to specify which files to be included as PDS member. (string) --- ps (dict) --- The details of a PS type data set. vsam (dict) --- The details of a VSAM data set. alternateKeys (list) --- The alternate key definitions, if any. A legacy dataset might not have any alternate key defined, but if those alternate keys definitions exist, provide them as some applications will make use of them. (dict) --- Defines an alternate key. This value is optional. A legacy data set might not have any alternate key defined but if those alternate keys definitions exist, provide them, as some applications will make use of them. allowDuplicates (boolean) --- Indicates whether the alternate key values are supposed to be unique for the given data set. A strictly positive integer value representing the length of the alternate key. name (string) --- The name of the alternate key. A positive integer value representing the offset to mark the start of the alternate key part in the record byte array. compressed (boolean) --- Indicates whether indexes for this dataset are stored as compressed values. If you have a large data set (typically > 100 Mb), consider setting this flag to True. encoding (string) --- The character set used by the data set. Can be ASCII, EBCDIC, or unknown. The record format of the data set. primaryKey (dict) --- The primary key of the data set. A strictly positive integer value representing the length of the primary key. name (string) --- A name for the Primary Key. A positive integer value representing the offset to mark the start of the primary key in the record byte array. The length of a record. The maximum record length. In case of fixed, both minimum and maximum are the same. The minimum record length of a record. relativePath (string) --- The relative location of the data set in the database or file system. storageType (string) --- The storage type of the data set: database or file system. For Micro Focus, database corresponds to datastore and file system corresponds to EFS/FSX. For Blu Age, there is no support of file system and database corresponds to Blusam. The location of the data set. s3Location (string) --- The URI of the Amazon S3 bucket. s3Location (string) --- The Amazon S3 location of the data sets.",
      "nested_params": [
        {
          "name": "dataSets",
          "type": "list",
          "required": false,
          "description": "The data sets.",
          "nested_params": [
            {
              "name": "dataSet",
              "type": "dict",
              "required": false,
              "description": "The data set.",
              "nested_params": [
                {
                  "name": "datasetName",
                  "type": "string",
                  "required": false,
                  "description": "The logical identifier for a specific data set (in mainframe format).",
                  "nested_params": []
                },
                {
                  "name": "datasetOrg",
                  "type": "dict",
                  "required": false,
                  "description": "The type of dataset. The only supported value is VSAM.",
                  "nested_params": [
                    {
                      "name": "gdg",
                      "type": "dict",
                      "required": false,
                      "description": "The generation data group of the data set.",
                      "nested_params": [
                        {
                          "name": "limit",
                          "type": "integer",
                          "required": false,
                          "description": "The maximum number of generation data sets, up to 255, in a GDG.",
                          "nested_params": []
                        },
                        {
                          "name": "rollDisposition",
                          "type": "string",
                          "required": false,
                          "description": "The disposition of the data set in the catalog.",
                          "nested_params": []
                        }
                      ]
                    },
                    {
                      "name": "po",
                      "type": "dict",
                      "required": false,
                      "description": "The details of a PO type data set.",
                      "nested_params": [
                        {
                          "name": "encoding",
                          "type": "string",
                          "required": false,
                          "description": "The character set encoding of the data set.",
                          "nested_params": []
                        },
                        {
                          "name": "format",
                          "type": "string",
                          "required": false,
                          "description": "The format of the data set records.",
                          "nested_params": []
                        },
                        {
                          "name": "memberFileExtensions",
                          "type": "list",
                          "required": false,
                          "description": "An array containing one or more filename extensions, allowing you to specify which files to be included as PDS member.",
                          "nested_params": []
                        }
                      ]
                    },
                    {
                      "name": "ps",
                      "type": "dict",
                      "required": false,
                      "description": "The details of a PS type data set.",
                      "nested_params": [
                        {
                          "name": "encoding",
                          "type": "string",
                          "required": false,
                          "description": "The character set encoding of the data set.",
                          "nested_params": []
                        },
                        {
                          "name": "format",
                          "type": "string",
                          "required": false,
                          "description": "The format of the data set records.",
                          "nested_params": []
                        }
                      ]
                    },
                    {
                      "name": "vsam",
                      "type": "dict",
                      "required": false,
                      "description": "The details of a VSAM data set.",
                      "nested_params": [
                        {
                          "name": "alternateKeys",
                          "type": "list",
                          "required": false,
                          "description": "The alternate key definitions, if any. A legacy dataset might not have any alternate key defined, but if those alternate keys definitions exist, provide them as some applications will make use of them.",
                          "nested_params": [
                            {
                              "name": "allowDuplicates",
                              "type": "boolean",
                              "required": false,
                              "description": "Indicates whether the alternate key values are supposed to be unique for the given data set.",
                              "nested_params": []
                            },
                            {
                              "name": "length",
                              "type": "integer",
                              "required": false,
                              "description": "A strictly positive integer value representing the length of the alternate key.",
                              "nested_params": []
                            },
                            {
                              "name": "name",
                              "type": "string",
                              "required": false,
                              "description": "The name of the alternate key.",
                              "nested_params": []
                            },
                            {
                              "name": "offset",
                              "type": "integer",
                              "required": false,
                              "description": "A positive integer value representing the offset to mark the start of the alternate key part in the record byte array.",
                              "nested_params": []
                            }
                          ]
                        },
                        {
                          "name": "compressed",
                          "type": "boolean",
                          "required": false,
                          "description": "Indicates whether indexes for this dataset are stored as compressed values. If you have a large data set (typically > 100 Mb), consider setting this flag to True.",
                          "nested_params": []
                        },
                        {
                          "name": "encoding",
                          "type": "string",
                          "required": false,
                          "description": "The character set used by the data set. Can be ASCII, EBCDIC, or unknown.",
                          "nested_params": []
                        },
                        {
                          "name": "format",
                          "type": "string",
                          "required": false,
                          "description": "The record format of the data set.",
                          "nested_params": []
                        },
                        {
                          "name": "primaryKey",
                          "type": "dict",
                          "required": false,
                          "description": "The primary key of the data set.",
                          "nested_params": [
                            {
                              "name": "length",
                              "type": "integer",
                              "required": false,
                              "description": "A strictly positive integer value representing the length of the primary key.",
                              "nested_params": []
                            },
                            {
                              "name": "name",
                              "type": "string",
                              "required": false,
                              "description": "A name for the Primary Key.",
                              "nested_params": []
                            },
                            {
                              "name": "offset",
                              "type": "integer",
                              "required": false,
                              "description": "A positive integer value representing the offset to mark the start of the primary key in the record byte array.",
                              "nested_params": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "recordLength",
                  "type": "dict",
                  "required": false,
                  "description": "The length of a record.",
                  "nested_params": [
                    {
                      "name": "max",
                      "type": "integer",
                      "required": false,
                      "description": "The maximum record length. In case of fixed, both minimum and maximum are the same.",
                      "nested_params": []
                    },
                    {
                      "name": "min",
                      "type": "integer",
                      "required": false,
                      "description": "The minimum record length of a record.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "relativePath",
                  "type": "string",
                  "required": false,
                  "description": "The relative location of the data set in the database or file system.",
                  "nested_params": []
                },
                {
                  "name": "storageType",
                  "type": "string",
                  "required": false,
                  "description": "The storage type of the data set: database or file system. For Micro Focus, database corresponds to datastore and file system corresponds to EFS/FSX. For Blu Age, there is no support of file system and database corresponds to Blusam.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "externalLocation",
              "type": "dict",
              "required": false,
              "description": "The location of the data set.",
              "nested_params": [
                {
                  "name": "s3Location",
                  "type": "string",
                  "required": false,
                  "description": "The URI of the Amazon S3 bucket.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "s3Location",
          "type": "string",
          "required": false,
          "description": "The Amazon S3 location of the data sets.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "taskId",
          "type": "string",
          "description": "The task identifier. This operation is asynchronous. Use this identifier with the  GetDataSetImportTask operation to obtain the status of this task.",
          "nested_items": []
        }
      ]
    }
  ]
}