{
  "method_name": "create_sink",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/oam/client/create_sink.html",
  "description": "Use this to create a sink in the current account, so that it can be used as a monitoring account in CloudWatch cross-account observability. A sink is a resource that represents an attachment point in a monitoring account. Source accounts can link to the sink to send observability data. After you create a sink, you must create a sink policy that allows source accounts to attach to it. For more information, see PutSinkPolicy. Each account can contain one sink per Region. If you delete a sink, you can then create a new one in that Region.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "A name for the sink.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "dict",
      "required": false,
      "description": "Assigns one or more tags (key-value pairs) to the link. Tags can help you organize and categorize your resources. You can also use them to scope user permissions by granting a user permission to access or change only resources with certain tag values. For more information about using tags to control access, see Controlling access to Amazon Web Services resources using tags. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Arn",
          "type": "string",
          "description": "The ARN of the sink that is newly created.",
          "nested_items": []
        },
        {
          "name": "Id",
          "type": "string",
          "description": "The random ID string that Amazon Web Services generated as part of the sink ARN.",
          "nested_items": []
        },
        {
          "name": "Name",
          "type": "string",
          "description": "The name of the sink.",
          "nested_items": []
        },
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}