{
  "method_name": "describe_ledger",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/qldb/client/describe_ledger.html",
  "description": "Returns information about a ledger, including its state, permissions mode, encryption at rest settings, and when it was created.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "The name of the ledger that you want to describe.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Name",
          "type": "string",
          "description": "The name of the ledger.",
          "nested_items": []
        },
        {
          "name": "Arn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) for the ledger.",
          "nested_items": []
        },
        {
          "name": "State",
          "type": "string",
          "description": "The current status of the ledger.",
          "nested_items": []
        },
        {
          "name": "CreationDateTime",
          "type": "datetime",
          "description": "The date and time, in epoch time format, when the ledger was created. (Epoch time format is the number of seconds elapsed since 12:00:00 AM January 1, 1970 UTC.)",
          "nested_items": []
        },
        {
          "name": "PermissionsMode",
          "type": "string",
          "description": "The permissions mode of the ledger.",
          "nested_items": []
        },
        {
          "name": "DeletionProtection",
          "type": "boolean",
          "description": "Specifies whether the ledger is protected from being deleted by any user. If not defined during ledger creation, this feature is enabled ( true) by default.",
          "nested_items": []
        },
        {
          "name": "EncryptionDescription",
          "type": "dict",
          "description": "Information about the encryption of data at rest in the ledger. This includes the current status, the KMS key, and when the key became inaccessible (in the case of an error). If this parameter is undefined, the ledger uses an Amazon Web Services owned KMS key for encryption.",
          "nested_items": [
            {
              "name": "KmsKeyArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the customer managed KMS key that the ledger uses for encryption at rest. If this parameter is undefined, the ledger uses an Amazon Web Services owned KMS key for encryption. It will display AWS_OWNED_KMS_KEY when updating the ledger's encryption configuration to the Amazon Web Services owned KMS key.",
              "nested_items": []
            },
            {
              "name": "EncryptionStatus",
              "type": "string",
              "description": "The current state of encryption at rest for the ledger. This can be one of the following values:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "ENABLED: Encryption is fully enabled using the specified key.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "UPDATING: The ledger is actively processing the specified key change. Key changes in QLDB are asynchronous. The ledger is fully accessible without any performance impact while the key change is being processed. The amount of time it takes to update a key varies depending on the ledger size.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "KMS_KEY_INACCESSIBLE: The specified customer managed KMS key is not accessible, and the ledger is impaired. Either the key was disabled or deleted, or the grants on the key were revoked. When a ledger is impaired, it is not accessible and does not accept any read or write requests. An impaired ledger automatically returns to an active state after you restore the grants on the key, or re-enable the key that was disabled. However, deleting a customer managed KMS key is irreversible. After a key is deleted, you can no longer access the ledgers that are protected with that key, and the data becomes unrecoverable permanently.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "InaccessibleKmsKeyDateTime",
              "type": "datetime",
              "description": "The date and time, in epoch time format, when the KMS key first became inaccessible, in the case of an error. (Epoch time format is the number of seconds that have elapsed since 12:00:00 AM January 1, 1970 UTC.)",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}