{
  "method_name": "get_saml_provider",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iam/client/get_saml_provider.html",
  "description": "Returns the SAML provider metadocument that was uploaded when the IAM SAML provider resource object was created or updated.",
  "parameters": [
    {
      "name": "SAMLProviderArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the SAML provider resource object in IAM to get information about. For more information about ARNs, see Amazon Resource Names (ARNs) in the Amazon Web Services General Reference.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "SAMLProviderUUID",
          "type": "string",
          "description": "The unique identifier assigned to the SAML provider.",
          "nested_items": []
        },
        {
          "name": "SAMLMetadataDocument",
          "type": "string",
          "description": "The XML metadata document that includes information about an identity provider.",
          "nested_items": []
        },
        {
          "name": "CreateDate",
          "type": "datetime",
          "description": "The date and time when the SAML provider was created.",
          "nested_items": []
        },
        {
          "name": "ValidUntil",
          "type": "datetime",
          "description": "The expiration date and time for the SAML provider.",
          "nested_items": []
        },
        {
          "name": "Tags",
          "type": "list",
          "description": "A list of tags that are attached to the specified IAM SAML provider. The returned list of tags is sorted by tag key. For more information about tagging, see Tagging IAM resources in the IAM User Guide.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Key",
                  "type": "string",
                  "description": "The key name that can be used to look up or retrieve the associated value. For example, Department or Cost Center are common choices.",
                  "nested_items": []
                },
                {
                  "name": "Value",
                  "type": "string",
                  "description": "The value associated with this tag. For example, tags with a key name of Department could have values such as Human Resources, Accounting, and Support. Tags with a key name of Cost Center might have values that consist of the number associated with the different cost centers in your company. Typically, many resources have tags with the same key name but with different values.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "AssertionEncryptionMode",
          "type": "string",
          "description": "Specifies the encryption setting for the SAML provider.",
          "nested_items": []
        },
        {
          "name": "PrivateKeyList",
          "type": "list",
          "description": "The private key metadata for the SAML provider.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "KeyId",
                  "type": "string",
                  "description": "The unique identifier for the SAML private key.",
                  "nested_items": []
                },
                {
                  "name": "Timestamp",
                  "type": "datetime",
                  "description": "The date and time, in ISO 8601 date-time format, when the private key was uploaded.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}