{
  "method_name": "get_account_password_policy",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iam/client/get_account_password_policy.html",
  "description": "Retrieves the password policy for the Amazon Web Services account. This tells you the complexity requirements and mandatory rotation periods for the IAM user passwords in your account. For more information about using a password policy, see Managing an IAM password policy.",
  "parameters": [],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "PasswordPolicy",
          "type": "dict",
          "description": "A structure that contains details about the account's password policy.",
          "nested_items": [
            {
              "name": "MinimumPasswordLength",
              "type": "integer",
              "description": "Minimum length to require for IAM user passwords.",
              "nested_items": []
            },
            {
              "name": "RequireSymbols",
              "type": "boolean",
              "description": "Specifies whether IAM user passwords must contain at least one of the following symbols:",
              "nested_items": []
            },
            {
              "name": "RequireNumbers",
              "type": "boolean",
              "description": "Specifies whether IAM user passwords must contain at least one numeric character (0 to 9).",
              "nested_items": []
            },
            {
              "name": "RequireUppercaseCharacters",
              "type": "boolean",
              "description": "Specifies whether IAM user passwords must contain at least one uppercase character (A to Z).",
              "nested_items": []
            },
            {
              "name": "RequireLowercaseCharacters",
              "type": "boolean",
              "description": "Specifies whether IAM user passwords must contain at least one lowercase character (a to z).",
              "nested_items": []
            },
            {
              "name": "AllowUsersToChangePassword",
              "type": "boolean",
              "description": "Specifies whether IAM users are allowed to change their own password. Gives IAM users permissions to iam:ChangePassword for only their user and to the iam:GetAccountPasswordPolicy action. This option does not attach a permissions policy to each user, rather the permissions are applied at the account-level for all users by IAM.",
              "nested_items": []
            },
            {
              "name": "ExpirePasswords",
              "type": "boolean",
              "description": "Indicates whether passwords in the account expire. Returns true if MaxPasswordAge contains a value greater than 0. Returns false if MaxPasswordAge is 0 or not present.",
              "nested_items": []
            },
            {
              "name": "MaxPasswordAge",
              "type": "integer",
              "description": "The number of days that an IAM user password is valid.",
              "nested_items": []
            },
            {
              "name": "PasswordReusePrevention",
              "type": "integer",
              "description": "Specifies the number of previous passwords that IAM users are prevented from reusing.",
              "nested_items": []
            },
            {
              "name": "HardExpiry",
              "type": "boolean",
              "description": "Specifies whether IAM users are prevented from setting a new password via the Amazon Web Services Management Console after their password has expired. The IAM user cannot access the console until an administrator resets the password. IAM users with iam:ChangePassword permission and active access keys can reset their own expired console password using the CLI or API.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}