{
  "method_name": "list_service_specific_credentials",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iam/client/list_service_specific_credentials.html",
  "description": "Returns information about the service-specific credentials associated with the specified IAM user. If none exists, the operation returns an empty list. The service-specific credentials returned by this operation are used only for authenticating the IAM user to a specific service. For more information about using service-specific credentials to authenticate to an Amazon Web Services service, see Set up service-specific credentials in the CodeCommit User Guide.",
  "parameters": [
    {
      "name": "UserName",
      "type": "string",
      "required": false,
      "description": "The name of the user whose service-specific credentials you want information about. If this value is not specified, then the operation assumes the user whose credentials are used to call the operation. This parameter allows (through its regex pattern) a string of characters consisting of upper and lowercase alphanumeric characters with no spaces. You can also include any of the following characters: _+=,.@-",
      "nested_params": []
    },
    {
      "name": "ServiceName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ServiceSpecificCredentials",
          "type": "list",
          "description": "A list of structures that each contain details about a service-specific credential.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "UserName",
                  "type": "string",
                  "description": "The name of the IAM user associated with the service-specific credential.",
                  "nested_items": []
                },
                {
                  "name": "Status",
                  "type": "string",
                  "description": "The status of the service-specific credential. Active means that the key is valid for API calls, while Inactive means it is not.",
                  "nested_items": []
                },
                {
                  "name": "ServiceUserName",
                  "type": "string",
                  "description": "The generated user name for the service-specific credential.",
                  "nested_items": []
                },
                {
                  "name": "CreateDate",
                  "type": "datetime",
                  "description": "The date and time, in ISO 8601 date-time format, when the service-specific credential were created.",
                  "nested_items": []
                },
                {
                  "name": "ServiceSpecificCredentialId",
                  "type": "string",
                  "description": "The unique identifier for the service-specific credential.",
                  "nested_items": []
                },
                {
                  "name": "ServiceName",
                  "type": "string",
                  "description": "The name of the service associated with the service-specific credential.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}