{
  "method_name": "list_policies_granting_service_access",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iam/client/list_policies_granting_service_access.html",
  "description": "Retrieves a list of policies that the IAM identity (user, group, or role) can use to access each specified service. The list of policies returned by the operation depends on the ARN of the identity that you provide. For each managed policy, this operation returns the ARN and policy name. For each inline policy, it returns the policy name and the entity to which it is attached. Inline policies do not have an ARN. For more information about these policy types, see Managed policies and inline policies in the IAM User Guide. Policies that are attached to users and roles as permissions boundaries are not returned. To view which managed policy is currently used to set the permissions boundary for a user or role, use the  GetUser or  GetRole operations.",
  "parameters": [
    {
      "name": "Marker",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Arn",
      "type": "string",
      "required": true,
      "description": "The ARN of the IAM identity (user, group, or role) whose policies you want to list.",
      "nested_params": []
    },
    {
      "name": "ServiceNamespaces",
      "type": "list",
      "required": true,
      "description": "The service namespace for the Amazon Web Services services whose policies you want to list. To learn the service namespace for a service, see Actions, resources, and condition keys for Amazon Web Services services in the IAM User Guide. Choose the name of the service to view details for that service. In the first paragraph, find the service prefix. For example, (service prefix: a4b). For more information about service namespaces, see Amazon Web Services service namespaces in theÂ Amazon Web Services General Reference. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "PoliciesGrantingServiceAccess",
          "type": "list",
          "description": "AÂ  ListPoliciesGrantingServiceAccess object that contains details about the permissions policies attached to the specified identity (user, group, or role).",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ServiceNamespace",
                  "type": "string",
                  "description": "The namespace of the service that was accessed.",
                  "nested_items": []
                },
                {
                  "name": "Policies",
                  "type": "list",
                  "description": "TheÂ  PoliciesGrantingServiceAccess object that contains details about the policy.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "PolicyName",
                          "type": "string",
                          "description": "The policy name.",
                          "nested_items": []
                        },
                        {
                          "name": "PolicyType",
                          "type": "string",
                          "description": "The policy type. For more information about these policy types, see Managed policies and inline policies in the IAM User Guide.",
                          "nested_items": []
                        },
                        {
                          "name": "PolicyArn",
                          "type": "string",
                          "description": "The Amazon Resource Name (ARN). ARNs are unique identifiers for Amazon Web Services resources.",
                          "nested_items": []
                        },
                        {
                          "name": "EntityType",
                          "type": "string",
                          "description": "The type of entity (user or role) that used the policy to access the service to which the inline policy is attached.",
                          "nested_items": []
                        },
                        {
                          "name": "EntityName",
                          "type": "string",
                          "description": "The name of the entity (user or role) to which the inline policy is attached.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "IsTruncated",
          "type": "boolean",
          "description": "A flag that indicates whether there are more items to return. If your results were truncated, you can make a subsequent pagination request using the Marker request parameter to retrieve more items. We recommend that you check IsTruncated after every call to ensure that you receive all your results.",
          "nested_items": []
        },
        {
          "name": "Marker",
          "type": "string",
          "description": "When IsTruncated is true, this element is present and contains the value to use for the Marker parameter in a subsequent pagination request.",
          "nested_items": []
        }
      ]
    }
  ]
}