{
  "method_name": "update_role_description",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iam/client/update_role_description.html",
  "description": "Use  UpdateRole instead. Modifies only the description of a role. This operation performs the same function as the Description parameter in the UpdateRole operation.",
  "parameters": [
    {
      "name": "RoleName",
      "type": "string",
      "required": true,
      "description": "The name of the role that you want to modify.",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": true,
      "description": "The new description that you want to apply to the specified role.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "Path",
              "type": "string",
              "description": "The path to the role. For more information about paths, see IAM identifiers in the IAM User Guide.",
              "nested_items": []
            },
            {
              "name": "RoleName",
              "type": "string",
              "description": "The friendly name that identifies the role.",
              "nested_items": []
            },
            {
              "name": "RoleId",
              "type": "string",
              "description": "The stable and unique string identifying the role. For more information about IDs, see IAM identifiers in the IAM User Guide.",
              "nested_items": []
            },
            {
              "name": "Arn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) specifying the role. For more information about ARNs and how to use them in policies, see IAM identifiers in the IAM User Guide guide.",
              "nested_items": []
            },
            {
              "name": "CreateDate",
              "type": "datetime",
              "description": "The date and time, in ISO 8601 date-time format, when the role was created.",
              "nested_items": []
            },
            {
              "name": "AssumeRolePolicyDocument",
              "type": "string",
              "description": "The policy that grants an entity permission to assume the role.",
              "nested_items": []
            },
            {
              "name": "Description",
              "type": "string",
              "description": "A description of the role that you provide.",
              "nested_items": []
            },
            {
              "name": "MaxSessionDuration",
              "type": "integer",
              "description": "The maximum session duration (in seconds) for the specified role. Anyone who uses the CLI, or API to assume the role can specify the duration using the optional DurationSeconds API parameter or duration-seconds CLI parameter.",
              "nested_items": []
            },
            {
              "name": "PermissionsBoundary",
              "type": "dict",
              "description": "The ARN of the policy used to set the permissions boundary for the role.",
              "nested_items": [
                {
                  "name": "PermissionsBoundaryType",
                  "type": "string",
                  "description": "The permissions boundary usage type that indicates what type of IAM resource is used as the permissions boundary for an entity. This data type can only have a value of Policy.",
                  "nested_items": []
                },
                {
                  "name": "PermissionsBoundaryArn",
                  "type": "string",
                  "description": "The ARN of the policy used to set the permissions boundary for the user or role.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Tags",
              "type": "list",
              "description": "A list of tags that are attached to the role. For more information about tagging, see Tagging IAM resources in the IAM User Guide.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Key",
                      "type": "string",
                      "description": "The key name that can be used to look up or retrieve the associated value. For example, Department or Cost Center are common choices.",
                      "nested_items": []
                    },
                    {
                      "name": "Value",
                      "type": "string",
                      "description": "The value associated with this tag. For example, tags with a key name of Department could have values such as Human Resources, Accounting, and Support. Tags with a key name of Cost Center might have values that consist of the number associated with the different cost centers in your company. Typically, many resources have tags with the same key name but with different values.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "RoleLastUsed",
              "type": "dict",
              "description": "Contains information about the last time that an IAM role was used. This includes the date and time and the Region in which the role was last used. Activity is only reported for the trailing 400 days. This period can be shorter if your Region began supporting these features within the last year. The role might have been used more than 400 days ago. For more information, see Regions where data is tracked in the IAM user Guide.",
              "nested_items": [
                {
                  "name": "LastUsedDate",
                  "type": "datetime",
                  "description": "The date and time, inÂ  ISO 8601 date-time format that the role was last used.",
                  "nested_items": []
                },
                {
                  "name": "Region",
                  "type": "string",
                  "description": "The name of the Amazon Web Services Region in which the role was last used.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}