{
  "method_name": "upload_signing_certificate",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iam/client/upload_signing_certificate.html",
  "description": "Uploads an X.509 signing certificate and associates it with the specified IAM user. Some Amazon Web Services services require you to use certificates to validate requests that are signed with a corresponding private key. When you upload the certificate, its default status is Active. For information about when you would use an X.509 signing certificate, see Managing server certificates in IAM in the IAM User Guide. If the UserName is not specified, the IAM user name is determined implicitly based on the Amazon Web Services access key ID used to sign the request. This operation works for access keys under the Amazon Web Services account. Consequently, you can use this operation to manage Amazon Web Services account root user credentials even if the Amazon Web Services account has no associated users.",
  "parameters": [
    {
      "name": "UserName",
      "type": "string",
      "required": false,
      "description": "The name of the user the signing certificate is for. This parameter allows (through its regex pattern) a string of characters consisting of upper and lowercase alphanumeric characters with no spaces. You can also include any of the following characters: _+=,.@-",
      "nested_params": []
    },
    {
      "name": "CertificateBody",
      "type": "string",
      "required": true,
      "description": "The contents of the signing certificate. The regex pattern used to validate this parameter is a string of characters consisting of the following: Any printable ASCII character ranging from the space character ( \\u0020) through the end of the ASCII character range The printable characters in the Basic Latin and Latin-1 Supplement character set (through \\u00FF) The special characters tab ( \\u0009), line feed ( \\u000A), and carriage return ( \\u000D)",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Certificate",
          "type": "dict",
          "description": "Information about the certificate.",
          "nested_items": [
            {
              "name": "UserName",
              "type": "string",
              "description": "The name of the user the signing certificate is associated with.",
              "nested_items": []
            },
            {
              "name": "CertificateId",
              "type": "string",
              "description": "The ID for the signing certificate.",
              "nested_items": []
            },
            {
              "name": "CertificateBody",
              "type": "string",
              "description": "The contents of the signing certificate.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The status of the signing certificate. Active means that the key is valid for API calls, while Inactive means it is not.",
              "nested_items": []
            },
            {
              "name": "UploadDate",
              "type": "datetime",
              "description": "The date when the signing certificate was uploaded.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}