{
  "method_name": "failover_global_cluster",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/neptune/client/failover_global_cluster.html",
  "description": "Initiates the failover process for a Neptune global database. A failover for a Neptune global database promotes one of secondary read-only DB clusters to be the primary DB cluster and demotes the primary DB cluster to being a secondary (read-only) DB cluster. In other words, the role of the current primary DB cluster and the selected target secondary DB cluster are switched. The selected secondary DB cluster assumes full read/write capabilities for the Neptune global database.",
  "parameters": [
    {
      "name": "GlobalClusterIdentifier",
      "type": "string",
      "required": true,
      "description": "Identifier of the Neptune global database that should be failed over. The identifier is the unique key assigned by the user when the Neptune global database was created. In other words, it's the name of the global database that you want to fail over. Constraints: Must match the identifier of an existing Neptune global database.",
      "nested_params": []
    },
    {
      "name": "TargetDbClusterIdentifier",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the secondary Neptune DB cluster that you want to promote to primary for the global database.",
      "nested_params": []
    },
    {
      "name": "AllowDataLoss",
      "type": "boolean",
      "required": false,
      "description": "Specifies whether to allow data loss for this global database cluster operation. Allowing data loss triggers a global failover operation. If you don't specify AllowDataLoss, the global database cluster operation defaults to a switchover. Constraints:Can't be specified together with the Switchover parameter.",
      "nested_params": []
    },
    {
      "name": "Switchover",
      "type": "boolean",
      "required": false,
      "description": "Specifies whether to switch over this global database cluster. Constraints:Can't be specified together with the AllowDataLoss parameter.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "GlobalCluster",
          "type": "dict",
          "description": "Contains the details of an Amazon Neptune global database.",
          "nested_items": [
            {
              "name": "GlobalClusterIdentifier",
              "type": "string",
              "description": "Contains a user-supplied global database cluster identifier. This identifier is the unique key that identifies a global database.",
              "nested_items": []
            },
            {
              "name": "GlobalClusterResourceId",
              "type": "string",
              "description": "An immutable identifier for the global database that is unique within in all regions. This identifier is found in CloudTrail log entries whenever the KMS key for the DB cluster is accessed.",
              "nested_items": []
            },
            {
              "name": "GlobalClusterArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) for the global database.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "Specifies the current state of this global database.",
              "nested_items": []
            },
            {
              "name": "Engine",
              "type": "string",
              "description": "The Neptune database engine used by the global database ( \"neptune\").",
              "nested_items": []
            },
            {
              "name": "EngineVersion",
              "type": "string",
              "description": "The Neptune engine version used by the global database.",
              "nested_items": []
            },
            {
              "name": "StorageEncrypted",
              "type": "boolean",
              "description": "The storage encryption setting for the global database.",
              "nested_items": []
            },
            {
              "name": "DeletionProtection",
              "type": "boolean",
              "description": "The deletion protection setting for the global database.",
              "nested_items": []
            },
            {
              "name": "GlobalClusterMembers",
              "type": "list",
              "description": "A list of cluster ARNs and instance ARNs for all the DB clusters that are part of the global database.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "DBClusterArn",
                      "type": "string",
                      "description": "The Amazon Resource Name (ARN) for each Neptune cluster.",
                      "nested_items": []
                    },
                    {
                      "name": "Readers",
                      "type": "list",
                      "description": "The Amazon Resource Name (ARN) for each read-only secondary cluster associated with the Neptune global database.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "IsWriter",
                      "type": "boolean",
                      "description": "Specifies whether the Neptune cluster is the primary cluster (that is, has read-write capability) for the Neptune global database with which it is associated.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "FailoverState",
              "type": "dict",
              "description": "A data object containing all properties for the current state of an in-process or pending switchover or failover process for this global cluster (Neptune global database). This object is empty unless the SwitchoverGlobalCluster or FailoverGlobalCluster operation was called on this global cluster.",
              "nested_items": [
                {
                  "name": "Status",
                  "type": "string",
                  "description": "The current status of the global cluster. Possible values are as follows:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "pending --- The service received a request to switch over or fail over the global cluster. The global cluster's primary DB cluster and the specified secondary DB cluster are being verified before the operation starts.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "failing-over --- Neptune is promoting the chosen secondary Neptune DB cluster to become the new primary DB cluster to fail over the global cluster.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "cancelling --- The request to switch over or fail over the global cluster was cancelled and the primary Neptune DB cluster and the selected secondary Neptune DB cluster are returning to their previous states.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "switching-over --- This status covers the range of Neptune internal operations that take place during the switchover process, such as demoting the primary Neptune DB cluster, promoting the secondary Neptune DB cluster, and synchronizing replicas.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "FromDbClusterArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the Neptune DB cluster that is currently being demoted, and which is associated with this state.",
                  "nested_items": []
                },
                {
                  "name": "ToDbClusterArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the Neptune DB cluster that is currently being promoted, and which is associated with this state.",
                  "nested_items": []
                },
                {
                  "name": "IsDataLossAllowed",
                  "type": "boolean",
                  "description": "Indicates whether the operation is a global switchover or a global failover. If data loss is allowed, then the operation is a global failover. Otherwise, it's a switchover.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}