{
  "method_name": "describe_launch_configurations",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/autoscaling/client/describe_launch_configurations.html",
  "description": "Gets information about the launch configurations in the account and Region.",
  "parameters": [
    {
      "name": "LaunchConfigurationNames",
      "type": "list",
      "required": false,
      "description": "The launch configuration names. If you omit this property, all launch configurations are described. Array Members: Maximum number of 50 items. (string) ---",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxRecords",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "LaunchConfigurations",
          "type": "list",
          "description": "The launch configurations.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "LaunchConfigurationName",
                  "type": "string",
                  "description": "The name of the launch configuration.",
                  "nested_items": []
                },
                {
                  "name": "LaunchConfigurationARN",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the launch configuration.",
                  "nested_items": []
                },
                {
                  "name": "ImageId",
                  "type": "string",
                  "description": "The ID of the Amazon Machine Image (AMI) to use to launch your EC2 instances. For more information, see Find a Linux AMI in the Amazon EC2 User Guide for Linux Instances.",
                  "nested_items": []
                },
                {
                  "name": "KeyName",
                  "type": "string",
                  "description": "The name of the key pair.",
                  "nested_items": []
                },
                {
                  "name": "SecurityGroups",
                  "type": "list",
                  "description": "A list that contains the security groups to assign to the instances in the Auto Scaling group. For more information, see Control traffic to your Amazon Web Services resources using security groups in the Amazon Virtual Private Cloud User Guide.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "ClassicLinkVPCId",
                  "type": "string",
                  "description": "Available for backward compatibility.",
                  "nested_items": []
                },
                {
                  "name": "ClassicLinkVPCSecurityGroups",
                  "type": "list",
                  "description": "Available for backward compatibility.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "UserData",
                  "type": "string",
                  "description": "The user data to make available to the launched EC2 instances. For more information, see Instance metadata and user data (Linux) and Instance metadata and user data (Windows). If you are using a command line tool, base64-encoding is performed for you, and you can load the text from a file. Otherwise, you must provide base64-encoded text. User data is limited to 16 KB.",
                  "nested_items": []
                },
                {
                  "name": "InstanceType",
                  "type": "string",
                  "description": "The instance type for the instances. For information about available instance types, see Available instance types in the Amazon EC2 User Guide for Linux Instances.",
                  "nested_items": []
                },
                {
                  "name": "KernelId",
                  "type": "string",
                  "description": "The ID of the kernel associated with the AMI.",
                  "nested_items": []
                },
                {
                  "name": "RamdiskId",
                  "type": "string",
                  "description": "The ID of the RAM disk associated with the AMI.",
                  "nested_items": []
                },
                {
                  "name": "BlockDeviceMappings",
                  "type": "list",
                  "description": "The block device mapping entries that define the block devices to attach to the instances at launch. By default, the block devices specified in the block device mapping for the AMI are used. For more information, see Block device mappings in the Amazon EC2 User Guide for Linux Instances.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "VirtualName",
                          "type": "string",
                          "description": "The name of the instance store volume (virtual device) to attach to an instance at launch. The name must be in the form ephemeral*X* where X is a number starting from zero (0), for example, ephemeral0.",
                          "nested_items": []
                        },
                        {
                          "name": "DeviceName",
                          "type": "string",
                          "description": "The device name assigned to the volume (for example, /dev/sdh or xvdh). For more information, see Device naming on Linux instances in the Amazon EC2 User Guide for Linux Instances.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "SnapshotId",
                              "type": "string",
                              "description": "The snapshot ID of the volume to use.",
                              "nested_items": []
                            },
                            {
                              "name": "VolumeSize",
                              "type": "integer",
                              "description": "The volume size, in GiBs. The following are the supported volumes sizes for each volume type:",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "gp2 and gp3: 1-16,384",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "io1: 4-16,384",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "st1 and sc1: 125-16,384",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "standard: 1-1,024",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "VolumeType",
                              "type": "string",
                              "description": "The volume type. For more information, see Amazon EBS volume types in the Amazon EBS User Guide.",
                              "nested_items": []
                            },
                            {
                              "name": "DeleteOnTermination",
                              "type": "boolean",
                              "description": "Indicates whether the volume is deleted on instance termination. For Amazon EC2 Auto Scaling, the default value is true.",
                              "nested_items": []
                            },
                            {
                              "name": "Iops",
                              "type": "integer",
                              "description": "The number of input/output (I/O) operations per second (IOPS) to provision for the volume. For gp3 and io1 volumes, this represents the number of IOPS that are provisioned for the volume. For gp2 volumes, this represents the baseline performance of the volume and the rate at which the volume accumulates I/O credits for bursting.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "gp3: 3,000-16,000 IOPS.",
                                  "nested_items": []
                                },
                                {
                                  "name": "",
                                  "type": "",
                                  "description": "io1: 100-64,000 IOPS.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "Encrypted",
                              "type": "boolean",
                              "description": "Specifies whether the volume should be encrypted. Encrypted EBS volumes can only be attached to instances that support Amazon EBS encryption. For more information, see Requirements for Amazon EBS encryption in the Amazon EBS User Guide. If your AMI uses encrypted volumes, you can also only launch it on supported instance types.",
                              "nested_items": []
                            },
                            {
                              "name": "Throughput",
                              "type": "integer",
                              "description": "The throughput (MiBps) to provision for a gp3 volume.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "NoDevice",
                          "type": "boolean",
                          "description": "Setting this value to true prevents a volume that is included in the block device mapping of the AMI from being mapped to the specified device name at launch.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "InstanceMonitoring",
                  "type": "dict",
                  "description": "Controls whether instances in this group are launched with detailed ( true) or basic ( false) monitoring.",
                  "nested_items": [
                    {
                      "name": "Enabled",
                      "type": "boolean",
                      "description": "If true, detailed monitoring is enabled. Otherwise, basic monitoring is enabled.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "SpotPrice",
                  "type": "string",
                  "description": "The maximum hourly price to be paid for any Spot Instance launched to fulfill the request. Spot Instances are launched when the price you specify exceeds the current Spot price. For more information, see Requesting Spot Instances for fault-tolerant and flexible applications in the Amazon EC2 Auto Scaling User Guide.",
                  "nested_items": []
                },
                {
                  "name": "IamInstanceProfile",
                  "type": "string",
                  "description": "The name or the Amazon Resource Name (ARN) of the instance profile associated with the IAM role for the instance. The instance profile contains the IAM role. For more information, see IAM role for applications that run on Amazon EC2 instances in the Amazon EC2 Auto Scaling User Guide.",
                  "nested_items": []
                },
                {
                  "name": "CreatedTime",
                  "type": "datetime",
                  "description": "The creation date and time for the launch configuration.",
                  "nested_items": []
                },
                {
                  "name": "EbsOptimized",
                  "type": "boolean",
                  "description": "Specifies whether the launch configuration is optimized for EBS I/O ( true) or not ( false). For more information, see Amazon EBS-optimized instances in the Amazon EC2 User Guide for Linux Instances.",
                  "nested_items": []
                },
                {
                  "name": "AssociatePublicIpAddress",
                  "type": "boolean",
                  "description": "Specifies whether to assign a public IPv4 address to the group's instances. If the instance is launched into a default subnet, the default is to assign a public IPv4 address, unless you disabled the option to assign a public IPv4 address on the subnet. If the instance is launched into a nondefault subnet, the default is not to assign a public IPv4 address, unless you enabled the option to assign a public IPv4 address on the subnet. For more information, see Provide network connectivity for your Auto Scaling instances using Amazon VPC in the Amazon EC2 Auto Scaling User Guide.",
                  "nested_items": []
                },
                {
                  "name": "PlacementTenancy",
                  "type": "string",
                  "description": "The tenancy of the instance, either default or dedicated. An instance with dedicated tenancy runs on isolated, single-tenant hardware and can only be launched into a VPC.",
                  "nested_items": []
                },
                {
                  "name": "MetadataOptions",
                  "type": "dict",
                  "description": "The metadata options for the instances. For more information, see Configure the instance metadata options in the Amazon EC2 Auto Scaling User Guide.",
                  "nested_items": [
                    {
                      "name": "HttpTokens",
                      "type": "string",
                      "description": "The state of token usage for your instance metadata requests. If the parameter is not specified in the request, the default state is optional.",
                      "nested_items": []
                    },
                    {
                      "name": "HttpPutResponseHopLimit",
                      "type": "integer",
                      "description": "The desired HTTP PUT response hop limit for instance metadata requests. The larger the number, the further instance metadata requests can travel.",
                      "nested_items": []
                    },
                    {
                      "name": "HttpEndpoint",
                      "type": "string",
                      "description": "This parameter enables or disables the HTTP metadata endpoint on your instances. If the parameter is not specified, the default state is enabled.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "A string that indicates that the response contains more items than can be returned in a single response. To receive additional items, specify this string for the NextToken value when requesting the next set of items. This value is null when there are no more items to return.",
          "nested_items": []
        }
      ]
    }
  ]
}