{
  "method_name": "describe_auto_scaling_instances",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/autoscaling/client/describe_auto_scaling_instances.html",
  "description": "Gets information about the Auto Scaling instances in the account and Region.",
  "parameters": [
    {
      "name": "InstanceIds",
      "type": "list",
      "required": false,
      "description": "The IDs of the instances. If you omit this property, all Auto Scaling instances are described. If you specify an ID that does not exist, it is ignored with no error. Array Members: Maximum number of 50 items. (string) ---",
      "nested_params": []
    },
    {
      "name": "MaxRecords",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "AutoScalingInstances",
          "type": "list",
          "description": "The instances.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "InstanceId",
                  "type": "string",
                  "description": "The ID of the instance.",
                  "nested_items": []
                },
                {
                  "name": "InstanceType",
                  "type": "string",
                  "description": "The instance type of the EC2 instance.",
                  "nested_items": []
                },
                {
                  "name": "AutoScalingGroupName",
                  "type": "string",
                  "description": "The name of the Auto Scaling group for the instance.",
                  "nested_items": []
                },
                {
                  "name": "AvailabilityZone",
                  "type": "string",
                  "description": "The Availability Zone for the instance.",
                  "nested_items": []
                },
                {
                  "name": "LifecycleState",
                  "type": "string",
                  "description": "The lifecycle state for the instance. The Quarantined state is not used. For more information, see Amazon EC2 Auto Scaling instance lifecycle in the Amazon EC2 Auto Scaling User Guide.",
                  "nested_items": []
                },
                {
                  "name": "HealthStatus",
                  "type": "string",
                  "description": "The last reported health status of this instance. Healthy means that the instance is healthy and should remain in service. Unhealthy means that the instance is unhealthy and Amazon EC2 Auto Scaling should terminate and replace it.",
                  "nested_items": []
                },
                {
                  "name": "LaunchConfigurationName",
                  "type": "string",
                  "description": "The launch configuration used to launch the instance. This value is not available if you attached the instance to the Auto Scaling group.",
                  "nested_items": []
                },
                {
                  "name": "LaunchTemplate",
                  "type": "dict",
                  "description": "The launch template for the instance.",
                  "nested_items": [
                    {
                      "name": "LaunchTemplateId",
                      "type": "string",
                      "description": "The ID of the launch template. To get the template ID, use the Amazon EC2 DescribeLaunchTemplates API operation. New launch templates can be created using the Amazon EC2 CreateLaunchTemplate API.",
                      "nested_items": []
                    },
                    {
                      "name": "LaunchTemplateName",
                      "type": "string",
                      "description": "The name of the launch template. To get the template name, use the Amazon EC2 DescribeLaunchTemplates API operation. New launch templates can be created using the Amazon EC2 CreateLaunchTemplate API.",
                      "nested_items": []
                    },
                    {
                      "name": "Version",
                      "type": "string",
                      "description": "The version number, $Latest, or $Default. To get the version number, use the Amazon EC2 DescribeLaunchTemplateVersions API operation. New launch template versions can be created using the Amazon EC2 CreateLaunchTemplateVersion API. If the value is $Latest, Amazon EC2 Auto Scaling selects the latest version of the launch template when launching instances. If the value is $Default, Amazon EC2 Auto Scaling selects the default version of the launch template when launching instances. The default value is $Default.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "ProtectedFromScaleIn",
                  "type": "boolean",
                  "description": "Indicates whether the instance is protected from termination by Amazon EC2 Auto Scaling when scaling in.",
                  "nested_items": []
                },
                {
                  "name": "WeightedCapacity",
                  "type": "string",
                  "description": "The number of capacity units contributed by the instance based on its instance type.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "A string that indicates that the response contains more items than can be returned in a single response. To receive additional items, specify this string for the NextToken value when requesting the next set of items. This value is null when there are no more items to return.",
          "nested_items": []
        }
      ]
    }
  ]
}