{
  "method_name": "describe_instance_refreshes",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/autoscaling/client/describe_instance_refreshes.html",
  "description": "Gets information about the instance refreshes for the specified Auto Scaling group from the previous six weeks. This operation is part of the instance refresh feature in Amazon EC2 Auto Scaling, which helps you update instances in your Auto Scaling group after you make configuration changes. To help you determine the status of an instance refresh, Amazon EC2 Auto Scaling returns information about the instance refreshes you previously initiated, including their status, start time, end time, the percentage of the instance refresh that is complete, and the number of instances remaining to update before the instance refresh is complete. If a rollback is initiated while an instance refresh is in progress, Amazon EC2 Auto Scaling also returns information about the rollback of the instance refresh.",
  "parameters": [
    {
      "name": "AutoScalingGroupName",
      "type": "string",
      "required": true,
      "description": "The name of the Auto Scaling group.",
      "nested_params": []
    },
    {
      "name": "InstanceRefreshIds",
      "type": "list",
      "required": false,
      "description": "One or more instance refresh IDs. (string) ---",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxRecords",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "InstanceRefreshes",
          "type": "list",
          "description": "The instance refreshes for the specified group, sorted by creation timestamp in descending order.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "InstanceRefreshId",
                  "type": "string",
                  "description": "The instance refresh ID.",
                  "nested_items": []
                },
                {
                  "name": "AutoScalingGroupName",
                  "type": "string",
                  "description": "The name of the Auto Scaling group.",
                  "nested_items": []
                },
                {
                  "name": "Status",
                  "type": "string",
                  "description": "The current status for the instance refresh operation:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "Pending - The request was created, but the instance refresh has not started.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "InProgress - An instance refresh is in progress.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Successful - An instance refresh completed successfully.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Failed - An instance refresh failed to complete. You can troubleshoot using the status reason and the scaling activities.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Cancelling - An ongoing instance refresh is being cancelled.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Cancelled - The instance refresh is cancelled.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "RollbackInProgress - An instance refresh is being rolled back.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "RollbackFailed - The rollback failed to complete. You can troubleshoot using the status reason and the scaling activities.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "RollbackSuccessful - The rollback completed successfully.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Baking - Waiting the specified bake time after an instance refresh has finished updating instances.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "StatusReason",
                  "type": "string",
                  "description": "The explanation for the specific status assigned to this operation.",
                  "nested_items": []
                },
                {
                  "name": "StartTime",
                  "type": "datetime",
                  "description": "The date and time at which the instance refresh began.",
                  "nested_items": []
                },
                {
                  "name": "EndTime",
                  "type": "datetime",
                  "description": "The date and time at which the instance refresh ended.",
                  "nested_items": []
                },
                {
                  "name": "PercentageComplete",
                  "type": "integer",
                  "description": "The percentage of the instance refresh that is complete. For each instance replacement, Amazon EC2 Auto Scaling tracks the instance's health status and warm-up time. When the instance's health status changes to healthy and the specified warm-up time passes, the instance is considered updated and is added to the percentage complete.",
                  "nested_items": []
                },
                {
                  "name": "InstancesToUpdate",
                  "type": "integer",
                  "description": "The number of instances remaining to update before the instance refresh is complete.",
                  "nested_items": []
                },
                {
                  "name": "ProgressDetails",
                  "type": "dict",
                  "description": "Additional progress details for an Auto Scaling group that has a warm pool.",
                  "nested_items": [
                    {
                      "name": "LivePoolProgress",
                      "type": "dict",
                      "description": "Reports progress on replacing instances that are in the Auto Scaling group.",
                      "nested_items": [
                        {
                          "name": "PercentageComplete",
                          "type": "integer",
                          "description": "The percentage of instances in the Auto Scaling group that have been replaced. For each instance replacement, Amazon EC2 Auto Scaling tracks the instance's health status and warm-up time. When the instance's health status changes to healthy and the specified warm-up time passes, the instance is considered updated and is added to the percentage complete.",
                          "nested_items": []
                        },
                        {
                          "name": "InstancesToUpdate",
                          "type": "integer",
                          "description": "The number of instances remaining to update.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "WarmPoolProgress",
                      "type": "dict",
                      "description": "Reports progress on replacing instances that are in the warm pool.",
                      "nested_items": [
                        {
                          "name": "PercentageComplete",
                          "type": "integer",
                          "description": "The percentage of instances in the warm pool that have been replaced. For each instance replacement, Amazon EC2 Auto Scaling tracks the instance's health status and warm-up time. When the instance's health status changes to healthy and the specified warm-up time passes, the instance is considered updated and is added to the percentage complete.",
                          "nested_items": []
                        },
                        {
                          "name": "InstancesToUpdate",
                          "type": "integer",
                          "description": "The number of instances remaining to update.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "Preferences",
                  "type": "dict",
                  "description": "The preferences for an instance refresh.",
                  "nested_items": [
                    {
                      "name": "MinHealthyPercentage",
                      "type": "integer",
                      "description": "Specifies the minimum percentage of the group to keep in service, healthy, and ready to use to support your workload to allow the operation to continue. The value is expressed as a percentage of the desired capacity of the Auto Scaling group. Value range is 0 to 100.",
                      "nested_items": []
                    },
                    {
                      "name": "InstanceWarmup",
                      "type": "integer",
                      "description": "A time period, in seconds, during which an instance refresh waits before moving on to replacing the next instance after a new instance enters the InService state.",
                      "nested_items": []
                    },
                    {
                      "name": "CheckpointPercentages",
                      "type": "list",
                      "description": "(Optional) Threshold values for each checkpoint in ascending order. Each number must be unique. To replace all instances in the Auto Scaling group, the last number in the array must be 100.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "integer",
                          "description": "(integer) ---",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "CheckpointDelay",
                      "type": "integer",
                      "description": "(Optional) The amount of time, in seconds, to wait after a checkpoint before continuing. This property is optional, but if you specify a value for it, you must also specify a value for CheckpointPercentages. If you specify a value for CheckpointPercentages and not for CheckpointDelay, the CheckpointDelay defaults to 3600 (1 hour).",
                      "nested_items": []
                    },
                    {
                      "name": "SkipMatching",
                      "type": "boolean",
                      "description": "(Optional) Indicates whether skip matching is enabled. If enabled ( true), then Amazon EC2 Auto Scaling skips replacing instances that match the desired configuration. If no desired configuration is specified, then it skips replacing instances that have the same launch template and instance types that the Auto Scaling group was using before the start of the instance refresh. The default is false.",
                      "nested_items": []
                    },
                    {
                      "name": "AutoRollback",
                      "type": "boolean",
                      "description": "(Optional) Indicates whether to roll back the Auto Scaling group to its previous configuration if the instance refresh fails or a CloudWatch alarm threshold is met. The default is false.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "There is no desired configuration specified for the instance refresh.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "The Auto Scaling group has a launch template that uses an Amazon Web Services Systems Manager parameter instead of an AMI ID for the ImageId property.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "The Auto Scaling group uses the launch template's $Latest or $Default version.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "ScaleInProtectedInstances",
                      "type": "string",
                      "description": "Choose the behavior that you want Amazon EC2 Auto Scaling to use if instances protected from scale in are found.",
                      "nested_items": []
                    },
                    {
                      "name": "StandbyInstances",
                      "type": "string",
                      "description": "Choose the behavior that you want Amazon EC2 Auto Scaling to use if instances in Standby state are found.",
                      "nested_items": []
                    },
                    {
                      "name": "AlarmSpecification",
                      "type": "dict",
                      "description": "(Optional) The CloudWatch alarm specification. CloudWatch alarms can be used to identify any issues and fail the operation if an alarm threshold is met.",
                      "nested_items": [
                        {
                          "name": "Alarms",
                          "type": "list",
                          "description": "The names of one or more CloudWatch alarms to monitor for the instance refresh. You can specify up to 10 alarms.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "MaxHealthyPercentage",
                      "type": "integer",
                      "description": "Specifies the maximum percentage of the group that can be in service and healthy, or pending, to support your workload when replacing instances. The value is expressed as a percentage of the desired capacity of the Auto Scaling group. Value range is 100 to 200.",
                      "nested_items": []
                    },
                    {
                      "name": "BakeTime",
                      "type": "integer",
                      "description": "The amount of time, in seconds, to wait at the end of an instance refresh before the instance refresh is considered complete.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "DesiredConfiguration",
                  "type": "dict",
                  "description": "Describes the desired configuration for the instance refresh.",
                  "nested_items": [
                    {
                      "name": "LaunchTemplate",
                      "type": "dict",
                      "description": "Describes the launch template and the version of the launch template that Amazon EC2 Auto Scaling uses to launch Amazon EC2 instances. For more information about launch templates, see Launch templates in the Amazon EC2 Auto Scaling User Guide.",
                      "nested_items": [
                        {
                          "name": "LaunchTemplateId",
                          "type": "string",
                          "description": "The ID of the launch template. To get the template ID, use the Amazon EC2 DescribeLaunchTemplates API operation. New launch templates can be created using the Amazon EC2 CreateLaunchTemplate API.",
                          "nested_items": []
                        },
                        {
                          "name": "LaunchTemplateName",
                          "type": "string",
                          "description": "The name of the launch template. To get the template name, use the Amazon EC2 DescribeLaunchTemplates API operation. New launch templates can be created using the Amazon EC2 CreateLaunchTemplate API.",
                          "nested_items": []
                        },
                        {
                          "name": "Version",
                          "type": "string",
                          "description": "The version number, $Latest, or $Default. To get the version number, use the Amazon EC2 DescribeLaunchTemplateVersions API operation. New launch template versions can be created using the Amazon EC2 CreateLaunchTemplateVersion API. If the value is $Latest, Amazon EC2 Auto Scaling selects the latest version of the launch template when launching instances. If the value is $Default, Amazon EC2 Auto Scaling selects the default version of the launch template when launching instances. The default value is $Default.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "MixedInstancesPolicy",
                      "type": "dict",
                      "description": "Use this structure to launch multiple instance types and On-Demand Instances and Spot Instances within a single Auto Scaling group.",
                      "nested_items": [
                        {
                          "name": "LaunchTemplate",
                          "type": "dict",
                          "description": "One or more launch templates and the instance types (overrides) that are used to launch EC2 instances to fulfill On-Demand and Spot capacities.",
                          "nested_items": [
                            {
                              "name": "LaunchTemplateSpecification",
                              "type": "dict",
                              "description": "The launch template.",
                              "nested_items": [
                                {
                                  "name": "LaunchTemplateId",
                                  "type": "string",
                                  "description": "The ID of the launch template. To get the template ID, use the Amazon EC2 DescribeLaunchTemplates API operation. New launch templates can be created using the Amazon EC2 CreateLaunchTemplate API.",
                                  "nested_items": []
                                },
                                {
                                  "name": "LaunchTemplateName",
                                  "type": "string",
                                  "description": "The name of the launch template. To get the template name, use the Amazon EC2 DescribeLaunchTemplates API operation. New launch templates can be created using the Amazon EC2 CreateLaunchTemplate API.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Version",
                                  "type": "string",
                                  "description": "The version number, $Latest, or $Default. To get the version number, use the Amazon EC2 DescribeLaunchTemplateVersions API operation. New launch template versions can be created using the Amazon EC2 CreateLaunchTemplateVersion API. If the value is $Latest, Amazon EC2 Auto Scaling selects the latest version of the launch template when launching instances. If the value is $Default, Amazon EC2 Auto Scaling selects the default version of the launch template when launching instances. The default value is $Default.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "Overrides",
                              "type": "list",
                              "description": "Any properties that you specify override the same properties in the launch template.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "Override the instance type that is specified in the launch template.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "Use multiple instance types.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "name": "InstancesDistribution",
                          "type": "dict",
                          "description": "The instances distribution.",
                          "nested_items": [
                            {
                              "name": "OnDemandAllocationStrategy",
                              "type": "string",
                              "description": "The allocation strategy to apply to your On-Demand Instances when they are launched. Possible instance types are determined by the launch template overrides that you specify.",
                              "nested_items": []
                            },
                            {
                              "name": "OnDemandBaseCapacity",
                              "type": "integer",
                              "description": "The minimum amount of the Auto Scaling group's capacity that must be fulfilled by On-Demand Instances. This base portion is launched first as your group scales.",
                              "nested_items": []
                            },
                            {
                              "name": "OnDemandPercentageAboveBaseCapacity",
                              "type": "integer",
                              "description": "Controls the percentages of On-Demand Instances and Spot Instances for your additional capacity beyond OnDemandBaseCapacity. Expressed as a number (for example, 20 specifies 20% On-Demand Instances, 80% Spot Instances). If set to 100, only On-Demand Instances are used.",
                              "nested_items": []
                            },
                            {
                              "name": "SpotAllocationStrategy",
                              "type": "string",
                              "description": "The allocation strategy to apply to your Spot Instances when they are launched. Possible instance types are determined by the launch template overrides that you specify.",
                              "nested_items": []
                            },
                            {
                              "name": "SpotInstancePools",
                              "type": "integer",
                              "description": "The number of Spot Instance pools across which to allocate your Spot Instances. The Spot pools are determined from the different instance types in the overrides. Valid only when the SpotAllocationStrategy is lowest-price. Value must be in the range of 1---20.",
                              "nested_items": []
                            },
                            {
                              "name": "SpotMaxPrice",
                              "type": "string",
                              "description": "The maximum price per unit hour that you are willing to pay for a Spot Instance. If your maximum price is lower than the Spot price for the instance types that you selected, your Spot Instances are not launched. We do not recommend specifying a maximum price because it can lead to increased interruptions. When Spot Instances launch, you pay the current Spot price. To remove a maximum price that you previously set, include the property but specify an empty string ('') for the value.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "RollbackDetails",
                  "type": "dict",
                  "description": "The rollback details.",
                  "nested_items": [
                    {
                      "name": "RollbackReason",
                      "type": "string",
                      "description": "The reason for this instance refresh rollback (for example, whether a manual or automatic rollback was initiated).",
                      "nested_items": []
                    },
                    {
                      "name": "RollbackStartTime",
                      "type": "datetime",
                      "description": "The date and time at which the rollback began.",
                      "nested_items": []
                    },
                    {
                      "name": "PercentageCompleteOnRollback",
                      "type": "integer",
                      "description": "Indicates the value of PercentageComplete at the time the rollback started.",
                      "nested_items": []
                    },
                    {
                      "name": "InstancesToUpdateOnRollback",
                      "type": "integer",
                      "description": "Indicates the value of InstancesToUpdate at the time the rollback started.",
                      "nested_items": []
                    },
                    {
                      "name": "ProgressDetailsOnRollback",
                      "type": "dict",
                      "description": "Reports progress on replacing instances in an Auto Scaling group that has a warm pool. This includes separate details for instances in the warm pool and instances in the Auto Scaling group (the live pool).",
                      "nested_items": [
                        {
                          "name": "LivePoolProgress",
                          "type": "dict",
                          "description": "Reports progress on replacing instances that are in the Auto Scaling group.",
                          "nested_items": [
                            {
                              "name": "PercentageComplete",
                              "type": "integer",
                              "description": "The percentage of instances in the Auto Scaling group that have been replaced. For each instance replacement, Amazon EC2 Auto Scaling tracks the instance's health status and warm-up time. When the instance's health status changes to healthy and the specified warm-up time passes, the instance is considered updated and is added to the percentage complete.",
                              "nested_items": []
                            },
                            {
                              "name": "InstancesToUpdate",
                              "type": "integer",
                              "description": "The number of instances remaining to update.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "WarmPoolProgress",
                          "type": "dict",
                          "description": "Reports progress on replacing instances that are in the warm pool.",
                          "nested_items": [
                            {
                              "name": "PercentageComplete",
                              "type": "integer",
                              "description": "The percentage of instances in the warm pool that have been replaced. For each instance replacement, Amazon EC2 Auto Scaling tracks the instance's health status and warm-up time. When the instance's health status changes to healthy and the specified warm-up time passes, the instance is considered updated and is added to the percentage complete.",
                              "nested_items": []
                            },
                            {
                              "name": "InstancesToUpdate",
                              "type": "integer",
                              "description": "The number of instances remaining to update.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "A string that indicates that the response contains more items than can be returned in a single response. To receive additional items, specify this string for the NextToken value when requesting the next set of items. This value is null when there are no more items to return.",
          "nested_items": []
        }
      ]
    }
  ]
}