{
  "method_name": "execute_policy",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/autoscaling/client/execute_policy.html",
  "description": "Executes the specified policy. This can be useful for testing the design of your scaling policy.",
  "parameters": [
    {
      "name": "AutoScalingGroupName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "PolicyName",
      "type": "string",
      "required": true,
      "description": "The name or ARN of the policy.",
      "nested_params": []
    },
    {
      "name": "HonorCooldown",
      "type": "boolean",
      "required": false,
      "description": "Indicates whether Amazon EC2 Auto Scaling waits for the cooldown period to complete before executing the policy. Valid only if the policy type is SimpleScaling. For more information, see Scaling cooldowns for Amazon EC2 Auto Scaling in the Amazon EC2 Auto Scaling User Guide.",
      "nested_params": []
    },
    {
      "name": "MetricValue",
      "type": "float",
      "required": false,
      "description": "The metric value to compare to BreachThreshold. This enables you to execute a policy of type StepScaling and determine which step adjustment to use. For example, if the breach threshold is 50 and you want to use a step adjustment with a lower bound of 0 and an upper bound of 10, you can set the metric value to 59. If you specify a metric value that doesn't correspond to a step adjustment for the policy, the call returns an error. Required if the policy type is StepScaling and not supported otherwise.",
      "nested_params": []
    },
    {
      "name": "BreachThreshold",
      "type": "float",
      "required": false,
      "description": "The breach threshold for the alarm. Required if the policy type is StepScaling and not supported otherwise.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}