{
  "method_name": "create_custom_line_item",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/billingconductor/client/create_custom_line_item.html",
  "description": "Creates a custom line item that can be used to create a one-time fixed charge that can be applied to a single billing group for the current or previous billing period. The one-time fixed charge is either a fee or discount.",
  "parameters": [
    {
      "name": "ClientToken",
      "type": "string",
      "required": false,
      "description": "The token that is needed to support idempotency. Idempotency isn't currently supported, but will be implemented in a future update. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "The name of the custom line item.",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": true,
      "description": "The description of the custom line item. This is shown on the Bills page in association with the charge value.",
      "nested_params": []
    },
    {
      "name": "BillingGroupArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) that references the billing group where the custom line item applies to.",
      "nested_params": []
    },
    {
      "name": "BillingPeriodRange",
      "type": "dict",
      "required": true,
      "description": "A time range for which the custom line item is effective. The inclusive start billing period that defines a billing period range where a custom line is applied. ExclusiveEndBillingPeriod (string) --- The inclusive end billing period that defines a billing period range where a custom line is applied.",
      "nested_params": [
        {
          "name": "InclusiveStartBillingPeriod",
          "type": "string",
          "required": false,
          "description": "The inclusive start billing period that defines a billing period range where a custom line is applied.",
          "nested_params": []
        },
        {
          "name": "ExclusiveEndBillingPeriod",
          "type": "string",
          "required": false,
          "description": "The inclusive end billing period that defines a billing period range where a custom line is applied.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Tags",
      "type": "dict",
      "required": false,
      "description": "A map that contains tag keys and tag values that are attached to a custom line item. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "ChargeDetails",
      "type": "dict",
      "required": true,
      "description": "A CustomLineItemChargeDetails that describes the charge details for a custom line item. Flat (dict) --- A CustomLineItemFlatChargeDetails that describes the charge details of a flat custom line item. The custom line item's fixed charge value in USD. Percentage (dict) --- A CustomLineItemPercentageChargeDetails that describes the charge details of a percentage custom line item. The custom line item's percentage value. This will be multiplied against the combined value of its associated resources to determine its charge value. AssociatedValues (list) --- A list of resource ARNs to associate to the percentage custom line item. (string) --- The type of the custom line item that indicates whether the charge is a fee or credit. LineItemFilters (list) --- A representation of the line item filter. (dict) --- A representation of the line item filter for your custom line item. You can use line item filters to include or exclude specific resource values from the billing group's total cost. For example, if you create a custom line item and you want to filter out a value, such as Savings Plan discounts, you can update LineItemFilter to exclude it. The attribute of the line item filter. This specifies what attribute that you can filter on. The match criteria of the line item filter. This parameter specifies whether not to include the resource value from the billing group total cost. The values of the line item filter. This specifies the values to filter on. Currently, you can only exclude Savings Plan discounts. (string) ---",
      "nested_params": [
        {
          "name": "Flat",
          "type": "dict",
          "required": false,
          "description": "A CustomLineItemFlatChargeDetails that describes the charge details of a flat custom line item.",
          "nested_params": [
            {
              "name": "ChargeValue",
              "type": "float",
              "required": false,
              "description": "The custom line item's fixed charge value in USD.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Percentage",
          "type": "dict",
          "required": false,
          "description": "A CustomLineItemPercentageChargeDetails that describes the charge details of a percentage custom line item.",
          "nested_params": [
            {
              "name": "PercentageValue",
              "type": "float",
              "required": false,
              "description": "The custom line item's percentage value. This will be multiplied against the combined value of its associated resources to determine its charge value.",
              "nested_params": []
            },
            {
              "name": "AssociatedValues",
              "type": "list",
              "required": false,
              "description": "A list of resource ARNs to associate to the percentage custom line item.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Type",
          "type": "string",
          "required": false,
          "description": "The type of the custom line item that indicates whether the charge is a fee or credit.",
          "nested_params": []
        },
        {
          "name": "LineItemFilters",
          "type": "list",
          "required": false,
          "description": "A representation of the line item filter.",
          "nested_params": [
            {
              "name": "Attribute",
              "type": "string",
              "required": false,
              "description": "The attribute of the line item filter. This specifies what attribute that you can filter on.",
              "nested_params": []
            },
            {
              "name": "MatchOption",
              "type": "string",
              "required": false,
              "description": "The match criteria of the line item filter. This parameter specifies whether not to include the resource value from the billing group total cost.",
              "nested_params": []
            },
            {
              "name": "Values",
              "type": "list",
              "required": false,
              "description": "The values of the line item filter. This specifies the values to filter on. Currently, you can only exclude Savings Plan discounts.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "AccountId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Arn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the created custom line item.",
          "nested_items": []
        }
      ]
    }
  ]
}