{
  "method_name": "get_tag_sync_task",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/resource-groups/client/get_tag_sync_task.html",
  "description": "Returns information about a specified tag-sync task. To run this command, you must have the following permissions:",
  "parameters": [
    {
      "name": "TaskArn",
      "type": "string",
      "required": true,
      "description": "The Amazon resource name (ARN) of the tag-sync task.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "GroupArn",
          "type": "string",
          "description": "The Amazon resource name (ARN) of the application group.",
          "nested_items": []
        },
        {
          "name": "GroupName",
          "type": "string",
          "description": "The name of the application group.",
          "nested_items": []
        },
        {
          "name": "TaskArn",
          "type": "string",
          "description": "The Amazon resource name (ARN) of the tag-sync task.",
          "nested_items": []
        },
        {
          "name": "TagKey",
          "type": "string",
          "description": "The tag key.",
          "nested_items": []
        },
        {
          "name": "TagValue",
          "type": "string",
          "description": "The tag value.",
          "nested_items": []
        },
        {
          "name": "ResourceQuery",
          "type": "dict",
          "description": "The query you can use to define a resource group or a search for resources. A ResourceQuery specifies both a query Type and a Query string as JSON string objects. See the examples section for example JSON strings. For more information about creating a resource group with a resource query, see Build queries and groups in Resource Groups in the Resource Groups User Guide.",
          "nested_items": [
            {
              "name": "Type",
              "type": "string",
              "description": "The type of the query to perform. This can have one of two values:",
              "nested_items": [
                {
                  "name": "",
                  "type": "ARN",
                  "description": "CLOUDFORMATION_STACK_1_0: Specifies that you want the group to contain the members of an CloudFormation stack. The Query contains a StackIdentifier element with an Amazon resource name (ARN) for a CloudFormation stack.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "TAG_FILTERS_1_0: Specifies that you want the group to include resource that have tags that match the query.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Query",
              "type": "string",
              "description": "The query that defines a group or a search. The contents depends on the value of the Type element.",
              "nested_items": [
                {
                  "name": "",
                  "type": "a JSON array",
                  "description": "ResourceTypeFilters --- Applies to all ResourceQuery objects of either Type. This element contains one of the following two items:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "The value AWS::AllSupported. This causes the ResourceQuery to match resources of any resource type that also match the query.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "a JSON array",
                      "description": "A list (a JSON array) of resource type identifiers that limit the query to only resources of the specified types. For the complete list of resource types that you can use in the array value for ResourceTypeFilters, see Resources you can use with Resource Groups and Tag Editor in the Resource Groups User Guide.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "RoleArn",
          "type": "string",
          "description": "The Amazon resource name (ARN) of the role assumed by Resource Groups to tag and untag resources on your behalf.",
          "nested_items": []
        },
        {
          "name": "Status",
          "type": "string",
          "description": "The status of the tag-sync task.",
          "nested_items": [
            {
              "name": "",
              "type": "",
              "description": "ACTIVE - The tag-sync task is actively managing resources in the application by adding or removing the awsApplication tag from resources when they are tagged or untagged with the specified tag key-value pair.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "",
              "description": "ERROR - The tag-sync task is not actively managing resources in the application. Review the ErrorMessage for more information about resolving the error.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "ErrorMessage",
          "type": "string",
          "description": "The specific error message in cases where the tag-sync task status is ERROR.",
          "nested_items": []
        },
        {
          "name": "CreatedAt",
          "type": "datetime",
          "description": "The timestamp of when the tag-sync task was created.",
          "nested_items": []
        }
      ]
    }
  ]
}