{
  "method_name": "get_group_query",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/resource-groups/client/get_group_query.html",
  "description": "Retrieves the resource query associated with the specified resource group. For more information about resource queries, see Create a tag-based group in Resource Groups. To run this command, you must have the following permissions:",
  "parameters": [
    {
      "name": "GroupName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Group",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "GroupQuery",
          "type": "dict",
          "description": "The resource query associated with the specified group. For more information about resource queries, see Create a tag-based group in Resource Groups.",
          "nested_items": [
            {
              "name": "GroupName",
              "type": "string",
              "description": "The name of the resource group that is associated with the specified resource query.",
              "nested_items": []
            },
            {
              "name": "ResourceQuery",
              "type": "dict",
              "description": "The resource query that determines which Amazon Web Services resources are members of the associated resource group.",
              "nested_items": [
                {
                  "name": "Type",
                  "type": "string",
                  "description": "The type of the query to perform. This can have one of two values:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "ARN",
                      "description": "CLOUDFORMATION_STACK_1_0: Specifies that you want the group to contain the members of an CloudFormation stack. The Query contains a StackIdentifier element with an Amazon resource name (ARN) for a CloudFormation stack.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "TAG_FILTERS_1_0: Specifies that you want the group to include resource that have tags that match the query.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Query",
                  "type": "string",
                  "description": "The query that defines a group or a search. The contents depends on the value of the Type element.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "a JSON array",
                      "description": "ResourceTypeFilters --- Applies to all ResourceQuery objects of either Type. This element contains one of the following two items:",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "The value AWS::AllSupported. This causes the ResourceQuery to match resources of any resource type that also match the query.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "a JSON array",
                          "description": "A list (a JSON array) of resource type identifiers that limit the query to only resources of the specified types. For the complete list of resource types that you can use in the array value for ResourceTypeFilters, see Resources you can use with Resource Groups and Tag Editor in the Resource Groups User Guide.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}