{
  "method_name": "put_group_configuration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/resource-groups/client/put_group_configuration.html",
  "description": "Attaches a service configuration to the specified group. This occurs asynchronously, and can take time to complete. You can use  GetGroupConfiguration to check the status of the update. To run this command, you must have the following permissions:",
  "parameters": [
    {
      "name": "Group",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Configuration",
      "type": "list",
      "required": true,
      "description": "The new configuration to associate with the specified group. A configuration associates the resource group with an Amazon Web Services service and specifies how the service can interact with the resources in the group. A configuration is an array of  GroupConfigurationItem elements. For information about the syntax of a service configuration, see Service configurations for Resource Groups. (dict) --- An item in a group configuration. A group service configuration can have one or more items. For details about group service configuration syntax, see Service configurations for resource groups. Specifies the type of group configuration item. Each item must have a unique value for type. For the list of types that you can specify for a configuration item, see Supported resource types and parameters. Parameters (list) --- A collection of parameters for this group configuration item. For the list of parameters that you can use with each configuration item type, see Supported resource types and parameters. (dict) --- A parameter for a group configuration item. The name of the group configuration parameter. Values (list) --- The value or values to be used for the specified parameter. For the list of values you can use with each parameter, see Supported resource types and parameters. (string) ---",
      "nested_params": [
        {
          "name": "Type",
          "type": "string",
          "required": false,
          "description": "Specifies the type of group configuration item. Each item must have a unique value for type. For the list of types that you can specify for a configuration item, see Supported resource types and parameters.",
          "nested_params": []
        },
        {
          "name": "Parameters",
          "type": "list",
          "required": false,
          "description": "A collection of parameters for this group configuration item. For the list of parameters that you can use with each configuration item type, see Supported resource types and parameters.",
          "nested_params": [
            {
              "name": "Name",
              "type": "string",
              "required": false,
              "description": "The name of the group configuration parameter. For the list of parameters that you can use with each configuration item type, see Supported resource types and parameters.",
              "nested_params": []
            },
            {
              "name": "Values",
              "type": "list",
              "required": false,
              "description": "The value or values to be used for the specified parameter. For the list of values you can use with each parameter, see Supported resource types and parameters.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}