{
  "method_name": "create_policy_store",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/verifiedpermissions/client/create_policy_store.html",
  "description": "Creates a policy store. A policy store is a container for policy resources.",
  "parameters": [
    {
      "name": "clientToken",
      "type": "string",
      "required": false,
      "description": "Specifies a unique, case-sensitive ID that you provide to ensure the idempotency of the request. This lets you safely retry the request without accidentally performing the same operation a second time. Passing the same value to a later call to an operation requires that you also pass the same value for all other parameters. We recommend that you use a UUID type of value.. If you don't provide this value, then Amazon Web Services generates a random one for you. If you retry the operation with the same ClientToken, but with different parameters, the retry fails with an ConflictException error. Verified Permissions recognizes a ClientToken for eight hours. After eight hours, the next request with the same parameters performs the operation again regardless of the value of ClientToken. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "validationSettings",
      "type": "dict",
      "required": true,
      "description": "Specifies the validation setting for this policy store. Currently, the only valid and required value is Mode. The validation mode currently configured for this policy store. The valid values are: OFF --- Neither Verified Permissions nor Cedar perform any validation on policies. No validation errors are reported by either service. STRICT --- Requires a schema to be present in the policy store. Cedar performs validation on all submitted new or updated static policies and policy templates. Any that fail validation are rejected and Cedar doesn't store them in the policy store.",
      "nested_params": [
        {
          "name": "mode",
          "type": "string",
          "required": false,
          "description": "The validation mode currently configured for this policy store. The valid values are:",
          "nested_params": [
            {
              "name": "OFF",
              "type": "",
              "required": false,
              "description": "",
              "nested_params": []
            },
            {
              "name": "STRICT",
              "type": "",
              "required": false,
              "description": "",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "deletionProtection",
      "type": "string",
      "required": false,
      "description": "Specifies whether the policy store can be deleted. If enabled, the policy store can't be deleted. The default state is DISABLED.",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "dict",
      "required": false,
      "description": "The list of key-value pairs to associate with the policy store. (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "policyStoreId",
          "type": "string",
          "description": "The unique ID of the new policy store.",
          "nested_items": []
        },
        {
          "name": "arn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the new policy store.",
          "nested_items": []
        },
        {
          "name": "createdDate",
          "type": "datetime",
          "description": "The date and time the policy store was originally created.",
          "nested_items": []
        },
        {
          "name": "lastUpdatedDate",
          "type": "datetime",
          "description": "The date and time the policy store was last updated.",
          "nested_items": []
        }
      ]
    }
  ]
}