{
  "method_name": "update_identity_source",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/verifiedpermissions/client/update_identity_source.html",
  "description": "Updates the specified identity source to use a new identity provider (IdP), or to change the mapping of identities from the IdP to a different principal entity type.",
  "parameters": [
    {
      "name": "policyStoreId",
      "type": "string",
      "required": true,
      "description": "Specifies the ID of the policy store that contains the identity source that you want to update.",
      "nested_params": []
    },
    {
      "name": "identitySourceId",
      "type": "string",
      "required": true,
      "description": "Specifies the ID of the identity source that you want to update.",
      "nested_params": []
    },
    {
      "name": "updateConfiguration",
      "type": "dict",
      "required": true,
      "description": "Specifies the details required to communicate with the identity provider (IdP) associated with this identity source. cognitoUserPoolConfiguration (dict) --- Contains configuration details of a Amazon Cognito user pool. The Amazon Resource Name (ARN) of the Amazon Cognito user pool associated with this identity source. clientIds (list) --- The client ID of an app client that is configured for the specified Amazon Cognito user pool. (string) --- groupConfiguration (dict) --- The configuration of the user groups from an Amazon Cognito user pool identity source. The name of the schema entity type that's mapped to the user pool group. Defaults to AWS::CognitoGroup. openIdConnectConfiguration (dict) --- Contains configuration details of an OpenID Connect (OIDC) identity provider, or identity source, that Verified Permissions can use to generate entities from authenticated identities. It specifies the issuer URL, token type that you want to use, and policy store entity details. The issuer URL of an OIDC identity provider. This URL must have an OIDC discovery endpoint at the path .well-known/openid-configuration. entityIdPrefix (string) --- A descriptive string that you want to prefix to user entities from your OIDC identity provider. For example, if you set an entityIdPrefix of MyOIDCProvider, you can reference principals in your policies in the format MyCorp::User::MyOIDCProvider|Carlos. groupConfiguration (dict) --- The claim in OIDC identity provider tokens that indicates a user's group membership, and the entity type that you want to map it to. For example, this object can map the contents of a groups claim to MyCorp::UserGroup. The token claim that you want Verified Permissions to interpret as group membership. For example, groups. The policy store entity type that you want to map your users' group claim to. For example, MyCorp::UserGroup. A group entity type is an entity that can have a user entity type as a member. The token type that you want to process from your OIDC identity provider. Your policy store can process either identity (ID) or access tokens from a given OIDC identity source. accessTokenOnly (dict) --- The OIDC configuration for processing access tokens. Contains allowed audience claims, for example https://auth.example.com, and the claim that you want to map to the principal, for example sub. principalIdClaim (string) --- The claim that determines the principal in OIDC access tokens. For example, sub. audiences (list) --- The access token aud claim values that you want to accept in your policy store. For example, https://myapp.example.com, https://myapp2.example.com. (string) --- identityTokenOnly (dict) --- The OIDC configuration for processing identity (ID) tokens. Contains allowed client ID claims, for example 1example23456789, and the claim that you want to map to the principal, for example sub. clientIds (list) --- The ID token audience, or client ID, claim values that you want to accept in your policy store from an OIDC identity provider. For example, 1example23456789, 2example10111213. (string) ---",
      "nested_params": [
        {
          "name": "cognitoUserPoolConfiguration",
          "type": "dict",
          "required": false,
          "description": "Contains configuration details of a Amazon Cognito user pool.",
          "nested_params": [
            {
              "name": "userPoolArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of the Amazon Cognito user pool associated with this identity source.",
              "nested_params": []
            },
            {
              "name": "clientIds",
              "type": "list",
              "required": false,
              "description": "The client ID of an app client that is configured for the specified Amazon Cognito user pool.",
              "nested_params": []
            },
            {
              "name": "groupConfiguration",
              "type": "dict",
              "required": false,
              "description": "The configuration of the user groups from an Amazon Cognito user pool identity source.",
              "nested_params": [
                {
                  "name": "groupEntityType",
                  "type": "string",
                  "required": false,
                  "description": "The name of the schema entity type that's mapped to the user pool group. Defaults to AWS::CognitoGroup.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "openIdConnectConfiguration",
          "type": "dict",
          "required": false,
          "description": "Contains configuration details of an OpenID Connect (OIDC) identity provider, or identity source, that Verified Permissions can use to generate entities from authenticated identities. It specifies the issuer URL, token type that you want to use, and policy store entity details.",
          "nested_params": [
            {
              "name": "issuer",
              "type": "string",
              "required": false,
              "description": "The issuer URL of an OIDC identity provider. This URL must have an OIDC discovery endpoint at the path .well-known/openid-configuration.",
              "nested_params": []
            },
            {
              "name": "entityIdPrefix",
              "type": "string",
              "required": false,
              "description": "A descriptive string that you want to prefix to user entities from your OIDC identity provider. For example, if you set an entityIdPrefix of MyOIDCProvider, you can reference principals in your policies in the format MyCorp::User::MyOIDCProvider|Carlos.",
              "nested_params": []
            },
            {
              "name": "groupConfiguration",
              "type": "dict",
              "required": false,
              "description": "The claim in OIDC identity provider tokens that indicates a user's group membership, and the entity type that you want to map it to. For example, this object can map the contents of a groups claim to MyCorp::UserGroup.",
              "nested_params": [
                {
                  "name": "groupClaim",
                  "type": "string",
                  "required": false,
                  "description": "The token claim that you want Verified Permissions to interpret as group membership. For example, groups.",
                  "nested_params": []
                },
                {
                  "name": "groupEntityType",
                  "type": "string",
                  "required": false,
                  "description": "The policy store entity type that you want to map your users' group claim to. For example, MyCorp::UserGroup. A group entity type is an entity that can have a user entity type as a member.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "tokenSelection",
              "type": "dict",
              "required": false,
              "description": "The token type that you want to process from your OIDC identity provider. Your policy store can process either identity (ID) or access tokens from a given OIDC identity source.",
              "nested_params": [
                {
                  "name": "accessTokenOnly",
                  "type": "dict",
                  "required": false,
                  "description": "The OIDC configuration for processing access tokens. Contains allowed audience claims, for example https://auth.example.com, and the claim that you want to map to the principal, for example sub.",
                  "nested_params": [
                    {
                      "name": "principalIdClaim",
                      "type": "string",
                      "required": false,
                      "description": "The claim that determines the principal in OIDC access tokens. For example, sub.",
                      "nested_params": []
                    },
                    {
                      "name": "audiences",
                      "type": "list",
                      "required": false,
                      "description": "The access token aud claim values that you want to accept in your policy store. For example, https://myapp.example.com, https://myapp2.example.com.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "identityTokenOnly",
                  "type": "dict",
                  "required": false,
                  "description": "The OIDC configuration for processing identity (ID) tokens. Contains allowed client ID claims, for example 1example23456789, and the claim that you want to map to the principal, for example sub.",
                  "nested_params": [
                    {
                      "name": "principalIdClaim",
                      "type": "string",
                      "required": false,
                      "description": "The claim that determines the principal in OIDC access tokens. For example, sub.",
                      "nested_params": []
                    },
                    {
                      "name": "clientIds",
                      "type": "list",
                      "required": false,
                      "description": "The ID token audience, or client ID, claim values that you want to accept in your policy store from an OIDC identity provider. For example, 1example23456789, 2example10111213.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "principalEntityType",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "createdDate",
          "type": "datetime",
          "description": "The date and time that the updated identity source was originally created.",
          "nested_items": []
        },
        {
          "name": "identitySourceId",
          "type": "string",
          "description": "The ID of the updated identity source.",
          "nested_items": []
        },
        {
          "name": "lastUpdatedDate",
          "type": "datetime",
          "description": "The date and time that the identity source was most recently updated.",
          "nested_items": []
        },
        {
          "name": "policyStoreId",
          "type": "string",
          "description": "The ID of the policy store that contains the updated identity source.",
          "nested_items": []
        }
      ]
    }
  ]
}