{
  "method_name": "import_decoder_manifest",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/iotfleetwise/client/import_decoder_manifest.html",
  "description": "Creates a decoder manifest using your existing CAN DBC file from your local device. The CAN signal name must be unique and not repeated across CAN message definitions in a .dbc file.",
  "parameters": [
    {
      "name": "name",
      "type": "string",
      "required": true,
      "description": "The name of the decoder manifest to import.",
      "nested_params": []
    },
    {
      "name": "networkFileDefinitions",
      "type": "list",
      "required": true,
      "description": "The file to load into an Amazon Web Services account. (dict) --- Specifications for defining a vehicle network. canDbc (dict) --- Information, including CAN DBC files, about the configurations used to create a decoder manifest. Contains information about a network interface. A list of DBC files. You can upload only one DBC file for each network interface and specify up to five (inclusive) files in the list. The DBC file can be a maximum size of 200 MB. (bytes) --- signalsMap (dict) --- Pairs every signal specified in your vehicle model with a signal decoder. (string) --- (string) ---",
      "nested_params": [
        {
          "name": "canDbc",
          "type": "dict",
          "required": false,
          "description": "Information, including CAN DBC files, about the configurations used to create a decoder manifest.",
          "nested_params": [
            {
              "name": "networkInterface",
              "type": "string",
              "required": false,
              "description": "Contains information about a network interface.",
              "nested_params": []
            },
            {
              "name": "canDbcFiles",
              "type": "list",
              "required": false,
              "description": "A list of DBC files. You can upload only one DBC file for each network interface and specify up to five (inclusive) files in the list. The DBC file can be a maximum size of 200 MB.",
              "nested_params": []
            },
            {
              "name": "signalsMap",
              "type": "dict",
              "required": false,
              "description": "Pairs every signal specified in your vehicle model with a signal decoder.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "name",
          "type": "string",
          "description": "The name of the imported decoder manifest.",
          "nested_items": []
        },
        {
          "name": "arn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the decoder manifest that was imported.",
          "nested_items": []
        }
      ]
    }
  ]
}