{
  "method_name": "create_hit",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/mturk/client/create_hit.html",
  "description": "The CreateHIT operation creates a new Human Intelligence Task (HIT). The new HIT is made available for Workers to find and accept on the Amazon Mechanical Turk website. This operation allows you to specify a new HIT by passing in values for the properties of the HIT, such as its title, reward amount and number of assignments. When you pass these values to CreateHIT, a new HIT is created for you, with a new HITTypeID. The HITTypeID can be used to create additional HITs in the future without needing to specify common parameters such as the title, description and reward amount each time. An alternative way to create HITs is to first generate a HITTypeID using the CreateHITType operation and then call the CreateHITWithHITType operation. This is the recommended best practice for Requesters who are creating large numbers of HITs. CreateHIT also supports several ways to provide question data: by providing a value for the Question parameter that fully specifies the contents of the HIT, or by providing a HitLayoutId and associated HitLayoutParameters.",
  "parameters": [
    {
      "name": "MaxAssignments",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "AutoApprovalDelayInSeconds",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "LifetimeInSeconds",
      "type": "integer",
      "required": true,
      "description": "An amount of time, in seconds, after which the HIT is no longer available for users to accept. After the lifetime of the HIT elapses, the HIT no longer appears in HIT searches, even if not all of the assignments for the HIT have been accepted.",
      "nested_params": []
    },
    {
      "name": "AssignmentDurationInSeconds",
      "type": "integer",
      "required": true,
      "description": "The amount of time, in seconds, that a Worker has to complete the HIT after accepting it. If a Worker does not complete the assignment within the specified duration, the assignment is considered abandoned. If the HIT is still active (that is, its lifetime has not elapsed), the assignment becomes available for other users to find and accept.",
      "nested_params": []
    },
    {
      "name": "Reward",
      "type": "string",
      "required": true,
      "description": "The amount of money the Requester will pay a Worker for successfully completing the HIT.",
      "nested_params": []
    },
    {
      "name": "Title",
      "type": "string",
      "required": true,
      "description": "The title of the HIT. A title should be short and descriptive about the kind of task the HIT contains. On the Amazon Mechanical Turk web site, the HIT title appears in search results, and everywhere the HIT is mentioned.",
      "nested_params": []
    },
    {
      "name": "Keywords",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": true,
      "description": "A general description of the HIT. A description includes detailed information about the kind of task the HIT contains. On the Amazon Mechanical Turk web site, the HIT description appears in the expanded view of search results, and in the HIT and assignment screens. A good description gives the user enough information to evaluate the HIT before accepting it.",
      "nested_params": []
    },
    {
      "name": "Question",
      "type": "string",
      "required": false,
      "description": "The data the person completing the HIT uses to produce the results. Constraints: Must be a QuestionForm data structure, an ExternalQuestion data structure, or an HTMLQuestion data structure. The XML question data must not be larger than 64 kilobytes (65,535 bytes) in size, including whitespace. Either a Question parameter or a HITLayoutId parameter must be provided.",
      "nested_params": []
    },
    {
      "name": "RequesterAnnotation",
      "type": "string",
      "required": false,
      "description": "An arbitrary data field. The RequesterAnnotation parameter lets your application attach arbitrary data to the HIT for tracking purposes. For example, this parameter could be an identifier internal to the Requester's application that corresponds with the HIT. The RequesterAnnotation parameter for a HIT is only visible to the Requester who created the HIT. It is not shown to the Worker, or any other Requester. The RequesterAnnotation parameter may be different for each HIT you submit. It does not affect how your HITs are grouped.",
      "nested_params": []
    },
    {
      "name": "QualificationRequirements",
      "type": "list",
      "required": true,
      "description": "Conditions that a Worker's Qualifications must meet in order to accept the HIT. A HIT can have between zero and ten Qualification requirements. All requirements must be met in order for a Worker to accept the HIT. Additionally, other actions can be restricted using the ActionsGuarded field on each QualificationRequirement structure. (dict) --- The QualificationRequirement data structure describes a Qualification that a Worker must have before the Worker is allowed to accept a HIT. A requirement may optionally state that a Worker must have the Qualification in order to preview the HIT, or see the HIT in search results. The ID of the Qualification type for the requirement. The kind of comparison to make against a Qualification's value. You can compare a Qualification's value to an IntegerValue to see if it is LessThan, LessThanOrEqualTo, GreaterThan, GreaterThanOrEqualTo, EqualTo, or NotEqualTo the IntegerValue. You can compare it to a LocaleValue to see if it is EqualTo, or NotEqualTo the LocaleValue. You can check to see if the value is In or NotIn a set of IntegerValue or LocaleValue values. Lastly, a Qualification requirement can also test if a Qualification Exists or DoesNotExist in the user's profile, regardless of its value. IntegerValues (list) --- The integer value to compare against the Qualification's value. IntegerValue must not be present if Comparator is Exists or DoesNotExist. IntegerValue can only be used if the Qualification type has an integer value; it cannot be used with the Worker_Locale QualificationType ID. When performing a set comparison by using the In or the NotIn comparator, you can use up to 15 IntegerValue elements in a QualificationRequirement data structure. (integer) --- LocaleValues (list) --- The locale value to compare against the Qualification's value. The local value must be a valid ISO 3166 country code or supports ISO 3166-2 subdivisions. LocaleValue can only be used with a Worker_Locale QualificationType ID. LocaleValue can only be used with the EqualTo, NotEqualTo, In, and NotIn comparators. You must only use a single LocaleValue element when using the EqualTo or NotEqualTo comparators. When performing a set comparison by using the In or the NotIn comparator, you can use up to 30 LocaleValue elements in a QualificationRequirement data structure. (dict) --- The Locale data structure represents a geographical region or location. The country of the locale. Must be a valid ISO 3166 country code. For example, the code US refers to the United States of America. Subdivision (string) --- The state or subdivision of the locale. A valid ISO 3166-2 subdivision code. For example, the code WA refers to the state of Washington. RequiredToPreview (boolean) --- DEPRECATED: Use the ActionsGuarded field instead. If RequiredToPreview is true, the question data for the HIT will not be shown when a Worker whose Qualifications do not meet this requirement tries to preview the HIT. That is, a Worker's Qualifications must meet all of the requirements for which RequiredToPreview is true in order to preview the HIT. If a Worker meets all of the requirements where RequiredToPreview is true (or if there are no such requirements), but does not meet all of the requirements for the HIT, the Worker will be allowed to preview the HIT's question data, but will not be allowed to accept and complete the HIT. The default is false. This should not be used in combination with the ActionsGuarded field. ActionsGuarded (string) --- Setting this attribute prevents Workers whose Qualifications do not meet this QualificationRequirement from taking the specified action. Valid arguments include 'Accept' (Worker cannot accept the HIT, but can preview the HIT and see it in their search results), 'PreviewAndAccept' (Worker cannot accept or preview the HIT, but can see the HIT in their search results), and 'DiscoverPreviewAndAccept' (Worker cannot accept, preview, or see the HIT in their search results). It's possible for you to create a HIT with multiple QualificationRequirements (which can have different values for the ActionGuarded attribute). In this case, the Worker is only permitted to perform an action when they have met all QualificationRequirements guarding the action. The actions in the order of least restrictive to most restrictive are Discover, Preview and Accept. For example, if a Worker meets all QualificationRequirements that are set to DiscoverPreviewAndAccept, but do not meet all requirements that are set with PreviewAndAccept, then the Worker will be able to Discover, i.e. see the HIT in their search result, but will not be able to Preview or Accept the HIT. ActionsGuarded should not be used in combination with the RequiredToPreview field.",
      "nested_params": [
        {
          "name": "QualificationTypeId",
          "type": "string",
          "required": false,
          "description": "The ID of the Qualification type for the requirement.",
          "nested_params": []
        },
        {
          "name": "Comparator",
          "type": "string",
          "required": false,
          "description": "The kind of comparison to make against a Qualification's value. You can compare a Qualification's value to an IntegerValue to see if it is LessThan, LessThanOrEqualTo, GreaterThan, GreaterThanOrEqualTo, EqualTo, or NotEqualTo the IntegerValue. You can compare it to a LocaleValue to see if it is EqualTo, or NotEqualTo the LocaleValue. You can check to see if the value is In or NotIn a set of IntegerValue or LocaleValue values. Lastly, a Qualification requirement can also test if a Qualification Exists or DoesNotExist in the user's profile, regardless of its value.",
          "nested_params": []
        },
        {
          "name": "IntegerValues",
          "type": "list",
          "required": false,
          "description": "The integer value to compare against the Qualification's value. IntegerValue must not be present if Comparator is Exists or DoesNotExist. IntegerValue can only be used if the Qualification type has an integer value; it cannot be used with the Worker_Locale QualificationType ID. When performing a set comparison by using the In or the NotIn comparator, you can use up to 15 IntegerValue elements in a QualificationRequirement data structure.",
          "nested_params": []
        },
        {
          "name": "LocaleValues",
          "type": "list",
          "required": false,
          "description": "The locale value to compare against the Qualification's value. The local value must be a valid ISO 3166 country code or supports ISO 3166-2 subdivisions. LocaleValue can only be used with a Worker_Locale QualificationType ID. LocaleValue can only be used with the EqualTo, NotEqualTo, In, and NotIn comparators. You must only use a single LocaleValue element when using the EqualTo or NotEqualTo comparators. When performing a set comparison by using the In or the NotIn comparator, you can use up to 30 LocaleValue elements in a QualificationRequirement data structure.",
          "nested_params": [
            {
              "name": "Country",
              "type": "string",
              "required": false,
              "description": "The country of the locale. Must be a valid ISO 3166 country code. For example, the code US refers to the United States of America.",
              "nested_params": []
            },
            {
              "name": "Subdivision",
              "type": "string",
              "required": false,
              "description": "The state or subdivision of the locale. A valid ISO 3166-2 subdivision code. For example, the code WA refers to the state of Washington.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "RequiredToPreview",
          "type": "boolean",
          "required": false,
          "description": "DEPRECATED: Use the ActionsGuarded field instead. If RequiredToPreview is true, the question data for the HIT will not be shown when a Worker whose Qualifications do not meet this requirement tries to preview the HIT. That is, a Worker's Qualifications must meet all of the requirements for which RequiredToPreview is true in order to preview the HIT. If a Worker meets all of the requirements where RequiredToPreview is true (or if there are no such requirements), but does not meet all of the requirements for the HIT, the Worker will be allowed to preview the HIT's question data, but will not be allowed to accept and complete the HIT. The default is false. This should not be used in combination with the ActionsGuarded field.",
          "nested_params": []
        },
        {
          "name": "ActionsGuarded",
          "type": "string",
          "required": false,
          "description": "Setting this attribute prevents Workers whose Qualifications do not meet this QualificationRequirement from taking the specified action. Valid arguments include 'Accept' (Worker cannot accept the HIT, but can preview the HIT and see it in their search results), 'PreviewAndAccept' (Worker cannot accept or preview the HIT, but can see the HIT in their search results), and 'DiscoverPreviewAndAccept' (Worker cannot accept, preview, or see the HIT in their search results). It's possible for you to create a HIT with multiple QualificationRequirements (which can have different values for the ActionGuarded attribute). In this case, the Worker is only permitted to perform an action when they have met all QualificationRequirements guarding the action. The actions in the order of least restrictive to most restrictive are Discover, Preview and Accept. For example, if a Worker meets all QualificationRequirements that are set to DiscoverPreviewAndAccept, but do not meet all requirements that are set with PreviewAndAccept, then the Worker will be able to Discover, i.e. see the HIT in their search result, but will not be able to Preview or Accept the HIT. ActionsGuarded should not be used in combination with the RequiredToPreview field.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "UniqueRequestToken",
      "type": "string",
      "required": false,
      "description": "A unique identifier for this request which allows you to retry the call on error without creating duplicate HITs. This is useful in cases such as network timeouts where it is unclear whether or not the call succeeded on the server. If the HIT already exists in the system from a previous call using the same UniqueRequestToken, subsequent calls will return a AWS.MechanicalTurk.HitAlreadyExists error with a message containing the HITId.",
      "nested_params": []
    },
    {
      "name": "AssignmentReviewPolicy",
      "type": "dict",
      "required": true,
      "description": "The Assignment-level Review Policy applies to the assignments under the HIT. You can specify for Mechanical Turk to take various actions based on the policy. Name of a Review Policy: SimplePlurality/2011-09-01 or ScoreMyKnownAnswers/2011-09-01 Parameters (list) --- Name of the parameter from the Review policy. (dict) --- Name of the parameter from the Review policy. Key (string) --- Name of the parameter from the list of Review Polices. Values (list) --- The list of values of the Parameter (string) --- MapEntries (list) --- List of ParameterMapEntry objects. (dict) --- This data structure is the data type for the AnswerKey parameter of the ScoreMyKnownAnswers/2011-09-01 Review Policy. Key (string) --- The QuestionID from the HIT that is used to identify which question requires Mechanical Turk to score as part of the ScoreMyKnownAnswers/2011-09-01 Review Policy. Values (list) --- The list of answers to the question specified in the MapEntry Key element. The Worker must match all values in order for the answer to be scored correctly. (string) ---",
      "nested_params": [
        {
          "name": "PolicyName",
          "type": "string",
          "required": false,
          "description": "Name of a Review Policy: SimplePlurality/2011-09-01 or ScoreMyKnownAnswers/2011-09-01",
          "nested_params": []
        },
        {
          "name": "Parameters",
          "type": "list",
          "required": false,
          "description": "Name of the parameter from the Review policy.",
          "nested_params": [
            {
              "name": "Key",
              "type": "string",
              "required": false,
              "description": "Name of the parameter from the list of Review Polices.",
              "nested_params": []
            },
            {
              "name": "Values",
              "type": "list",
              "required": false,
              "description": "The list of values of the Parameter.",
              "nested_params": []
            },
            {
              "name": "MapEntries",
              "type": "list",
              "required": false,
              "description": "List of ParameterMapEntry objects.",
              "nested_params": [
                {
                  "name": "Key",
                  "type": "string",
                  "required": false,
                  "description": "The QuestionID from the HIT that is used to identify which question requires Mechanical Turk to score as part of the ScoreMyKnownAnswers/2011-09-01 Review Policy.",
                  "nested_params": []
                },
                {
                  "name": "Values",
                  "type": "list",
                  "required": false,
                  "description": "The list of answers to the question specified in the MapEntry Key element. The Worker must match all values in order for the answer to be scored correctly.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "HITReviewPolicy",
      "type": "dict",
      "required": true,
      "description": "The HIT-level Review Policy applies to the HIT. You can specify for Mechanical Turk to take various actions based on the policy. Name of a Review Policy: SimplePlurality/2011-09-01 or ScoreMyKnownAnswers/2011-09-01 Parameters (list) --- Name of the parameter from the Review policy. (dict) --- Name of the parameter from the Review policy. Key (string) --- Name of the parameter from the list of Review Polices. Values (list) --- The list of values of the Parameter (string) --- MapEntries (list) --- List of ParameterMapEntry objects. (dict) --- This data structure is the data type for the AnswerKey parameter of the ScoreMyKnownAnswers/2011-09-01 Review Policy. Key (string) --- The QuestionID from the HIT that is used to identify which question requires Mechanical Turk to score as part of the ScoreMyKnownAnswers/2011-09-01 Review Policy. Values (list) --- The list of answers to the question specified in the MapEntry Key element. The Worker must match all values in order for the answer to be scored correctly. (string) ---",
      "nested_params": [
        {
          "name": "PolicyName",
          "type": "string",
          "required": false,
          "description": "Name of a Review Policy: SimplePlurality/2011-09-01 or ScoreMyKnownAnswers/2011-09-01",
          "nested_params": []
        },
        {
          "name": "Parameters",
          "type": "list",
          "required": false,
          "description": "Name of the parameter from the Review policy.",
          "nested_params": [
            {
              "name": "Key",
              "type": "string",
              "required": false,
              "description": "Name of the parameter from the list of Review Polices.",
              "nested_params": []
            },
            {
              "name": "Values",
              "type": "list",
              "required": false,
              "description": "The list of values of the Parameter.",
              "nested_params": []
            },
            {
              "name": "MapEntries",
              "type": "list",
              "required": false,
              "description": "List of ParameterMapEntry objects.",
              "nested_params": [
                {
                  "name": "Key",
                  "type": "string",
                  "required": false,
                  "description": "The QuestionID from the HIT that is used to identify which question requires Mechanical Turk to score as part of the ScoreMyKnownAnswers/2011-09-01 Review Policy.",
                  "nested_params": []
                },
                {
                  "name": "Values",
                  "type": "list",
                  "required": false,
                  "description": "The list of answers to the question specified in the MapEntry Key element. The Worker must match all values in order for the answer to be scored correctly.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "HITLayoutId",
      "type": "string",
      "required": false,
      "description": "The HITLayoutId allows you to use a pre-existing HIT design with placeholder values and create an additional HIT by providing those values as HITLayoutParameters. Constraints: Either a Question parameter or a HITLayoutId parameter must be provided.",
      "nested_params": []
    },
    {
      "name": "HITLayoutParameters",
      "type": "list",
      "required": true,
      "description": "If the HITLayoutId is provided, any placeholder values must be filled in with values using the HITLayoutParameter structure. For more information, see HITLayout. (dict) --- The HITLayoutParameter data structure defines parameter values used with a HITLayout. A HITLayout is a reusable Amazon Mechanical Turk project template used to provide Human Intelligence Task (HIT) question data for CreateHIT. The name of the parameter in the HITLayout. The value substituted for the parameter referenced in the HITLayout.",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name of the parameter in the HITLayout.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value substituted for the parameter referenced in the HITLayout.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "HITId",
              "type": "string",
              "description": "A unique identifier for the HIT.",
              "nested_items": []
            },
            {
              "name": "HITTypeId",
              "type": "string",
              "description": "The ID of the HIT type of this HIT.",
              "nested_items": []
            },
            {
              "name": "HITGroupId",
              "type": "string",
              "description": "The ID of the HIT Group of this HIT.",
              "nested_items": []
            },
            {
              "name": "HITLayoutId",
              "type": "string",
              "description": "The ID of the HIT Layout of this HIT.",
              "nested_items": []
            },
            {
              "name": "CreationTime",
              "type": "datetime",
              "description": "The date and time the HIT was created.",
              "nested_items": []
            },
            {
              "name": "Title",
              "type": "string",
              "description": "The title of the HIT.",
              "nested_items": []
            },
            {
              "name": "Description",
              "type": "string",
              "description": "A general description of the HIT.",
              "nested_items": []
            },
            {
              "name": "Question",
              "type": "string",
              "description": "The data the Worker completing the HIT uses produce the results. This is either either a QuestionForm, HTMLQuestion or an ExternalQuestion data structure.",
              "nested_items": []
            },
            {
              "name": "Keywords",
              "type": "string",
              "description": "One or more words or phrases that describe the HIT, separated by commas. Search terms similar to the keywords of a HIT are more likely to have the HIT in the search results.",
              "nested_items": []
            },
            {
              "name": "HITStatus",
              "type": "string",
              "description": "The status of the HIT and its assignments. Valid Values are Assignable | Unassignable | Reviewable | Reviewing | Disposed.",
              "nested_items": []
            },
            {
              "name": "MaxAssignments",
              "type": "integer",
              "description": "The number of times the HIT can be accepted and completed before the HIT becomes unavailable.",
              "nested_items": []
            },
            {
              "name": "Reward",
              "type": "string",
              "description": "A string representing a currency amount.",
              "nested_items": []
            },
            {
              "name": "AutoApprovalDelayInSeconds",
              "type": "integer",
              "description": "The amount of time, in seconds, after the Worker submits an assignment for the HIT that the results are automatically approved by Amazon Mechanical Turk. This is the amount of time the Requester has to reject an assignment submitted by a Worker before the assignment is auto-approved and the Worker is paid.",
              "nested_items": []
            },
            {
              "name": "Expiration",
              "type": "datetime",
              "description": "The date and time the HIT expires.",
              "nested_items": []
            },
            {
              "name": "AssignmentDurationInSeconds",
              "type": "integer",
              "description": "The length of time, in seconds, that a Worker has to complete the HIT after accepting it.",
              "nested_items": []
            },
            {
              "name": "RequesterAnnotation",
              "type": "string",
              "description": "An arbitrary data field the Requester who created the HIT can use. This field is visible only to the creator of the HIT.",
              "nested_items": []
            },
            {
              "name": "QualificationRequirements",
              "type": "list",
              "description": "Conditions that a Worker's Qualifications must meet in order to accept the HIT. A HIT can have between zero and ten Qualification requirements. All requirements must be met in order for a Worker to accept the HIT. Additionally, other actions can be restricted using the ActionsGuarded field on each QualificationRequirement structure.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "QualificationTypeId",
                      "type": "string",
                      "description": "The ID of the Qualification type for the requirement.",
                      "nested_items": []
                    },
                    {
                      "name": "Comparator",
                      "type": "string",
                      "description": "The kind of comparison to make against a Qualification's value. You can compare a Qualification's value to an IntegerValue to see if it is LessThan, LessThanOrEqualTo, GreaterThan, GreaterThanOrEqualTo, EqualTo, or NotEqualTo the IntegerValue. You can compare it to a LocaleValue to see if it is EqualTo, or NotEqualTo the LocaleValue. You can check to see if the value is In or NotIn a set of IntegerValue or LocaleValue values. Lastly, a Qualification requirement can also test if a Qualification Exists or DoesNotExist in the user's profile, regardless of its value.",
                      "nested_items": []
                    },
                    {
                      "name": "IntegerValues",
                      "type": "list",
                      "description": "The integer value to compare against the Qualification's value. IntegerValue must not be present if Comparator is Exists or DoesNotExist. IntegerValue can only be used if the Qualification type has an integer value; it cannot be used with the Worker_Locale QualificationType ID. When performing a set comparison by using the In or the NotIn comparator, you can use up to 15 IntegerValue elements in a QualificationRequirement data structure.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "integer",
                          "description": "(integer) ---",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "LocaleValues",
                      "type": "list",
                      "description": "The locale value to compare against the Qualification's value. The local value must be a valid ISO 3166 country code or supports ISO 3166-2 subdivisions. LocaleValue can only be used with a Worker_Locale QualificationType ID. LocaleValue can only be used with the EqualTo, NotEqualTo, In, and NotIn comparators. You must only use a single LocaleValue element when using the EqualTo or NotEqualTo comparators. When performing a set comparison by using the In or the NotIn comparator, you can use up to 30 LocaleValue elements in a QualificationRequirement data structure.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "Country",
                              "type": "string",
                              "description": "The country of the locale. Must be a valid ISO 3166 country code. For example, the code US refers to the United States of America.",
                              "nested_items": []
                            },
                            {
                              "name": "Subdivision",
                              "type": "string",
                              "description": "The state or subdivision of the locale. A valid ISO 3166-2 subdivision code. For example, the code WA refers to the state of Washington.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "RequiredToPreview",
                      "type": "boolean",
                      "description": "DEPRECATED: Use the ActionsGuarded field instead. If RequiredToPreview is true, the question data for the HIT will not be shown when a Worker whose Qualifications do not meet this requirement tries to preview the HIT. That is, a Worker's Qualifications must meet all of the requirements for which RequiredToPreview is true in order to preview the HIT. If a Worker meets all of the requirements where RequiredToPreview is true (or if there are no such requirements), but does not meet all of the requirements for the HIT, the Worker will be allowed to preview the HIT's question data, but will not be allowed to accept and complete the HIT. The default is false. This should not be used in combination with the ActionsGuarded field.",
                      "nested_items": []
                    },
                    {
                      "name": "ActionsGuarded",
                      "type": "string",
                      "description": "Setting this attribute prevents Workers whose Qualifications do not meet this QualificationRequirement from taking the specified action. Valid arguments include 'Accept' (Worker cannot accept the HIT, but can preview the HIT and see it in their search results), 'PreviewAndAccept' (Worker cannot accept or preview the HIT, but can see the HIT in their search results), and 'DiscoverPreviewAndAccept' (Worker cannot accept, preview, or see the HIT in their search results). It's possible for you to create a HIT with multiple QualificationRequirements (which can have different values for the ActionGuarded attribute). In this case, the Worker is only permitted to perform an action when they have met all QualificationRequirements guarding the action. The actions in the order of least restrictive to most restrictive are Discover, Preview and Accept. For example, if a Worker meets all QualificationRequirements that are set to DiscoverPreviewAndAccept, but do not meet all requirements that are set with PreviewAndAccept, then the Worker will be able to Discover, i.e. see the HIT in their search result, but will not be able to Preview or Accept the HIT. ActionsGuarded should not be used in combination with the RequiredToPreview field.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "HITReviewStatus",
              "type": "string",
              "description": "Indicates the review status of the HIT. Valid Values are NotReviewed | MarkedForReview | ReviewedAppropriate | ReviewedInappropriate.",
              "nested_items": []
            },
            {
              "name": "NumberOfAssignmentsPending",
              "type": "integer",
              "description": "The number of assignments for this HIT that are being previewed or have been accepted by Workers, but have not yet been submitted, returned, or abandoned.",
              "nested_items": []
            },
            {
              "name": "NumberOfAssignmentsAvailable",
              "type": "integer",
              "description": "The number of assignments for this HIT that are available for Workers to accept.",
              "nested_items": []
            },
            {
              "name": "NumberOfAssignmentsCompleted",
              "type": "integer",
              "description": "The number of assignments for this HIT that have been approved or rejected.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}