{
  "method_name": "get_qualification_type",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/mturk/client/get_qualification_type.html",
  "description": "The ``GetQualificationType``operation retrieves information about a Qualification type using its ID.",
  "parameters": [
    {
      "name": "QualificationTypeId",
      "type": "string",
      "required": true,
      "description": "The ID of the QualificationType.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "QualificationType",
          "type": "dict",
          "description": "The returned Qualification Type.",
          "nested_items": [
            {
              "name": "QualificationTypeId",
              "type": "string",
              "description": "A unique identifier for the Qualification type. A Qualification type is given a Qualification type ID when you call the CreateQualificationType operation.",
              "nested_items": []
            },
            {
              "name": "CreationTime",
              "type": "datetime",
              "description": "The date and time the Qualification type was created.",
              "nested_items": []
            },
            {
              "name": "Name",
              "type": "string",
              "description": "The name of the Qualification type. The type name is used to identify the type, and to find the type using a Qualification type search.",
              "nested_items": []
            },
            {
              "name": "Description",
              "type": "string",
              "description": "A long description for the Qualification type.",
              "nested_items": []
            },
            {
              "name": "Keywords",
              "type": "string",
              "description": "One or more words or phrases that describe theQualification type, separated by commas. The Keywords make the type easier to find using a search.",
              "nested_items": []
            },
            {
              "name": "QualificationTypeStatus",
              "type": "string",
              "description": "The status of the Qualification type. A Qualification type's status determines if users can apply to receive a Qualification of this type, and if HITs can be created with requirements based on this type. Valid values are Active | Inactive.",
              "nested_items": []
            },
            {
              "name": "Test",
              "type": "string",
              "description": "The questions for a Qualification test associated with this Qualification type that a user can take to obtain a Qualification of this type. This parameter must be specified if AnswerKey is present. A Qualification type cannot have both a specified Test parameter and an AutoGranted value of true.",
              "nested_items": []
            },
            {
              "name": "TestDurationInSeconds",
              "type": "integer",
              "description": "The amount of time, in seconds, given to a Worker to complete the Qualification test, beginning from the time the Worker requests the Qualification.",
              "nested_items": []
            },
            {
              "name": "AnswerKey",
              "type": "string",
              "description": "The answers to the Qualification test specified in the Test parameter.",
              "nested_items": []
            },
            {
              "name": "RetryDelayInSeconds",
              "type": "integer",
              "description": "The amount of time, in seconds, Workers must wait after taking the Qualification test before they can take it again. Workers can take a Qualification test multiple times if they were not granted the Qualification from a previous attempt, or if the test offers a gradient score and they want a better score. If not specified, retries are disabled and Workers can request a Qualification only once.",
              "nested_items": []
            },
            {
              "name": "IsRequestable",
              "type": "boolean",
              "description": "Specifies whether the Qualification type is one that a user can request through the Amazon Mechanical Turk web site, such as by taking a Qualification test. This value is False for Qualifications assigned automatically by the system. Valid values are True | False.",
              "nested_items": []
            },
            {
              "name": "AutoGranted",
              "type": "boolean",
              "description": "Specifies that requests for the Qualification type are granted immediately, without prompting the Worker with a Qualification test. Valid values are True | False.",
              "nested_items": []
            },
            {
              "name": "AutoGrantedValue",
              "type": "integer",
              "description": "The Qualification integer value to use for automatically granted Qualifications, if AutoGranted is true. This is 1 by default.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}