{
  "method_name": "get_hit",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/mturk/client/get_hit.html",
  "description": "The GetHIT operation retrieves the details of the specified HIT.",
  "parameters": [
    {
      "name": "HITId",
      "type": "string",
      "required": true,
      "description": "The ID of the HIT to be retrieved.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "HITId",
              "type": "string",
              "description": "A unique identifier for the HIT.",
              "nested_items": []
            },
            {
              "name": "HITTypeId",
              "type": "string",
              "description": "The ID of the HIT type of this HIT.",
              "nested_items": []
            },
            {
              "name": "HITGroupId",
              "type": "string",
              "description": "The ID of the HIT Group of this HIT.",
              "nested_items": []
            },
            {
              "name": "HITLayoutId",
              "type": "string",
              "description": "The ID of the HIT Layout of this HIT.",
              "nested_items": []
            },
            {
              "name": "CreationTime",
              "type": "datetime",
              "description": "The date and time the HIT was created.",
              "nested_items": []
            },
            {
              "name": "Title",
              "type": "string",
              "description": "The title of the HIT.",
              "nested_items": []
            },
            {
              "name": "Description",
              "type": "string",
              "description": "A general description of the HIT.",
              "nested_items": []
            },
            {
              "name": "Question",
              "type": "string",
              "description": "The data the Worker completing the HIT uses produce the results. This is either either a QuestionForm, HTMLQuestion or an ExternalQuestion data structure.",
              "nested_items": []
            },
            {
              "name": "Keywords",
              "type": "string",
              "description": "One or more words or phrases that describe the HIT, separated by commas. Search terms similar to the keywords of a HIT are more likely to have the HIT in the search results.",
              "nested_items": []
            },
            {
              "name": "HITStatus",
              "type": "string",
              "description": "The status of the HIT and its assignments. Valid Values are Assignable | Unassignable | Reviewable | Reviewing | Disposed.",
              "nested_items": []
            },
            {
              "name": "MaxAssignments",
              "type": "integer",
              "description": "The number of times the HIT can be accepted and completed before the HIT becomes unavailable.",
              "nested_items": []
            },
            {
              "name": "Reward",
              "type": "string",
              "description": "A string representing a currency amount.",
              "nested_items": []
            },
            {
              "name": "AutoApprovalDelayInSeconds",
              "type": "integer",
              "description": "The amount of time, in seconds, after the Worker submits an assignment for the HIT that the results are automatically approved by Amazon Mechanical Turk. This is the amount of time the Requester has to reject an assignment submitted by a Worker before the assignment is auto-approved and the Worker is paid.",
              "nested_items": []
            },
            {
              "name": "Expiration",
              "type": "datetime",
              "description": "The date and time the HIT expires.",
              "nested_items": []
            },
            {
              "name": "AssignmentDurationInSeconds",
              "type": "integer",
              "description": "The length of time, in seconds, that a Worker has to complete the HIT after accepting it.",
              "nested_items": []
            },
            {
              "name": "RequesterAnnotation",
              "type": "string",
              "description": "An arbitrary data field the Requester who created the HIT can use. This field is visible only to the creator of the HIT.",
              "nested_items": []
            },
            {
              "name": "QualificationRequirements",
              "type": "list",
              "description": "Conditions that a Worker's Qualifications must meet in order to accept the HIT. A HIT can have between zero and ten Qualification requirements. All requirements must be met in order for a Worker to accept the HIT. Additionally, other actions can be restricted using the ActionsGuarded field on each QualificationRequirement structure.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "QualificationTypeId",
                      "type": "string",
                      "description": "The ID of the Qualification type for the requirement.",
                      "nested_items": []
                    },
                    {
                      "name": "Comparator",
                      "type": "string",
                      "description": "The kind of comparison to make against a Qualification's value. You can compare a Qualification's value to an IntegerValue to see if it is LessThan, LessThanOrEqualTo, GreaterThan, GreaterThanOrEqualTo, EqualTo, or NotEqualTo the IntegerValue. You can compare it to a LocaleValue to see if it is EqualTo, or NotEqualTo the LocaleValue. You can check to see if the value is In or NotIn a set of IntegerValue or LocaleValue values. Lastly, a Qualification requirement can also test if a Qualification Exists or DoesNotExist in the user's profile, regardless of its value.",
                      "nested_items": []
                    },
                    {
                      "name": "IntegerValues",
                      "type": "list",
                      "description": "The integer value to compare against the Qualification's value. IntegerValue must not be present if Comparator is Exists or DoesNotExist. IntegerValue can only be used if the Qualification type has an integer value; it cannot be used with the Worker_Locale QualificationType ID. When performing a set comparison by using the In or the NotIn comparator, you can use up to 15 IntegerValue elements in a QualificationRequirement data structure.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "integer",
                          "description": "(integer) ---",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "LocaleValues",
                      "type": "list",
                      "description": "The locale value to compare against the Qualification's value. The local value must be a valid ISO 3166 country code or supports ISO 3166-2 subdivisions. LocaleValue can only be used with a Worker_Locale QualificationType ID. LocaleValue can only be used with the EqualTo, NotEqualTo, In, and NotIn comparators. You must only use a single LocaleValue element when using the EqualTo or NotEqualTo comparators. When performing a set comparison by using the In or the NotIn comparator, you can use up to 30 LocaleValue elements in a QualificationRequirement data structure.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "Country",
                              "type": "string",
                              "description": "The country of the locale. Must be a valid ISO 3166 country code. For example, the code US refers to the United States of America.",
                              "nested_items": []
                            },
                            {
                              "name": "Subdivision",
                              "type": "string",
                              "description": "The state or subdivision of the locale. A valid ISO 3166-2 subdivision code. For example, the code WA refers to the state of Washington.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "RequiredToPreview",
                      "type": "boolean",
                      "description": "DEPRECATED: Use the ActionsGuarded field instead. If RequiredToPreview is true, the question data for the HIT will not be shown when a Worker whose Qualifications do not meet this requirement tries to preview the HIT. That is, a Worker's Qualifications must meet all of the requirements for which RequiredToPreview is true in order to preview the HIT. If a Worker meets all of the requirements where RequiredToPreview is true (or if there are no such requirements), but does not meet all of the requirements for the HIT, the Worker will be allowed to preview the HIT's question data, but will not be allowed to accept and complete the HIT. The default is false. This should not be used in combination with the ActionsGuarded field.",
                      "nested_items": []
                    },
                    {
                      "name": "ActionsGuarded",
                      "type": "string",
                      "description": "Setting this attribute prevents Workers whose Qualifications do not meet this QualificationRequirement from taking the specified action. Valid arguments include 'Accept' (Worker cannot accept the HIT, but can preview the HIT and see it in their search results), 'PreviewAndAccept' (Worker cannot accept or preview the HIT, but can see the HIT in their search results), and 'DiscoverPreviewAndAccept' (Worker cannot accept, preview, or see the HIT in their search results). It's possible for you to create a HIT with multiple QualificationRequirements (which can have different values for the ActionGuarded attribute). In this case, the Worker is only permitted to perform an action when they have met all QualificationRequirements guarding the action. The actions in the order of least restrictive to most restrictive are Discover, Preview and Accept. For example, if a Worker meets all QualificationRequirements that are set to DiscoverPreviewAndAccept, but do not meet all requirements that are set with PreviewAndAccept, then the Worker will be able to Discover, i.e. see the HIT in their search result, but will not be able to Preview or Accept the HIT. ActionsGuarded should not be used in combination with the RequiredToPreview field.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "HITReviewStatus",
              "type": "string",
              "description": "Indicates the review status of the HIT. Valid Values are NotReviewed | MarkedForReview | ReviewedAppropriate | ReviewedInappropriate.",
              "nested_items": []
            },
            {
              "name": "NumberOfAssignmentsPending",
              "type": "integer",
              "description": "The number of assignments for this HIT that are being previewed or have been accepted by Workers, but have not yet been submitted, returned, or abandoned.",
              "nested_items": []
            },
            {
              "name": "NumberOfAssignmentsAvailable",
              "type": "integer",
              "description": "The number of assignments for this HIT that are available for Workers to accept.",
              "nested_items": []
            },
            {
              "name": "NumberOfAssignmentsCompleted",
              "type": "integer",
              "description": "The number of assignments for this HIT that have been approved or rejected.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}