{
  "method_name": "list_assignments_for_hit",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/mturk/client/list_assignments_for_hit.html",
  "description": "The ListAssignmentsForHIT operation retrieves completed assignments for a HIT. You can use this operation to retrieve the results for a HIT. You can get assignments for a HIT at any time, even if the HIT is not yet Reviewable. If a HIT requested multiple assignments, and has received some results but has not yet become Reviewable, you can still retrieve the partial results with this operation. Use the AssignmentStatus parameter to control which set of assignments for a HIT are returned. The ListAssignmentsForHIT operation can return submitted assignments awaiting approval, or it can return assignments that have already been approved or rejected. You can set AssignmentStatus=Approved,Rejected to get assignments that have already been approved and rejected together in one result set. Only the Requester who created the HIT can retrieve the assignments for that HIT. Results are sorted and divided into numbered pages and the operation returns a single page of results. You can use the parameters of the operation to control sorting and pagination.",
  "parameters": [
    {
      "name": "HITId",
      "type": "string",
      "required": true,
      "description": "The ID of the HIT.",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "AssignmentStatuses",
      "type": "list",
      "required": false,
      "description": "The status of the assignments to return: Submitted | Approved | Rejected (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "NextToken",
          "type": "string",
          "description": "If the previous response was incomplete (because there is more data to retrieve), Amazon Mechanical Turk returns a pagination token in the response. You can use this pagination token to retrieve the next set of results.",
          "nested_items": []
        },
        {
          "name": "NumResults",
          "type": "integer",
          "description": "The number of assignments on the page in the filtered results list, equivalent to the number of assignments returned by this call.",
          "nested_items": []
        },
        {
          "name": "Assignments",
          "type": "list",
          "description": "The collection of Assignment data structures returned by this call.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "AssignmentId",
                  "type": "string",
                  "description": "A unique identifier for the assignment.",
                  "nested_items": []
                },
                {
                  "name": "WorkerId",
                  "type": "string",
                  "description": "The ID of the Worker who accepted the HIT.",
                  "nested_items": []
                },
                {
                  "name": "HITId",
                  "type": "string",
                  "description": "The ID of the HIT.",
                  "nested_items": []
                },
                {
                  "name": "AssignmentStatus",
                  "type": "string",
                  "description": "The status of the assignment.",
                  "nested_items": []
                },
                {
                  "name": "AutoApprovalTime",
                  "type": "datetime",
                  "description": "If results have been submitted, AutoApprovalTime is the date and time the results of the assignment results are considered Approved automatically if they have not already been explicitly approved or rejected by the Requester. This value is derived from the auto-approval delay specified by the Requester in the HIT. This value is omitted from the assignment if the Worker has not yet submitted results.",
                  "nested_items": []
                },
                {
                  "name": "AcceptTime",
                  "type": "datetime",
                  "description": "The date and time the Worker accepted the assignment.",
                  "nested_items": []
                },
                {
                  "name": "SubmitTime",
                  "type": "datetime",
                  "description": "If the Worker has submitted results, SubmitTime is the date and time the assignment was submitted. This value is omitted from the assignment if the Worker has not yet submitted results.",
                  "nested_items": []
                },
                {
                  "name": "ApprovalTime",
                  "type": "datetime",
                  "description": "If the Worker has submitted results and the Requester has approved the results, ApprovalTime is the date and time the Requester approved the results. This value is omitted from the assignment if the Requester has not yet approved the results.",
                  "nested_items": []
                },
                {
                  "name": "RejectionTime",
                  "type": "datetime",
                  "description": "If the Worker has submitted results and the Requester has rejected the results, RejectionTime is the date and time the Requester rejected the results.",
                  "nested_items": []
                },
                {
                  "name": "Deadline",
                  "type": "datetime",
                  "description": "The date and time of the deadline for the assignment. This value is derived from the deadline specification for the HIT and the date and time the Worker accepted the HIT.",
                  "nested_items": []
                },
                {
                  "name": "Answer",
                  "type": "string",
                  "description": "The Worker's answers submitted for the HIT contained in a QuestionFormAnswers document, if the Worker provides an answer. If the Worker does not provide any answers, Answer may contain a QuestionFormAnswers document, or Answer may be empty.",
                  "nested_items": []
                },
                {
                  "name": "RequesterFeedback",
                  "type": "string",
                  "description": "The feedback string included with the call to the ApproveAssignment operation or the RejectAssignment operation, if the Requester approved or rejected the assignment and specified feedback.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}