{
  "method_name": "list_qualification_requests",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/mturk/client/list_qualification_requests.html",
  "description": "The ListQualificationRequests operation retrieves requests for Qualifications of a particular Qualification type. The owner of the Qualification type calls this operation to poll for pending requests, and accepts them using the AcceptQualification operation.",
  "parameters": [
    {
      "name": "QualificationTypeId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "NumResults",
          "type": "integer",
          "description": "The number of Qualification requests on this page in the filtered results list, equivalent to the number of Qualification requests being returned by this call.",
          "nested_items": []
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "If the previous response was incomplete (because there is more data to retrieve), Amazon Mechanical Turk returns a pagination token in the response. You can use this pagination token to retrieve the next set of results.",
          "nested_items": []
        },
        {
          "name": "QualificationRequests",
          "type": "list",
          "description": "The Qualification request. The response includes one QualificationRequest element for each Qualification request returned by the query.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "QualificationRequestId",
                  "type": "string",
                  "description": "The ID of the Qualification request, a unique identifier generated when the request was submitted.",
                  "nested_items": []
                },
                {
                  "name": "QualificationTypeId",
                  "type": "string",
                  "description": "The ID of the Qualification type the Worker is requesting, as returned by the CreateQualificationType operation.",
                  "nested_items": []
                },
                {
                  "name": "WorkerId",
                  "type": "string",
                  "description": "The ID of the Worker requesting the Qualification.",
                  "nested_items": []
                },
                {
                  "name": "Test",
                  "type": "string",
                  "description": "The contents of the Qualification test that was presented to the Worker, if the type has a test and the Worker has submitted answers. This value is identical to the QuestionForm associated with the Qualification type at the time the Worker requests the Qualification.",
                  "nested_items": []
                },
                {
                  "name": "Answer",
                  "type": "string",
                  "description": "The Worker's answers for the Qualification type's test contained in a QuestionFormAnswers document, if the type has a test and the Worker has submitted answers. If the Worker does not provide any answers, Answer may be empty.",
                  "nested_items": []
                },
                {
                  "name": "SubmitTime",
                  "type": "datetime",
                  "description": "The date and time the Qualification request had a status of Submitted. This is either the time the Worker submitted answers for a Qualification test, or the time the Worker requested the Qualification if the Qualification type does not have a test.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}