{
  "method_name": "update_notification_settings",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/mturk/client/update_notification_settings.html",
  "description": "The UpdateNotificationSettings operation creates, updates, disables or re-enables notifications for a HIT type. If you call the UpdateNotificationSettings operation for a HIT type that already has a notification specification, the operation replaces the old specification with a new one. You can call the UpdateNotificationSettings operation to enable or disable notifications for the HIT type, without having to modify the notification specification itself by providing updates to the Active status without specifying a new notification specification. To change the Active status of a HIT type's notifications, the HIT type must already have a notification specification, or one must be provided in the same call to UpdateNotificationSettings.",
  "parameters": [
    {
      "name": "HITTypeId",
      "type": "string",
      "required": true,
      "description": "The ID of the HIT type whose notification specification is being updated.",
      "nested_params": []
    },
    {
      "name": "Notification",
      "type": "dict",
      "required": true,
      "description": "The notification specification for the HIT type. The target for notification messages. The Destination's format is determined by the specified Transport: When Transport is Email, the Destination is your email address. When Transport is SQS, the Destination is your queue URL. When Transport is SNS, the Destination is the ARN of your topic. The method Amazon Mechanical Turk uses to send the notification. Valid Values: Email | SQS | SNS. The version of the Notification API to use. Valid value is 2006-05-05. The list of events that should cause notifications to be sent. Valid Values: AssignmentAccepted | AssignmentAbandoned | AssignmentReturned | AssignmentSubmitted | AssignmentRejected | AssignmentApproved | HITCreated | HITExtended | HITDisposed | HITReviewable | HITExpired | Ping. The Ping event is only valid for the SendTestEventNotification operation. (string) ---",
      "nested_params": [
        {
          "name": "Destination",
          "type": "string",
          "required": false,
          "description": "The target for notification messages. The Destination's format is determined by the specified Transport:",
          "nested_params": []
        },
        {
          "name": "Transport",
          "type": "string",
          "required": false,
          "description": "The method Amazon Mechanical Turk uses to send the notification. Valid Values: Email | SQS | SNS.",
          "nested_params": []
        },
        {
          "name": "Version",
          "type": "string",
          "required": false,
          "description": "The version of the Notification API to use. Valid value is 2006-05-05.",
          "nested_params": []
        },
        {
          "name": "EventTypes",
          "type": "list",
          "required": false,
          "description": "The list of events that should cause notifications to be sent. Valid Values: AssignmentAccepted | AssignmentAbandoned | AssignmentReturned | AssignmentSubmitted | AssignmentRejected | AssignmentApproved | HITCreated | HITExtended | HITDisposed | HITReviewable | HITExpired | Ping. The Ping event is only valid for the SendTestEventNotification operation.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Active",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}