{
  "method_name": "update_lake_formation_identity_center_configuration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/lakeformation/client/update_lake_formation_identity_center_configuration.html",
  "description": "Updates the IAM Identity Center connection parameters.",
  "parameters": [
    {
      "name": "CatalogId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ShareRecipients",
      "type": "list",
      "required": false,
      "description": "A list of Amazon Web Services account IDs or Amazon Web Services organization/organizational unit ARNs that are allowed to access to access data managed by Lake Formation. If the ShareRecipients list includes valid values, then the resource share is updated with the principals you want to have access to the resources. If the ShareRecipients value is null, both the list of share recipients and the resource share remain unchanged. If the ShareRecipients value is an empty list, then the existing share recipients list will be cleared, and the resource share will be deleted. (dict) --- The Lake Formation principal. Supported principals are IAM users or IAM roles. DataLakePrincipalIdentifier (string) --- An identifier for the Lake Formation principal.",
      "nested_params": [
        {
          "name": "DataLakePrincipalIdentifier",
          "type": "string",
          "required": false,
          "description": "An identifier for the Lake Formation principal.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ApplicationStatus",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ExternalFiltering",
      "type": "dict",
      "required": true,
      "description": "A list of the account IDs of Amazon Web Services accounts of third-party applications that are allowed to access data managed by Lake Formation. Allows to enable or disable the third-party applications that are allowed to access data managed by Lake Formation. List of third-party application ARNs integrated with Lake Formation. (string) ---",
      "nested_params": [
        {
          "name": "Status",
          "type": "string",
          "required": false,
          "description": "Allows to enable or disable the third-party applications that are allowed to access data managed by Lake Formation.",
          "nested_params": []
        },
        {
          "name": "AuthorizedTargets",
          "type": "list",
          "required": false,
          "description": "List of third-party application ARNs integrated with Lake Formation.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}