{
  "method_name": "merge_profiles",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/customer-profiles/client/merge_profiles.html",
  "description": "Runs an AWS Lambda job that does the following: You can use MergeProfiles together with GetMatches, which returns potentially matching profiles, or use it with the results of another matching system. After profiles have been merged, they cannot be separated (unmerged).",
  "parameters": [
    {
      "name": "DomainName",
      "type": "string",
      "required": true,
      "description": "The unique name of the domain.",
      "nested_params": []
    },
    {
      "name": "MainProfileId",
      "type": "string",
      "required": true,
      "description": "The identifier of the profile to be taken.",
      "nested_params": []
    },
    {
      "name": "ProfileIdsToBeMerged",
      "type": "list",
      "required": true,
      "description": "The identifier of the profile to be merged into MainProfileId. (string) ---",
      "nested_params": []
    },
    {
      "name": "FieldSourceProfileIds",
      "type": "dict",
      "required": false,
      "description": "The identifiers of the fields in the profile that has the information you want to apply to the merge. For example, say you want to merge EmailAddress from Profile1 into MainProfile. This would be the identifier of the EmailAddress field in Profile1. AccountNumber (string) --- A unique identifier for the account number field to be merged. AdditionalInformation (string) --- A unique identifier for the additional information field to be merged. PartyType (string) --- A unique identifier for the party type field to be merged. BusinessName (string) --- A unique identifier for the business name field to be merged. FirstName (string) --- A unique identifier for the first name field to be merged. MiddleName (string) --- A unique identifier for the middle name field to be merged. LastName (string) --- A unique identifier for the last name field to be merged. BirthDate (string) --- A unique identifier for the birthdate field to be merged. Gender (string) --- A unique identifier for the gender field to be merged. PhoneNumber (string) --- A unique identifier for the phone number field to be merged. MobilePhoneNumber (string) --- A unique identifier for the mobile phone number field to be merged. HomePhoneNumber (string) --- A unique identifier for the home phone number field to be merged. BusinessPhoneNumber (string) --- A unique identifier for the business phone number field to be merged. EmailAddress (string) --- A unique identifier for the email address field to be merged. PersonalEmailAddress (string) --- A unique identifier for the personal email address field to be merged. BusinessEmailAddress (string) --- A unique identifier for the party type field to be merged. Address (string) --- A unique identifier for the party type field to be merged. ShippingAddress (string) --- A unique identifier for the shipping address field to be merged. MailingAddress (string) --- A unique identifier for the mailing address field to be merged. BillingAddress (string) --- A unique identifier for the billing type field to be merged. Attributes (dict) --- A unique identifier for the attributes field to be merged. (string) --- (string) ---",
      "nested_params": [
        {
          "name": "AccountNumber",
          "type": "string",
          "required": false,
          "description": "A unique identifier for the account number field to be merged.",
          "nested_params": []
        },
        {
          "name": "AdditionalInformation",
          "type": "string",
          "required": false,
          "description": "A unique identifier for the additional information field to be merged.",
          "nested_params": []
        },
        {
          "name": "PartyType",
          "type": "string",
          "required": false,
          "description": "A unique identifier for the party type field to be merged.",
          "nested_params": []
        },
        {
          "name": "BusinessName",
          "type": "string",
          "required": false,
          "description": "A unique identifier for the business name field to be merged.",
          "nested_params": []
        },
        {
          "name": "FirstName",
          "type": "string",
          "required": false,
          "description": "A unique identifier for the first name field to be merged.",
          "nested_params": []
        },
        {
          "name": "MiddleName",
          "type": "string",
          "required": false,
          "description": "A unique identifier for the middle name field to be merged.",
          "nested_params": []
        },
        {
          "name": "LastName",
          "type": "string",
          "required": false,
          "description": "A unique identifier for the last name field to be merged.",
          "nested_params": []
        },
        {
          "name": "BirthDate",
          "type": "string",
          "required": false,
          "description": "A unique identifier for the birthdate field to be merged.",
          "nested_params": []
        },
        {
          "name": "Gender",
          "type": "string",
          "required": false,
          "description": "A unique identifier for the gender field to be merged.",
          "nested_params": []
        },
        {
          "name": "PhoneNumber",
          "type": "string",
          "required": false,
          "description": "A unique identifier for the phone number field to be merged.",
          "nested_params": []
        },
        {
          "name": "MobilePhoneNumber",
          "type": "string",
          "required": false,
          "description": "A unique identifier for the mobile phone number field to be merged.",
          "nested_params": []
        },
        {
          "name": "HomePhoneNumber",
          "type": "string",
          "required": false,
          "description": "A unique identifier for the home phone number field to be merged.",
          "nested_params": []
        },
        {
          "name": "BusinessPhoneNumber",
          "type": "string",
          "required": false,
          "description": "A unique identifier for the business phone number field to be merged.",
          "nested_params": []
        },
        {
          "name": "EmailAddress",
          "type": "string",
          "required": false,
          "description": "A unique identifier for the email address field to be merged.",
          "nested_params": []
        },
        {
          "name": "PersonalEmailAddress",
          "type": "string",
          "required": false,
          "description": "A unique identifier for the personal email address field to be merged.",
          "nested_params": []
        },
        {
          "name": "BusinessEmailAddress",
          "type": "string",
          "required": false,
          "description": "A unique identifier for the party type field to be merged.",
          "nested_params": []
        },
        {
          "name": "Address",
          "type": "string",
          "required": false,
          "description": "A unique identifier for the party type field to be merged.",
          "nested_params": []
        },
        {
          "name": "ShippingAddress",
          "type": "string",
          "required": false,
          "description": "A unique identifier for the shipping address field to be merged.",
          "nested_params": []
        },
        {
          "name": "MailingAddress",
          "type": "string",
          "required": false,
          "description": "A unique identifier for the mailing address field to be merged.",
          "nested_params": []
        },
        {
          "name": "BillingAddress",
          "type": "string",
          "required": false,
          "description": "A unique identifier for the billing type field to be merged.",
          "nested_params": []
        },
        {
          "name": "Attributes",
          "type": "dict",
          "required": false,
          "description": "A unique identifier for the attributes field to be merged.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Message",
          "type": "string",
          "description": "A message that indicates the merge request is complete.",
          "nested_items": []
        }
      ]
    }
  ]
}