{
  "method_name": "put_integration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/customer-profiles/client/put_integration.html",
  "description": "Adds an integration between the service and a third-party service, which includes Amazon AppFlow and Amazon Connect. An integration can belong to only one domain. To add or remove tags on an existing Integration, see TagResource/ UntagResource.",
  "parameters": [
    {
      "name": "DomainName",
      "type": "string",
      "required": true,
      "description": "The unique name of the domain.",
      "nested_params": []
    },
    {
      "name": "Uri",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ObjectTypeName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "dict",
      "required": false,
      "description": "The tags used to organize, track, or control access for this resource. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "FlowDefinition",
      "type": "dict",
      "required": true,
      "description": "The configuration that controls how Customer Profiles retrieves data from the source. Description (string) --- A description of the flow you want to create. The specified name of the flow. Use underscores (_) or hyphens (-) only. Spaces are not allowed. The Amazon Resource Name of the AWS Key Management Service (KMS) key you provide for encryption. ConnectorProfileName (string) --- The name of the AppFlow connector profile. This name must be unique for each connector profile in the AWS account. The type of connector, such as Salesforce, Marketo, and so on. IncrementalPullConfig (dict) --- Defines the configuration for a scheduled incremental data pull. If a valid configuration is provided, the fields specified in the configuration are used when querying for the incremental data pull. DatetimeTypeFieldName (string) --- A field that specifies the date time or timestamp field as the criteria to use when importing incremental records from the source. Specifies the information that is required to query a particular source connector. Marketo (dict) --- The properties that are applied when Marketo is being used as a source. The object specified in the Marketo flow source. S3 (dict) --- The properties that are applied when Amazon S3 is being used as the flow source. The Amazon S3 bucket name where the source files are stored. BucketPrefix (string) --- The object key for the Amazon S3 bucket in which the source files are stored. Salesforce (dict) --- The properties that are applied when Salesforce is being used as a source. The object specified in the Salesforce flow source. EnableDynamicFieldUpdate (boolean) --- The flag that enables dynamic fetching of new (recently added) fields in the Salesforce objects while running a flow. IncludeDeletedRecords (boolean) --- Indicates whether Amazon AppFlow includes deleted files in the flow run. ServiceNow (dict) --- The properties that are applied when ServiceNow is being used as a source. The object specified in the ServiceNow flow source. Zendesk (dict) --- The properties that are applied when using Zendesk as a flow source. The object specified in the Zendesk flow source. A list of tasks that Customer Profiles performs while transferring the data in the flow run. (dict) --- A class for modeling different type of tasks. Task implementation varies based on the TaskType. ConnectorOperator (dict) --- The operation to be performed on the provided source fields. Marketo (string) --- The operation to be performed on the provided Marketo source fields. S3 (string) --- The operation to be performed on the provided Amazon S3 source fields. Salesforce (string) --- The operation to be performed on the provided Salesforce source fields. ServiceNow (string) --- The operation to be performed on the provided ServiceNow source fields. Zendesk (string) --- The operation to be performed on the provided Zendesk source fields. DestinationField (string) --- A field in a destination connector, or a field value against which Amazon AppFlow validates a source field. The source fields to which a particular task is applied. (string) --- TaskProperties (dict) --- A map used to store task-related information. The service looks for particular information based on the TaskType. (string) --- (string) --- Specifies the particular task implementation that Amazon AppFlow performs. The trigger settings that determine how and when the flow runs. Specifies the type of flow trigger. It can be OnDemand, Scheduled, or Event. TriggerProperties (dict) --- Specifies the configuration details of a schedule-triggered flow that you define. Currently, these settings only apply to the Scheduled trigger type. Scheduled (dict) --- Specifies the configuration details of a schedule-triggered flow that you define. The scheduling expression that determines the rate at which the schedule will run, for example rate (5 minutes). DataPullMode (string) --- Specifies whether a scheduled flow has an incremental data transfer or a complete data transfer for each flow run. ScheduleStartTime (datetime) --- Specifies the scheduled start time for a scheduled-trigger flow. ScheduleEndTime (datetime) --- Specifies the scheduled end time for a scheduled-trigger flow. Timezone (string) --- Specifies the time zone used when referring to the date and time of a scheduled-triggered flow, such as America/New_York. ScheduleOffset (integer) --- Specifies the optional offset that is added to the time interval for a schedule-triggered flow. FirstExecutionFrom (datetime) --- Specifies the date range for the records to import from the connector in the first flow run.",
      "nested_params": [
        {
          "name": "Description",
          "type": "string",
          "required": false,
          "description": "A description of the flow you want to create.",
          "nested_params": []
        },
        {
          "name": "FlowName",
          "type": "string",
          "required": false,
          "description": "The specified name of the flow. Use underscores (_) or hyphens (-) only. Spaces are not allowed.",
          "nested_params": []
        },
        {
          "name": "KmsArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name of the AWS Key Management Service (KMS) key you provide for encryption.",
          "nested_params": []
        },
        {
          "name": "SourceFlowConfig",
          "type": "dict",
          "required": false,
          "description": "The configuration that controls how Customer Profiles retrieves data from the source.",
          "nested_params": [
            {
              "name": "ConnectorProfileName",
              "type": "string",
              "required": false,
              "description": "The name of the AppFlow connector profile. This name must be unique for each connector profile in the AWS account.",
              "nested_params": []
            },
            {
              "name": "ConnectorType",
              "type": "string",
              "required": false,
              "description": "The type of connector, such as Salesforce, Marketo, and so on.",
              "nested_params": []
            },
            {
              "name": "IncrementalPullConfig",
              "type": "dict",
              "required": false,
              "description": "Defines the configuration for a scheduled incremental data pull. If a valid configuration is provided, the fields specified in the configuration are used when querying for the incremental data pull.",
              "nested_params": [
                {
                  "name": "DatetimeTypeFieldName",
                  "type": "string",
                  "required": false,
                  "description": "A field that specifies the date time or timestamp field as the criteria to use when importing incremental records from the source.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "SourceConnectorProperties",
              "type": "dict",
              "required": false,
              "description": "Specifies the information that is required to query a particular source connector.",
              "nested_params": [
                {
                  "name": "Marketo",
                  "type": "dict",
                  "required": false,
                  "description": "The properties that are applied when Marketo is being used as a source.",
                  "nested_params": [
                    {
                      "name": "Object",
                      "type": "string",
                      "required": false,
                      "description": "The object specified in the Marketo flow source.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "S3",
                  "type": "dict",
                  "required": false,
                  "description": "The properties that are applied when Amazon S3 is being used as the flow source.",
                  "nested_params": [
                    {
                      "name": "BucketName",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon S3 bucket name where the source files are stored.",
                      "nested_params": []
                    },
                    {
                      "name": "BucketPrefix",
                      "type": "string",
                      "required": false,
                      "description": "The object key for the Amazon S3 bucket in which the source files are stored.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "Salesforce",
                  "type": "dict",
                  "required": false,
                  "description": "The properties that are applied when Salesforce is being used as a source.",
                  "nested_params": [
                    {
                      "name": "Object",
                      "type": "string",
                      "required": false,
                      "description": "The object specified in the Salesforce flow source.",
                      "nested_params": []
                    },
                    {
                      "name": "EnableDynamicFieldUpdate",
                      "type": "boolean",
                      "required": false,
                      "description": "The flag that enables dynamic fetching of new (recently added) fields in the Salesforce objects while running a flow.",
                      "nested_params": []
                    },
                    {
                      "name": "IncludeDeletedRecords",
                      "type": "boolean",
                      "required": false,
                      "description": "Indicates whether Amazon AppFlow includes deleted files in the flow run.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "ServiceNow",
                  "type": "dict",
                  "required": false,
                  "description": "The properties that are applied when ServiceNow is being used as a source.",
                  "nested_params": [
                    {
                      "name": "Object",
                      "type": "string",
                      "required": false,
                      "description": "The object specified in the ServiceNow flow source.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "Zendesk",
                  "type": "dict",
                  "required": false,
                  "description": "The properties that are applied when using Zendesk as a flow source.",
                  "nested_params": [
                    {
                      "name": "Object",
                      "type": "string",
                      "required": false,
                      "description": "The object specified in the Zendesk flow source.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Tasks",
          "type": "list",
          "required": false,
          "description": "A list of tasks that Customer Profiles performs while transferring the data in the flow run.",
          "nested_params": [
            {
              "name": "ConnectorOperator",
              "type": "dict",
              "required": false,
              "description": "The operation to be performed on the provided source fields.",
              "nested_params": [
                {
                  "name": "Marketo",
                  "type": "string",
                  "required": false,
                  "description": "The operation to be performed on the provided Marketo source fields.",
                  "nested_params": []
                },
                {
                  "name": "S3",
                  "type": "string",
                  "required": false,
                  "description": "The operation to be performed on the provided Amazon S3 source fields.",
                  "nested_params": []
                },
                {
                  "name": "Salesforce",
                  "type": "string",
                  "required": false,
                  "description": "The operation to be performed on the provided Salesforce source fields.",
                  "nested_params": []
                },
                {
                  "name": "ServiceNow",
                  "type": "string",
                  "required": false,
                  "description": "The operation to be performed on the provided ServiceNow source fields.",
                  "nested_params": []
                },
                {
                  "name": "Zendesk",
                  "type": "string",
                  "required": false,
                  "description": "The operation to be performed on the provided Zendesk source fields.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "DestinationField",
              "type": "string",
              "required": false,
              "description": "A field in a destination connector, or a field value against which Amazon AppFlow validates a source field.",
              "nested_params": []
            },
            {
              "name": "SourceFields",
              "type": "list",
              "required": false,
              "description": "The source fields to which a particular task is applied.",
              "nested_params": []
            },
            {
              "name": "TaskProperties",
              "type": "dict",
              "required": false,
              "description": "A map used to store task-related information. The service looks for particular information based on the TaskType.",
              "nested_params": []
            },
            {
              "name": "TaskType",
              "type": "string",
              "required": false,
              "description": "Specifies the particular task implementation that Amazon AppFlow performs.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "TriggerConfig",
          "type": "dict",
          "required": false,
          "description": "The trigger settings that determine how and when the flow runs.",
          "nested_params": [
            {
              "name": "TriggerType",
              "type": "string",
              "required": false,
              "description": "Specifies the type of flow trigger. It can be OnDemand, Scheduled, or Event.",
              "nested_params": []
            },
            {
              "name": "TriggerProperties",
              "type": "dict",
              "required": false,
              "description": "Specifies the configuration details of a schedule-triggered flow that you define. Currently, these settings only apply to the Scheduled trigger type.",
              "nested_params": [
                {
                  "name": "Scheduled",
                  "type": "dict",
                  "required": false,
                  "description": "Specifies the configuration details of a schedule-triggered flow that you define.",
                  "nested_params": [
                    {
                      "name": "ScheduleExpression",
                      "type": "string",
                      "required": false,
                      "description": "The scheduling expression that determines the rate at which the schedule will run, for example rate (5 minutes).",
                      "nested_params": []
                    },
                    {
                      "name": "DataPullMode",
                      "type": "string",
                      "required": false,
                      "description": "Specifies whether a scheduled flow has an incremental data transfer or a complete data transfer for each flow run.",
                      "nested_params": []
                    },
                    {
                      "name": "ScheduleStartTime",
                      "type": "datetime",
                      "required": false,
                      "description": "Specifies the scheduled start time for a scheduled-trigger flow.",
                      "nested_params": []
                    },
                    {
                      "name": "ScheduleEndTime",
                      "type": "datetime",
                      "required": false,
                      "description": "Specifies the scheduled end time for a scheduled-trigger flow.",
                      "nested_params": []
                    },
                    {
                      "name": "Timezone",
                      "type": "string",
                      "required": false,
                      "description": "Specifies the time zone used when referring to the date and time of a scheduled-triggered flow, such as America/New_York.",
                      "nested_params": []
                    },
                    {
                      "name": "ScheduleOffset",
                      "type": "integer",
                      "required": false,
                      "description": "Specifies the optional offset that is added to the time interval for a schedule-triggered flow.",
                      "nested_params": []
                    },
                    {
                      "name": "FirstExecutionFrom",
                      "type": "datetime",
                      "required": false,
                      "description": "Specifies the date range for the records to import from the connector in the first flow run.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "ObjectTypeNames",
      "type": "dict",
      "required": false,
      "description": "A map in which each key is an event type from an external application such as Segment or Shopify, and each value is an ObjectTypeName (template) used to ingest the event. It supports the following event types: SegmentIdentify, ShopifyCreateCustomers, ShopifyUpdateCustomers, ShopifyCreateDraftOrders, ShopifyUpdateDraftOrders, ShopifyCreateOrders, and ShopifyUpdatedOrders. (string) --- (string) ---",
      "nested_params": []
    },
    {
      "name": "RoleArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "EventTriggerNames",
      "type": "list",
      "required": false,
      "description": "A list of unique names for active event triggers associated with the integration. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "DomainName",
          "type": "string",
          "description": "The unique name of the domain.",
          "nested_items": []
        },
        {
          "name": "Uri",
          "type": "string",
          "description": "The URI of the S3 bucket or any other type of data source.",
          "nested_items": []
        },
        {
          "name": "ObjectTypeName",
          "type": "string",
          "description": "The name of the profile object type.",
          "nested_items": []
        },
        {
          "name": "CreatedAt",
          "type": "datetime",
          "description": "The timestamp of when the domain was created.",
          "nested_items": []
        },
        {
          "name": "LastUpdatedAt",
          "type": "datetime",
          "description": "The timestamp of when the domain was most recently edited.",
          "nested_items": []
        },
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "ObjectTypeNames",
          "type": "dict",
          "description": "A map in which each key is an event type from an external application such as Segment or Shopify, and each value is an ObjectTypeName (template) used to ingest the event. It supports the following event types: SegmentIdentify, ShopifyCreateCustomers, ShopifyUpdateCustomers, ShopifyCreateDraftOrders, ShopifyUpdateDraftOrders, ShopifyCreateOrders, and ShopifyUpdatedOrders.",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "WorkflowId",
          "type": "string",
          "description": "Unique identifier for the workflow.",
          "nested_items": []
        },
        {
          "name": "IsUnstructured",
          "type": "boolean",
          "description": "Boolean that shows if the Flow that's associated with the Integration is created in Amazon Appflow, or with ObjectTypeName equals _unstructured via API/CLI in flowDefinition.",
          "nested_items": []
        },
        {
          "name": "RoleArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the IAM role. The Integration uses this role to make Customer Profiles requests on your behalf.",
          "nested_items": []
        },
        {
          "name": "EventTriggerNames",
          "type": "list",
          "description": "A list of unique names for active event triggers associated with the integration. This list would be empty if no Event Trigger is associated with the integration.",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}