{
  "method_name": "start_sessions_statistics_aggregation",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/deadline/client/start_sessions_statistics_aggregation.html",
  "description": "Starts an asynchronous request for getting aggregated statistics about queues and farms. Get the statistics using the GetSessionsStatisticsAggregation operation. You can only have one running aggregation for your Deadline Cloud farm. Call the GetSessionsStatisticsAggregation operation and check the status field to see if an aggregation is running. Statistics are available for 1 hour after you call the StartSessionsStatisticsAggregation operation.",
  "parameters": [
    {
      "name": "farmId",
      "type": "string",
      "required": true,
      "description": "The identifier of the farm that contains queues or fleets to return statistics for.",
      "nested_params": []
    },
    {
      "name": "resourceIds",
      "type": "dict",
      "required": true,
      "description": "A list of fleet IDs or queue IDs to gather statistics for. queueIds (list) --- One to 10 queue IDs that specify the queues to return statistics for. If you specify the queueIds field, you can't specify the fleetIds field. (string) --- fleetIds (list) --- One to 10 fleet IDs that specify the fleets to return statistics for. If you specify the fleetIds field, you can't specify the queueIds field. (string) ---",
      "nested_params": [
        {
          "name": "queueIds",
          "type": "list",
          "required": false,
          "description": "One to 10 queue IDs that specify the queues to return statistics for. If you specify the queueIds field, you can't specify the fleetIds field.",
          "nested_params": []
        },
        {
          "name": "fleetIds",
          "type": "list",
          "required": false,
          "description": "One to 10 fleet IDs that specify the fleets to return statistics for. If you specify the fleetIds field, you can't specify the queueIds field.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "startTime",
      "type": "datetime",
      "required": true,
      "description": "The Linux timestamp of the date and time that the statistics start.",
      "nested_params": []
    },
    {
      "name": "endTime",
      "type": "datetime",
      "required": true,
      "description": "The Linux timestamp of the date and time that the statistics end.",
      "nested_params": []
    },
    {
      "name": "timezone",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "period",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "groupBy",
      "type": "list",
      "required": true,
      "description": "The field to use to group the statistics. (string) ---",
      "nested_params": []
    },
    {
      "name": "statistics",
      "type": "list",
      "required": true,
      "description": "One to four statistics to return. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "aggregationId",
          "type": "string",
          "description": "A unique identifier for the aggregated statistics. Use this identifier with the GetAggregatedStatisticsForSessions operation to return the statistics.",
          "nested_items": []
        }
      ]
    }
  ]
}