{
  "method_name": "batch_start_recommendations",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/dms/client/batch_start_recommendations.html",
  "description": "Starts the analysis of up to 20 source databases to recommend target engines for each source database. This is a batch version of StartRecommendations. The result of analysis of each source database is reported individually in the response. Because the batch request can result in a combination of successful and unsuccessful actions, you should check for batch errors even when the call returns an HTTP status code of 200.",
  "parameters": [
    {
      "name": "Data",
      "type": "list",
      "required": true,
      "description": "Provides information about source databases to analyze. After this analysis, Fleet Advisor recommends target engines for each source database. (dict) --- Provides information about the source database to analyze and provide target recommendations according to the specified requirements. DatabaseId (string) --- The identifier of the source database. Settings (dict) --- The required target engine settings. InstanceSizingType (string) --- The size of your target instance. Fleet Advisor calculates this value based on your data collection type, such as total capacity and resource utilization. Valid values include \"total-capacity\" and \"utilization\". WorkloadType (string) --- The deployment option for your target engine. For production databases, Fleet Advisor chooses Multi-AZ deployment. For development or test databases, Fleet Advisor chooses Single-AZ deployment. Valid values include \"development\" and \"production\".",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ErrorEntries",
          "type": "list",
          "description": "A list with error details about the analysis of each source database.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "DatabaseId",
                  "type": "string",
                  "description": "The identifier of the source database.",
                  "nested_items": []
                },
                {
                  "name": "Message",
                  "type": "string",
                  "description": "The information about the error.",
                  "nested_items": []
                },
                {
                  "name": "Code",
                  "type": "string",
                  "description": "The code of an error that occurred during the analysis of the source database.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}