{
  "method_name": "create_event_subscription",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/dms/client/create_event_subscription.html",
  "description": "Creates an DMS event notification subscription. You can specify the type of source ( SourceType) you want to be notified of, provide a list of DMS source IDs ( SourceIds) that triggers the events, and provide a list of event categories ( EventCategories) for events you want to be notified of. If you specify both the SourceType and SourceIds, such as SourceType = replication-instance and SourceIdentifier = my-replinstance, you will be notified of all the replication instance events for the specified source. If you specify a SourceType but don't specify a SourceIdentifier, you receive notice of the events for that source type for all your DMS sources. If you don't specify either SourceType nor SourceIdentifier, you will be notified of events generated from all DMS sources belonging to your customer account. For more information about DMS events, see Working with Events and Notifications in the Database Migration Service User Guide.",
  "parameters": [
    {
      "name": "SubscriptionName",
      "type": "string",
      "required": true,
      "description": "The name of the DMS event notification subscription. This name must be less than 255 characters.",
      "nested_params": []
    },
    {
      "name": "SnsTopicArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the Amazon SNS topic created for event notification. The ARN is created by Amazon SNS when you create a topic and subscribe to it.",
      "nested_params": []
    },
    {
      "name": "SourceType",
      "type": "string",
      "required": false,
      "description": "The type of DMS resource that generates the events. For example, if you want to be notified of events generated by a replication instance, you set this parameter to replication-instance. If this value isn't specified, all events are returned. Valid values: replication-instance | replication-task.",
      "nested_params": []
    },
    {
      "name": "EventCategories",
      "type": "list",
      "required": false,
      "description": "A list of event categories for a source type that you want to subscribe to. For more information, see Working with Events and Notifications in the Database Migration Service User Guide. (string) ---",
      "nested_params": []
    },
    {
      "name": "SourceIds",
      "type": "list",
      "required": false,
      "description": "A list of identifiers for which DMS provides notification events. If you don't specify a value, notifications are provided for all sources. If you specify multiple values, they must be of the same type. For example, if you specify a database instance ID, then all of the other values must be database instance IDs. (string) ---",
      "nested_params": []
    },
    {
      "name": "Enabled",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": false,
      "description": "One or more tags to be assigned to the event subscription. (dict) --- A user-defined key-value pair that describes metadata added to an DMS resource and that is used by operations such as the following: AddTagsToResource ListTagsForResource RemoveTagsFromResource Key (string) --- A key is the required name of the tag. The string value can be 1-128 Unicode characters in length and can't be prefixed with 'aws:' or 'dms:'. The string can only contain only the set of Unicode letters, digits, white-space, --\u0098_', --\u0098.', --\u0098/', --\u0098=', --\u0098+', --\u0098-' (Java regular expressions: '^([\\p{L}\\p{Z}\\p{N}_.:/=+\\-]*)$'). Value (string) --- A value is the optional value of the tag. The string value can be 1-256 Unicode characters in length and can't be prefixed with 'aws:' or 'dms:'. ResourceArn (string) --- The Amazon Resource Name (ARN) string that uniquely identifies the resource for which the tag is created.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "EventSubscription",
          "type": "dict",
          "description": "The event subscription that was created.",
          "nested_items": [
            {
              "name": "CustomerAwsId",
              "type": "string",
              "description": "The Amazon Web Services customer account associated with the DMS event notification subscription.",
              "nested_items": []
            },
            {
              "name": "CustSubscriptionId",
              "type": "string",
              "description": "The DMS event notification subscription Id.",
              "nested_items": []
            },
            {
              "name": "SnsTopicArn",
              "type": "string",
              "description": "The topic ARN of the DMS event notification subscription.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The status of the DMS event notification subscription.",
              "nested_items": []
            },
            {
              "name": "SubscriptionCreationTime",
              "type": "string",
              "description": "The time the DMS event notification subscription was created.",
              "nested_items": []
            },
            {
              "name": "SourceType",
              "type": "string",
              "description": "The type of DMS resource that generates events.",
              "nested_items": []
            },
            {
              "name": "SourceIdsList",
              "type": "list",
              "description": "A list of source Ids for the event subscription.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "EventCategoriesList",
              "type": "list",
              "description": "A lists of event categories.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Enabled",
              "type": "boolean",
              "description": "Boolean value that indicates if the event subscription is enabled.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}