{
  "method_name": "describe_account_attributes",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/dms/client/describe_account_attributes.html",
  "description": "Lists all of the DMS attributes for a customer account. These attributes include DMS quotas for the account and a unique account identifier in a particular DMS region. DMS quotas include a list of resource quotas supported by the account, such as the number of replication instances allowed. The description for each resource quota, includes the quota name, current usage toward that quota, and the quota's maximum value. DMS uses the unique account identifier to name each artifact used by DMS in the given region. This command does not take any parameters.",
  "parameters": [],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "AccountQuotas",
          "type": "list",
          "description": "Account quota information.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "AccountQuotaName",
                  "type": "string",
                  "description": "The name of the DMS quota for this Amazon Web Services account.",
                  "nested_items": []
                },
                {
                  "name": "Used",
                  "type": "integer",
                  "description": "The amount currently used toward the quota maximum.",
                  "nested_items": []
                },
                {
                  "name": "Max",
                  "type": "integer",
                  "description": "The maximum allowed value for the quota.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "UniqueAccountIdentifier",
          "type": "string",
          "description": "A unique DMS identifier for an account in a particular Amazon Web Services Region. The value of this identifier has the following format: c99999999999. DMS uses this identifier to name artifacts. For example, DMS uses this identifier to name the default Amazon S3 bucket for storing task assessment reports in a given Amazon Web Services Region. The format of this S3 bucket name is the following: dms-AccountNumber-UniqueAccountIdentifier. Here is an example name for this default S3 bucket: dms-111122223333-c44445555666.",
          "nested_items": []
        }
      ]
    }
  ]
}