{
  "method_name": "describe_pending_maintenance_actions",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/dms/client/describe_pending_maintenance_actions.html",
  "description": "Returns a list of upcoming maintenance events for replication instances in your account in the current Region.",
  "parameters": [
    {
      "name": "ReplicationInstanceArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": true,
      "description": "(dict) --- Identifies the name and value of a filter object. This filter is used to limit the number and type of DMS objects that are returned for a particular Describe* call or similar operation. Filters are used as an optional parameter for certain API operations. The name of the filter as specified for a Describe* or similar operation. The filter value, which can specify one or more values used to narrow the returned results. (string) ---",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name of the filter as specified for a Describe* or similar operation.",
          "nested_params": []
        },
        {
          "name": "Values",
          "type": "list",
          "required": false,
          "description": "The filter value, which can specify one or more values used to narrow the returned results.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Marker",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxRecords",
      "type": "integer",
      "required": false,
      "description": "The maximum number of records to include in the response. If more records exist than the specified MaxRecords value, a pagination token called a marker is included in the response so that the remaining results can be retrieved. Default: 100 Constraints: Minimum 20, maximum 100.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "PendingMaintenanceActions",
          "type": "list",
          "description": "The pending maintenance action.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ResourceIdentifier",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the DMS resource that the pending maintenance action applies to. For information about creating an ARN, see Constructing an Amazon Resource Name (ARN) for DMS in the DMS documentation.",
                  "nested_items": []
                },
                {
                  "name": "PendingMaintenanceActionDetails",
                  "type": "list",
                  "description": "Detailed information about the pending maintenance action.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Action",
                          "type": "string",
                          "description": "The type of pending maintenance action that is available for the resource.",
                          "nested_items": []
                        },
                        {
                          "name": "AutoAppliedAfterDate",
                          "type": "datetime",
                          "description": "The date of the maintenance window when the action is to be applied. The maintenance action is applied to the resource during its first maintenance window after this date. If this date is specified, any next-maintenance opt-in requests are ignored.",
                          "nested_items": []
                        },
                        {
                          "name": "ForcedApplyDate",
                          "type": "datetime",
                          "description": "The date when the maintenance action will be automatically applied. The maintenance action is applied to the resource on this date regardless of the maintenance window for the resource. If this date is specified, any immediate opt-in requests are ignored.",
                          "nested_items": []
                        },
                        {
                          "name": "OptInStatus",
                          "type": "string",
                          "description": "The type of opt-in request that has been received for the resource.",
                          "nested_items": []
                        },
                        {
                          "name": "CurrentApplyDate",
                          "type": "datetime",
                          "description": "The effective date when the pending maintenance action will be applied to the resource. This date takes into account opt-in requests received from the ApplyPendingMaintenanceAction API operation, and also the AutoAppliedAfterDate and ForcedApplyDate parameter values. This value is blank if an opt-in request has not been received and nothing has been specified for AutoAppliedAfterDate or ForcedApplyDate.",
                          "nested_items": []
                        },
                        {
                          "name": "Description",
                          "type": "string",
                          "description": "A description providing more detail about the maintenance action.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "Marker",
          "type": "string",
          "description": "An optional pagination token provided by a previous request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by MaxRecords.",
          "nested_items": []
        }
      ]
    }
  ]
}