{
  "method_name": "describe_recommendation_limitations",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/dms/client/describe_recommendation_limitations.html",
  "description": "Returns a paginated list of limitations for recommendations of target Amazon Web Services engines.",
  "parameters": [
    {
      "name": "Filters",
      "type": "list",
      "required": true,
      "description": "Filters applied to the limitations described in the form of key-value pairs. (dict) --- Identifies the name and value of a filter object. This filter is used to limit the number and type of DMS objects that are returned for a particular Describe* call or similar operation. Filters are used as an optional parameter for certain API operations. The name of the filter as specified for a Describe* or similar operation. The filter value, which can specify one or more values used to narrow the returned results. (string) ---",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name of the filter as specified for a Describe* or similar operation.",
          "nested_params": []
        },
        {
          "name": "Values",
          "type": "list",
          "required": false,
          "description": "The filter value, which can specify one or more values used to narrow the returned results.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "MaxRecords",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "Specifies the unique pagination token that makes it possible to display the next page of results. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by MaxRecords. If NextToken is returned by a previous response, there are more results available. The value of NextToken is a unique pagination token for each page. Make the call again using the returned token to retrieve the next page. Keep all other arguments unchanged.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "NextToken",
          "type": "string",
          "description": "The unique pagination token returned for you to pass to a subsequent request. Fleet Advisor returns this token when the number of records in the response is greater than the MaxRecords value. To retrieve the next page, make the call again using the returned token and keeping all other arguments unchanged.",
          "nested_items": []
        },
        {
          "name": "Limitations",
          "type": "list",
          "description": "The list of limitations for recommendations of target Amazon Web Services engines.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "DatabaseId",
                  "type": "string",
                  "description": "The identifier of the source database.",
                  "nested_items": []
                },
                {
                  "name": "EngineName",
                  "type": "string",
                  "description": "The name of the target engine that Fleet Advisor should use in the target engine recommendation. Valid values include \"rds-aurora-mysql\", \"rds-aurora-postgresql\", \"rds-mysql\", \"rds-oracle\", \"rds-sql-server\", and \"rds-postgresql\".",
                  "nested_items": []
                },
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The name of the limitation. Describes unsupported database features, migration action items, and other limitations.",
                  "nested_items": []
                },
                {
                  "name": "Description",
                  "type": "string",
                  "description": "A description of the limitation. Provides additional information about the limitation, and includes recommended actions that you can take to address or avoid this limitation.",
                  "nested_items": []
                },
                {
                  "name": "Impact",
                  "type": "string",
                  "description": "The impact of the limitation. You can use this parameter to prioritize limitations that you want to address. Valid values include \"Blocker\", \"High\", \"Medium\", and \"Low\".",
                  "nested_items": []
                },
                {
                  "name": "Type",
                  "type": "string",
                  "description": "The type of the limitation, such as action required, upgrade required, and limited feature.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}