{
  "method_name": "describe_recommendations",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/dms/client/describe_recommendations.html",
  "description": "Returns a paginated list of target engine recommendations for your source databases.",
  "parameters": [
    {
      "name": "Filters",
      "type": "list",
      "required": true,
      "description": "Filters applied to the target engine recommendations described in the form of key-value pairs. (dict) --- Identifies the name and value of a filter object. This filter is used to limit the number and type of DMS objects that are returned for a particular Describe* call or similar operation. Filters are used as an optional parameter for certain API operations. The name of the filter as specified for a Describe* or similar operation. The filter value, which can specify one or more values used to narrow the returned results. (string) ---",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name of the filter as specified for a Describe* or similar operation.",
          "nested_params": []
        },
        {
          "name": "Values",
          "type": "list",
          "required": false,
          "description": "The filter value, which can specify one or more values used to narrow the returned results.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "MaxRecords",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "Specifies the unique pagination token that makes it possible to display the next page of results. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by MaxRecords. If NextToken is returned by a previous response, there are more results available. The value of NextToken is a unique pagination token for each page. Make the call again using the returned token to retrieve the next page. Keep all other arguments unchanged.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "NextToken",
          "type": "string",
          "description": "The unique pagination token returned for you to pass to a subsequent request. Fleet Advisor returns this token when the number of records in the response is greater than the MaxRecords value. To retrieve the next page, make the call again using the returned token and keeping all other arguments unchanged.",
          "nested_items": []
        },
        {
          "name": "Recommendations",
          "type": "list",
          "description": "The list of recommendations of target engines that Fleet Advisor created for the source database.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "DatabaseId",
                  "type": "string",
                  "description": "The identifier of the source database for which Fleet Advisor provided this recommendation.",
                  "nested_items": []
                },
                {
                  "name": "EngineName",
                  "type": "string",
                  "description": "The name of the target engine. Valid values include \"rds-aurora-mysql\", \"rds-aurora-postgresql\", \"rds-mysql\", \"rds-oracle\", \"rds-sql-server\", and \"rds-postgresql\".",
                  "nested_items": []
                },
                {
                  "name": "CreatedDate",
                  "type": "string",
                  "description": "The date when Fleet Advisor created the target engine recommendation.",
                  "nested_items": []
                },
                {
                  "name": "Status",
                  "type": "string",
                  "description": "The status of the target engine recommendation. Valid values include \"alternate\", \"in-progress\", \"not-viable\", and \"recommended\".",
                  "nested_items": []
                },
                {
                  "name": "Preferred",
                  "type": "boolean",
                  "description": "Indicates that this target is the rightsized migration destination.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "InstanceSizingType",
                      "type": "string",
                      "description": "The size of your target instance. Fleet Advisor calculates this value based on your data collection type, such as total capacity and resource utilization. Valid values include \"total-capacity\" and \"utilization\".",
                      "nested_items": []
                    },
                    {
                      "name": "WorkloadType",
                      "type": "string",
                      "description": "The deployment option for your target engine. For production databases, Fleet Advisor chooses Multi-AZ deployment. For development or test databases, Fleet Advisor chooses Single-AZ deployment. Valid values include \"development\" and \"production\".",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "RdsEngine",
                      "type": "dict",
                      "description": "The recommendation of a target Amazon RDS database engine.",
                      "nested_items": [
                        {
                          "name": "RequirementsToTarget",
                          "type": "dict",
                          "description": "Supplemental information about the requirements to the recommended target database on Amazon RDS.",
                          "nested_items": [
                            {
                              "name": "EngineEdition",
                              "type": "string",
                              "description": "The required target Amazon RDS engine edition.",
                              "nested_items": []
                            },
                            {
                              "name": "InstanceVcpu",
                              "type": "float",
                              "description": "The required number of virtual CPUs (vCPU) on the Amazon RDS DB instance.",
                              "nested_items": []
                            },
                            {
                              "name": "InstanceMemory",
                              "type": "float",
                              "description": "The required memory on the Amazon RDS DB instance.",
                              "nested_items": []
                            },
                            {
                              "name": "StorageSize",
                              "type": "integer",
                              "description": "The required Amazon RDS DB instance storage size.",
                              "nested_items": []
                            },
                            {
                              "name": "StorageIops",
                              "type": "integer",
                              "description": "The required number of I/O operations completed each second (IOPS) on your Amazon RDS DB instance.",
                              "nested_items": []
                            },
                            {
                              "name": "DeploymentOption",
                              "type": "string",
                              "description": "The required deployment option for the Amazon RDS DB instance. Valid values include \"MULTI_AZ\" for Multi-AZ deployments and \"SINGLE_AZ\" for Single-AZ deployments.",
                              "nested_items": []
                            },
                            {
                              "name": "EngineVersion",
                              "type": "string",
                              "description": "The required target Amazon RDS engine version.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "TargetConfiguration",
                          "type": "dict",
                          "description": "Supplemental information about the configuration of the recommended target database on Amazon RDS.",
                          "nested_items": [
                            {
                              "name": "EngineEdition",
                              "type": "string",
                              "description": "Describes the recommended target Amazon RDS engine edition.",
                              "nested_items": []
                            },
                            {
                              "name": "InstanceType",
                              "type": "string",
                              "description": "Describes the recommended target Amazon RDS instance type.",
                              "nested_items": []
                            },
                            {
                              "name": "InstanceVcpu",
                              "type": "float",
                              "description": "Describes the number of virtual CPUs (vCPU) on the recommended Amazon RDS DB instance that meets your requirements.",
                              "nested_items": []
                            },
                            {
                              "name": "InstanceMemory",
                              "type": "float",
                              "description": "Describes the memory on the recommended Amazon RDS DB instance that meets your requirements.",
                              "nested_items": []
                            },
                            {
                              "name": "StorageType",
                              "type": "string",
                              "description": "Describes the storage type of the recommended Amazon RDS DB instance that meets your requirements.",
                              "nested_items": []
                            },
                            {
                              "name": "StorageSize",
                              "type": "integer",
                              "description": "Describes the storage size of the recommended Amazon RDS DB instance that meets your requirements.",
                              "nested_items": []
                            },
                            {
                              "name": "StorageIops",
                              "type": "integer",
                              "description": "Describes the number of I/O operations completed each second (IOPS) on the recommended Amazon RDS DB instance that meets your requirements.",
                              "nested_items": []
                            },
                            {
                              "name": "DeploymentOption",
                              "type": "string",
                              "description": "Describes the deployment option for the recommended Amazon RDS DB instance. The deployment options include Multi-AZ and Single-AZ deployments. Valid values include \"MULTI_AZ\" and \"SINGLE_AZ\".",
                              "nested_items": []
                            },
                            {
                              "name": "EngineVersion",
                              "type": "string",
                              "description": "Describes the recommended target Amazon RDS engine version.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}