{
  "method_name": "start_recommendations",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/dms/client/start_recommendations.html",
  "description": "Starts the analysis of your source database to provide recommendations of target engines. You can create recommendations for multiple source databases using BatchStartRecommendations.",
  "parameters": [
    {
      "name": "DatabaseId",
      "type": "string",
      "required": true,
      "description": "The identifier of the source database to analyze and provide recommendations for.",
      "nested_params": []
    },
    {
      "name": "Settings",
      "type": "dict",
      "required": true,
      "description": "The settings in JSON format that Fleet Advisor uses to determine target engine recommendations. These parameters include target instance sizing and availability and durability settings. For target instance sizing, Fleet Advisor supports the following two options: total capacity and resource utilization. For availability and durability, Fleet Advisor supports the following two options: production (Multi-AZ deployments) and Dev/Test (Single-AZ deployments). The size of your target instance. Fleet Advisor calculates this value based on your data collection type, such as total capacity and resource utilization. Valid values include \"total-capacity\" and \"utilization\". The deployment option for your target engine. For production databases, Fleet Advisor chooses Multi-AZ deployment. For development or test databases, Fleet Advisor chooses Single-AZ deployment. Valid values include \"development\" and \"production\".",
      "nested_params": [
        {
          "name": "InstanceSizingType",
          "type": "string",
          "required": false,
          "description": "The size of your target instance. Fleet Advisor calculates this value based on your data collection type, such as total capacity and resource utilization. Valid values include \"total-capacity\" and \"utilization\".",
          "nested_params": []
        },
        {
          "name": "WorkloadType",
          "type": "string",
          "required": false,
          "description": "The deployment option for your target engine. For production databases, Fleet Advisor chooses Multi-AZ deployment. For development or test databases, Fleet Advisor chooses Single-AZ deployment. Valid values include \"development\" and \"production\".",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}