{
  "method_name": "share_directory",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ds/client/share_directory.html",
  "description": "Shares a specified directory ( DirectoryId) in your Amazon Web Services account (directory owner) with another Amazon Web Services account (directory consumer). With this operation you can use your directory from any Amazon Web Services account and from any Amazon VPC within an Amazon Web Services Region. When you share your Managed Microsoft AD directory, Directory Service creates a shared directory in the directory consumer account. This shared directory contains the metadata to provide access to the directory within the directory owner account. The shared directory is visible in all VPCs in the directory consumer account. The ShareMethod parameter determines whether the specified directory can be shared between Amazon Web Services accounts inside the same Amazon Web Services organization ( ORGANIZATIONS). It also determines whether you can share the directory with any other Amazon Web Services account either inside or outside of the organization ( HANDSHAKE). The ShareNotes parameter is only used when HANDSHAKE is called, which sends a directory sharing request to the directory consumer.",
  "parameters": [
    {
      "name": "DirectoryId",
      "type": "string",
      "required": true,
      "description": "Identifier of the Managed Microsoft AD directory that you want to share with other Amazon Web Services accounts.",
      "nested_params": []
    },
    {
      "name": "ShareNotes",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ShareTarget",
      "type": "dict",
      "required": true,
      "description": "Identifier for the directory consumer account with whom the directory is to be shared. Identifier of the directory consumer account. Type of identifier to be used in the Id field.",
      "nested_params": [
        {
          "name": "Id",
          "type": "string",
          "required": false,
          "description": "Identifier of the directory consumer account.",
          "nested_params": []
        },
        {
          "name": "Type",
          "type": "string",
          "required": false,
          "description": "Type of identifier to be used in the Id field.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ShareMethod",
      "type": "string",
      "required": true,
      "description": "The method used when sharing a directory to determine whether the directory should be shared within your Amazon Web Services organization ( ORGANIZATIONS) or with any Amazon Web Services account by sending a directory sharing request ( HANDSHAKE).",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "SharedDirectoryId",
          "type": "string",
          "description": "Identifier of the directory that is stored in the directory consumer account that is shared from the specified directory ( DirectoryId).",
          "nested_items": []
        }
      ]
    }
  ]
}