{
  "method_name": "batch_update_phone_number",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/chime/client/batch_update_phone_number.html",
  "description": "Updates phone number product types or calling names. You can update one attribute at a time for each UpdatePhoneNumberRequestItem. For example, you can update the product type or the calling name. For toll-free numbers, you cannot use the Amazon Chime Business Calling product type. For numbers outside the U.S., you must use the Amazon Chime SIP Media Application Dial-In product type. Updates to outbound calling names can take up to 72 hours to complete. Pending updates to outbound calling names must be complete before you can request another update.",
  "parameters": [
    {
      "name": "UpdatePhoneNumberRequestItems",
      "type": "list",
      "required": true,
      "description": "The request containing the phone number IDs and product types or calling names to update. (dict) --- The phone number ID, product type, or calling name fields to update, used with the  BatchUpdatePhoneNumber and  UpdatePhoneNumber actions. PhoneNumberId (string) --- The phone number ID to update. ProductType (string) --- The product type to update. CallingName (string) --- The outbound calling name to update.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "PhoneNumberErrors",
          "type": "list",
          "description": "If the action fails for one or more of the phone numbers in the request, a list of the phone numbers is returned, along with error codes and error messages.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "PhoneNumberId",
                  "type": "string",
                  "description": "The phone number ID for which the action failed.",
                  "nested_items": []
                },
                {
                  "name": "ErrorCode",
                  "type": "string",
                  "description": "The error code.",
                  "nested_items": []
                },
                {
                  "name": "ErrorMessage",
                  "type": "string",
                  "description": "The error message.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}