{
  "method_name": "send_data_set_notification",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/dataexchange/client/send_data_set_notification.html",
  "description": "The type of event associated with the data set.",
  "parameters": [
    {
      "name": "Scope",
      "type": "dict",
      "required": true,
      "description": "Affected scope of this notification such as the underlying resources affected by the notification event. LakeFormationTagPolicies (list) --- Underlying LF resources that will be affected by this notification. (dict) --- Extra details specific to the affected scope in this LF data set. Database (string) --- The underlying Glue database that the notification is referring to. Table (string) --- The underlying Glue table that the notification is referring to. RedshiftDataShares (list) --- Underlying Redshift resources that will be affected by this notification. (dict) --- Extra details specific to the affected scope in this Redshift data set. The ARN of the underlying Redshift data share that is being affected by this notification. The database name in the Redshift data share that is being affected by this notification. Function (string) --- A function name in the Redshift database that is being affected by this notification. Table (string) --- A table name in the Redshift database that is being affected by this notification. Schema (string) --- A schema name in the Redshift database that is being affected by this notification. View (string) --- A view name in the Redshift database that is being affected by this notification. S3DataAccesses (list) --- Underlying S3 resources that will be affected by this notification. (dict) --- Extra details specific to the affected scope in this S3 Data Access data set. KeyPrefixes (list) --- A list of the key prefixes affected by this notification. This can have up to 50 entries. (string) --- Keys (list) --- A list of the keys affected by this notification. (string) ---",
      "nested_params": [
        {
          "name": "LakeFormationTagPolicies",
          "type": "list",
          "required": false,
          "description": "Underlying LF resources that will be affected by this notification.",
          "nested_params": [
            {
              "name": "Database",
              "type": "string",
              "required": false,
              "description": "The underlying Glue database that the notification is referring to.",
              "nested_params": []
            },
            {
              "name": "Table",
              "type": "string",
              "required": false,
              "description": "The underlying Glue table that the notification is referring to.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "RedshiftDataShares",
          "type": "list",
          "required": false,
          "description": "Underlying Redshift resources that will be affected by this notification.",
          "nested_params": [
            {
              "name": "Arn",
              "type": "string",
              "required": false,
              "description": "The ARN of the underlying Redshift data share that is being affected by this notification.",
              "nested_params": []
            },
            {
              "name": "Database",
              "type": "string",
              "required": false,
              "description": "The database name in the Redshift data share that is being affected by this notification.",
              "nested_params": []
            },
            {
              "name": "Function",
              "type": "string",
              "required": false,
              "description": "A function name in the Redshift database that is being affected by this notification.",
              "nested_params": []
            },
            {
              "name": "Table",
              "type": "string",
              "required": false,
              "description": "A table name in the Redshift database that is being affected by this notification.",
              "nested_params": []
            },
            {
              "name": "Schema",
              "type": "string",
              "required": false,
              "description": "A schema name in the Redshift database that is being affected by this notification.",
              "nested_params": []
            },
            {
              "name": "View",
              "type": "string",
              "required": false,
              "description": "A view name in the Redshift database that is being affected by this notification.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "S3DataAccesses",
          "type": "list",
          "required": false,
          "description": "Underlying S3 resources that will be affected by this notification.",
          "nested_params": [
            {
              "name": "KeyPrefixes",
              "type": "list",
              "required": false,
              "description": "A list of the key prefixes affected by this notification. This can have up to 50 entries.",
              "nested_params": []
            },
            {
              "name": "Keys",
              "type": "list",
              "required": false,
              "description": "A list of the keys affected by this notification. This can have up to 50 entries.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": false,
      "description": "Idempotency key for the notification, this key allows us to deduplicate notifications that are sent in quick succession erroneously. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "Comment",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DataSetId",
      "type": "string",
      "required": true,
      "description": "Affected data set of the notification.",
      "nested_params": []
    },
    {
      "name": "Details",
      "type": "dict",
      "required": true,
      "description": "Extra details specific to this notification type. DataUpdate (dict) --- Extra details specific to a data update type notification. DataUpdatedAt (datetime) --- A datetime in the past when the data was updated. This typically means that the underlying resource supporting the data set was updated. Deprecation (dict) --- Extra details specific to a deprecation type notification. A datetime in the future when the data set will be deprecated. SchemaChange (dict) --- Extra details specific to a schema change type notification. Changes (list) --- List of schema changes happening in the scope of this notification. This can have up to 100 entries. (dict) --- Object encompassing information about a schema change to a single, particular field, a notification can have up to 100 of these. Name of the changing field. This value can be up to 255 characters long. Is the field being added, removed, or modified? Description (string) --- Description of what's changing about this field. This value can be up to 512 characters long. A date in the future when the schema change is taking effect.",
      "nested_params": [
        {
          "name": "DataUpdate",
          "type": "dict",
          "required": false,
          "description": "Extra details specific to a data update type notification.",
          "nested_params": [
            {
              "name": "DataUpdatedAt",
              "type": "datetime",
              "required": false,
              "description": "A datetime in the past when the data was updated. This typically means that the underlying resource supporting the data set was updated.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Deprecation",
          "type": "dict",
          "required": false,
          "description": "Extra details specific to a deprecation type notification.",
          "nested_params": [
            {
              "name": "DeprecationAt",
              "type": "datetime",
              "required": false,
              "description": "A datetime in the future when the data set will be deprecated.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "SchemaChange",
          "type": "dict",
          "required": false,
          "description": "Extra details specific to a schema change type notification.",
          "nested_params": [
            {
              "name": "Changes",
              "type": "list",
              "required": false,
              "description": "List of schema changes happening in the scope of this notification. This can have up to 100 entries.",
              "nested_params": [
                {
                  "name": "Name",
                  "type": "string",
                  "required": false,
                  "description": "Name of the changing field. This value can be up to 255 characters long.",
                  "nested_params": []
                },
                {
                  "name": "Type",
                  "type": "string",
                  "required": false,
                  "description": "Is the field being added, removed, or modified?",
                  "nested_params": []
                },
                {
                  "name": "Description",
                  "type": "string",
                  "required": false,
                  "description": "Description of what's changing about this field. This value can be up to 512 characters long.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "SchemaChangeAt",
              "type": "datetime",
              "required": false,
              "description": "A date in the future when the schema change is taking effect.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "Type",
      "type": "string",
      "required": true,
      "description": "The type of the notification. Describing the kind of event the notification is alerting you to.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": []
    }
  ]
}