{
  "method_name": "create_table",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/keyspaces/client/create_table.html",
  "description": "The CreateTable operation adds a new table to the specified keyspace. Within a keyspace, table names must be unique. CreateTable is an asynchronous operation. When the request is received, the status of the table is set to CREATING. You can monitor the creation status of the new table by using the GetTable operation, which returns the current status of the table. You can start using a table when the status is ACTIVE. For more information, see Create a table in the Amazon Keyspaces Developer Guide.",
  "parameters": [
    {
      "name": "keyspaceName",
      "type": "string",
      "required": true,
      "description": "The name of the keyspace that the table is going to be created in.",
      "nested_params": []
    },
    {
      "name": "tableName",
      "type": "string",
      "required": true,
      "description": "The name of the table.",
      "nested_params": []
    },
    {
      "name": "schemaDefinition",
      "type": "dict",
      "required": true,
      "description": "The schemaDefinition consists of the following parameters. For each column to be created: name - The name of the column. type - An Amazon Keyspaces data type. For more information, see Data types in the Amazon Keyspaces Developer Guide. The primary key of the table consists of the following columns: partitionKeys - The partition key can be a single column, or it can be a compound value composed of two or more columns. The partition key portion of the primary key is required and determines how Amazon Keyspaces stores your data. name - The name of each partition key column. clusteringKeys - The optional clustering column portion of your primary key determines how the data is clustered and sorted within each partition. name - The name of the clustering column. orderBy - Sets the ascendant ( ASC) or descendant ( DESC) order modifier. To define a column as static use staticColumns - Static columns store values that are shared by all rows in the same partition: name - The name of the column. The regular columns of the table. (dict) --- The names and data types of regular columns. The name of the column. The data type of the column. For a list of available data types, see Data types in the Amazon Keyspaces Developer Guide. The columns that are part of the partition key of the table . (dict) --- The partition key portion of the primary key is required and determines how Amazon Keyspaces stores the data. The partition key can be a single column, or it can be a compound value composed of two or more columns. The name(s) of the partition key column(s). clusteringKeys (list) --- The columns that are part of the clustering key of the table. (dict) --- The optional clustering column portion of your primary key determines how the data is clustered and sorted within each partition. The name(s) of the clustering column(s). Sets the ascendant ( ASC) or descendant ( DESC) order modifier. staticColumns (list) --- The columns that have been defined as STATIC. Static columns store values that are shared by all rows in the same partition. (dict) --- The static columns of the table. The name of the static column.",
      "nested_params": []
    },
    {
      "name": "comment",
      "type": "dict",
      "required": true,
      "description": "This parameter allows to enter a description of the table. An optional description of the table.",
      "nested_params": [
        {
          "name": "message",
          "type": "string",
          "required": false,
          "description": "An optional description of the table.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "capacitySpecification",
      "type": "dict",
      "required": true,
      "description": "Specifies the read/write throughput capacity mode for the table. The options are: throughputMode:PAY_PER_REQUEST and throughputMode:PROVISIONED - Provisioned capacity mode requires readCapacityUnits and writeCapacityUnits as input. The default is throughput_mode:PAY_PER_REQUEST. For more information, see Read/write capacity modes in the Amazon Keyspaces Developer Guide. The read/write throughput capacity mode for a table. readCapacityUnits (integer) --- The throughput capacity specified for read operations defined in read capacity units (RCUs). writeCapacityUnits (integer) --- The throughput capacity specified for write operations defined in write capacity units (WCUs).",
      "nested_params": []
    },
    {
      "name": "encryptionSpecification",
      "type": "dict",
      "required": true,
      "description": "Specifies how the encryption key for encryption at rest is managed for the table. You can choose one of the following KMS key (KMS key): type:AWS_OWNED_KMS_KEY - This key is owned by Amazon Keyspaces. type:CUSTOMER_MANAGED_KMS_KEY - This key is stored in your account and is created, owned, and managed by you. This option requires the kms_key_identifier of the KMS key in Amazon Resource Name (ARN) format as input. The default is type:AWS_OWNED_KMS_KEY. For more information, see Encryption at rest in the Amazon Keyspaces Developer Guide. The encryption option specified for the table. You can choose one of the following KMS keys (KMS keys): type:AWS_OWNED_KMS_KEY - This key is owned by Amazon Keyspaces. kmsKeyIdentifier (string) --- The Amazon Resource Name (ARN) of the customer managed KMS key, for example kms_key_identifier:ARN.",
      "nested_params": []
    },
    {
      "name": "pointInTimeRecovery",
      "type": "dict",
      "required": true,
      "description": "Specifies if pointInTimeRecovery is enabled or disabled for the table. The options are: status=ENABLED status=DISABLED If it's not specified, the default is status=DISABLED. For more information, see Point-in-time recovery in the Amazon Keyspaces Developer Guide. The options are: status=ENABLED status=DISABLED.",
      "nested_params": []
    },
    {
      "name": "ttl",
      "type": "dict",
      "required": true,
      "description": "Enables Time to Live custom settings for the table. The options are: status:enabled status:disabled The default is status:disabled. After ttl is enabled, you can't disable it for the table. For more information, see Expiring data by using Amazon Keyspaces Time to Live (TTL) in the Amazon Keyspaces Developer Guide. Shows how to enable custom Time to Live (TTL) settings for the specified table.",
      "nested_params": []
    },
    {
      "name": "defaultTimeToLive",
      "type": "integer",
      "required": false,
      "description": "The default Time to Live setting in seconds for the table. For more information, see Setting the default TTL value for a table in the Amazon Keyspaces Developer Guide.",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "list",
      "required": true,
      "description": "A list of key-value pair tags to be attached to the resource. For more information, see Adding tags and labels to Amazon Keyspaces resources in the Amazon Keyspaces Developer Guide. (dict) --- Describes a tag. A tag is a key-value pair. You can add up to 50 tags to a single Amazon Keyspaces resource. Amazon Web Services-assigned tag names and values are automatically assigned the aws: prefix, which the user cannot assign. Amazon Web Services-assigned tag names do not count towards the tag limit of 50. User-assigned tag names have the prefix user: in the Cost Allocation Report. You cannot backdate the application of a tag. The key of the tag. Tag keys are case sensitive. Each Amazon Keyspaces resource can only have up to one tag with the same key. If you try to add an existing tag (same key), the existing tag value will be updated to the new value. The value of the tag. Tag values are case-sensitive and can be null.",
      "nested_params": [
        {
          "name": "key",
          "type": "string",
          "required": false,
          "description": "The key of the tag. Tag keys are case sensitive. Each Amazon Keyspaces resource can only have up to one tag with the same key. If you try to add an existing tag (same key), the existing tag value will be updated to the new value.",
          "nested_params": []
        },
        {
          "name": "value",
          "type": "string",
          "required": false,
          "description": "The value of the tag. Tag values are case-sensitive and can be null.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "clientSideTimestamps",
      "type": "dict",
      "required": true,
      "description": "Enables client-side timestamps for the table. By default, the setting is disabled. You can enable client-side timestamps with the following option: status: \"enabled\" Once client-side timestamps are enabled for a table, this setting cannot be disabled. Shows how to enable client-side timestamps settings for the specified table.",
      "nested_params": []
    },
    {
      "name": "autoScalingSpecification",
      "type": "dict",
      "required": true,
      "description": "The optional auto scaling settings for a table in provisioned capacity mode. Specifies if the service can manage throughput capacity automatically on your behalf. Auto scaling helps you provision throughput capacity for variable workloads efficiently by increasing and decreasing your table's read and write capacity automatically in response to application traffic. For more information, see Managing throughput capacity automatically with Amazon Keyspaces auto scaling in the Amazon Keyspaces Developer Guide. By default, auto scaling is disabled for a table. writeCapacityAutoScaling (dict) --- The auto scaling settings for the table's write capacity. autoScalingDisabled (boolean) --- This optional parameter enables auto scaling for the table if set to false. minimumUnits (integer) --- The minimum level of throughput the table should always be ready to support. The value must be between 1 and the max throughput per second quota for your account (40,000 by default). maximumUnits (integer) --- Manage costs by specifying the maximum amount of throughput to provision. scalingPolicy (dict) --- Amazon Keyspaces supports the target tracking auto scaling policy. With this policy, Amazon Keyspaces auto scaling ensures that the table's ratio of consumed to provisioned capacity stays at or near the target value that you specify. You define the target value as a percentage between 20 and 90. targetTrackingScalingPolicyConfiguration (dict) --- Auto scaling scales up capacity automatically when traffic exceeds this target utilization rate, and then back down when it falls below the target. A double between 20 and 90. disableScaleIn (boolean) --- Specifies if scale-in is enabled. When auto scaling automatically decreases capacity for a table, the table scales in. When scaling policies are set, they can't scale in the table lower than its minimum capacity. scaleInCooldown (integer) --- Specifies a scale-in cool down period. A cooldown period in seconds between scaling activities that lets the table stabilize before another scaling activity starts. scaleOutCooldown (integer) --- Specifies a scale out cool down period. Specifies the target value for the target tracking auto scaling policy. Amazon Keyspaces auto scaling scales up capacity automatically when traffic exceeds this target utilization rate, and then back down when it falls below the target. This ensures that the ratio of consumed capacity to provisioned capacity stays at or near this value. You define targetValue as a percentage. readCapacityAutoScaling (dict) --- The auto scaling settings for the table's read capacity. A double between 20 and 90.",
      "nested_params": [
        {
          "name": "writeCapacityAutoScaling",
          "type": "dict",
          "required": false,
          "description": "The auto scaling settings for the table's write capacity.",
          "nested_params": [
            {
              "name": "autoScalingDisabled",
              "type": "boolean",
              "required": false,
              "description": "This optional parameter enables auto scaling for the table if set to false.",
              "nested_params": []
            },
            {
              "name": "minimumUnits",
              "type": "integer",
              "required": false,
              "description": "The minimum level of throughput the table should always be ready to support. The value must be between 1 and the max throughput per second quota for your account (40,000 by default).",
              "nested_params": []
            },
            {
              "name": "maximumUnits",
              "type": "integer",
              "required": false,
              "description": "Manage costs by specifying the maximum amount of throughput to provision. The value must be between 1 and the max throughput per second quota for your account (40,000 by default).",
              "nested_params": []
            },
            {
              "name": "scalingPolicy",
              "type": "dict",
              "required": false,
              "description": "Amazon Keyspaces supports the target tracking auto scaling policy. With this policy, Amazon Keyspaces auto scaling ensures that the table's ratio of consumed to provisioned capacity stays at or near the target value that you specify. You define the target value as a percentage between 20 and 90.",
              "nested_params": [
                {
                  "name": "targetTrackingScalingPolicyConfiguration",
                  "type": "dict",
                  "required": false,
                  "description": "Auto scaling scales up capacity automatically when traffic exceeds this target utilization rate, and then back down when it falls below the target. A double between 20 and 90.",
                  "nested_params": [
                    {
                      "name": "disableScaleIn",
                      "type": "boolean",
                      "required": false,
                      "description": "Specifies if scale-in is enabled. When auto scaling automatically decreases capacity for a table, the table scales in. When scaling policies are set, they can't scale in the table lower than its minimum capacity.",
                      "nested_params": []
                    },
                    {
                      "name": "scaleInCooldown",
                      "type": "integer",
                      "required": false,
                      "description": "Specifies a scale-in cool down period. A cooldown period in seconds between scaling activities that lets the table stabilize before another scaling activity starts.",
                      "nested_params": []
                    },
                    {
                      "name": "scaleOutCooldown",
                      "type": "integer",
                      "required": false,
                      "description": "Specifies a scale out cool down period. A cooldown period in seconds between scaling activities that lets the table stabilize before another scaling activity starts.",
                      "nested_params": []
                    },
                    {
                      "name": "targetValue",
                      "type": "float",
                      "required": false,
                      "description": "Specifies the target value for the target tracking auto scaling policy. Amazon Keyspaces auto scaling scales up capacity automatically when traffic exceeds this target utilization rate, and then back down when it falls below the target. This ensures that the ratio of consumed capacity to provisioned capacity stays at or near this value. You define targetValue as a percentage. A double between 20 and 90.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "readCapacityAutoScaling",
          "type": "dict",
          "required": false,
          "description": "The auto scaling settings for the table's read capacity.",
          "nested_params": [
            {
              "name": "autoScalingDisabled",
              "type": "boolean",
              "required": false,
              "description": "This optional parameter enables auto scaling for the table if set to false.",
              "nested_params": []
            },
            {
              "name": "minimumUnits",
              "type": "integer",
              "required": false,
              "description": "The minimum level of throughput the table should always be ready to support. The value must be between 1 and the max throughput per second quota for your account (40,000 by default).",
              "nested_params": []
            },
            {
              "name": "maximumUnits",
              "type": "integer",
              "required": false,
              "description": "Manage costs by specifying the maximum amount of throughput to provision. The value must be between 1 and the max throughput per second quota for your account (40,000 by default).",
              "nested_params": []
            },
            {
              "name": "scalingPolicy",
              "type": "dict",
              "required": false,
              "description": "Amazon Keyspaces supports the target tracking auto scaling policy. With this policy, Amazon Keyspaces auto scaling ensures that the table's ratio of consumed to provisioned capacity stays at or near the target value that you specify. You define the target value as a percentage between 20 and 90.",
              "nested_params": [
                {
                  "name": "targetTrackingScalingPolicyConfiguration",
                  "type": "dict",
                  "required": false,
                  "description": "Auto scaling scales up capacity automatically when traffic exceeds this target utilization rate, and then back down when it falls below the target. A double between 20 and 90.",
                  "nested_params": [
                    {
                      "name": "disableScaleIn",
                      "type": "boolean",
                      "required": false,
                      "description": "Specifies if scale-in is enabled. When auto scaling automatically decreases capacity for a table, the table scales in. When scaling policies are set, they can't scale in the table lower than its minimum capacity.",
                      "nested_params": []
                    },
                    {
                      "name": "scaleInCooldown",
                      "type": "integer",
                      "required": false,
                      "description": "Specifies a scale-in cool down period. A cooldown period in seconds between scaling activities that lets the table stabilize before another scaling activity starts.",
                      "nested_params": []
                    },
                    {
                      "name": "scaleOutCooldown",
                      "type": "integer",
                      "required": false,
                      "description": "Specifies a scale out cool down period. A cooldown period in seconds between scaling activities that lets the table stabilize before another scaling activity starts.",
                      "nested_params": []
                    },
                    {
                      "name": "targetValue",
                      "type": "float",
                      "required": false,
                      "description": "Specifies the target value for the target tracking auto scaling policy. Amazon Keyspaces auto scaling scales up capacity automatically when traffic exceeds this target utilization rate, and then back down when it falls below the target. This ensures that the ratio of consumed capacity to provisioned capacity stays at or near this value. You define targetValue as a percentage. A double between 20 and 90.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "replicaSpecifications",
      "type": "list",
      "required": true,
      "description": "The optional Amazon Web Services Region specific settings of a multi-Region table. These settings overwrite the general settings of the table for the specified Region. For a multi-Region table in provisioned capacity mode, you can configure the table's read capacity differently for each Region's replica. The write capacity, however, remains synchronized between all replicas to ensure that there's enough capacity to replicate writes across all Regions. To define the read capacity for a table replica in a specific Region, you can do so by configuring the following parameters. region: The Region where these settings are applied. (Required) readCapacityUnits: The provisioned read capacity units. (Optional) readCapacityAutoScaling: The read capacity auto scaling settings for the table. (Optional) (dict) --- The Amazon Web Services Region specific settings of a multi-Region table. For a multi-Region table, you can configure the table's read capacity differently per Amazon Web Services Region. You can do this by configuring the following parameters. (Optional) The Amazon Web Services Region. readCapacityUnits (integer) --- The provisioned read capacity units for the multi-Region table in the specified Amazon Web Services Region. readCapacityAutoScaling (dict) --- The read capacity auto scaling settings for the multi-Region table in the specified Amazon Web Services Region. autoScalingDisabled (boolean) --- This optional parameter enables auto scaling for the table if set to false. minimumUnits (integer) --- The minimum level of throughput the table should always be ready to support. The value must be between 1 and the max throughput per second quota for your account (40,000 by default). maximumUnits (integer) --- Manage costs by specifying the maximum amount of throughput to provision. scalingPolicy (dict) --- Amazon Keyspaces supports the target tracking auto scaling policy. With this policy, Amazon Keyspaces auto scaling ensures that the table's ratio of consumed to provisioned capacity stays at or near the target value that you specify. You define the target value as a percentage between 20 and 90. targetTrackingScalingPolicyConfiguration (dict) --- Auto scaling scales up capacity automatically when traffic exceeds this target utilization rate, and then back down when it falls below the target. A double between 20 and 90. disableScaleIn (boolean) --- Specifies if scale-in is enabled. When auto scaling automatically decreases capacity for a table, the table scales in. When scaling policies are set, they can't scale in the table lower than its minimum capacity. scaleInCooldown (integer) --- Specifies a scale-in cool down period. A cooldown period in seconds between scaling activities that lets the table stabilize before another scaling activity starts. scaleOutCooldown (integer) --- Specifies a scale out cool down period. Specifies the target value for the target tracking auto scaling policy. Amazon Keyspaces auto scaling scales up capacity automatically when traffic exceeds this target utilization rate, and then back down when it falls below the target. This ensures that the ratio of consumed capacity to provisioned capacity stays at or near this value. You define targetValue as a percentage. A double between 20 and 90.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "resourceArn",
          "type": "string",
          "description": "The unique identifier of the table in the format of an Amazon Resource Name (ARN).",
          "nested_items": []
        }
      ]
    }
  ]
}