{
  "method_name": "associate_resolver_query_log_config",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/route53resolver/client/associate_resolver_query_log_config.html",
  "description": "Associates an Amazon VPC with a specified query logging configuration. Route 53 Resolver logs DNS queries that originate in all of the Amazon VPCs that are associated with a specified query logging configuration. To associate more than one VPC with a configuration, submit one AssociateResolverQueryLogConfig request for each VPC. To remove a VPC from a query logging configuration, see DisassociateResolverQueryLogConfig.",
  "parameters": [
    {
      "name": "ResolverQueryLogConfigId",
      "type": "string",
      "required": true,
      "description": "The ID of the query logging configuration that you want to associate a VPC with.",
      "nested_params": []
    },
    {
      "name": "ResourceId",
      "type": "string",
      "required": true,
      "description": "The ID of an Amazon VPC that you want this query logging configuration to log queries for.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ResolverQueryLogConfigAssociation",
          "type": "dict",
          "description": "A complex type that contains settings for a specified association between an Amazon VPC and a query logging configuration.",
          "nested_items": [
            {
              "name": "Id",
              "type": "string",
              "description": "The ID of the query logging association.",
              "nested_items": []
            },
            {
              "name": "ResolverQueryLogConfigId",
              "type": "string",
              "description": "The ID of the query logging configuration that a VPC is associated with.",
              "nested_items": []
            },
            {
              "name": "ResourceId",
              "type": "string",
              "description": "The ID of the Amazon VPC that is associated with the query logging configuration.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The status of the specified query logging association. Valid values include the following:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "CREATING: Resolver is creating an association between an Amazon VPC and a query logging configuration.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "ACTIVE: The association between an Amazon VPC and a query logging configuration was successfully created. Resolver is logging queries that originate in the specified VPC.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "DELETING: Resolver is deleting this query logging association.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "FAILED: Resolver either couldn't create or couldn't delete the query logging association.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Error",
              "type": "string",
              "description": "If the value of Status is FAILED, the value of Error indicates the cause:",
              "nested_items": [
                {
                  "name": "",
                  "type": "for example, an Amazon S3 bucket",
                  "description": "DESTINATION_NOT_FOUND: The specified destination (for example, an Amazon S3 bucket) was deleted.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "ACCESS_DENIED: Permissions don't allow sending logs to the destination.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "ErrorMessage",
              "type": "string",
              "description": "Contains additional information about the error. If the value or Error is null, the value of ErrorMessage also is null.",
              "nested_items": []
            },
            {
              "name": "CreationTime",
              "type": "string",
              "description": "The date and time that the VPC was associated with the query logging configuration, in Unix time format and Coordinated Universal Time (UTC).",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}