{
  "method_name": "create_resolver_query_log_config",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/route53resolver/client/create_resolver_query_log_config.html",
  "description": "Creates a Resolver query logging configuration, which defines where you want Resolver to save DNS query logs that originate in your VPCs. Resolver can log queries only for VPCs that are in the same Region as the query logging configuration. To specify which VPCs you want to log queries for, you use AssociateResolverQueryLogConfig. For more information, see AssociateResolverQueryLogConfig. You can optionally use Resource Access Manager (RAM) to share a query logging configuration with other Amazon Web Services accounts. The other accounts can then associate VPCs with the configuration. The query logs that Resolver creates for a configuration include all DNS queries that originate in all VPCs that are associated with the configuration.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "The name that you want to give the query logging configuration.",
      "nested_params": []
    },
    {
      "name": "DestinationArn",
      "type": "string",
      "required": true,
      "description": "The ARN of the resource that you want Resolver to send query logs. You can send query logs to an S3 bucket, a CloudWatch Logs log group, or a Kinesis Data Firehose delivery stream. Examples of valid values include the following: S3 bucket: arn:aws:s3:::amzn-s3-demo-bucket You can optionally append a file prefix to the end of the ARN. arn:aws:s3:::amzn-s3-demo-bucket/development/ CloudWatch Logs log group: arn:aws:logs:us-west-1:123456789012:log-group:/mystack-testgroup-12ABC1AB12A1:* Kinesis Data Firehose delivery stream: arn:aws:kinesis:us-east-2:0123456789:stream/my_stream_name.",
      "nested_params": [
        {
          "name": "S3 bucket",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "CloudWatch Logs log group",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        },
        {
          "name": "Kinesis Data Firehose delivery stream",
          "type": "",
          "required": false,
          "description": "",
          "nested_params": []
        }
      ]
    },
    {
      "name": "CreatorRequestId",
      "type": "string",
      "required": true,
      "description": "A unique string that identifies the request and that allows failed requests to be retried without the risk of running the operation twice. CreatorRequestId can be any unique string, for example, a date/time stamp. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "A list of the tag keys and values that you want to associate with the query logging configuration. (dict) --- One tag that you want to add to the specified resource. A tag consists of a Key (a name for the tag) and a Value. The name for the tag. For example, if you want to associate Resolver resources with the account IDs of your customers for billing purposes, the value of Key might be account-id. The value for the tag. For example, if Key is account-id, then Value might be the ID of the customer account that you're creating the resource for.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The name for the tag. For example, if you want to associate Resolver resources with the account IDs of your customers for billing purposes, the value of Key might be account-id.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value for the tag. For example, if Key is account-id, then Value might be the ID of the customer account that you're creating the resource for.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ResolverQueryLogConfig",
          "type": "dict",
          "description": "Information about the CreateResolverQueryLogConfig request, including the status of the request.",
          "nested_items": [
            {
              "name": "Id",
              "type": "string",
              "description": "The ID for the query logging configuration.",
              "nested_items": []
            },
            {
              "name": "OwnerId",
              "type": "string",
              "description": "The Amazon Web Services account ID for the account that created the query logging configuration.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The status of the specified query logging configuration. Valid values include the following:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "CREATING: Resolver is creating the query logging configuration.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "CREATED: The query logging configuration was successfully created. Resolver is logging queries that originate in the specified VPC.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "DELETING: Resolver is deleting this query logging configuration.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "for example, an Amazon S3 bucket",
                  "description": "FAILED: Resolver can't deliver logs to the location that is specified in the query logging configuration. Here are two common causes:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "for example, an Amazon S3 bucket",
                      "description": "The specified destination (for example, an Amazon S3 bucket) was deleted.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Permissions don't allow sending logs to the destination.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "ShareStatus",
              "type": "string",
              "description": "An indication of whether the query logging configuration is shared with other Amazon Web Services accounts, or was shared with the current account by another Amazon Web Services account. Sharing is configured through Resource Access Manager (RAM).",
              "nested_items": []
            },
            {
              "name": "AssociationCount",
              "type": "integer",
              "description": "The number of VPCs that are associated with the query logging configuration.",
              "nested_items": []
            },
            {
              "name": "Arn",
              "type": "string",
              "description": "The ARN for the query logging configuration.",
              "nested_items": []
            },
            {
              "name": "Name",
              "type": "string",
              "description": "The name of the query logging configuration.",
              "nested_items": []
            },
            {
              "name": "DestinationArn",
              "type": "string",
              "description": "The ARN of the resource that you want Resolver to send query logs: an Amazon S3 bucket, a CloudWatch Logs log group, or a Kinesis Data Firehose delivery stream.",
              "nested_items": []
            },
            {
              "name": "CreatorRequestId",
              "type": "string",
              "description": "A unique string that identifies the request that created the query logging configuration. The CreatorRequestId allows failed requests to be retried without the risk of running the operation twice.",
              "nested_items": []
            },
            {
              "name": "CreationTime",
              "type": "string",
              "description": "The date and time that the query logging configuration was created, in Unix time format and Coordinated Universal Time (UTC).",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}