{
  "method_name": "create_firewall_rule_group",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/route53resolver/client/create_firewall_rule_group.html",
  "description": "Creates an empty DNS Firewall rule group for filtering DNS network traffic in a VPC. You can add rules to the new rule group by calling  CreateFirewallRule.",
  "parameters": [
    {
      "name": "CreatorRequestId",
      "type": "string",
      "required": true,
      "description": "A unique string defined by you to identify the request. This allows you to retry failed requests without the risk of running the operation twice. This can be any unique string, for example, a timestamp. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "A name that lets you identify the rule group, to manage and use it.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "A list of the tag keys and values that you want to associate with the rule group. (dict) --- One tag that you want to add to the specified resource. A tag consists of a Key (a name for the tag) and a Value. The name for the tag. For example, if you want to associate Resolver resources with the account IDs of your customers for billing purposes, the value of Key might be account-id. The value for the tag. For example, if Key is account-id, then Value might be the ID of the customer account that you're creating the resource for.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The name for the tag. For example, if you want to associate Resolver resources with the account IDs of your customers for billing purposes, the value of Key might be account-id.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value for the tag. For example, if Key is account-id, then Value might be the ID of the customer account that you're creating the resource for.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "FirewallRuleGroup",
          "type": "dict",
          "description": "A collection of rules used to filter DNS network traffic.",
          "nested_items": [
            {
              "name": "Id",
              "type": "string",
              "description": "The ID of the rule group.",
              "nested_items": []
            },
            {
              "name": "Arn",
              "type": "string",
              "description": "The ARN (Amazon Resource Name) of the rule group.",
              "nested_items": []
            },
            {
              "name": "Name",
              "type": "string",
              "description": "The name of the rule group.",
              "nested_items": []
            },
            {
              "name": "RuleCount",
              "type": "integer",
              "description": "The number of rules in the rule group.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The status of the domain list.",
              "nested_items": []
            },
            {
              "name": "StatusMessage",
              "type": "string",
              "description": "Additional information about the status of the rule group, if available.",
              "nested_items": []
            },
            {
              "name": "OwnerId",
              "type": "string",
              "description": "The Amazon Web Services account ID for the account that created the rule group. When a rule group is shared with your account, this is the account that has shared the rule group with you.",
              "nested_items": []
            },
            {
              "name": "CreatorRequestId",
              "type": "string",
              "description": "A unique string defined by you to identify the request. This allows you to retry failed requests without the risk of running the operation twice. This can be any unique string, for example, a timestamp.",
              "nested_items": []
            },
            {
              "name": "ShareStatus",
              "type": "string",
              "description": "Whether the rule group is shared with other Amazon Web Services accounts, or was shared with the current account by another Amazon Web Services account. Sharing is configured through Resource Access Manager (RAM).",
              "nested_items": []
            },
            {
              "name": "CreationTime",
              "type": "string",
              "description": "The date and time that the rule group was created, in Unix time format and Coordinated Universal Time (UTC).",
              "nested_items": []
            },
            {
              "name": "ModificationTime",
              "type": "string",
              "description": "The date and time that the rule group was last modified, in Unix time format and Coordinated Universal Time (UTC).",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}