{
  "method_name": "delete_resolver_endpoint",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/route53resolver/client/delete_resolver_endpoint.html",
  "description": "Deletes a Resolver endpoint. The effect of deleting a Resolver endpoint depends on whether it's an inbound or an outbound Resolver endpoint:",
  "parameters": [
    {
      "name": "ResolverEndpointId",
      "type": "string",
      "required": true,
      "description": "The ID of the Resolver endpoint that you want to delete.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ResolverEndpoint",
          "type": "dict",
          "description": "Information about the DeleteResolverEndpoint request, including the status of the request.",
          "nested_items": [
            {
              "name": "Id",
              "type": "string",
              "description": "The ID of the Resolver endpoint.",
              "nested_items": []
            },
            {
              "name": "CreatorRequestId",
              "type": "string",
              "description": "A unique string that identifies the request that created the Resolver endpoint. The CreatorRequestId allows failed requests to be retried without the risk of running the operation twice.",
              "nested_items": []
            },
            {
              "name": "Arn",
              "type": "string",
              "description": "The ARN (Amazon Resource Name) for the Resolver endpoint.",
              "nested_items": []
            },
            {
              "name": "Name",
              "type": "string",
              "description": "The name that you assigned to the Resolver endpoint when you submitted a CreateResolverEndpoint request.",
              "nested_items": []
            },
            {
              "name": "SecurityGroupIds",
              "type": "list",
              "description": "The ID of one or more security groups that control access to this VPC. The security group must include one or more inbound rules (for inbound endpoints) or outbound rules (for outbound endpoints). Inbound and outbound rules must allow TCP and UDP access. For inbound access, open port 53. For outbound access, open the port that you're using for DNS queries on your network.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Direction",
              "type": "string",
              "description": "Indicates whether the Resolver endpoint allows inbound or outbound DNS queries:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "INBOUND: allows DNS queries to your VPC from your network.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "OUTBOUND: allows DNS queries from your VPC to your network.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "INBOUND_DELEGATION: Resolver delegates queries to Route 53 private hosted zones from your network.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "IpAddressCount",
              "type": "integer",
              "description": "The number of IP addresses that the Resolver endpoint can use for DNS queries.",
              "nested_items": []
            },
            {
              "name": "HostVPCId",
              "type": "string",
              "description": "The ID of the VPC that you want to create the Resolver endpoint in.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "A code that specifies the current status of the Resolver endpoint. Valid values include the following:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "CREATING: Resolver is creating and configuring one or more Amazon VPC network interfaces for this endpoint.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "OPERATIONAL: The Amazon VPC network interfaces for this endpoint are correctly configured and able to pass inbound or outbound DNS queries between your network and Resolver.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "UPDATING: Resolver is associating or disassociating one or more network interfaces with this endpoint.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "per network interface",
                  "description": "AUTO_RECOVERING: Resolver is trying to recover one or more of the network interfaces that are associated with this endpoint. During the recovery process, the endpoint functions with limited capacity because of the limit on the number of DNS queries per IP address (per network interface). For the current limit, see Limits on Route 53 Resolver.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "An endpoint must always include at least two IP addresses.",
                  "description": "ACTION_NEEDED: This endpoint is unhealthy, and Resolver can't automatically recover it. To resolve the problem, we recommend that you check each IP address that you associated with the endpoint. For each IP address that isn't available, add another IP address and then delete the IP address that isn't available. (An endpoint must always include at least two IP addresses.) A status of ACTION_NEEDED can have a variety of causes. Here are two common causes:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "One or more of the network interfaces that are associated with the endpoint were deleted using Amazon VPC.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "The network interface couldn't be created for some reason that's outside the control of Resolver.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "",
                  "type": "",
                  "description": "DELETING: Resolver is deleting this endpoint and the associated network interfaces.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "StatusMessage",
              "type": "string",
              "description": "A detailed description of the status of the Resolver endpoint.",
              "nested_items": []
            },
            {
              "name": "CreationTime",
              "type": "string",
              "description": "The date and time that the endpoint was created, in Unix time format and Coordinated Universal Time (UTC).",
              "nested_items": []
            },
            {
              "name": "ModificationTime",
              "type": "string",
              "description": "The date and time that the endpoint was last modified, in Unix time format and Coordinated Universal Time (UTC).",
              "nested_items": []
            },
            {
              "name": "OutpostArn",
              "type": "string",
              "description": "The ARN (Amazon Resource Name) for the Outpost.",
              "nested_items": []
            },
            {
              "name": "PreferredInstanceType",
              "type": "string",
              "description": "The Amazon EC2 instance type.",
              "nested_items": []
            },
            {
              "name": "ResolverEndpointType",
              "type": "string",
              "description": "The Resolver endpoint IP address type.",
              "nested_items": []
            },
            {
              "name": "Protocols",
              "type": "list",
              "description": "Protocols used for the endpoint. DoH-FIPS is applicable for a default inbound endpoints only.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "Do53 and DoH in combination.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Do53 and DoH-FIPS in combination.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "Do53 alone.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "DoH alone.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "DoH-FIPS alone.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "None, which is treated as Do53.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}