{
  "method_name": "delete_firewall_rule",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/route53resolver/client/delete_firewall_rule.html",
  "description": "Deletes the specified firewall rule.",
  "parameters": [
    {
      "name": "FirewallRuleGroupId",
      "type": "string",
      "required": true,
      "description": "The unique identifier of the firewall rule group that you want to delete the rule from.",
      "nested_params": []
    },
    {
      "name": "FirewallDomainListId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "FirewallThreatProtectionId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Qtype",
      "type": "string",
      "required": false,
      "description": "The DNS query type that the rule you are deleting evaluates. Allowed values are; A: Returns an IPv4 address. AAAA: Returns an Ipv6 address. CAA: Restricts CAs that can create SSL/TLS certifications for the domain. CNAME: Returns another domain name. DS: Record that identifies the DNSSEC signing key of a delegated zone. MX: Specifies mail servers. NAPTR: Regular-expression-based rewriting of domain names. NS: Authoritative name servers. PTR: Maps an IP address to a domain name. SOA: Start of authority record for the zone. SPF: Lists the servers authorized to send emails from a domain. SRV: Application specific values that identify servers. TXT: Verifies email senders and application-specific values. A query type you define by using the DNS type ID, for example 28 for AAAA. The values must be defined as TYPENUMBER, where the NUMBER can be 1-65334, for example, TYPE28. For more information, see List of DNS record types.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "FirewallRule",
          "type": "dict",
          "description": "The specification for the firewall rule that you just deleted.",
          "nested_items": [
            {
              "name": "FirewallRuleGroupId",
              "type": "string",
              "description": "The unique identifier of the Firewall rule group of the rule.",
              "nested_items": []
            },
            {
              "name": "FirewallDomainListId",
              "type": "string",
              "description": "The ID of the domain list that's used in the rule.",
              "nested_items": []
            },
            {
              "name": "FirewallThreatProtectionId",
              "type": "string",
              "description": "ID of the DNS Firewall Advanced rule.",
              "nested_items": []
            },
            {
              "name": "Name",
              "type": "string",
              "description": "The name of the rule.",
              "nested_items": []
            },
            {
              "name": "Priority",
              "type": "integer",
              "description": "The priority of the rule in the rule group. This value must be unique within the rule group. DNS Firewall processes the rules in a rule group by order of priority, starting from the lowest setting.",
              "nested_items": []
            },
            {
              "name": "Action",
              "type": "string",
              "description": "The action that DNS Firewall should take on a DNS query when it matches one of the domains in the rule's domain list, or a threat in a DNS Firewall Advanced rule:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "ALLOW - Permit the request to go through. Not available for DNS Firewall Advanced rules.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "ALERT - Permit the request to go through but send an alert to the logs.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "BLOCK - Disallow the request. If this is specified, additional handling details are provided in the rule's BlockResponse setting.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "BlockResponse",
              "type": "string",
              "description": "The way that you want DNS Firewall to block the request. Used for the rule action setting BLOCK.",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "NODATA - Respond indicating that the query was successful, but no response is available for it.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "NXDOMAIN - Respond indicating that the domain name that's in the query doesn't exist.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "OVERRIDE - Provide a custom override in the response. This option requires custom handling details in the rule's BlockOverride* settings.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "BlockOverrideDomain",
              "type": "string",
              "description": "The custom DNS record to send back in response to the query. Used for the rule action BLOCK with a BlockResponse setting of OVERRIDE.",
              "nested_items": []
            },
            {
              "name": "BlockOverrideDnsType",
              "type": "string",
              "description": "The DNS record's type. This determines the format of the record value that you provided in BlockOverrideDomain. Used for the rule action BLOCK with a BlockResponse setting of OVERRIDE.",
              "nested_items": []
            },
            {
              "name": "BlockOverrideTtl",
              "type": "integer",
              "description": "The recommended amount of time, in seconds, for the DNS resolver or web browser to cache the provided override record. Used for the rule action BLOCK with a BlockResponse setting of OVERRIDE.",
              "nested_items": []
            },
            {
              "name": "CreatorRequestId",
              "type": "string",
              "description": "A unique string defined by you to identify the request. This allows you to retry failed requests without the risk of executing the operation twice. This can be any unique string, for example, a timestamp.",
              "nested_items": []
            },
            {
              "name": "CreationTime",
              "type": "string",
              "description": "The date and time that the rule was created, in Unix time format and Coordinated Universal Time (UTC).",
              "nested_items": []
            },
            {
              "name": "ModificationTime",
              "type": "string",
              "description": "The date and time that the rule was last modified, in Unix time format and Coordinated Universal Time (UTC).",
              "nested_items": []
            },
            {
              "name": "FirewallDomainRedirectionAction",
              "type": "string",
              "description": "How you want the the rule to evaluate DNS redirection in the DNS redirection chain, such as CNAME or DNAME.",
              "nested_items": []
            },
            {
              "name": "Qtype",
              "type": "string",
              "description": "The DNS query type you want the rule to evaluate. Allowed values are;",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "A: Returns an IPv4 address.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "AAAA: Returns an Ipv6 address.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "CAA: Restricts CAs that can create SSL/TLS certifications for the domain.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "CNAME: Returns another domain name.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "DS: Record that identifies the DNSSEC signing key of a delegated zone.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "MX: Specifies mail servers.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "NAPTR: Regular-expression-based rewriting of domain names.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "NS: Authoritative name servers.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "PTR: Maps an IP address to a domain name.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "SOA: Start of authority record for the zone.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "SPF: Lists the servers authorized to send emails from a domain.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "SRV: Application specific values that identify servers.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "TXT: Verifies email senders and application-specific values.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "A query type you define by using the DNS type ID, for example 28 for AAAA. The values must be defined as TYPENUMBER, where the NUMBER can be 1-65334, for example, TYPE28. For more information, see List of DNS record types.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "DnsThreatProtection",
              "type": "string",
              "description": "The type of the DNS Firewall Advanced rule. Valid values are:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "DGA: Domain generation algorithms detection. DGAs are used by attackers to generate a large number of domains to to launch malware attacks.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "DNS_TUNNELING: DNS tunneling detection. DNS tunneling is used by attackers to exfiltrate data from the client by using the DNS tunnel without making a network connection to the client.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "ConfidenceThreshold",
              "type": "string",
              "description": "The confidence threshold for DNS Firewall Advanced. You must provide this value when you create a DNS Firewall Advanced rule. The confidence level values mean:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "LOW: Provides the highest detection rate for threats, but also increases false positives.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "MEDIUM: Provides a balance between detecting threats and false positives.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "HIGH: Detects only the most well corroborated threats with a low rate of false positives.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}