{
  "method_name": "list_resolver_rule_associations",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/route53resolver/client/list_resolver_rule_associations.html",
  "description": "Lists the associations that were created between Resolver rules and VPCs using the current Amazon Web Services account.",
  "parameters": [
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "For the first ListResolverRuleAssociation request, omit this value. If you have more than MaxResults rule associations, you can submit another ListResolverRuleAssociation request to get the next group of rule associations. In the next request, specify the value of NextToken from the previous response.",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": false,
      "description": "An optional specification to return a subset of Resolver rules, such as Resolver rules that are associated with the same VPC ID. (dict) --- For Resolver list operations ( ListResolverEndpoints, ListResolverRules, ListResolverRuleAssociations, ListResolverQueryLogConfigs, ListResolverQueryLogConfigAssociations), and ListResolverDnssecConfigs), an optional specification to return a subset of objects. To filter objects, such as Resolver endpoints or Resolver rules, you specify Name and Values. For example, to list only inbound Resolver endpoints, specify Direction for Name and specify INBOUND for Values. Name (string) --- The name of the parameter that you want to use to filter objects. The valid values for Name depend on the action that you're including the filter in, ListResolverEndpoints, ListResolverRules, ListResolverRuleAssociations, ListResolverQueryLogConfigs, or ListResolverQueryLogConfigAssociations. Valid values for Name include the following: CreatorRequestId: The value that you specified when you created the Resolver endpoint. Direction: Whether you want to return inbound or outbound Resolver endpoints. If you specify DIRECTION for Name, specify INBOUND or OUTBOUND for Values. HostVPCId: The ID of the VPC that inbound DNS queries pass through on the way from your network to your VPCs in a region, or the VPC that outbound queries pass through on the way from your VPCs to your network. In a CreateResolverEndpoint request, SubnetId indirectly identifies the VPC. In a GetResolverEndpoint request, the VPC ID for a Resolver endpoint is returned in the HostVPCId element. IpAddressCount: The number of IP addresses that you have associated with the Resolver endpoint. Name: The name of the Resolver endpoint. SecurityGroupIds: The IDs of the VPC security groups that you specified when you created the Resolver endpoint. Status: The status of the Resolver endpoint. If you specify Status for Name, specify one of the following status codes for Values: CREATING, OPERATIONAL, UPDATING, AUTO_RECOVERING, ACTION_NEEDED, or DELETING. For more information, see Status in ResolverEndpoint. Valid values for Name include the following: CreatorRequestId: The value that you specified when you created the Resolver rule. DomainName: The domain name for which Resolver is forwarding DNS queries to your network. In the value that you specify for Values, include a trailing dot (.) after the domain name. For example, if the domain name is example.com, specify the following value. Note the '.' after com: example.com. Name: The name of the Resolver rule. ResolverEndpointId: The ID of the Resolver endpoint that the Resolver rule is associated with. Status: The status of the Resolver rule. If you specify Status for Name, specify one of the following status codes for Values: COMPLETE, DELETING, UPDATING, or FAILED. Type: The type of the Resolver rule. If you specify TYPE for Name, specify FORWARD or SYSTEM for Values. Valid values for Name include the following: Name: The name of the Resolver rule association. ResolverRuleId: The ID of the Resolver rule that is associated with one or more VPCs. Status: The status of the Resolver rule association. If you specify Status for Name, specify one of the following status codes for Values: CREATING, COMPLETE, DELETING, or FAILED. VPCId: The ID of the VPC that the Resolver rule is associated with. Valid values for Name include the following: Arn: The ARN for the query logging configuration. AssociationCount: The number of VPCs that are associated with the query logging configuration. CreationTime: The date and time that the query logging configuration was created, in Unix time format and Coordinated Universal Time (UTC). CreatorRequestId: A unique string that identifies the request that created the query logging configuration. Destination: The Amazon Web Services service that you want to forward query logs to. Valid values include the following: S3 CloudWatchLogs KinesisFirehose DestinationArn: The ARN of the location that Resolver is sending query logs to. This value can be the ARN for an S3 bucket, a CloudWatch Logs log group, or a Kinesis Data Firehose delivery stream. Id: The ID of the query logging configuration Name: The name of the query logging configuration OwnerId: The Amazon Web Services account ID for the account that created the query logging configuration. ShareStatus: An indication of whether the query logging configuration is shared with other Amazon Web Services accounts, or was shared with the current account by another Amazon Web Services account. Valid values include: NOT_SHARED, SHARED_WITH_ME, or SHARED_BY_ME. Status: The status of the query logging configuration. If you specify Status for Name, specify the applicable status code for Values: CREATING, CREATED, DELETING, or FAILED. For more information, see Status. Valid values for Name include the following: CreationTime: The date and time that the VPC was associated with the query logging configuration, in Unix time format and Coordinated Universal Time (UTC). Error: If the value of Status is FAILED, specify the cause: DESTINATION_NOT_FOUND or ACCESS_DENIED. Id: The ID of the query logging association. ResolverQueryLogConfigId: The ID of the query logging configuration that a VPC is associated with. ResourceId: The ID of the Amazon VPC that is associated with the query logging configuration. Status: The status of the query logging association. Values (list) --- When you're using a List operation and you want the operation to return a subset of objects, such as Resolver endpoints or Resolver rules, the value of the parameter that you want to use to filter objects. (string) ---",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name of the parameter that you want to use to filter objects. The valid values for Name depend on the action that you're including the filter in, ListResolverEndpoints, ListResolverRules, ListResolverRuleAssociations, ListResolverQueryLogConfigs, or ListResolverQueryLogConfigAssociations. Valid values for Name include the following:",
          "nested_params": []
        },
        {
          "name": "Values",
          "type": "list",
          "required": false,
          "description": "When you're using a List operation and you want the operation to return a subset of objects, such as Resolver endpoints or Resolver rules, the value of the parameter that you want to use to filter objects. For example, to list only inbound Resolver endpoints, specify Direction for Name and specify INBOUND for Values.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "NextToken",
          "type": "string",
          "description": "If more than MaxResults rule associations match the specified criteria, you can submit another ListResolverRuleAssociation request to get the next group of results. In the next request, specify the value of NextToken from the previous response.",
          "nested_items": []
        },
        {
          "name": "MaxResults",
          "type": "integer",
          "description": "The value that you specified for MaxResults in the request.",
          "nested_items": []
        },
        {
          "name": "ResolverRuleAssociations",
          "type": "list",
          "description": "The associations that were created between Resolver rules and VPCs using the current Amazon Web Services account, and that match the specified filters, if any.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Id",
                  "type": "string",
                  "description": "The ID of the association between a Resolver rule and a VPC. Resolver assigns this value when you submit an AssociateResolverRule request.",
                  "nested_items": []
                },
                {
                  "name": "ResolverRuleId",
                  "type": "string",
                  "description": "The ID of the Resolver rule that you associated with the VPC that is specified by VPCId.",
                  "nested_items": []
                },
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The name of an association between a Resolver rule and a VPC.",
                  "nested_items": []
                },
                {
                  "name": "VPCId",
                  "type": "string",
                  "description": "The ID of the VPC that you associated the Resolver rule with.",
                  "nested_items": []
                },
                {
                  "name": "Status",
                  "type": "string",
                  "description": "A code that specifies the current status of the association between a Resolver rule and a VPC.",
                  "nested_items": []
                },
                {
                  "name": "StatusMessage",
                  "type": "string",
                  "description": "A detailed description of the status of the association between a Resolver rule and a VPC.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}