{
  "method_name": "list_firewall_rule_groups",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/route53resolver/client/list_firewall_rule_groups.html",
  "description": "Retrieves the minimal high-level information for the rule groups that you have defined. A single call might return only a partial list of the rule groups. For information, see MaxResults.",
  "parameters": [
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "The maximum number of objects that you want Resolver to return for this request. If more objects are available, in the response, Resolver provides a NextToken value that you can use in a subsequent call to get the next batch of objects. If you don't specify a value for MaxResults, Resolver returns up to 100 objects.",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "For the first call to this list request, omit this value. When you request a list of objects, Resolver returns at most the number of objects specified in MaxResults. If more objects are available for retrieval, Resolver returns a NextToken value in the response. To retrieve the next batch of objects, use the token that was returned for the prior request in your next request.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "NextToken",
          "type": "string",
          "description": "If objects are still available for retrieval, Resolver returns this token in the response. To retrieve the next batch of objects, provide this token in your next request.",
          "nested_items": []
        },
        {
          "name": "FirewallRuleGroups",
          "type": "list",
          "description": "A list of your firewall rule groups.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Id",
                  "type": "string",
                  "description": "The ID of the rule group.",
                  "nested_items": []
                },
                {
                  "name": "Arn",
                  "type": "string",
                  "description": "The ARN (Amazon Resource Name) of the rule group.",
                  "nested_items": []
                },
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The name of the rule group.",
                  "nested_items": []
                },
                {
                  "name": "OwnerId",
                  "type": "string",
                  "description": "The Amazon Web Services account ID for the account that created the rule group. When a rule group is shared with your account, this is the account that has shared the rule group with you.",
                  "nested_items": []
                },
                {
                  "name": "CreatorRequestId",
                  "type": "string",
                  "description": "A unique string defined by you to identify the request. This allows you to retry failed requests without the risk of running the operation twice. This can be any unique string, for example, a timestamp.",
                  "nested_items": []
                },
                {
                  "name": "ShareStatus",
                  "type": "string",
                  "description": "Whether the rule group is shared with other Amazon Web Services accounts, or was shared with the current account by another Amazon Web Services account. Sharing is configured through Resource Access Manager (RAM).",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}