{
  "method_name": "list_firewall_configs",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/route53resolver/client/list_firewall_configs.html",
  "description": "Retrieves the firewall configurations that you have defined. DNS Firewall uses the configurations to manage firewall behavior for your VPCs. A single call might return only a partial list of the configurations. For information, see MaxResults.",
  "parameters": [
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "The maximum number of objects that you want Resolver to return for this request. If more objects are available, in the response, Resolver provides a NextToken value that you can use in a subsequent call to get the next batch of objects. If you don't specify a value for MaxResults, Resolver returns up to 100 objects.",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "For the first call to this list request, omit this value. When you request a list of objects, Resolver returns at most the number of objects specified in MaxResults. If more objects are available for retrieval, Resolver returns a NextToken value in the response. To retrieve the next batch of objects, use the token that was returned for the prior request in your next request.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "NextToken",
          "type": "string",
          "description": "If objects are still available for retrieval, Resolver returns this token in the response. To retrieve the next batch of objects, provide this token in your next request.",
          "nested_items": []
        },
        {
          "name": "FirewallConfigs",
          "type": "list",
          "description": "The configurations for the firewall behavior provided by DNS Firewall for VPCs from Amazon Virtual Private Cloud (Amazon VPC).",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Id",
                  "type": "string",
                  "description": "The ID of the firewall configuration.",
                  "nested_items": []
                },
                {
                  "name": "ResourceId",
                  "type": "string",
                  "description": "The ID of the VPC that this firewall configuration applies to.",
                  "nested_items": []
                },
                {
                  "name": "OwnerId",
                  "type": "string",
                  "description": "The Amazon Web Services account ID of the owner of the VPC that this firewall configuration applies to.",
                  "nested_items": []
                },
                {
                  "name": "FirewallFailOpen",
                  "type": "string",
                  "description": "Determines how DNS Firewall operates during failures, for example when all traffic that is sent to DNS Firewall fails to receive a reply.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "By default, fail open is disabled, which means the failure mode is closed. This approach favors security over availability. DNS Firewall returns a failure error when it is unable to properly evaluate a query.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "If you enable this option, the failure mode is open. This approach favors availability over security. DNS Firewall allows queries to proceed if it is unable to properly evaluate them.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}