{
  "method_name": "update_resolver_rule",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/route53resolver/client/update_resolver_rule.html",
  "description": "Updates settings for a specified Resolver rule. ResolverRuleId is required, and all other parameters are optional. If you don't specify a parameter, it retains its current value.",
  "parameters": [
    {
      "name": "ResolverRuleId",
      "type": "string",
      "required": true,
      "description": "The ID of the Resolver rule that you want to update.",
      "nested_params": []
    },
    {
      "name": "Config",
      "type": "dict",
      "required": true,
      "description": "The new settings for the Resolver rule. Name (string) --- The new name for the Resolver rule. The name that you specify appears in the Resolver dashboard in the Route 53 console. TargetIps (list) --- For DNS queries that originate in your VPC, the new IP addresses that you want to route outbound DNS queries to. (dict) --- In a CreateResolverRule request, an array of the IPs that you want to forward DNS queries to. Ip (string) --- One IPv4 address that you want to forward DNS queries to. Port (integer) --- The port at Ip that you want to forward DNS queries to. Ipv6 (string) --- One IPv6 address that you want to forward DNS queries to. Protocol (string) --- The protocols for the target address. The protocol you choose needs to be supported by the outbound endpoint of the Resolver rule. ServerNameIndication (string) --- The Server Name Indication of the DoH server that you want to forward queries to. This is only used if the Protocol of the TargetAddress is DoH. ResolverEndpointId (string) --- The ID of the new outbound Resolver endpoint that you want to use to route DNS queries to the IP addresses that you specify in TargetIps.",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The new name for the Resolver rule. The name that you specify appears in the Resolver dashboard in the Route 53 console.",
          "nested_params": []
        },
        {
          "name": "TargetIps",
          "type": "list",
          "required": false,
          "description": "For DNS queries that originate in your VPC, the new IP addresses that you want to route outbound DNS queries to.",
          "nested_params": [
            {
              "name": "Ip",
              "type": "string",
              "required": false,
              "description": "One IPv4 address that you want to forward DNS queries to.",
              "nested_params": []
            },
            {
              "name": "Port",
              "type": "integer",
              "required": false,
              "description": "The port at Ip that you want to forward DNS queries to.",
              "nested_params": []
            },
            {
              "name": "Ipv6",
              "type": "string",
              "required": false,
              "description": "One IPv6 address that you want to forward DNS queries to.",
              "nested_params": []
            },
            {
              "name": "Protocol",
              "type": "string",
              "required": false,
              "description": "The protocols for the target address. The protocol you choose needs to be supported by the outbound endpoint of the Resolver rule.",
              "nested_params": []
            },
            {
              "name": "ServerNameIndication",
              "type": "string",
              "required": false,
              "description": "The Server Name Indication of the DoH server that you want to forward queries to. This is only used if the Protocol of the TargetAddress is DoH.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ResolverEndpointId",
          "type": "string",
          "required": false,
          "description": "The ID of the new outbound Resolver endpoint that you want to use to route DNS queries to the IP addresses that you specify in TargetIps.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ResolverRule",
          "type": "dict",
          "description": "The response to an UpdateResolverRule request.",
          "nested_items": [
            {
              "name": "Id",
              "type": "string",
              "description": "The ID that Resolver assigned to the Resolver rule when you created it.",
              "nested_items": []
            },
            {
              "name": "CreatorRequestId",
              "type": "string",
              "description": "A unique string that you specified when you created the Resolver rule. CreatorRequestId identifies the request and allows failed requests to be retried without the risk of running the operation twice.",
              "nested_items": []
            },
            {
              "name": "Arn",
              "type": "string",
              "description": "The ARN (Amazon Resource Name) for the Resolver rule specified by Id.",
              "nested_items": []
            },
            {
              "name": "DomainName",
              "type": "string",
              "description": "DNS queries for this domain name are forwarded to the IP addresses that are specified in TargetIps. If a query matches multiple Resolver rules (example.com and www.example.com), the query is routed using the Resolver rule that contains the most specific domain name (www.example.com).",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "A code that specifies the current status of the Resolver rule.",
              "nested_items": []
            },
            {
              "name": "StatusMessage",
              "type": "string",
              "description": "A detailed description of the status of a Resolver rule.",
              "nested_items": []
            },
            {
              "name": "RuleType",
              "type": "string",
              "description": "When you want to forward DNS queries for specified domain name to resolvers on your network, specify FORWARD or DELEGATE. If a query matches multiple Resolver rules (example.com and www.example.com), outbound DNS queries are routed using the Resolver rule that contains the most specific domain name (www.example.com).",
              "nested_items": []
            },
            {
              "name": "Name",
              "type": "string",
              "description": "The name for the Resolver rule, which you specified when you created the Resolver rule.",
              "nested_items": []
            },
            {
              "name": "TargetIps",
              "type": "list",
              "description": "An array that contains the IP addresses and ports that an outbound endpoint forwards DNS queries to. Typically, these are the IP addresses of DNS resolvers on your network.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Ip",
                      "type": "string",
                      "description": "One IPv4 address that you want to forward DNS queries to.",
                      "nested_items": []
                    },
                    {
                      "name": "Port",
                      "type": "integer",
                      "description": "The port at Ip that you want to forward DNS queries to.",
                      "nested_items": []
                    },
                    {
                      "name": "Ipv6",
                      "type": "string",
                      "description": "One IPv6 address that you want to forward DNS queries to.",
                      "nested_items": []
                    },
                    {
                      "name": "Protocol",
                      "type": "string",
                      "description": "The protocols for the target address. The protocol you choose needs to be supported by the outbound endpoint of the Resolver rule.",
                      "nested_items": []
                    },
                    {
                      "name": "ServerNameIndication",
                      "type": "string",
                      "description": "The Server Name Indication of the DoH server that you want to forward queries to. This is only used if the Protocol of the TargetAddress is DoH.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "ResolverEndpointId",
              "type": "string",
              "description": "The ID of the endpoint that the rule is associated with.",
              "nested_items": []
            },
            {
              "name": "OwnerId",
              "type": "string",
              "description": "When a rule is shared with another Amazon Web Services account, the account ID of the account that the rule is shared with.",
              "nested_items": []
            },
            {
              "name": "ShareStatus",
              "type": "string",
              "description": "Whether the rule is shared and, if so, whether the current account is sharing the rule with another account, or another account is sharing the rule with the current account.",
              "nested_items": []
            },
            {
              "name": "CreationTime",
              "type": "string",
              "description": "The date and time that the Resolver rule was created, in Unix time format and Coordinated Universal Time (UTC).",
              "nested_items": []
            },
            {
              "name": "ModificationTime",
              "type": "string",
              "description": "The date and time that the Resolver rule was last updated, in Unix time format and Coordinated Universal Time (UTC).",
              "nested_items": []
            },
            {
              "name": "DelegationRecord",
              "type": "string",
              "description": "DNS queries with delegation records that point to this domain name are forwarded to resolvers on your network.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}