{
  "method_name": "list_invoice_units",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/invoicing/client/list_invoice_units.html",
  "description": "This fetches a list of all invoice unit definitions for a given account, as of the provided AsOf date.",
  "parameters": [
    {
      "name": "Filters",
      "type": "dict",
      "required": false,
      "description": "An optional input to the list API. If multiple filters are specified, the returned list will be a configuration that match all of the provided filters. Supported filter types are InvoiceReceivers, Names, and Accounts. Names (list) --- An optional input to the list API. You can specify a list of invoice unit names inside filters to return invoice units that match only the specified invoice unit names. If multiple names are provided, the result is an OR condition (match any) of the specified invoice unit names. (string) --- InvoiceReceivers (list) --- You can specify a list of Amazon Web Services account IDs inside filters to return invoice units that match only the specified accounts. If multiple accounts are provided, the result is an OR condition (match any) of the specified accounts. This filter only matches the specified accounts on the invoice receivers of the invoice units. (string) --- Accounts (list) --- You can specify a list of Amazon Web Services account IDs inside filters to return invoice units that match only the specified accounts. The specified account IDs are matched with either the receiver or the linked accounts in the rules. (string) ---",
      "nested_params": [
        {
          "name": "Names",
          "type": "list",
          "required": false,
          "description": "An optional input to the list API. You can specify a list of invoice unit names inside filters to return invoice units that match only the specified invoice unit names. If multiple names are provided, the result is an OR condition (match any) of the specified invoice unit names.",
          "nested_params": []
        },
        {
          "name": "InvoiceReceivers",
          "type": "list",
          "required": false,
          "description": "You can specify a list of Amazon Web Services account IDs inside filters to return invoice units that match only the specified accounts. If multiple accounts are provided, the result is an OR condition (match any) of the specified accounts. This filter only matches the specified accounts on the invoice receivers of the invoice units.",
          "nested_params": []
        },
        {
          "name": "Accounts",
          "type": "list",
          "required": false,
          "description": "You can specify a list of Amazon Web Services account IDs inside filters to return invoice units that match only the specified accounts. If multiple accounts are provided, the result is an OR condition (match any) of the specified accounts. The specified account IDs are matched with either the receiver or the linked accounts in the rules.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "AsOf",
      "type": "datetime",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "InvoiceUnits",
          "type": "list",
          "description": "An invoice unit is a set of mutually exclusive accounts that correspond to your business entity.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "InvoiceUnitArn",
                  "type": "string",
                  "description": "ARN to identify an invoice unit. This information can't be modified or deleted.",
                  "nested_items": []
                },
                {
                  "name": "InvoiceReceiver",
                  "type": "string",
                  "description": "The account that receives invoices related to the invoice unit.",
                  "nested_items": []
                },
                {
                  "name": "Name",
                  "type": "string",
                  "description": "A unique name that is distinctive within your Amazon Web Services.",
                  "nested_items": []
                },
                {
                  "name": "Description",
                  "type": "string",
                  "description": "The assigned description for an invoice unit. This information can't be modified or deleted.",
                  "nested_items": []
                },
                {
                  "name": "TaxInheritanceDisabled",
                  "type": "boolean",
                  "description": "Whether the invoice unit based tax inheritance is/ should be enabled or disabled.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "LinkedAccounts",
                      "type": "list",
                      "description": "The list of LINKED_ACCOUNT IDs where charges are included within the invoice unit.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "LastModified",
                  "type": "datetime",
                  "description": "The last time the invoice unit was updated. This is important to determine the version of invoice unit configuration used to create the invoices. Any invoice created after this modified time will use this invoice unit configuration.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The next token used to indicate where the returned list should start from.",
          "nested_items": []
        }
      ]
    }
  ]
}