{
  "method_name": "describe_container",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/mediastore/client/describe_container.html",
  "description": "Retrieves the properties of the requested container. This request is commonly used to retrieve the endpoint of a container. An endpoint is a value assigned by the service when a new container is created. A container's endpoint does not change after it has been assigned. The DescribeContainer request returns a single Container object based on ContainerName. To return all Container objects that are associated with a specified AWS account, use  ListContainers.",
  "parameters": [
    {
      "name": "ContainerName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Container",
          "type": "dict",
          "description": "The name of the queried container.",
          "nested_items": [
            {
              "name": "Endpoint",
              "type": "string",
              "description": "The DNS endpoint of the container. Use the endpoint to identify the specific container when sending requests to the data plane. The service assigns this value when the container is created. Once the value has been assigned, it does not change.",
              "nested_items": []
            },
            {
              "name": "CreationTime",
              "type": "datetime",
              "description": "Unix timestamp.",
              "nested_items": []
            },
            {
              "name": "ARN",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the container. The ARN has the following format:",
              "nested_items": []
            },
            {
              "name": "Name",
              "type": "string",
              "description": "The name of the container.",
              "nested_items": []
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The status of container creation or deletion. The status is one of the following: CREATING, ACTIVE, or DELETING. While the service is creating the container, the status is CREATING. When the endpoint is available, the status changes to ACTIVE.",
              "nested_items": []
            },
            {
              "name": "AccessLoggingEnabled",
              "type": "boolean",
              "description": "The state of access logging on the container. This value is false by default, indicating that AWS Elemental MediaStore does not send access logs to Amazon CloudWatch Logs. When you enable access logging on the container, MediaStore changes this value to true, indicating that the service delivers access logs for objects stored in that container to CloudWatch Logs.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}