{
  "method_name": "export_certificate",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/acm/client/export_certificate.html",
  "description": "Exports a private certificate issued by a private certificate authority (CA) for use anywhere. The exported file contains the certificate, the certificate chain, and the encrypted private 2048-bit RSA key associated with the public key that is embedded in the certificate. For security, you must assign a passphrase for the private key when exporting it. For information about exporting and formatting a certificate using the ACM console or CLI, see Export a Private Certificate.",
  "parameters": [
    {
      "name": "CertificateArn",
      "type": "string",
      "required": true,
      "description": "An Amazon Resource Name (ARN) of the issued certificate. This must be of the form: arn:aws:acm:region:account:certificate/12345678-1234-1234-1234-123456789012",
      "nested_params": []
    },
    {
      "name": "Passphrase",
      "type": "bytes",
      "required": true,
      "description": "Passphrase to associate with the encrypted exported private key. If you want to later decrypt the private key, you must have the passphrase. You can use the following OpenSSL command to decrypt a private key. After entering the command, you are prompted for the passphrase. openssl rsa -in encrypted_key.pem -out decrypted_key.pem.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Certificate",
          "type": "string",
          "description": "The base64 PEM-encoded certificate.",
          "nested_items": []
        },
        {
          "name": "CertificateChain",
          "type": "string",
          "description": "The base64 PEM-encoded certificate chain. This does not include the certificate that you are exporting.",
          "nested_items": []
        },
        {
          "name": "PrivateKey",
          "type": "string",
          "description": "The encrypted private key associated with the public key in the certificate. The key is output in PKCS #8 format and is base64 PEM-encoded.",
          "nested_items": []
        }
      ]
    }
  ]
}