{
  "method_name": "put_account_configuration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/acm/client/put_account_configuration.html",
  "description": "Adds or modifies account-level configurations in ACM. The supported configuration option is DaysBeforeExpiry. This option specifies the number of days prior to certificate expiration when ACM starts generating EventBridge events. ACM sends one event per day per certificate until the certificate expires. By default, accounts receive events starting 45 days before certificate expiration.",
  "parameters": [
    {
      "name": "ExpiryEvents",
      "type": "dict",
      "required": false,
      "description": "Specifies expiration events associated with an account. DaysBeforeExpiry (integer) --- Specifies the number of days prior to certificate expiration when ACM starts generating EventBridge events. ACM sends one event per day per certificate until the certificate expires. By default, accounts receive events starting 45 days before certificate expiration.",
      "nested_params": [
        {
          "name": "DaysBeforeExpiry",
          "type": "integer",
          "required": false,
          "description": "Specifies the number of days prior to certificate expiration when ACM starts generating EventBridge events. ACM sends one event per day per certificate until the certificate expires. By default, accounts receive events starting 45 days before certificate expiration.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "IdempotencyToken",
      "type": "string",
      "required": true,
      "description": "Customer-chosen string used to distinguish between calls to PutAccountConfiguration. Idempotency tokens time out after one hour. If you call PutAccountConfiguration multiple times with the same unexpired idempotency token, ACM treats it as the same request and returns the original result. If you change the idempotency token for each call, ACM treats each call as a new request.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}