{
  "method_name": "associate_client_vpn_target_network",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/associate_client_vpn_target_network.html",
  "description": "Associates a target network with a Client VPN endpoint. A target network is a subnet in a VPC. You can associate multiple subnets from the same VPC with a Client VPN endpoint. You can associate only one subnet in each Availability Zone. We recommend that you associate at least two subnets to provide Availability Zone redundancy. If you specified a VPC when you created the Client VPN endpoint or if you have previous subnet associations, the specified subnet must be in the same VPC. To specify a subnet that's in a different VPC, you must first modify the Client VPN endpoint (  ModifyClientVpnEndpoint) and change the VPC that's associated with it.",
  "parameters": [
    {
      "name": "ClientVpnEndpointId",
      "type": "string",
      "required": true,
      "description": "The ID of the Client VPN endpoint.",
      "nested_params": []
    },
    {
      "name": "SubnetId",
      "type": "string",
      "required": true,
      "description": "The ID of the subnet to associate with the Client VPN endpoint.",
      "nested_params": []
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": false,
      "description": "Unique, case-sensitive identifier that you provide to ensure the idempotency of the request. For more information, see Ensuring idempotency. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "AssociationId",
          "type": "string",
          "description": "The unique ID of the target network association.",
          "nested_items": []
        },
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "Code",
              "type": "string",
              "description": "The state of the target network association.",
              "nested_items": []
            },
            {
              "name": "Message",
              "type": "string",
              "description": "A message about the status of the target network association, if applicable.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}