{
  "method_name": "create_client_vpn_endpoint",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/create_client_vpn_endpoint.html",
  "description": "Creates a Client VPN endpoint. A Client VPN endpoint is the resource you create and configure to enable and manage client VPN sessions. It is the destination endpoint at which all client VPN sessions are terminated.",
  "parameters": [
    {
      "name": "ClientCidrBlock",
      "type": "string",
      "required": true,
      "description": "The IPv4 address range, in CIDR notation, from which to assign client IP addresses. The address range cannot overlap with the local CIDR of the VPC in which the associated subnet is located, or the routes that you add manually. The address range cannot be changed after the Client VPN endpoint has been created. Client CIDR range must have a size of at least /22 and must not be greater than /12.",
      "nested_params": []
    },
    {
      "name": "ServerCertificateArn",
      "type": "string",
      "required": true,
      "description": "The ARN of the server certificate. For more information, see the Certificate Manager User Guide.",
      "nested_params": []
    },
    {
      "name": "AuthenticationOptions",
      "type": "list",
      "required": true,
      "description": "Information about the authentication method to be used to authenticate clients. (dict) --- Describes the authentication method to be used by a Client VPN endpoint. For more information, see Authentication in the Client VPN Administrator Guide. Type (string) --- The type of client authentication to be used. ActiveDirectory (dict) --- Information about the Active Directory to be used, if applicable. You must provide this information if Type is directory-service-authentication. DirectoryId (string) --- The ID of the Active Directory to be used for authentication. MutualAuthentication (dict) --- Information about the authentication certificates to be used, if applicable. You must provide this information if Type is certificate-authentication. ClientRootCertificateChainArn (string) --- The ARN of the client certificate. The certificate must be signed by a certificate authority (CA) and it must be provisioned in Certificate Manager (ACM). FederatedAuthentication (dict) --- Information about the IAM SAML identity provider to be used, if applicable. You must provide this information if Type is federated-authentication. SAMLProviderArn (string) --- The Amazon Resource Name (ARN) of the IAM SAML identity provider. SelfServiceSAMLProviderArn (string) --- The Amazon Resource Name (ARN) of the IAM SAML identity provider for the self-service portal.",
      "nested_params": [
        {
          "name": "Type",
          "type": "string",
          "required": false,
          "description": "The type of client authentication to be used.",
          "nested_params": []
        },
        {
          "name": "ActiveDirectory",
          "type": "dict",
          "required": false,
          "description": "",
          "nested_params": [
            {
              "name": "DirectoryId",
              "type": "string",
              "required": false,
              "description": "The ID of the Active Directory to be used for authentication.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "MutualAuthentication",
          "type": "dict",
          "required": false,
          "description": "",
          "nested_params": [
            {
              "name": "ClientRootCertificateChainArn",
              "type": "string",
              "required": false,
              "description": "The ARN of the client certificate. The certificate must be signed by a certificate authority (CA) and it must be provisioned in Certificate Manager (ACM).",
              "nested_params": []
            }
          ]
        },
        {
          "name": "FederatedAuthentication",
          "type": "dict",
          "required": false,
          "description": "",
          "nested_params": [
            {
              "name": "SAMLProviderArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of the IAM SAML identity provider.",
              "nested_params": []
            },
            {
              "name": "SelfServiceSAMLProviderArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of the IAM SAML identity provider for the self-service portal.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "ConnectionLogOptions",
      "type": "dict",
      "required": true,
      "description": "Information about the client connection logging options. If you enable client connection logging, data about client connections is sent to a Cloudwatch Logs log stream. The following information is logged: Client connection requests Client connection results (successful and unsuccessful) Reasons for unsuccessful client connection requests Client connection termination time Enabled (boolean) --- Indicates whether connection logging is enabled. CloudwatchLogGroup (string) --- The name of the CloudWatch Logs log group. Required if connection logging is enabled. CloudwatchLogStream (string) --- The name of the CloudWatch Logs log stream to which the connection data is published.",
      "nested_params": []
    },
    {
      "name": "DnsServers",
      "type": "list",
      "required": false,
      "description": "Information about the DNS servers to be used for DNS resolution. A Client VPN endpoint can have up to two DNS servers. If no DNS server is specified, the DNS address configured on the device is used for the DNS server. (string) ---",
      "nested_params": []
    },
    {
      "name": "TransportProtocol",
      "type": "string",
      "required": false,
      "description": "The transport protocol to be used by the VPN session. Default value: udp.",
      "nested_params": []
    },
    {
      "name": "VpnPort",
      "type": "integer",
      "required": false,
      "description": "The port number to assign to the Client VPN endpoint for TCP and UDP traffic. Valid Values: 443 | 1194 Default Value: 443",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "SplitTunnel",
      "type": "boolean",
      "required": false,
      "description": "Indicates whether split-tunnel is enabled on the Client VPN endpoint. By default, split-tunnel on a VPN endpoint is disabled. For information about split-tunnel VPN endpoints, see Split-tunnel Client VPN endpoint in the Client VPN Administrator Guide.",
      "nested_params": []
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": false,
      "description": "Unique, case-sensitive identifier that you provide to ensure the idempotency of the request. For more information, see Ensuring idempotency. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "TagSpecifications",
      "type": "list",
      "required": false,
      "description": "The tags to apply to the Client VPN endpoint during creation. (dict) --- The tags to apply to a resource when the resource is being created. When you specify a tag, you must specify the resource type to tag, otherwise the request will fail. ResourceType (string) --- The type of resource to tag on creation. Tags (list) --- The tags to apply to the resource. (dict) --- Describes a tag. Key (string) --- The key of the tag. Constraints: Tag keys are case-sensitive and accept a maximum of 127 Unicode characters. May not begin with aws:. Value (string) --- The value of the tag. Constraints: Tag values are case-sensitive and accept a maximum of 256 Unicode characters.",
      "nested_params": [
        {
          "name": "ResourceType",
          "type": "string",
          "required": false,
          "description": "The type of resource to tag on creation.",
          "nested_params": []
        },
        {
          "name": "Tags",
          "type": "list",
          "required": false,
          "description": "The tags to apply to the resource.",
          "nested_params": [
            {
              "name": "Key",
              "type": "string",
              "required": false,
              "description": "The key of the tag. Constraints: Tag keys are case-sensitive and accept a maximum of 127 Unicode characters. May not begin with aws:.",
              "nested_params": []
            },
            {
              "name": "Value",
              "type": "string",
              "required": false,
              "description": "The value of the tag. Constraints: Tag values are case-sensitive and accept a maximum of 256 Unicode characters.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "SecurityGroupIds",
      "type": "list",
      "required": false,
      "description": "The IDs of one or more security groups to apply to the target network. You must also specify the ID of the VPC that contains the security groups. (string) ---",
      "nested_params": []
    },
    {
      "name": "VpcId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "SelfServicePortal",
      "type": "string",
      "required": false,
      "description": "Specify whether to enable the self-service portal for the Client VPN endpoint. Default Value: enabled.",
      "nested_params": []
    },
    {
      "name": "ClientConnectOptions",
      "type": "dict",
      "required": false,
      "description": "The options for managing connection authorization for new client connections. Enabled (boolean) --- Indicates whether client connect options are enabled. The default is false (not enabled). LambdaFunctionArn (string) --- The Amazon Resource Name (ARN) of the Lambda function used for connection authorization.",
      "nested_params": [
        {
          "name": "Enabled",
          "type": "boolean",
          "required": false,
          "description": "Indicates whether client connect options are enabled. The default is false (not enabled).",
          "nested_params": []
        },
        {
          "name": "LambdaFunctionArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the Lambda function used for connection authorization.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "SessionTimeoutHours",
      "type": "integer",
      "required": false,
      "description": "The maximum VPN session duration time in hours. Valid values: 8 | 10 | 12 | 24 Default value: 24",
      "nested_params": []
    },
    {
      "name": "ClientLoginBannerOptions",
      "type": "dict",
      "required": false,
      "description": "Options for enabling a customizable text banner that will be displayed on Amazon Web Services provided clients when a VPN session is established. Enabled (boolean) --- Enable or disable a customizable text banner that will be displayed on Amazon Web Services provided clients when a VPN session is established. Valid values: true | false Default value: false BannerText (string) --- Customizable text that will be displayed in a banner on Amazon Web Services provided clients when a VPN session is established. UTF-8 encoded characters only. Maximum of 1400 characters.",
      "nested_params": [
        {
          "name": "Enabled",
          "type": "boolean",
          "required": false,
          "description": "Enable or disable a customizable text banner that will be displayed on Amazon Web Services provided clients when a VPN session is established. Valid values: true | false Default value: false.",
          "nested_params": []
        },
        {
          "name": "BannerText",
          "type": "string",
          "required": false,
          "description": "Customizable text that will be displayed in a banner on Amazon Web Services provided clients when a VPN session is established. UTF-8 encoded characters only. Maximum of 1400 characters.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ClientRouteEnforcementOptions",
      "type": "dict",
      "required": false,
      "description": "Client route enforcement is a feature of the Client VPN service that helps enforce administrator defined routes on devices connected through the VPN. T his feature helps improve your security posture by ensuring that network traffic originating from a connected client is not inadvertently sent outside the VPN tunnel. Client route enforcement works by monitoring the route table of a connected device for routing policy changes to the VPN connection. If the feature detects any VPN routing policy modifications, it will automatically force an update to the route table, reverting it back to the expected route configurations. Enforced (boolean) --- Enable or disable Client Route Enforcement. The state can either be true (enabled) or false (disabled). The default is false. Valid values: true | false Default value: false.",
      "nested_params": [
        {
          "name": "Enforced",
          "type": "boolean",
          "required": false,
          "description": "Enable or disable Client Route Enforcement. The state can either be true (enabled) or false (disabled). The default is false. Valid values: true | false Default value: false.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "DisconnectOnSessionTimeout",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ClientVpnEndpointId",
          "type": "string",
          "description": "The ID of the Client VPN endpoint.",
          "nested_items": []
        },
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "Code",
              "type": "string",
              "description": "The state of the Client VPN endpoint. Possible states include:",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "pending-associate - The Client VPN endpoint has been created but no target networks have been associated. The Client VPN endpoint cannot accept connections.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "available - The Client VPN endpoint has been created and a target network has been associated. The Client VPN endpoint can accept connections.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "deleting - The Client VPN endpoint is being deleted. The Client VPN endpoint cannot accept connections.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "deleted - The Client VPN endpoint has been deleted. The Client VPN endpoint cannot accept connections.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Message",
              "type": "string",
              "description": "A message about the status of the Client VPN endpoint.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "DnsName",
          "type": "string",
          "description": "The DNS name to be used by clients when establishing their VPN session.",
          "nested_items": []
        }
      ]
    }
  ]
}