{
  "method_name": "delete_fleets",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/delete_fleets.html",
  "description": "Deletes the specified EC2 Fleet request. After you delete an EC2 Fleet request, it launches no new instances. You must also specify whether a deleted EC2 Fleet request should terminate its instances. If you choose to terminate the instances, the EC2 Fleet request enters the deleted_terminating state. Otherwise, it enters the deleted_running state, and the instances continue to run until they are interrupted or you terminate them manually. A deleted instant fleet with running instances is not supported. When you delete an instant fleet, Amazon EC2 automatically terminates all its instances. For fleets with more than 1000 instances, the deletion request might fail. If your fleet has more than 1000 instances, first terminate most of the instances manually, leaving 1000 or fewer. Then delete the fleet, and the remaining instances will be terminated automatically. For more information, see Delete an EC2 Fleet request and the instances in the fleet in the Amazon EC2 User Guide.",
  "parameters": [
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "FleetIds",
      "type": "list",
      "required": true,
      "description": "The IDs of the EC2 Fleets. Constraints: In a single request, you can specify up to 25 instant fleet IDs and up to 100 maintain or request fleet IDs. (string) ---",
      "nested_params": []
    },
    {
      "name": "TerminateInstances",
      "type": "boolean",
      "required": true,
      "description": "Indicates whether to terminate the associated instances when the EC2 Fleet is deleted. The default is to terminate the instances. To let the instances continue to run after the EC2 Fleet is deleted, specify no-terminate-instances. Supported only for fleets of type maintain and request. For instant fleets, you cannot specify NoTerminateInstances. A deleted instant fleet with running instances is not supported.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "SuccessfulFleetDeletions",
          "type": "list",
          "description": "Information about the EC2 Fleets that are successfully deleted.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "CurrentFleetState",
                  "type": "string",
                  "description": "The current state of the EC2 Fleet.",
                  "nested_items": []
                },
                {
                  "name": "PreviousFleetState",
                  "type": "string",
                  "description": "The previous state of the EC2 Fleet.",
                  "nested_items": []
                },
                {
                  "name": "FleetId",
                  "type": "string",
                  "description": "The ID of the EC2 Fleet.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "UnsuccessfulFleetDeletions",
          "type": "list",
          "description": "Information about the EC2 Fleets that are not successfully deleted.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Code",
                      "type": "string",
                      "description": "The error code.",
                      "nested_items": []
                    },
                    {
                      "name": "Message",
                      "type": "string",
                      "description": "The description for the error code.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "FleetId",
                  "type": "string",
                  "description": "The ID of the EC2 Fleet.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}