{
  "method_name": "describe_regions",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/describe_regions.html",
  "description": "Describes the Regions that are enabled for your account, or all Regions. For a list of the Regions supported by Amazon EC2, see Amazon EC2 service endpoints. For information about enabling and disabling Regions for your account, see Specify which Amazon Web Services Regions your account can use in the Amazon Web Services Account Management Reference Guide.",
  "parameters": [
    {
      "name": "RegionNames",
      "type": "list",
      "required": false,
      "description": "The names of the Regions. You can specify any Regions, whether they are enabled and disabled for your account. (string) ---",
      "nested_params": []
    },
    {
      "name": "AllRegions",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": false,
      "description": "The filters. endpoint - The endpoint of the Region (for example, ec2.us-east-1.amazonaws.com). opt-in-status - The opt-in status of the Region ( opt-in-not-required | opted-in | not-opted-in). region-name - The name of the Region (for example, us-east-1). (dict) --- A filter name and value pair that is used to return a more specific list of results from a describe operation. Filters can be used to match a set of resources by specific criteria, such as tags, attributes, or IDs. If you specify multiple filters, the filters are joined with an AND, and the request returns only results that match all of the specified filters. For more information, see List and filter using the CLI and API in the Amazon EC2 User Guide. Name (string) --- The name of the filter. Filter names are case-sensitive. Values (list) --- The filter values. Filter values are case-sensitive. If you specify multiple values for a filter, the values are joined with an OR, and the request returns all results that match any of the specified values. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Regions",
          "type": "list",
          "description": "Information about the Regions.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "OptInStatus",
                  "type": "string",
                  "description": "The Region opt-in status. The possible values are opt-in-not-required, opted-in, and not-opted-in.",
                  "nested_items": []
                },
                {
                  "name": "RegionName",
                  "type": "string",
                  "description": "The name of the Region.",
                  "nested_items": []
                },
                {
                  "name": "Endpoint",
                  "type": "string",
                  "description": "The Region service endpoint.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}