{
  "method_name": "describe_spot_fleet_requests",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/describe_spot_fleet_requests.html",
  "description": "Describes your Spot Fleet requests. Spot Fleet requests are deleted 48 hours after they are canceled and their instances are terminated.",
  "parameters": [
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "SpotFleetRequestIds",
      "type": "list",
      "required": false,
      "description": "The IDs of the Spot Fleet requests. (string) ---",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "NextToken",
          "type": "string",
          "description": "The token to include in another request to get the next page of items. This value is null when there are no more items to return.",
          "nested_items": []
        },
        {
          "name": "SpotFleetRequestConfigs",
          "type": "list",
          "description": "Information about the configuration of your Spot Fleet.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ActivityStatus",
                  "type": "string",
                  "description": "The progress of the Spot Fleet request. If there is an error, the status is error. After all requests are placed, the status is pending_fulfillment. If the size of the fleet is equal to or greater than its target capacity, the status is fulfilled. If the size of the fleet is decreased, the status is pending_termination while Spot Instances are terminating.",
                  "nested_items": []
                },
                {
                  "name": "CreateTime",
                  "type": "datetime",
                  "description": "The creation date and time of the request.",
                  "nested_items": []
                },
                {
                  "name": "SpotFleetRequestConfig",
                  "type": "dict",
                  "description": "The configuration of the Spot Fleet request.",
                  "nested_items": [
                    {
                      "name": "AllocationStrategy",
                      "type": "string",
                      "description": "The strategy that determines how to allocate the target Spot Instance capacity across the Spot Instance pools specified by the Spot Fleet launch configuration. For more information, see Allocation strategies for Spot Instances in the Amazon EC2 User Guide.",
                      "nested_items": []
                    },
                    {
                      "name": "OnDemandAllocationStrategy",
                      "type": "string",
                      "description": "The order of the launch template overrides to use in fulfilling On-Demand capacity. If you specify lowestPrice, Spot Fleet uses price to determine the order, launching the lowest price first. If you specify prioritized, Spot Fleet uses the priority that you assign to each Spot Fleet launch template override, launching the highest priority first. If you do not specify a value, Spot Fleet defaults to lowestPrice.",
                      "nested_items": []
                    },
                    {
                      "name": "SpotMaintenanceStrategies",
                      "type": "dict",
                      "description": "The strategies for managing your Spot Instances that are at an elevated risk of being interrupted.",
                      "nested_items": [
                        {
                          "name": "CapacityRebalance",
                          "type": "dict",
                          "description": "The Spot Instance replacement strategy to use when Amazon EC2 emits a signal that your Spot Instance is at an elevated risk of being interrupted. For more information, see Capacity rebalancing in the Amazon EC2 User Guide.",
                          "nested_items": [
                            {
                              "name": "ReplacementStrategy",
                              "type": "string",
                              "description": "The replacement strategy to use. Only available for fleets of type maintain.",
                              "nested_items": []
                            },
                            {
                              "name": "TerminationDelay",
                              "type": "integer",
                              "description": "The amount of time (in seconds) that Amazon EC2 waits before terminating the old Spot Instance after launching a new replacement Spot Instance.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "ClientToken",
                      "type": "string",
                      "description": "A unique, case-sensitive identifier that you provide to ensure the idempotency of your listings. This helps to avoid duplicate listings. For more information, see Ensuring Idempotency.",
                      "nested_items": []
                    },
                    {
                      "name": "ExcessCapacityTerminationPolicy",
                      "type": "string",
                      "description": "Indicates whether running instances should be terminated if you decrease the target capacity of the Spot Fleet request below the current size of the Spot Fleet.",
                      "nested_items": []
                    },
                    {
                      "name": "FulfilledCapacity",
                      "type": "float",
                      "description": "The number of units fulfilled by this request compared to the set target capacity. You cannot set this value.",
                      "nested_items": []
                    },
                    {
                      "name": "OnDemandFulfilledCapacity",
                      "type": "float",
                      "description": "The number of On-Demand units fulfilled by this request compared to the set target On-Demand capacity.",
                      "nested_items": []
                    },
                    {
                      "name": "IamFleetRole",
                      "type": "string",
                      "description": "The Amazon Resource Name (ARN) of an Identity and Access Management (IAM) role that grants the Spot Fleet the permission to request, launch, terminate, and tag instances on your behalf. For more information, see Spot Fleet prerequisites in the Amazon EC2 User Guide. Spot Fleet can terminate Spot Instances on your behalf when you cancel its Spot Fleet request using CancelSpotFleetRequests or when the Spot Fleet request expires, if you set TerminateInstancesWithExpiration.",
                      "nested_items": []
                    },
                    {
                      "name": "LaunchSpecifications",
                      "type": "list",
                      "description": "The launch specifications for the Spot Fleet request. If you specify LaunchSpecifications, you can't specify LaunchTemplateConfigs. If you include On-Demand capacity in your request, you must use LaunchTemplateConfigs.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "AddressingType",
                              "type": "string",
                              "description": "Deprecated.",
                              "nested_items": []
                            },
                            {
                              "name": "BlockDeviceMappings",
                              "type": "list",
                              "description": "One or more block devices that are mapped to the Spot Instances. You can't specify both a snapshot ID and an encryption value. This is because only blank volumes can be encrypted on creation. If a snapshot is the basis for a volume, it is not blank and its encryption status is used for the volume encryption status.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "dict",
                                      "description": "",
                                      "nested_items": [
                                        {
                                          "name": "DeleteOnTermination",
                                          "type": "boolean",
                                          "description": "Indicates whether the EBS volume is deleted on instance termination. For more information, see Preserving Amazon EBS volumes on instance termination in the Amazon EC2 User Guide.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "Iops",
                                          "type": "integer",
                                          "description": "The number of I/O operations per second (IOPS). For gp3, io1, and io2 volumes, this represents the number of IOPS that are provisioned for the volume. For gp2 volumes, this represents the baseline performance of the volume and the rate at which the volume accumulates I/O credits for bursting.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "gp3: 3,000 - 16,000 IOPS.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "io1: 100 - 64,000 IOPS.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "io2: 100 - 256,000 IOPS.",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "SnapshotId",
                                          "type": "string",
                                          "description": "The ID of the snapshot.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "VolumeSize",
                                          "type": "integer",
                                          "description": "The size of the volume, in GiBs. You must specify either a snapshot ID or a volume size. If you specify a snapshot, the default is the snapshot size. You can specify a volume size that is equal to or larger than the snapshot size.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "gp2 and gp3: 1 - 16,384 GiB.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "io1: 4 - 16,384 GiB.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "io2: 4 - 65,536 GiB.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "st1 and sc1: 125 - 16,384 GiB.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "standard: 1 - 1024 GiB.",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "VolumeType",
                                          "type": "string",
                                          "description": "The volume type. For more information, see Amazon EBS volume types in the Amazon EBS User Guide.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "KmsKeyId",
                                          "type": "string",
                                          "description": "of the customer managed KMS key to use for EBS encryption.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "Throughput",
                                          "type": "integer",
                                          "description": "The throughput that the volume supports, in MiB/s.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "OutpostArn",
                                          "type": "string",
                                          "description": "The ARN of the Outpost on which the snapshot is stored.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "Encrypted",
                                          "type": "boolean",
                                          "description": "Indicates whether the encryption state of an EBS volume is changed while being restored from a backing snapshot. The effect of setting the encryption state to true depends on the volume origin (new or from a snapshot), starting encryption state, ownership, and whether encryption by default is enabled. For more information, see Amazon EBS encryption in the Amazon EBS User Guide.",
                                          "nested_items": [
                                            {
                                              "name": "new (empty) volume",
                                              "type": "empty",
                                              "description": "",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "existing encrypted or unencrypted snapshot",
                                              "type": "",
                                              "description": "",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "existing unencrypted volume",
                                              "type": "",
                                              "description": "",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "existing encrypted volume",
                                              "type": "",
                                              "description": "",
                                              "nested_items": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "name": "NoDevice",
                                      "type": "string",
                                      "description": "To omit the device from the block device mapping, specify an empty string. When this property is specified, the device is removed from the block device mapping regardless of the assigned value.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "DeviceName",
                                      "type": "string",
                                      "description": "The device name (for example, /dev/sdh or xvdh).",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "VirtualName",
                                      "type": "string",
                                      "description": "The virtual device name ( ephemeral``N). Instance store volumes are numbered starting from 0. An instance type with 2 available instance store volumes can specify mappings for ``ephemeral0 and ephemeral1. The number of available instance store volumes depends on the instance type. After you connect to the instance, you must mount the volume.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "EbsOptimized",
                              "type": "boolean",
                              "description": "Indicates whether the instances are optimized for EBS I/O. This optimization provides dedicated throughput to Amazon EBS and an optimized configuration stack to provide optimal EBS I/O performance. This optimization isn't available with all instance types. Additional usage charges apply when using an EBS Optimized instance.",
                              "nested_items": []
                            },
                            {
                              "name": "IamInstanceProfile",
                              "type": "dict",
                              "description": "The IAM instance profile.",
                              "nested_items": [
                                {
                                  "name": "Arn",
                                  "type": "string",
                                  "description": "The Amazon Resource Name (ARN) of the instance profile.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Name",
                                  "type": "string",
                                  "description": "The name of the instance profile.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "ImageId",
                              "type": "string",
                              "description": "The ID of the AMI.",
                              "nested_items": []
                            },
                            {
                              "name": "InstanceType",
                              "type": "string",
                              "description": "The instance type.",
                              "nested_items": []
                            },
                            {
                              "name": "KernelId",
                              "type": "string",
                              "description": "The ID of the kernel.",
                              "nested_items": []
                            },
                            {
                              "name": "KeyName",
                              "type": "string",
                              "description": "The name of the key pair.",
                              "nested_items": []
                            },
                            {
                              "name": "Monitoring",
                              "type": "dict",
                              "description": "Enable or disable monitoring for the instances.",
                              "nested_items": [
                                {
                                  "name": "Enabled",
                                  "type": "boolean",
                                  "description": "Enables monitoring for the instance.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "NetworkInterfaces",
                              "type": "list",
                              "description": "The network interfaces.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "AssociatePublicIpAddress",
                                      "type": "boolean",
                                      "description": "Indicates whether to assign a public IPv4 address to an instance you launch in a VPC. The public IP address can only be assigned to a network interface for eth0, and can only be assigned to a new network interface, not an existing one. You cannot specify more than one network interface in the request. If launching into a default subnet, the default value is true.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "DeleteOnTermination",
                                      "type": "boolean",
                                      "description": "If set to true, the interface is deleted when the instance is terminated. You can specify true only if creating a new network interface when launching an instance.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Description",
                                      "type": "string",
                                      "description": "The description of the network interface. Applies only if creating a network interface when launching an instance.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "DeviceIndex",
                                      "type": "integer",
                                      "description": "The position of the network interface in the attachment order. A primary network interface has a device index of 0.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Groups",
                                      "type": "list",
                                      "description": "The IDs of the security groups for the network interface. Applies only if creating a network interface when launching an instance.",
                                      "nested_items": [
                                        {
                                          "name": "",
                                          "type": "string",
                                          "description": "(string) ---",
                                          "nested_items": []
                                        }
                                      ]
                                    },
                                    {
                                      "name": "Ipv6AddressCount",
                                      "type": "integer",
                                      "description": "A number of IPv6 addresses to assign to the network interface. Amazon EC2 chooses the IPv6 addresses from the range of the subnet. You cannot specify this option and the option to assign specific IPv6 addresses in the same request. You can specify this option if you've specified a minimum number of instances to launch.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Ipv6Addresses",
                                      "type": "list",
                                      "description": "The IPv6 addresses to assign to the network interface. You cannot specify this option and the option to assign a number of IPv6 addresses in the same request. You cannot specify this option if you've specified a minimum number of instances to launch.",
                                      "nested_items": [
                                        {
                                          "name": "",
                                          "type": "dict",
                                          "description": "",
                                          "nested_items": [
                                            {
                                              "name": "Ipv6Address",
                                              "type": "string",
                                              "description": "The IPv6 address.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "IsPrimaryIpv6",
                                              "type": "boolean",
                                              "description": "Determines if an IPv6 address associated with a network interface is the primary IPv6 address. When you enable an IPv6 GUA address to be a primary IPv6, the first IPv6 GUA will be made the primary IPv6 address until the instance is terminated or the network interface is detached. For more information, see RunInstances.",
                                              "nested_items": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "name": "NetworkInterfaceId",
                                      "type": "string",
                                      "description": "The ID of the network interface.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "PrivateIpAddress",
                                      "type": "string",
                                      "description": "The private IPv4 address of the network interface. Applies only if creating a network interface when launching an instance. You cannot specify this option if you're launching more than one instance in a RunInstances request.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "PrivateIpAddresses",
                                      "type": "list",
                                      "description": "The private IPv4 addresses to assign to the network interface. Only one private IPv4 address can be designated as primary. You cannot specify this option if you're launching more than one instance in a RunInstances request.",
                                      "nested_items": [
                                        {
                                          "name": "",
                                          "type": "dict",
                                          "description": "",
                                          "nested_items": [
                                            {
                                              "name": "Primary",
                                              "type": "boolean",
                                              "description": "Indicates whether the private IPv4 address is the primary private IPv4 address. Only one IPv4 address can be designated as primary.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "PrivateIpAddress",
                                              "type": "string",
                                              "description": "The private IPv4 address.",
                                              "nested_items": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "name": "SecondaryPrivateIpAddressCount",
                                      "type": "integer",
                                      "description": "The number of secondary private IPv4 addresses. You can't specify this parameter and also specify a secondary private IP address using the PrivateIpAddress parameter.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "SubnetId",
                                      "type": "string",
                                      "description": "The ID of the subnet associated with the network interface. Applies only if creating a network interface when launching an instance.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "AssociateCarrierIpAddress",
                                      "type": "boolean",
                                      "description": "Indicates whether to assign a carrier IP address to the network interface.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "InterfaceType",
                                      "type": "string",
                                      "description": "The type of network interface.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "NetworkCardIndex",
                                      "type": "integer",
                                      "description": "The index of the network card. Some instance types support multiple network cards. The primary network interface must be assigned to network card index 0. The default is network card index 0.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Ipv4Prefixes",
                                      "type": "list",
                                      "description": "The IPv4 delegated prefixes to be assigned to the network interface. You cannot use this option if you use the Ipv4PrefixCount option.",
                                      "nested_items": [
                                        {
                                          "name": "",
                                          "type": "dict",
                                          "description": "",
                                          "nested_items": [
                                            {
                                              "name": "Ipv4Prefix",
                                              "type": "string",
                                              "description": "The IPv4 prefix. For information, see Assigning prefixes to network interfaces in the Amazon EC2 User Guide.",
                                              "nested_items": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "name": "Ipv4PrefixCount",
                                      "type": "integer",
                                      "description": "The number of IPv4 delegated prefixes to be automatically assigned to the network interface. You cannot use this option if you use the Ipv4Prefix option.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Ipv6Prefixes",
                                      "type": "list",
                                      "description": "The IPv6 delegated prefixes to be assigned to the network interface. You cannot use this option if you use the Ipv6PrefixCount option.",
                                      "nested_items": [
                                        {
                                          "name": "",
                                          "type": "dict",
                                          "description": "",
                                          "nested_items": [
                                            {
                                              "name": "Ipv6Prefix",
                                              "type": "string",
                                              "description": "The IPv6 prefix.",
                                              "nested_items": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "name": "Ipv6PrefixCount",
                                      "type": "integer",
                                      "description": "The number of IPv6 delegated prefixes to be automatically assigned to the network interface. You cannot use this option if you use the Ipv6Prefix option.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "PrimaryIpv6",
                                      "type": "boolean",
                                      "description": "The primary IPv6 address of the network interface. When you enable an IPv6 GUA address to be a primary IPv6, the first IPv6 GUA will be made the primary IPv6 address until the instance is terminated or the network interface is detached. For more information about primary IPv6 addresses, see RunInstances.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "EnaSrdSpecification",
                                      "type": "dict",
                                      "description": "Specifies the ENA Express settings for the network interface that's attached to the instance.",
                                      "nested_items": [
                                        {
                                          "name": "EnaSrdEnabled",
                                          "type": "boolean",
                                          "description": "Specifies whether ENA Express is enabled for the network interface when you launch an instance.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "EnaSrdUdpSpecification",
                                          "type": "dict",
                                          "description": "Contains ENA Express settings for UDP network traffic for the network interface attached to the instance.",
                                          "nested_items": [
                                            {
                                              "name": "EnaSrdUdpEnabled",
                                              "type": "boolean",
                                              "description": "Indicates whether UDP traffic uses ENA Express for your instance. To ensure that UDP traffic can use ENA Express when you launch an instance, you must also set EnaSrdEnabled in the EnaSrdSpecificationRequest to true.",
                                              "nested_items": []
                                            }
                                          ]
                                        }
                                      ]
                                    },
                                    {
                                      "name": "ConnectionTrackingSpecification",
                                      "type": "dict",
                                      "description": "A security group connection tracking specification that enables you to set the timeout for connection tracking on an Elastic network interface. For more information, see Connection tracking timeouts in the Amazon EC2 User Guide.",
                                      "nested_items": [
                                        {
                                          "name": "TcpEstablishedTimeout",
                                          "type": "integer",
                                          "description": "for idle TCP connections in an established state. Min: 60 seconds. Max: 432000 seconds (5 days). Default: 432000 seconds. Recommended: Less than 432000 seconds.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "UdpStreamTimeout",
                                          "type": "integer",
                                          "description": "for idle UDP flows classified as streams which have seen more than one request-response transaction. Min: 60 seconds. Max: 180 seconds (3 minutes). Default: 180 seconds.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "UdpTimeout",
                                          "type": "integer",
                                          "description": "for idle UDP flows that have seen traffic only in a single direction or a single request-response transaction. Min: 30 seconds. Max: 60 seconds. Default: 30 seconds.",
                                          "nested_items": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "Placement",
                              "type": "dict",
                              "description": "The placement information.",
                              "nested_items": [
                                {
                                  "name": "AvailabilityZone",
                                  "type": "string",
                                  "description": "The Availability Zone.",
                                  "nested_items": []
                                },
                                {
                                  "name": "GroupName",
                                  "type": "string",
                                  "description": "The name of the placement group.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Tenancy",
                                  "type": "string",
                                  "description": "The tenancy of the instance (if the instance is running in a VPC). An instance with a tenancy of dedicated runs on single-tenant hardware. The host tenancy is not supported for Spot Instances.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "RamdiskId",
                              "type": "string",
                              "description": "The ID of the RAM disk. Some kernels require additional drivers at launch. Check the kernel requirements for information about whether you need to specify a RAM disk. To find kernel requirements, refer to the Amazon Web Services Resource Center and search for the kernel ID.",
                              "nested_items": []
                            },
                            {
                              "name": "SpotPrice",
                              "type": "string",
                              "description": "The maximum price per unit hour that you are willing to pay for a Spot Instance. We do not recommend using this parameter because it can lead to increased interruptions. If you do not specify this parameter, you will pay the current Spot price.",
                              "nested_items": []
                            },
                            {
                              "name": "SubnetId",
                              "type": "string",
                              "description": "The IDs of the subnets in which to launch the instances. To specify multiple subnets, separate them using commas; for example, 'subnet-1234abcdeexample1, subnet-0987cdef6example2'.",
                              "nested_items": []
                            },
                            {
                              "name": "UserData",
                              "type": "string",
                              "description": "The base64-encoded user data that instances use when starting up. User data is limited to 16 KB.",
                              "nested_items": []
                            },
                            {
                              "name": "WeightedCapacity",
                              "type": "float",
                              "description": "The number of units provided by the specified instance type. These are the same units that you chose to set the target capacity in terms of instances, or a performance characteristic such as vCPUs, memory, or I/O.",
                              "nested_items": []
                            },
                            {
                              "name": "TagSpecifications",
                              "type": "list",
                              "description": "The tags to apply during creation.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "ResourceType",
                                      "type": "string",
                                      "description": "The type of resource. Currently, the only resource type that is supported is instance. To tag the Spot Fleet request on creation, use the TagSpecifications parameter in ``SpotFleetRequestConfigData ``.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Tags",
                                      "type": "list",
                                      "description": "The tags.",
                                      "nested_items": [
                                        {
                                          "name": "",
                                          "type": "dict",
                                          "description": "",
                                          "nested_items": [
                                            {
                                              "name": "Key",
                                              "type": "string",
                                              "description": "The key of the tag.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "Value",
                                              "type": "string",
                                              "description": "The value of the tag.",
                                              "nested_items": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "InstanceRequirements",
                              "type": "dict",
                              "description": "The attributes for the instance types. When you specify instance attributes, Amazon EC2 will identify instance types with those attributes.",
                              "nested_items": [
                                {
                                  "name": "VCpuCount",
                                  "type": "dict",
                                  "description": "The minimum and maximum number of vCPUs.",
                                  "nested_items": [
                                    {
                                      "name": "Min",
                                      "type": "integer",
                                      "description": "The minimum number of vCPUs. If the value is 0, there is no minimum limit.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Max",
                                      "type": "integer",
                                      "description": "The maximum number of vCPUs. If this parameter is not specified, there is no maximum limit.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "MemoryMiB",
                                  "type": "dict",
                                  "description": "The minimum and maximum amount of memory, in MiB.",
                                  "nested_items": [
                                    {
                                      "name": "Min",
                                      "type": "integer",
                                      "description": "The minimum amount of memory, in MiB. If this parameter is not specified, there is no minimum limit.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Max",
                                      "type": "integer",
                                      "description": "The maximum amount of memory, in MiB. If this parameter is not specified, there is no maximum limit.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "CpuManufacturers",
                                  "type": "list",
                                  "description": "The CPU manufacturers to include.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "For instance types with Intel CPUs, specify intel.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "For instance types with AMD CPUs, specify amd.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "For instance types with Amazon Web Services CPUs, specify amazon-web-services.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "For instance types with Apple CPUs, specify apple.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "MemoryGiBPerVCpu",
                                  "type": "dict",
                                  "description": "The minimum and maximum amount of memory per vCPU, in GiB.",
                                  "nested_items": [
                                    {
                                      "name": "Min",
                                      "type": "float",
                                      "description": "The minimum amount of memory per vCPU, in GiB. If this parameter is not specified, there is no minimum limit.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Max",
                                      "type": "float",
                                      "description": "The maximum amount of memory per vCPU, in GiB. If this parameter is not specified, there is no maximum limit.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "ExcludedInstanceTypes",
                                  "type": "list",
                                  "description": "The instance types to exclude.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "string",
                                      "description": "(string) ---",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "InstanceGenerations",
                                  "type": "list",
                                  "description": "Indicates whether current or previous generation instance types are included. The current generation instance types are recommended for use. Current generation instance types are typically the latest two to three generations in each instance family. For more information, see Instance types in the Amazon EC2 User Guide.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "string",
                                      "description": "(string) ---",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "SpotMaxPricePercentageOverLowestPrice",
                                  "type": "integer",
                                  "description": "[Price protection] The price protection threshold for Spot Instances, as a percentage higher than an identified Spot price. The identified Spot price is the Spot price of the lowest priced current generation C, M, or R instance type with your specified attributes. If no current generation C, M, or R instance type matches your attributes, then the identified Spot price is from the lowest priced current generation instance types, and failing that, from the lowest priced previous generation instance types that match your attributes. When Amazon EC2 selects instance types with your attributes, it will exclude instance types whose Spot price exceeds your specified threshold.",
                                  "nested_items": []
                                },
                                {
                                  "name": "OnDemandMaxPricePercentageOverLowestPrice",
                                  "type": "integer",
                                  "description": "[Price protection] The price protection threshold for On-Demand Instances, as a percentage higher than an identified On-Demand price. The identified On-Demand price is the price of the lowest priced current generation C, M, or R instance type with your specified attributes. When Amazon EC2 selects instance types with your attributes, it will exclude instance types whose price exceeds your specified threshold.",
                                  "nested_items": []
                                },
                                {
                                  "name": "BareMetal",
                                  "type": "string",
                                  "description": "Indicates whether bare metal instance types must be included, excluded, or required.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "To include bare metal instance types, specify included.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "To require only bare metal instance types, specify required.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "To exclude bare metal instance types, specify excluded.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "BurstablePerformance",
                                  "type": "string",
                                  "description": "Indicates whether burstable performance T instance types are included, excluded, or required. For more information, see Burstable performance instances.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "To include burstable performance instance types, specify included.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "To require only burstable performance instance types, specify required.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "To exclude burstable performance instance types, specify excluded.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "RequireHibernateSupport",
                                  "type": "boolean",
                                  "description": "Indicates whether instance types must support hibernation for On-Demand Instances.",
                                  "nested_items": []
                                },
                                {
                                  "name": "NetworkInterfaceCount",
                                  "type": "dict",
                                  "description": "The minimum and maximum number of network interfaces.",
                                  "nested_items": [
                                    {
                                      "name": "Min",
                                      "type": "integer",
                                      "description": "The minimum number of network interfaces. If this parameter is not specified, there is no minimum limit.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Max",
                                      "type": "integer",
                                      "description": "The maximum number of network interfaces. If this parameter is not specified, there is no maximum limit.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "LocalStorage",
                                  "type": "string",
                                  "description": "Indicates whether instance types with instance store volumes are included, excluded, or required. For more information, Amazon EC2 instance store in the Amazon EC2 User Guide.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "To include instance types with instance store volumes, specify included.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "To require only instance types with instance store volumes, specify required.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "To exclude instance types with instance store volumes, specify excluded.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "LocalStorageTypes",
                                  "type": "list",
                                  "description": "The type of local storage that is required.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "HDD",
                                      "description": "For instance types with hard disk drive (HDD) storage, specify hdd.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "SSD",
                                      "description": "For instance types with solid state drive (SSD) storage, specify ssd.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "TotalLocalStorageGB",
                                  "type": "dict",
                                  "description": "The minimum and maximum amount of total local storage, in GB.",
                                  "nested_items": [
                                    {
                                      "name": "Min",
                                      "type": "float",
                                      "description": "The minimum amount of total local storage, in GB. If this parameter is not specified, there is no minimum limit.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Max",
                                      "type": "float",
                                      "description": "The maximum amount of total local storage, in GB. If this parameter is not specified, there is no maximum limit.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "BaselineEbsBandwidthMbps",
                                  "type": "dict",
                                  "description": "The minimum and maximum baseline bandwidth to Amazon EBS, in Mbps. For more information, see Amazon EBS---optimized instances in the Amazon EC2 User Guide.",
                                  "nested_items": [
                                    {
                                      "name": "Min",
                                      "type": "integer",
                                      "description": "The minimum baseline bandwidth, in Mbps. If this parameter is not specified, there is no minimum limit.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Max",
                                      "type": "integer",
                                      "description": "The maximum baseline bandwidth, in Mbps. If this parameter is not specified, there is no maximum limit.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "AcceleratorTypes",
                                  "type": "list",
                                  "description": "The accelerator types that must be on the instance type.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "For instance types with FPGA accelerators, specify fpga.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "For instance types with GPU accelerators, specify gpu.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "For instance types with Inference accelerators, specify inference.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "AcceleratorCount",
                                  "type": "dict",
                                  "description": "The minimum and maximum number of accelerators (GPUs, FPGAs, or Amazon Web Services Inferentia chips) on an instance.",
                                  "nested_items": [
                                    {
                                      "name": "Min",
                                      "type": "integer",
                                      "description": "The minimum number of accelerators. If this parameter is not specified, there is no minimum limit.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Max",
                                      "type": "integer",
                                      "description": "The maximum number of accelerators. If this parameter is not specified, there is no maximum limit.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "AcceleratorManufacturers",
                                  "type": "list",
                                  "description": "Indicates whether instance types must have accelerators by specific manufacturers.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "For instance types with Amazon Web Services devices, specify amazon-web-services.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "For instance types with AMD devices, specify amd.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "For instance types with Habana devices, specify habana.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "For instance types with NVIDIA devices, specify nvidia.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "For instance types with Xilinx devices, specify xilinx.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "AcceleratorNames",
                                  "type": "list",
                                  "description": "The accelerators that must be on the instance type.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "For instance types with NVIDIA A10G GPUs, specify a10g.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "For instance types with NVIDIA A100 GPUs, specify a100.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "For instance types with NVIDIA H100 GPUs, specify h100.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "For instance types with Amazon Web Services Inferentia chips, specify inferentia.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "For instance types with NVIDIA GRID K520 GPUs, specify k520.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "For instance types with NVIDIA K80 GPUs, specify k80.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "For instance types with NVIDIA M60 GPUs, specify m60.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "For instance types with AMD Radeon Pro V520 GPUs, specify radeon-pro-v520.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "For instance types with NVIDIA T4 GPUs, specify t4.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "For instance types with NVIDIA T4G GPUs, specify t4g.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "For instance types with Xilinx VU9P FPGAs, specify vu9p.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "For instance types with NVIDIA V100 GPUs, specify v100.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "AcceleratorTotalMemoryMiB",
                                  "type": "dict",
                                  "description": "The minimum and maximum amount of total accelerator memory, in MiB.",
                                  "nested_items": [
                                    {
                                      "name": "Min",
                                      "type": "integer",
                                      "description": "The minimum amount of accelerator memory, in MiB. If this parameter is not specified, there is no minimum limit.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Max",
                                      "type": "integer",
                                      "description": "The maximum amount of accelerator memory, in MiB. If this parameter is not specified, there is no maximum limit.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "NetworkBandwidthGbps",
                                  "type": "dict",
                                  "description": "The minimum and maximum amount of network bandwidth, in gigabits per second (Gbps).",
                                  "nested_items": [
                                    {
                                      "name": "Min",
                                      "type": "float",
                                      "description": "The minimum amount of network bandwidth, in Gbps. If this parameter is not specified, there is no minimum limit.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Max",
                                      "type": "float",
                                      "description": "The maximum amount of network bandwidth, in Gbps. If this parameter is not specified, there is no maximum limit.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "AllowedInstanceTypes",
                                  "type": "list",
                                  "description": "The instance types to apply your specified attributes against. All other instance types are ignored, even if they match your specified attributes.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "string",
                                      "description": "(string) ---",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "MaxSpotPriceAsPercentageOfOptimalOnDemandPrice",
                                  "type": "integer",
                                  "description": "[Price protection] The price protection threshold for Spot Instances, as a percentage of an identified On-Demand price. The identified On-Demand price is the price of the lowest priced current generation C, M, or R instance type with your specified attributes. If no current generation C, M, or R instance type matches your attributes, then the identified price is from the lowest priced current generation instance types, and failing that, from the lowest priced previous generation instance types that match your attributes. When Amazon EC2 selects instance types with your attributes, it will exclude instance types whose price exceeds your specified threshold.",
                                  "nested_items": []
                                },
                                {
                                  "name": "BaselinePerformanceFactors",
                                  "type": "dict",
                                  "description": "The baseline performance to consider, using an instance family as a baseline reference. The instance family establishes the lowest acceptable level of performance. Amazon EC2 uses this baseline to guide instance type selection, but there is no guarantee that the selected instance types will always exceed the baseline for every application. Currently, this parameter only supports CPU performance as a baseline performance factor. For more information, see Performance protection in the Amazon EC2 User Guide.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "dict",
                                      "description": "",
                                      "nested_items": [
                                        {
                                          "name": "References",
                                          "type": "list",
                                          "description": "Specify an instance family to use as the baseline reference for CPU performance. All instance types that match your specified attributes will be compared against the CPU performance of the referenced instance family, regardless of CPU manufacturer or architecture differences.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "dict",
                                              "description": "",
                                              "nested_items": [
                                                {
                                                  "name": "InstanceFamily",
                                                  "type": "string",
                                                  "description": "The instance family to use as a baseline reference.",
                                                  "nested_items": [
                                                    {
                                                      "name": "",
                                                      "type": "",
                                                      "description": "c1",
                                                      "nested_items": []
                                                    },
                                                    {
                                                      "name": "",
                                                      "type": "",
                                                      "description": "g3 | g3s.",
                                                      "nested_items": []
                                                    },
                                                    {
                                                      "name": "",
                                                      "type": "",
                                                      "description": "hpc7g.",
                                                      "nested_items": []
                                                    },
                                                    {
                                                      "name": "",
                                                      "type": "",
                                                      "description": "m1 | m2",
                                                      "nested_items": []
                                                    },
                                                    {
                                                      "name": "",
                                                      "type": "",
                                                      "description": "mac1 | mac2 | mac2-m1ultra | mac2-m2 | mac2-m2pro.",
                                                      "nested_items": []
                                                    },
                                                    {
                                                      "name": "",
                                                      "type": "",
                                                      "description": "p3dn | p4d | p5",
                                                      "nested_items": []
                                                    },
                                                    {
                                                      "name": "",
                                                      "type": "",
                                                      "description": "t1",
                                                      "nested_items": []
                                                    },
                                                    {
                                                      "name": "",
                                                      "type": "",
                                                      "description": "u-12tb1 | u-18tb1 | u-24tb1 | u-3tb1 | u-6tb1 | u-9tb1 | u7i-12tb | u7in-16tb | u7in-24tb | u7in-32tb.",
                                                      "nested_items": []
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "SecurityGroups",
                              "type": "list",
                              "description": "The security groups.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "GroupId",
                                      "type": "string",
                                      "description": "The ID of the security group.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "GroupName",
                                      "type": "string",
                                      "description": "The name of the security group.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "LaunchTemplateConfigs",
                      "type": "list",
                      "description": "The launch template and overrides. If you specify LaunchTemplateConfigs, you can't specify LaunchSpecifications. If you include On-Demand capacity in your request, you must use LaunchTemplateConfigs.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "LaunchTemplateSpecification",
                              "type": "dict",
                              "description": "The launch template to use. Make sure that the launch template does not contain the NetworkInterfaceId parameter because you can't specify a network interface ID in a Spot Fleet.",
                              "nested_items": [
                                {
                                  "name": "LaunchTemplateId",
                                  "type": "string",
                                  "description": "The ID of the launch template.",
                                  "nested_items": []
                                },
                                {
                                  "name": "LaunchTemplateName",
                                  "type": "string",
                                  "description": "The name of the launch template.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Version",
                                  "type": "string",
                                  "description": "The launch template version number, $Latest, or $Default. You must specify a value, otherwise the request fails.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "Overrides",
                              "type": "list",
                              "description": "Any parameters that you specify override the same parameters in the launch template.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "InstanceType",
                                      "type": "string",
                                      "description": "The instance type.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "SpotPrice",
                                      "type": "string",
                                      "description": "The maximum price per unit hour that you are willing to pay for a Spot Instance. We do not recommend using this parameter because it can lead to increased interruptions. If you do not specify this parameter, you will pay the current Spot price.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "SubnetId",
                                      "type": "string",
                                      "description": "The ID of the subnet in which to launch the instances.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "AvailabilityZone",
                                      "type": "string",
                                      "description": "The Availability Zone in which to launch the instances.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "WeightedCapacity",
                                      "type": "float",
                                      "description": "The number of units provided by the specified instance type. These are the same units that you chose to set the target capacity in terms of instances, or a performance characteristic such as vCPUs, memory, or I/O.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Priority",
                                      "type": "float",
                                      "description": "The priority for the launch template override. The highest priority is launched first.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "InstanceRequirements",
                                      "type": "dict",
                                      "description": "The instance requirements. When you specify instance requirements, Amazon EC2 will identify instance types with the provided requirements, and then use your On-Demand and Spot allocation strategies to launch instances from these instance types, in the same way as when you specify a list of instance types.",
                                      "nested_items": [
                                        {
                                          "name": "VCpuCount",
                                          "type": "dict",
                                          "description": "The minimum and maximum number of vCPUs.",
                                          "nested_items": [
                                            {
                                              "name": "Min",
                                              "type": "integer",
                                              "description": "The minimum number of vCPUs. If the value is 0, there is no minimum limit.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "Max",
                                              "type": "integer",
                                              "description": "The maximum number of vCPUs. If this parameter is not specified, there is no maximum limit.",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "MemoryMiB",
                                          "type": "dict",
                                          "description": "The minimum and maximum amount of memory, in MiB.",
                                          "nested_items": [
                                            {
                                              "name": "Min",
                                              "type": "integer",
                                              "description": "The minimum amount of memory, in MiB. If this parameter is not specified, there is no minimum limit.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "Max",
                                              "type": "integer",
                                              "description": "The maximum amount of memory, in MiB. If this parameter is not specified, there is no maximum limit.",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "CpuManufacturers",
                                          "type": "list",
                                          "description": "The CPU manufacturers to include.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "For instance types with Intel CPUs, specify intel.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "For instance types with AMD CPUs, specify amd.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "For instance types with Amazon Web Services CPUs, specify amazon-web-services.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "For instance types with Apple CPUs, specify apple.",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "MemoryGiBPerVCpu",
                                          "type": "dict",
                                          "description": "The minimum and maximum amount of memory per vCPU, in GiB.",
                                          "nested_items": [
                                            {
                                              "name": "Min",
                                              "type": "float",
                                              "description": "The minimum amount of memory per vCPU, in GiB. If this parameter is not specified, there is no minimum limit.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "Max",
                                              "type": "float",
                                              "description": "The maximum amount of memory per vCPU, in GiB. If this parameter is not specified, there is no maximum limit.",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "ExcludedInstanceTypes",
                                          "type": "list",
                                          "description": "The instance types to exclude.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "string",
                                              "description": "(string) ---",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "InstanceGenerations",
                                          "type": "list",
                                          "description": "Indicates whether current or previous generation instance types are included. The current generation instance types are recommended for use. Current generation instance types are typically the latest two to three generations in each instance family. For more information, see Instance types in the Amazon EC2 User Guide.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "string",
                                              "description": "(string) ---",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "SpotMaxPricePercentageOverLowestPrice",
                                          "type": "integer",
                                          "description": "[Price protection] The price protection threshold for Spot Instances, as a percentage higher than an identified Spot price. The identified Spot price is the Spot price of the lowest priced current generation C, M, or R instance type with your specified attributes. If no current generation C, M, or R instance type matches your attributes, then the identified Spot price is from the lowest priced current generation instance types, and failing that, from the lowest priced previous generation instance types that match your attributes. When Amazon EC2 selects instance types with your attributes, it will exclude instance types whose Spot price exceeds your specified threshold.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "OnDemandMaxPricePercentageOverLowestPrice",
                                          "type": "integer",
                                          "description": "[Price protection] The price protection threshold for On-Demand Instances, as a percentage higher than an identified On-Demand price. The identified On-Demand price is the price of the lowest priced current generation C, M, or R instance type with your specified attributes. When Amazon EC2 selects instance types with your attributes, it will exclude instance types whose price exceeds your specified threshold.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "BareMetal",
                                          "type": "string",
                                          "description": "Indicates whether bare metal instance types must be included, excluded, or required.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "To include bare metal instance types, specify included.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "To require only bare metal instance types, specify required.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "To exclude bare metal instance types, specify excluded.",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "BurstablePerformance",
                                          "type": "string",
                                          "description": "Indicates whether burstable performance T instance types are included, excluded, or required. For more information, see Burstable performance instances.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "To include burstable performance instance types, specify included.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "To require only burstable performance instance types, specify required.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "To exclude burstable performance instance types, specify excluded.",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "RequireHibernateSupport",
                                          "type": "boolean",
                                          "description": "Indicates whether instance types must support hibernation for On-Demand Instances.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "NetworkInterfaceCount",
                                          "type": "dict",
                                          "description": "The minimum and maximum number of network interfaces.",
                                          "nested_items": [
                                            {
                                              "name": "Min",
                                              "type": "integer",
                                              "description": "The minimum number of network interfaces. If this parameter is not specified, there is no minimum limit.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "Max",
                                              "type": "integer",
                                              "description": "The maximum number of network interfaces. If this parameter is not specified, there is no maximum limit.",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "LocalStorage",
                                          "type": "string",
                                          "description": "Indicates whether instance types with instance store volumes are included, excluded, or required. For more information, Amazon EC2 instance store in the Amazon EC2 User Guide.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "To include instance types with instance store volumes, specify included.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "To require only instance types with instance store volumes, specify required.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "To exclude instance types with instance store volumes, specify excluded.",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "LocalStorageTypes",
                                          "type": "list",
                                          "description": "The type of local storage that is required.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "HDD",
                                              "description": "For instance types with hard disk drive (HDD) storage, specify hdd.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "SSD",
                                              "description": "For instance types with solid state drive (SSD) storage, specify ssd.",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "TotalLocalStorageGB",
                                          "type": "dict",
                                          "description": "The minimum and maximum amount of total local storage, in GB.",
                                          "nested_items": [
                                            {
                                              "name": "Min",
                                              "type": "float",
                                              "description": "The minimum amount of total local storage, in GB. If this parameter is not specified, there is no minimum limit.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "Max",
                                              "type": "float",
                                              "description": "The maximum amount of total local storage, in GB. If this parameter is not specified, there is no maximum limit.",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "BaselineEbsBandwidthMbps",
                                          "type": "dict",
                                          "description": "The minimum and maximum baseline bandwidth to Amazon EBS, in Mbps. For more information, see Amazon EBS---optimized instances in the Amazon EC2 User Guide.",
                                          "nested_items": [
                                            {
                                              "name": "Min",
                                              "type": "integer",
                                              "description": "The minimum baseline bandwidth, in Mbps. If this parameter is not specified, there is no minimum limit.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "Max",
                                              "type": "integer",
                                              "description": "The maximum baseline bandwidth, in Mbps. If this parameter is not specified, there is no maximum limit.",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "AcceleratorTypes",
                                          "type": "list",
                                          "description": "The accelerator types that must be on the instance type.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "For instance types with FPGA accelerators, specify fpga.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "For instance types with GPU accelerators, specify gpu.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "For instance types with Inference accelerators, specify inference.",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "AcceleratorCount",
                                          "type": "dict",
                                          "description": "The minimum and maximum number of accelerators (GPUs, FPGAs, or Amazon Web Services Inferentia chips) on an instance.",
                                          "nested_items": [
                                            {
                                              "name": "Min",
                                              "type": "integer",
                                              "description": "The minimum number of accelerators. If this parameter is not specified, there is no minimum limit.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "Max",
                                              "type": "integer",
                                              "description": "The maximum number of accelerators. If this parameter is not specified, there is no maximum limit.",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "AcceleratorManufacturers",
                                          "type": "list",
                                          "description": "Indicates whether instance types must have accelerators by specific manufacturers.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "For instance types with Amazon Web Services devices, specify amazon-web-services.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "For instance types with AMD devices, specify amd.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "For instance types with Habana devices, specify habana.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "For instance types with NVIDIA devices, specify nvidia.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "For instance types with Xilinx devices, specify xilinx.",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "AcceleratorNames",
                                          "type": "list",
                                          "description": "The accelerators that must be on the instance type.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "For instance types with NVIDIA A10G GPUs, specify a10g.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "For instance types with NVIDIA A100 GPUs, specify a100.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "For instance types with NVIDIA H100 GPUs, specify h100.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "For instance types with Amazon Web Services Inferentia chips, specify inferentia.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "For instance types with NVIDIA GRID K520 GPUs, specify k520.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "For instance types with NVIDIA K80 GPUs, specify k80.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "For instance types with NVIDIA M60 GPUs, specify m60.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "For instance types with AMD Radeon Pro V520 GPUs, specify radeon-pro-v520.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "For instance types with NVIDIA T4 GPUs, specify t4.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "For instance types with NVIDIA T4G GPUs, specify t4g.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "For instance types with Xilinx VU9P FPGAs, specify vu9p.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "",
                                              "type": "",
                                              "description": "For instance types with NVIDIA V100 GPUs, specify v100.",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "AcceleratorTotalMemoryMiB",
                                          "type": "dict",
                                          "description": "The minimum and maximum amount of total accelerator memory, in MiB.",
                                          "nested_items": [
                                            {
                                              "name": "Min",
                                              "type": "integer",
                                              "description": "The minimum amount of accelerator memory, in MiB. If this parameter is not specified, there is no minimum limit.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "Max",
                                              "type": "integer",
                                              "description": "The maximum amount of accelerator memory, in MiB. If this parameter is not specified, there is no maximum limit.",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "NetworkBandwidthGbps",
                                          "type": "dict",
                                          "description": "The minimum and maximum amount of network bandwidth, in gigabits per second (Gbps).",
                                          "nested_items": [
                                            {
                                              "name": "Min",
                                              "type": "float",
                                              "description": "The minimum amount of network bandwidth, in Gbps. If this parameter is not specified, there is no minimum limit.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "Max",
                                              "type": "float",
                                              "description": "The maximum amount of network bandwidth, in Gbps. If this parameter is not specified, there is no maximum limit.",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "AllowedInstanceTypes",
                                          "type": "list",
                                          "description": "The instance types to apply your specified attributes against. All other instance types are ignored, even if they match your specified attributes.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "string",
                                              "description": "(string) ---",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "MaxSpotPriceAsPercentageOfOptimalOnDemandPrice",
                                          "type": "integer",
                                          "description": "[Price protection] The price protection threshold for Spot Instances, as a percentage of an identified On-Demand price. The identified On-Demand price is the price of the lowest priced current generation C, M, or R instance type with your specified attributes. If no current generation C, M, or R instance type matches your attributes, then the identified price is from the lowest priced current generation instance types, and failing that, from the lowest priced previous generation instance types that match your attributes. When Amazon EC2 selects instance types with your attributes, it will exclude instance types whose price exceeds your specified threshold.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "BaselinePerformanceFactors",
                                          "type": "dict",
                                          "description": "The baseline performance to consider, using an instance family as a baseline reference. The instance family establishes the lowest acceptable level of performance. Amazon EC2 uses this baseline to guide instance type selection, but there is no guarantee that the selected instance types will always exceed the baseline for every application. Currently, this parameter only supports CPU performance as a baseline performance factor. For more information, see Performance protection in the Amazon EC2 User Guide.",
                                          "nested_items": [
                                            {
                                              "name": "",
                                              "type": "dict",
                                              "description": "",
                                              "nested_items": [
                                                {
                                                  "name": "References",
                                                  "type": "list",
                                                  "description": "Specify an instance family to use as the baseline reference for CPU performance. All instance types that match your specified attributes will be compared against the CPU performance of the referenced instance family, regardless of CPU manufacturer or architecture differences.",
                                                  "nested_items": [
                                                    {
                                                      "name": "",
                                                      "type": "dict",
                                                      "description": "",
                                                      "nested_items": [
                                                        {
                                                          "name": "InstanceFamily",
                                                          "type": "string",
                                                          "description": "The instance family to use as a baseline reference.",
                                                          "nested_items": [
                                                            {
                                                              "name": "",
                                                              "type": "",
                                                              "description": "c1",
                                                              "nested_items": []
                                                            },
                                                            {
                                                              "name": "",
                                                              "type": "",
                                                              "description": "g3 | g3s.",
                                                              "nested_items": []
                                                            },
                                                            {
                                                              "name": "",
                                                              "type": "",
                                                              "description": "hpc7g.",
                                                              "nested_items": []
                                                            },
                                                            {
                                                              "name": "",
                                                              "type": "",
                                                              "description": "m1 | m2",
                                                              "nested_items": []
                                                            },
                                                            {
                                                              "name": "",
                                                              "type": "",
                                                              "description": "mac1 | mac2 | mac2-m1ultra | mac2-m2 | mac2-m2pro.",
                                                              "nested_items": []
                                                            },
                                                            {
                                                              "name": "",
                                                              "type": "",
                                                              "description": "p3dn | p4d | p5",
                                                              "nested_items": []
                                                            },
                                                            {
                                                              "name": "",
                                                              "type": "",
                                                              "description": "t1",
                                                              "nested_items": []
                                                            },
                                                            {
                                                              "name": "",
                                                              "type": "",
                                                              "description": "u-12tb1 | u-18tb1 | u-24tb1 | u-3tb1 | u-6tb1 | u-9tb1 | u7i-12tb | u7in-16tb | u7in-24tb | u7in-32tb.",
                                                              "nested_items": []
                                                            }
                                                          ]
                                                        }
                                                      ]
                                                    }
                                                  ]
                                                }
                                              ]
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "SpotPrice",
                      "type": "string",
                      "description": "The maximum price per unit hour that you are willing to pay for a Spot Instance. We do not recommend using this parameter because it can lead to increased interruptions. If you do not specify this parameter, you will pay the current Spot price.",
                      "nested_items": []
                    },
                    {
                      "name": "TargetCapacity",
                      "type": "integer",
                      "description": "The number of units to request for the Spot Fleet. You can choose to set the target capacity in terms of instances or a performance characteristic that is important to your application workload, such as vCPUs, memory, or I/O. If the request type is maintain, you can specify a target capacity of 0 and add capacity later.",
                      "nested_items": []
                    },
                    {
                      "name": "OnDemandTargetCapacity",
                      "type": "integer",
                      "description": "The number of On-Demand units to request. You can choose to set the target capacity in terms of instances or a performance characteristic that is important to your application workload, such as vCPUs, memory, or I/O. If the request type is maintain, you can specify a target capacity of 0 and add capacity later.",
                      "nested_items": []
                    },
                    {
                      "name": "OnDemandMaxTotalPrice",
                      "type": "string",
                      "description": "The maximum amount per hour for On-Demand Instances that you're willing to pay. You can use the onDemandMaxTotalPrice parameter, the spotMaxTotalPrice parameter, or both parameters to ensure that your fleet cost does not exceed your budget. If you set a maximum price per hour for the On-Demand Instances and Spot Instances in your request, Spot Fleet will launch instances until it reaches the maximum amount you're willing to pay. When the maximum amount you're willing to pay is reached, the fleet stops launching instances even if it hasn't met the target capacity.",
                      "nested_items": []
                    },
                    {
                      "name": "SpotMaxTotalPrice",
                      "type": "string",
                      "description": "The maximum amount per hour for Spot Instances that you're willing to pay. You can use the spotMaxTotalPrice parameter, the onDemandMaxTotalPrice parameter, or both parameters to ensure that your fleet cost does not exceed your budget. If you set a maximum price per hour for the On-Demand Instances and Spot Instances in your request, Spot Fleet will launch instances until it reaches the maximum amount you're willing to pay. When the maximum amount you're willing to pay is reached, the fleet stops launching instances even if it hasn't met the target capacity.",
                      "nested_items": []
                    },
                    {
                      "name": "TerminateInstancesWithExpiration",
                      "type": "boolean",
                      "description": "Indicates whether running Spot Instances are terminated when the Spot Fleet request expires.",
                      "nested_items": []
                    },
                    {
                      "name": "Type",
                      "type": "string",
                      "description": "The type of request. Indicates whether the Spot Fleet only requests the target capacity or also attempts to maintain it. When this value is request, the Spot Fleet only places the required requests. It does not attempt to replenish Spot Instances if capacity is diminished, nor does it submit requests in alternative Spot pools if capacity is not available. When this value is maintain, the Spot Fleet maintains the target capacity. The Spot Fleet places the required requests to meet capacity and automatically replenishes any interrupted instances. Default: maintain. instant is listed but is not used by Spot Fleet.",
                      "nested_items": []
                    },
                    {
                      "name": "ValidFrom",
                      "type": "datetime",
                      "description": "The start date and time of the request, in UTC format (YYYY-MM-DD*T*HH:MM:*SS*Z). By default, Amazon EC2 starts fulfilling the request immediately.",
                      "nested_items": []
                    },
                    {
                      "name": "ValidUntil",
                      "type": "datetime",
                      "description": "The end date and time of the request, in UTC format (YYYY-MM-DD*T*HH:MM:*SS*Z). After the end date and time, no new Spot Instance requests are placed or able to fulfill the request. If no value is specified, the Spot Fleet request remains until you cancel it.",
                      "nested_items": []
                    },
                    {
                      "name": "ReplaceUnhealthyInstances",
                      "type": "boolean",
                      "description": "Indicates whether Spot Fleet should replace unhealthy instances.",
                      "nested_items": []
                    },
                    {
                      "name": "InstanceInterruptionBehavior",
                      "type": "string",
                      "description": "The behavior when a Spot Instance is interrupted. The default is terminate.",
                      "nested_items": []
                    },
                    {
                      "name": "LoadBalancersConfig",
                      "type": "dict",
                      "description": "One or more Classic Load Balancers and target groups to attach to the Spot Fleet request. Spot Fleet registers the running Spot Instances with the specified Classic Load Balancers and target groups.",
                      "nested_items": [
                        {
                          "name": "ClassicLoadBalancersConfig",
                          "type": "dict",
                          "description": "The Classic Load Balancers.",
                          "nested_items": [
                            {
                              "name": "ClassicLoadBalancers",
                              "type": "list",
                              "description": "One or more Classic Load Balancers.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "Name",
                                      "type": "string",
                                      "description": "The name of the load balancer.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "name": "TargetGroupsConfig",
                          "type": "dict",
                          "description": "The target groups.",
                          "nested_items": [
                            {
                              "name": "TargetGroups",
                              "type": "list",
                              "description": "One or more target groups.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "Arn",
                                      "type": "string",
                                      "description": "The Amazon Resource Name (ARN) of the target group.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "InstancePoolsToUseCount",
                      "type": "integer",
                      "description": "The number of Spot pools across which to allocate your target Spot capacity. Valid only when Spot AllocationStrategy is set to lowest-price. Spot Fleet selects the cheapest Spot pools and evenly allocates your target Spot capacity across the number of Spot pools that you specify.",
                      "nested_items": []
                    },
                    {
                      "name": "Context",
                      "type": "string",
                      "description": "Reserved.",
                      "nested_items": []
                    },
                    {
                      "name": "TargetCapacityUnitType",
                      "type": "string",
                      "description": "The unit for the target capacity. You can specify this parameter only when using attribute-based instance type selection.",
                      "nested_items": []
                    },
                    {
                      "name": "TagSpecifications",
                      "type": "list",
                      "description": "The key-value pair for tagging the Spot Fleet request on creation. The value for ResourceType must be spot-fleet-request, otherwise the Spot Fleet request fails. To tag instances at launch, specify the tags in the launch template (valid only if you use LaunchTemplateConfigs) or in the SpotFleetTagSpecification (valid only if you use LaunchSpecifications). For information about tagging after launch, see Tag your resources.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "ResourceType",
                              "type": "string",
                              "description": "The type of resource to tag on creation.",
                              "nested_items": []
                            },
                            {
                              "name": "Tags",
                              "type": "list",
                              "description": "The tags to apply to the resource.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "Key",
                                      "type": "string",
                                      "description": "The key of the tag.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Value",
                                      "type": "string",
                                      "description": "The value of the tag.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "SpotFleetRequestId",
                  "type": "string",
                  "description": "The ID of the Spot Fleet request.",
                  "nested_items": []
                },
                {
                  "name": "SpotFleetRequestState",
                  "type": "string",
                  "description": "The state of the Spot Fleet request.",
                  "nested_items": []
                },
                {
                  "name": "Tags",
                  "type": "list",
                  "description": "The tags for a Spot Fleet resource.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Key",
                          "type": "string",
                          "description": "The key of the tag.",
                          "nested_items": []
                        },
                        {
                          "name": "Value",
                          "type": "string",
                          "description": "The value of the tag.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}