{
  "method_name": "describe_spot_instance_requests",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/describe_spot_instance_requests.html",
  "description": "Describes the specified Spot Instance requests. You can use DescribeSpotInstanceRequests to find a running Spot Instance by examining the response. If the status of the Spot Instance is fulfilled, the instance ID appears in the response and contains the identifier of the instance. Alternatively, you can use DescribeInstances with a filter to look for instances where the instance lifecycle is spot. We recommend that you set MaxResults to a value between 5 and 1000 to limit the number of items returned. This paginates the output, which makes the list more manageable and returns the items faster. If the list of items exceeds your MaxResults value, then that number of items is returned along with a NextToken value that can be passed to a subsequent DescribeSpotInstanceRequests request to retrieve the remaining items. Spot Instance requests are deleted four hours after they are canceled and their instances are terminated.",
  "parameters": [
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "SpotInstanceRequestIds",
      "type": "list",
      "required": false,
      "description": "The IDs of the Spot Instance requests. (string) ---",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": false,
      "description": "The filters. availability-zone-group - The Availability Zone group. create-time - The time stamp when the Spot Instance request was created. fault-code - The fault code related to the request. fault-message - The fault message related to the request. instance-id - The ID of the instance that fulfilled the request. launch-group - The Spot Instance launch group. launch.block-device-mapping.delete-on-termination - Indicates whether the EBS volume is deleted on instance termination. launch.block-device-mapping.device-name - The device name for the volume in the block device mapping (for example, /dev/sdh or xvdh). launch.block-device-mapping.snapshot-id - The ID of the snapshot for the EBS volume. launch.block-device-mapping.volume-size - The size of the EBS volume, in GiB. launch.block-device-mapping.volume-type - The type of EBS volume: gp2 or gp3 for General Purpose SSD, io1 or io2 for Provisioned IOPS SSD, st1 for Throughput Optimized HDD, sc1 for Cold HDD, or standard for Magnetic. launch.group-id - The ID of the security group for the instance. launch.group-name - The name of the security group for the instance. launch.image-id - The ID of the AMI. launch.instance-type - The type of instance (for example, m3.medium). launch.kernel-id - The kernel ID. launch.key-name - The name of the key pair the instance launched with. launch.monitoring-enabled - Whether detailed monitoring is enabled for the Spot Instance. launch.ramdisk-id - The RAM disk ID. launched-availability-zone - The Availability Zone in which the request is launched. network-interface.addresses.primary - Indicates whether the IP address is the primary private IP address. network-interface.delete-on-termination - Indicates whether the network interface is deleted when the instance is terminated. network-interface.description - A description of the network interface. network-interface.device-index - The index of the device for the network interface attachment on the instance. network-interface.group-id - The ID of the security group associated with the network interface. network-interface.network-interface-id - The ID of the network interface. network-interface.private-ip-address - The primary private IP address of the network interface. network-interface.subnet-id - The ID of the subnet for the instance. product-description - The product description associated with the instance ( Linux/UNIX | Windows). spot-instance-request-id - The Spot Instance request ID. spot-price - The maximum hourly price for any Spot Instance launched to fulfill the request. state - The state of the Spot Instance request ( open | active | closed | cancelled | failed). Spot request status information can help you track your Amazon EC2 Spot Instance requests. For more information, see Spot request status in the Amazon EC2 User Guide. status-code - The short code describing the most recent evaluation of your Spot Instance request. status-message - The message explaining the status of the Spot Instance request. tag:<key> - The key/value combination of a tag assigned to the resource. Use the tag key in the filter name and the tag value as the filter value. For example, to find all resources that have a tag with the key Owner and the value TeamA, specify tag:Owner for the filter name and TeamA for the filter value. tag-key - The key of a tag assigned to the resource. Use this filter to find all resources assigned a tag with a specific key, regardless of the tag value. type - The type of Spot Instance request ( one-time | persistent). valid-from - The start date of the request. valid-until - The end date of the request. (dict) --- A filter name and value pair that is used to return a more specific list of results from a describe operation. Filters can be used to match a set of resources by specific criteria, such as tags, attributes, or IDs. If you specify multiple filters, the filters are joined with an AND, and the request returns only results that match all of the specified filters. For more information, see List and filter using the CLI and API in the Amazon EC2 User Guide. Name (string) --- The name of the filter. Filter names are case-sensitive. Values (list) --- The filter values. Filter values are case-sensitive. If you specify multiple values for a filter, the values are joined with an OR, and the request returns all results that match any of the specified values. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "SpotInstanceRequests",
          "type": "list",
          "description": "The Spot Instance requests.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "ActualBlockHourlyPrice",
                  "type": "string",
                  "description": "Deprecated.",
                  "nested_items": []
                },
                {
                  "name": "AvailabilityZoneGroup",
                  "type": "string",
                  "description": "The Availability Zone group. If you specify the same Availability Zone group for all Spot Instance requests, all Spot Instances are launched in the same Availability Zone.",
                  "nested_items": []
                },
                {
                  "name": "BlockDurationMinutes",
                  "type": "integer",
                  "description": "Deprecated.",
                  "nested_items": []
                },
                {
                  "name": "CreateTime",
                  "type": "datetime",
                  "description": "The date and time when the Spot Instance request was created, in UTC format (for example, YYYY-MM-DD*T*HH:MM:*SS*Z).",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Code",
                      "type": "string",
                      "description": "The reason code for the Spot Instance state change.",
                      "nested_items": []
                    },
                    {
                      "name": "Message",
                      "type": "string",
                      "description": "The message for the Spot Instance state change.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "InstanceId",
                  "type": "string",
                  "description": "The instance ID, if an instance has been launched to fulfill the Spot Instance request.",
                  "nested_items": []
                },
                {
                  "name": "LaunchGroup",
                  "type": "string",
                  "description": "The instance launch group. Launch groups are Spot Instances that launch together and terminate together.",
                  "nested_items": []
                },
                {
                  "name": "LaunchSpecification",
                  "type": "dict",
                  "description": "Additional information for launching instances.",
                  "nested_items": [
                    {
                      "name": "UserData",
                      "type": "string",
                      "description": "The base64-encoded user data that instances use when starting up. User data is limited to 16 KB.",
                      "nested_items": []
                    },
                    {
                      "name": "AddressingType",
                      "type": "string",
                      "description": "Deprecated.",
                      "nested_items": []
                    },
                    {
                      "name": "BlockDeviceMappings",
                      "type": "list",
                      "description": "The block device mapping entries.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "dict",
                              "description": "",
                              "nested_items": [
                                {
                                  "name": "DeleteOnTermination",
                                  "type": "boolean",
                                  "description": "Indicates whether the EBS volume is deleted on instance termination. For more information, see Preserving Amazon EBS volumes on instance termination in the Amazon EC2 User Guide.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Iops",
                                  "type": "integer",
                                  "description": "The number of I/O operations per second (IOPS). For gp3, io1, and io2 volumes, this represents the number of IOPS that are provisioned for the volume. For gp2 volumes, this represents the baseline performance of the volume and the rate at which the volume accumulates I/O credits for bursting.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "gp3: 3,000 - 16,000 IOPS.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "io1: 100 - 64,000 IOPS.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "io2: 100 - 256,000 IOPS.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "SnapshotId",
                                  "type": "string",
                                  "description": "The ID of the snapshot.",
                                  "nested_items": []
                                },
                                {
                                  "name": "VolumeSize",
                                  "type": "integer",
                                  "description": "The size of the volume, in GiBs. You must specify either a snapshot ID or a volume size. If you specify a snapshot, the default is the snapshot size. You can specify a volume size that is equal to or larger than the snapshot size.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "gp2 and gp3: 1 - 16,384 GiB.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "io1: 4 - 16,384 GiB.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "io2: 4 - 65,536 GiB.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "st1 and sc1: 125 - 16,384 GiB.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "standard: 1 - 1024 GiB.",
                                      "nested_items": []
                                    }
                                  ]
                                },
                                {
                                  "name": "VolumeType",
                                  "type": "string",
                                  "description": "The volume type. For more information, see Amazon EBS volume types in the Amazon EBS User Guide.",
                                  "nested_items": []
                                },
                                {
                                  "name": "KmsKeyId",
                                  "type": "string",
                                  "description": "of the customer managed KMS key to use for EBS encryption.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Throughput",
                                  "type": "integer",
                                  "description": "The throughput that the volume supports, in MiB/s.",
                                  "nested_items": []
                                },
                                {
                                  "name": "OutpostArn",
                                  "type": "string",
                                  "description": "The ARN of the Outpost on which the snapshot is stored.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Encrypted",
                                  "type": "boolean",
                                  "description": "Indicates whether the encryption state of an EBS volume is changed while being restored from a backing snapshot. The effect of setting the encryption state to true depends on the volume origin (new or from a snapshot), starting encryption state, ownership, and whether encryption by default is enabled. For more information, see Amazon EBS encryption in the Amazon EBS User Guide.",
                                  "nested_items": [
                                    {
                                      "name": "new (empty) volume",
                                      "type": "empty",
                                      "description": "",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "existing encrypted or unencrypted snapshot",
                                      "type": "",
                                      "description": "",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "existing unencrypted volume",
                                      "type": "",
                                      "description": "",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "existing encrypted volume",
                                      "type": "",
                                      "description": "",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "NoDevice",
                              "type": "string",
                              "description": "To omit the device from the block device mapping, specify an empty string. When this property is specified, the device is removed from the block device mapping regardless of the assigned value.",
                              "nested_items": []
                            },
                            {
                              "name": "DeviceName",
                              "type": "string",
                              "description": "The device name (for example, /dev/sdh or xvdh).",
                              "nested_items": []
                            },
                            {
                              "name": "VirtualName",
                              "type": "string",
                              "description": "The virtual device name ( ephemeral``N). Instance store volumes are numbered starting from 0. An instance type with 2 available instance store volumes can specify mappings for ``ephemeral0 and ephemeral1. The number of available instance store volumes depends on the instance type. After you connect to the instance, you must mount the volume.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "EbsOptimized",
                      "type": "boolean",
                      "description": "Indicates whether the instance is optimized for EBS I/O. This optimization provides dedicated throughput to Amazon EBS and an optimized configuration stack to provide optimal EBS I/O performance. This optimization isn't available with all instance types. Additional usage charges apply when using an EBS Optimized instance.",
                      "nested_items": []
                    },
                    {
                      "name": "IamInstanceProfile",
                      "type": "dict",
                      "description": "The IAM instance profile.",
                      "nested_items": [
                        {
                          "name": "Arn",
                          "type": "string",
                          "description": "The Amazon Resource Name (ARN) of the instance profile.",
                          "nested_items": []
                        },
                        {
                          "name": "Name",
                          "type": "string",
                          "description": "The name of the instance profile.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "ImageId",
                      "type": "string",
                      "description": "The ID of the AMI.",
                      "nested_items": []
                    },
                    {
                      "name": "InstanceType",
                      "type": "string",
                      "description": "The instance type. Only one instance type can be specified.",
                      "nested_items": []
                    },
                    {
                      "name": "KernelId",
                      "type": "string",
                      "description": "The ID of the kernel.",
                      "nested_items": []
                    },
                    {
                      "name": "KeyName",
                      "type": "string",
                      "description": "The name of the key pair.",
                      "nested_items": []
                    },
                    {
                      "name": "NetworkInterfaces",
                      "type": "list",
                      "description": "The network interfaces. If you specify a network interface, you must specify subnet IDs and security group IDs using the network interface.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "AssociatePublicIpAddress",
                              "type": "boolean",
                              "description": "Indicates whether to assign a public IPv4 address to an instance you launch in a VPC. The public IP address can only be assigned to a network interface for eth0, and can only be assigned to a new network interface, not an existing one. You cannot specify more than one network interface in the request. If launching into a default subnet, the default value is true.",
                              "nested_items": []
                            },
                            {
                              "name": "DeleteOnTermination",
                              "type": "boolean",
                              "description": "If set to true, the interface is deleted when the instance is terminated. You can specify true only if creating a new network interface when launching an instance.",
                              "nested_items": []
                            },
                            {
                              "name": "Description",
                              "type": "string",
                              "description": "The description of the network interface. Applies only if creating a network interface when launching an instance.",
                              "nested_items": []
                            },
                            {
                              "name": "DeviceIndex",
                              "type": "integer",
                              "description": "The position of the network interface in the attachment order. A primary network interface has a device index of 0.",
                              "nested_items": []
                            },
                            {
                              "name": "Groups",
                              "type": "list",
                              "description": "The IDs of the security groups for the network interface. Applies only if creating a network interface when launching an instance.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "string",
                                  "description": "(string) ---",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "Ipv6AddressCount",
                              "type": "integer",
                              "description": "A number of IPv6 addresses to assign to the network interface. Amazon EC2 chooses the IPv6 addresses from the range of the subnet. You cannot specify this option and the option to assign specific IPv6 addresses in the same request. You can specify this option if you've specified a minimum number of instances to launch.",
                              "nested_items": []
                            },
                            {
                              "name": "Ipv6Addresses",
                              "type": "list",
                              "description": "The IPv6 addresses to assign to the network interface. You cannot specify this option and the option to assign a number of IPv6 addresses in the same request. You cannot specify this option if you've specified a minimum number of instances to launch.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "Ipv6Address",
                                      "type": "string",
                                      "description": "The IPv6 address.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "IsPrimaryIpv6",
                                      "type": "boolean",
                                      "description": "Determines if an IPv6 address associated with a network interface is the primary IPv6 address. When you enable an IPv6 GUA address to be a primary IPv6, the first IPv6 GUA will be made the primary IPv6 address until the instance is terminated or the network interface is detached. For more information, see RunInstances.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "NetworkInterfaceId",
                              "type": "string",
                              "description": "The ID of the network interface.",
                              "nested_items": []
                            },
                            {
                              "name": "PrivateIpAddress",
                              "type": "string",
                              "description": "The private IPv4 address of the network interface. Applies only if creating a network interface when launching an instance. You cannot specify this option if you're launching more than one instance in a RunInstances request.",
                              "nested_items": []
                            },
                            {
                              "name": "PrivateIpAddresses",
                              "type": "list",
                              "description": "The private IPv4 addresses to assign to the network interface. Only one private IPv4 address can be designated as primary. You cannot specify this option if you're launching more than one instance in a RunInstances request.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "Primary",
                                      "type": "boolean",
                                      "description": "Indicates whether the private IPv4 address is the primary private IPv4 address. Only one IPv4 address can be designated as primary.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "PrivateIpAddress",
                                      "type": "string",
                                      "description": "The private IPv4 address.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "SecondaryPrivateIpAddressCount",
                              "type": "integer",
                              "description": "The number of secondary private IPv4 addresses. You can't specify this parameter and also specify a secondary private IP address using the PrivateIpAddress parameter.",
                              "nested_items": []
                            },
                            {
                              "name": "SubnetId",
                              "type": "string",
                              "description": "The ID of the subnet associated with the network interface. Applies only if creating a network interface when launching an instance.",
                              "nested_items": []
                            },
                            {
                              "name": "AssociateCarrierIpAddress",
                              "type": "boolean",
                              "description": "Indicates whether to assign a carrier IP address to the network interface.",
                              "nested_items": []
                            },
                            {
                              "name": "InterfaceType",
                              "type": "string",
                              "description": "The type of network interface.",
                              "nested_items": []
                            },
                            {
                              "name": "NetworkCardIndex",
                              "type": "integer",
                              "description": "The index of the network card. Some instance types support multiple network cards. The primary network interface must be assigned to network card index 0. The default is network card index 0.",
                              "nested_items": []
                            },
                            {
                              "name": "Ipv4Prefixes",
                              "type": "list",
                              "description": "The IPv4 delegated prefixes to be assigned to the network interface. You cannot use this option if you use the Ipv4PrefixCount option.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "Ipv4Prefix",
                                      "type": "string",
                                      "description": "The IPv4 prefix. For information, see Assigning prefixes to network interfaces in the Amazon EC2 User Guide.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "Ipv4PrefixCount",
                              "type": "integer",
                              "description": "The number of IPv4 delegated prefixes to be automatically assigned to the network interface. You cannot use this option if you use the Ipv4Prefix option.",
                              "nested_items": []
                            },
                            {
                              "name": "Ipv6Prefixes",
                              "type": "list",
                              "description": "The IPv6 delegated prefixes to be assigned to the network interface. You cannot use this option if you use the Ipv6PrefixCount option.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "Ipv6Prefix",
                                      "type": "string",
                                      "description": "The IPv6 prefix.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "Ipv6PrefixCount",
                              "type": "integer",
                              "description": "The number of IPv6 delegated prefixes to be automatically assigned to the network interface. You cannot use this option if you use the Ipv6Prefix option.",
                              "nested_items": []
                            },
                            {
                              "name": "PrimaryIpv6",
                              "type": "boolean",
                              "description": "The primary IPv6 address of the network interface. When you enable an IPv6 GUA address to be a primary IPv6, the first IPv6 GUA will be made the primary IPv6 address until the instance is terminated or the network interface is detached. For more information about primary IPv6 addresses, see RunInstances.",
                              "nested_items": []
                            },
                            {
                              "name": "EnaSrdSpecification",
                              "type": "dict",
                              "description": "Specifies the ENA Express settings for the network interface that's attached to the instance.",
                              "nested_items": [
                                {
                                  "name": "EnaSrdEnabled",
                                  "type": "boolean",
                                  "description": "Specifies whether ENA Express is enabled for the network interface when you launch an instance.",
                                  "nested_items": []
                                },
                                {
                                  "name": "EnaSrdUdpSpecification",
                                  "type": "dict",
                                  "description": "Contains ENA Express settings for UDP network traffic for the network interface attached to the instance.",
                                  "nested_items": [
                                    {
                                      "name": "EnaSrdUdpEnabled",
                                      "type": "boolean",
                                      "description": "Indicates whether UDP traffic uses ENA Express for your instance. To ensure that UDP traffic can use ENA Express when you launch an instance, you must also set EnaSrdEnabled in the EnaSrdSpecificationRequest to true.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "ConnectionTrackingSpecification",
                              "type": "dict",
                              "description": "A security group connection tracking specification that enables you to set the timeout for connection tracking on an Elastic network interface. For more information, see Connection tracking timeouts in the Amazon EC2 User Guide.",
                              "nested_items": [
                                {
                                  "name": "TcpEstablishedTimeout",
                                  "type": "integer",
                                  "description": "for idle TCP connections in an established state. Min: 60 seconds. Max: 432000 seconds (5 days). Default: 432000 seconds. Recommended: Less than 432000 seconds.",
                                  "nested_items": []
                                },
                                {
                                  "name": "UdpStreamTimeout",
                                  "type": "integer",
                                  "description": "for idle UDP flows classified as streams which have seen more than one request-response transaction. Min: 60 seconds. Max: 180 seconds (3 minutes). Default: 180 seconds.",
                                  "nested_items": []
                                },
                                {
                                  "name": "UdpTimeout",
                                  "type": "integer",
                                  "description": "for idle UDP flows that have seen traffic only in a single direction or a single request-response transaction. Min: 30 seconds. Max: 60 seconds. Default: 30 seconds.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "Placement",
                      "type": "dict",
                      "description": "The placement information for the instance.",
                      "nested_items": [
                        {
                          "name": "AvailabilityZone",
                          "type": "string",
                          "description": "The Availability Zone.",
                          "nested_items": []
                        },
                        {
                          "name": "GroupName",
                          "type": "string",
                          "description": "The name of the placement group.",
                          "nested_items": []
                        },
                        {
                          "name": "Tenancy",
                          "type": "string",
                          "description": "The tenancy of the instance (if the instance is running in a VPC). An instance with a tenancy of dedicated runs on single-tenant hardware. The host tenancy is not supported for Spot Instances.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "RamdiskId",
                      "type": "string",
                      "description": "The ID of the RAM disk.",
                      "nested_items": []
                    },
                    {
                      "name": "SubnetId",
                      "type": "string",
                      "description": "The ID of the subnet in which to launch the instance.",
                      "nested_items": []
                    },
                    {
                      "name": "SecurityGroups",
                      "type": "list",
                      "description": "The IDs of the security groups.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "GroupId",
                              "type": "string",
                              "description": "The ID of the security group.",
                              "nested_items": []
                            },
                            {
                              "name": "GroupName",
                              "type": "string",
                              "description": "The name of the security group.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "Monitoring",
                      "type": "dict",
                      "description": "Describes the monitoring of an instance.",
                      "nested_items": [
                        {
                          "name": "Enabled",
                          "type": "boolean",
                          "description": "Indicates whether detailed monitoring is enabled. Otherwise, basic monitoring is enabled.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "LaunchedAvailabilityZone",
                  "type": "string",
                  "description": "The Availability Zone in which the request is launched.",
                  "nested_items": []
                },
                {
                  "name": "ProductDescription",
                  "type": "string",
                  "description": "The product description associated with the Spot Instance.",
                  "nested_items": []
                },
                {
                  "name": "SpotInstanceRequestId",
                  "type": "string",
                  "description": "The ID of the Spot Instance request.",
                  "nested_items": []
                },
                {
                  "name": "SpotPrice",
                  "type": "string",
                  "description": "The maximum price per unit hour that you are willing to pay for a Spot Instance. We do not recommend using this parameter because it can lead to increased interruptions. If you do not specify this parameter, you will pay the current Spot price.",
                  "nested_items": []
                },
                {
                  "name": "State",
                  "type": "string",
                  "description": "The state of the Spot Instance request. Spot request status information helps track your Spot Instance requests. For more information, see Spot request status in the Amazon EC2 User Guide.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Code",
                      "type": "string",
                      "description": "The status code. For a list of status codes, see Spot request status codes in the Amazon EC2 User Guide.",
                      "nested_items": []
                    },
                    {
                      "name": "Message",
                      "type": "string",
                      "description": "The description for the status code.",
                      "nested_items": []
                    },
                    {
                      "name": "UpdateTime",
                      "type": "datetime",
                      "description": "The date and time of the most recent status update, in UTC format (for example, YYYY-MM-DD*T*HH:MM:*SS*Z).",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Tags",
                  "type": "list",
                  "description": "Any tags assigned to the resource.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Key",
                          "type": "string",
                          "description": "The key of the tag.",
                          "nested_items": []
                        },
                        {
                          "name": "Value",
                          "type": "string",
                          "description": "The value of the tag.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "Type",
                  "type": "string",
                  "description": "The Spot Instance request type.",
                  "nested_items": []
                },
                {
                  "name": "ValidFrom",
                  "type": "datetime",
                  "description": "The start date of the request, in UTC format (for example, YYYY-MM-DD*T*HH:MM:*SS*Z). The request becomes active at this date and time.",
                  "nested_items": []
                },
                {
                  "name": "ValidUntil",
                  "type": "datetime",
                  "description": "The end date of the request, in UTC format (YYYY-MM-DD*T*HH:MM:*SS*Z).",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "For a persistent request, the request remains active until the validUntil date and time is reached. Otherwise, the request remains active until you cancel it.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "For a one-time request, the request remains active until all instances launch, the request is canceled, or the validUntil date and time is reached. By default, the request is valid for 7 days from the date the request was created.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "InstanceInterruptionBehavior",
                  "type": "string",
                  "description": "The behavior when a Spot Instance is interrupted.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The token to include in another request to get the next page of items. This value is null when there are no more items to return.",
          "nested_items": []
        }
      ]
    }
  ]
}