{
  "method_name": "describe_route_tables",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/describe_route_tables.html",
  "description": "Describes your route tables. The default is to describe all your route tables. Alternatively, you can specify specific route table IDs or filter the results to include only the route tables that match specific criteria. Each subnet in your VPC must be associated with a route table. If a subnet is not explicitly associated with any route table, it is implicitly associated with the main route table. This command does not return the subnet ID for implicit associations. For more information, see Route tables in the Amazon VPC User Guide.",
  "parameters": [
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "RouteTableIds",
      "type": "list",
      "required": false,
      "description": "The IDs of the route tables. (string) ---",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": false,
      "description": "The filters. association.gateway-id - The ID of the gateway involved in the association. association.route-table-association-id - The ID of an association ID for the route table. association.route-table-id - The ID of the route table involved in the association. association.subnet-id - The ID of the subnet involved in the association. association.main - Indicates whether the route table is the main route table for the VPC ( true | false). Route tables that do not have an association ID are not returned in the response. owner-id - The ID of the Amazon Web Services account that owns the route table. route-table-id - The ID of the route table. route.destination-cidr-block - The IPv4 CIDR range specified in a route in the table. route.destination-ipv6-cidr-block - The IPv6 CIDR range specified in a route in the route table. route.destination-prefix-list-id - The ID (prefix) of the Amazon Web Services service specified in a route in the table. route.egress-only-internet-gateway-id - The ID of an egress-only Internet gateway specified in a route in the route table. route.gateway-id - The ID of a gateway specified in a route in the table. route.instance-id - The ID of an instance specified in a route in the table. route.nat-gateway-id - The ID of a NAT gateway. route.transit-gateway-id - The ID of a transit gateway. route.origin - Describes how the route was created. CreateRouteTable indicates that the route was automatically created when the route table was created; CreateRoute indicates that the route was manually added to the route table; EnableVgwRoutePropagation indicates that the route was propagated by route propagation. route.state - The state of a route in the route table ( active | blackhole). The blackhole state indicates that the route's target isn't available (for example, the specified gateway isn't attached to the VPC, the specified NAT instance has been terminated, and so on). route.vpc-peering-connection-id - The ID of a VPC peering connection specified in a route in the table. tag - The key/value combination of a tag assigned to the resource. Use the tag key in the filter name and the tag value as the filter value. For example, to find all resources that have a tag with the key Owner and the value TeamA, specify tag:Owner for the filter name and TeamA for the filter value. tag-key - The key of a tag assigned to the resource. Use this filter to find all resources assigned a tag with a specific key, regardless of the tag value. vpc-id - The ID of the VPC for the route table. (dict) --- A filter name and value pair that is used to return a more specific list of results from a describe operation. Filters can be used to match a set of resources by specific criteria, such as tags, attributes, or IDs. If you specify multiple filters, the filters are joined with an AND, and the request returns only results that match all of the specified filters. For more information, see List and filter using the CLI and API in the Amazon EC2 User Guide. Name (string) --- The name of the filter. Filter names are case-sensitive. Values (list) --- The filter values. Filter values are case-sensitive. If you specify multiple values for a filter, the values are joined with an OR, and the request returns all results that match any of the specified values. (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "RouteTables",
          "type": "list",
          "description": "Information about the route tables.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Associations",
                  "type": "list",
                  "description": "The associations between the route table and your subnets or gateways.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Main",
                          "type": "boolean",
                          "description": "Indicates whether this is the main route table.",
                          "nested_items": []
                        },
                        {
                          "name": "RouteTableAssociationId",
                          "type": "string",
                          "description": "The ID of the association.",
                          "nested_items": []
                        },
                        {
                          "name": "RouteTableId",
                          "type": "string",
                          "description": "The ID of the route table.",
                          "nested_items": []
                        },
                        {
                          "name": "SubnetId",
                          "type": "string",
                          "description": "The ID of the subnet. A subnet ID is not returned for an implicit association.",
                          "nested_items": []
                        },
                        {
                          "name": "GatewayId",
                          "type": "string",
                          "description": "The ID of the internet gateway or virtual private gateway.",
                          "nested_items": []
                        },
                        {
                          "name": "AssociationState",
                          "type": "dict",
                          "description": "The state of the association.",
                          "nested_items": [
                            {
                              "name": "State",
                              "type": "string",
                              "description": "The state of the association.",
                              "nested_items": []
                            },
                            {
                              "name": "StatusMessage",
                              "type": "string",
                              "description": "The status message, if applicable.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "PropagatingVgws",
                  "type": "list",
                  "description": "Any virtual private gateway (VGW) propagating routes.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "GatewayId",
                          "type": "string",
                          "description": "The ID of the virtual private gateway.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "RouteTableId",
                  "type": "string",
                  "description": "The ID of the route table.",
                  "nested_items": []
                },
                {
                  "name": "Routes",
                  "type": "list",
                  "description": "The routes in the route table.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "DestinationCidrBlock",
                          "type": "string",
                          "description": "The IPv4 CIDR block used for the destination match.",
                          "nested_items": []
                        },
                        {
                          "name": "DestinationIpv6CidrBlock",
                          "type": "string",
                          "description": "The IPv6 CIDR block used for the destination match.",
                          "nested_items": []
                        },
                        {
                          "name": "DestinationPrefixListId",
                          "type": "string",
                          "description": "The prefix of the Amazon Web Services service.",
                          "nested_items": []
                        },
                        {
                          "name": "EgressOnlyInternetGatewayId",
                          "type": "string",
                          "description": "The ID of the egress-only internet gateway.",
                          "nested_items": []
                        },
                        {
                          "name": "GatewayId",
                          "type": "string",
                          "description": "The ID of a gateway attached to your VPC.",
                          "nested_items": []
                        },
                        {
                          "name": "InstanceId",
                          "type": "string",
                          "description": "The ID of a NAT instance in your VPC.",
                          "nested_items": []
                        },
                        {
                          "name": "InstanceOwnerId",
                          "type": "string",
                          "description": "The ID of Amazon Web Services account that owns the instance.",
                          "nested_items": []
                        },
                        {
                          "name": "NatGatewayId",
                          "type": "string",
                          "description": "The ID of a NAT gateway.",
                          "nested_items": []
                        },
                        {
                          "name": "TransitGatewayId",
                          "type": "string",
                          "description": "The ID of a transit gateway.",
                          "nested_items": []
                        },
                        {
                          "name": "LocalGatewayId",
                          "type": "string",
                          "description": "The ID of the local gateway.",
                          "nested_items": []
                        },
                        {
                          "name": "CarrierGatewayId",
                          "type": "string",
                          "description": "The ID of the carrier gateway.",
                          "nested_items": []
                        },
                        {
                          "name": "NetworkInterfaceId",
                          "type": "string",
                          "description": "The ID of the network interface.",
                          "nested_items": []
                        },
                        {
                          "name": "Origin",
                          "type": "string",
                          "description": "Describes how the route was created.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "",
                              "description": "CreateRouteTable - The route was automatically created when the route table was created.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "CreateRoute - The route was manually added to the route table.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "EnableVgwRoutePropagation - The route was propagated by route propagation.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "State",
                          "type": "string",
                          "description": "The state of the route. The blackhole state indicates that the route's target isn't available (for example, the specified gateway isn't attached to the VPC, or the specified NAT instance has been terminated).",
                          "nested_items": []
                        },
                        {
                          "name": "VpcPeeringConnectionId",
                          "type": "string",
                          "description": "The ID of a VPC peering connection.",
                          "nested_items": []
                        },
                        {
                          "name": "CoreNetworkArn",
                          "type": "string",
                          "description": "The Amazon Resource Name (ARN) of the core network.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "Tags",
                  "type": "list",
                  "description": "Any tags assigned to the route table.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "Key",
                          "type": "string",
                          "description": "The key of the tag.",
                          "nested_items": []
                        },
                        {
                          "name": "Value",
                          "type": "string",
                          "description": "The value of the tag.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "VpcId",
                  "type": "string",
                  "description": "The ID of the VPC.",
                  "nested_items": []
                },
                {
                  "name": "OwnerId",
                  "type": "string",
                  "description": "The ID of the Amazon Web Services account that owns the route table.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "The token to include in another request to get the next page of items. This value is null when there are no more items to return.",
          "nested_items": []
        }
      ]
    }
  ]
}