{
  "method_name": "describe_spot_price_history",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/describe_spot_price_history.html",
  "description": "Describes the Spot price history. For more information, see Spot Instance pricing history in the Amazon EC2 User Guide. When you specify a start and end time, the operation returns the prices of the instance types within that time range. It also returns the last price change before the start time, which is the effective price as of the start time.",
  "parameters": [
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "StartTime",
      "type": "datetime",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "EndTime",
      "type": "datetime",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "InstanceTypes",
      "type": "list",
      "required": false,
      "description": "Filters the results by the specified instance types. (string) ---",
      "nested_params": []
    },
    {
      "name": "ProductDescriptions",
      "type": "list",
      "required": false,
      "description": "Filters the results by the specified basic product descriptions. (string) ---",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": false,
      "description": "The filters. availability-zone - The Availability Zone for which prices should be returned. instance-type - The type of instance (for example, m3.medium). product-description - The product description for the Spot price ( Linux/UNIX | Red Hat Enterprise Linux | SUSE Linux | Windows | Linux/UNIX (Amazon VPC) | Red Hat Enterprise Linux (Amazon VPC) | SUSE Linux (Amazon VPC) | Windows (Amazon VPC)). spot-price - The Spot price. The value must match exactly (or use wildcards; greater than or less than comparison is not supported). timestamp - The time stamp of the Spot price history, in UTC format (for example, ddd MMM dd HH:mm:ss UTC YYYY). You can use wildcards ( * and ?). Greater than or less than comparison is not supported. (dict) --- A filter name and value pair that is used to return a more specific list of results from a describe operation. Filters can be used to match a set of resources by specific criteria, such as tags, attributes, or IDs. If you specify multiple filters, the filters are joined with an AND, and the request returns only results that match all of the specified filters. For more information, see List and filter using the CLI and API in the Amazon EC2 User Guide. Name (string) --- The name of the filter. Filter names are case-sensitive. Values (list) --- The filter values. Filter values are case-sensitive. If you specify multiple values for a filter, the values are joined with an OR, and the request returns all results that match any of the specified values. (string) ---",
      "nested_params": []
    },
    {
      "name": "AvailabilityZone",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "NextToken",
          "type": "string",
          "description": "The token to include in another request to get the next page of items. This value is an empty string ( \"\") or null when there are no more items to return.",
          "nested_items": []
        },
        {
          "name": "SpotPriceHistory",
          "type": "list",
          "description": "The historical Spot prices.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "AvailabilityZone",
                  "type": "string",
                  "description": "The Availability Zone.",
                  "nested_items": []
                },
                {
                  "name": "InstanceType",
                  "type": "string",
                  "description": "The instance type.",
                  "nested_items": []
                },
                {
                  "name": "ProductDescription",
                  "type": "string",
                  "description": "A general description of the AMI.",
                  "nested_items": []
                },
                {
                  "name": "SpotPrice",
                  "type": "string",
                  "description": "The maximum price per unit hour that you are willing to pay for a Spot Instance. We do not recommend using this parameter because it can lead to increased interruptions. If you do not specify this parameter, you will pay the current Spot price.",
                  "nested_items": []
                },
                {
                  "name": "Timestamp",
                  "type": "datetime",
                  "description": "The date and time the request was created, in UTC format (for example, YYYY-MM-DD*T*HH:MM:*SS*Z).",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}