{
  "method_name": "enable_snapshot_block_public_access",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/enable_snapshot_block_public_access.html",
  "description": "Enables or modifies the block public access for snapshots setting at the account level for the specified Amazon Web Services Region. After you enable block public access for snapshots in a Region, users can no longer request public sharing for snapshots in that Region. Snapshots that are already publicly shared are either treated as private or they remain publicly shared, depending on the State that you specify. For more information, see Block public access for snapshots in the Amazon EBS User Guide.",
  "parameters": [
    {
      "name": "State",
      "type": "string",
      "required": true,
      "description": "The mode in which to enable block public access for snapshots for the Region. Specify one of the following values: block-all-sharing - Prevents all public sharing of snapshots in the Region. Users in the account will no longer be able to request new public sharing. Additionally, snapshots that are already publicly shared are treated as private and they are no longer publicly available. block-new-sharing - Prevents only new public sharing of snapshots in the Region. However, snapshots that are already publicly shared, remain publicly available. unblocked is not a valid value for EnableSnapshotBlockPublicAccess.",
      "nested_params": []
    },
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "State",
          "type": "string",
          "description": "The state of block public access for snapshots for the account and Region. Returns either block-all-sharing or block-new-sharing if the request succeeds.",
          "nested_items": []
        }
      ]
    }
  ]
}