{
  "method_name": "update_security_group_rule_descriptions_ingress",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/ec2/client/update_security_group_rule_descriptions_ingress.html",
  "description": "Updates the description of an ingress (inbound) security group rule. You can replace an existing description, or add a description to a rule that did not have one previously. You can remove a description for a security group rule by omitting the description parameter in the request.",
  "parameters": [
    {
      "name": "DryRun",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "GroupId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "GroupName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "IpPermissions",
      "type": "list",
      "required": false,
      "description": "The IP permissions for the security group rule. You must specify either IP permissions or a description. (dict) --- Describes the permissions for a security group rule. IpProtocol (string) --- The IP protocol name ( tcp, udp, icmp, icmpv6) or number (see Protocol Numbers). Use -1 to specify all protocols. When authorizing security group rules, specifying -1 or a protocol number other than tcp, udp, icmp, or icmpv6 allows traffic on all ports, regardless of any port range you specify. For tcp, udp, and icmp, you must specify a port range. For icmpv6, the port range is optional; if you omit the port range, traffic for all types and codes is allowed. FromPort (integer) --- If the protocol is TCP or UDP, this is the start of the port range. If the protocol is ICMP or ICMPv6, this is the ICMP type or -1 (all ICMP types). ToPort (integer) --- If the protocol is TCP or UDP, this is the end of the port range. If the protocol is ICMP or ICMPv6, this is the ICMP code or -1 (all ICMP codes). If the start port is -1 (all ICMP types), then the end port must be -1 (all ICMP codes). UserIdGroupPairs (list) --- The security group and Amazon Web Services account ID pairs. (dict) --- Describes a security group and Amazon Web Services account ID pair. Description (string) --- A description for the security group rule that references this user ID group pair. Constraints: Up to 255 characters in length. Allowed characters are a-z, A-Z, 0-9, spaces, and ._-:/()#,@[]+=;{}!$* UserId (string) --- The ID of an Amazon Web Services account. For a referenced security group in another VPC, the account ID of the referenced security group is returned in the response. If the referenced security group is deleted, this value is not returned. GroupName (string) --- [Default VPC] The name of the security group. For a security group in a nondefault VPC, use the security group ID. For a referenced security group in another VPC, this value is not returned if the referenced security group is deleted. GroupId (string) --- The ID of the security group. VpcId (string) --- The ID of the VPC for the referenced security group, if applicable. VpcPeeringConnectionId (string) --- The ID of the VPC peering connection, if applicable. PeeringStatus (string) --- The status of a VPC peering connection, if applicable. IpRanges (list) --- The IPv4 address ranges. (dict) --- Describes an IPv4 address range. Description (string) --- A description for the security group rule that references this IPv4 address range. Allowed characters are a-z, A-Z, 0-9, spaces, and ._-:/()#,@[]+=&;{}!$* CidrIp (string) --- The IPv4 address range. You can either specify a CIDR block or a source security group, not both. To specify a single IPv4 address, use the /32 prefix length. Ipv6Ranges (list) --- The IPv6 address ranges. (dict) --- Describes an IPv6 address range. Description (string) --- A description for the security group rule that references this IPv6 address range. Allowed characters are a-z, A-Z, 0-9, spaces, and ._-:/()#,@[]+=&;{}!$* CidrIpv6 (string) --- The IPv6 address range. To specify a single IPv6 address, use the /128 prefix length. PrefixListIds (list) --- The prefix list IDs. (dict) --- Describes a prefix list ID. Description (string) --- A description for the security group rule that references this prefix list ID. Allowed characters are a-z, A-Z, 0-9, spaces, and ._-:/()#,@[]+=;{}!$* PrefixListId (string) --- The ID of the prefix.",
      "nested_params": [
        {
          "name": "IpProtocol",
          "type": "string",
          "required": false,
          "description": "The IP protocol name ( tcp, udp, icmp, icmpv6) or number (see Protocol Numbers). Use -1 to specify all protocols. When authorizing security group rules, specifying -1 or a protocol number other than tcp, udp, icmp, or icmpv6 allows traffic on all ports, regardless of any port range you specify. For tcp, udp, and icmp, you must specify a port range. For icmpv6, the port range is optional; if you omit the port range, traffic for all types and codes is allowed.",
          "nested_params": []
        },
        {
          "name": "FromPort",
          "type": "integer",
          "required": false,
          "description": "If the protocol is TCP or UDP, this is the start of the port range. If the protocol is ICMP or ICMPv6, this is the ICMP type or -1 (all ICMP types).",
          "nested_params": []
        },
        {
          "name": "ToPort",
          "type": "integer",
          "required": false,
          "description": "If the protocol is TCP or UDP, this is the end of the port range. If the protocol is ICMP or ICMPv6, this is the ICMP code or -1 (all ICMP codes). If the start port is -1 (all ICMP types), then the end port must be -1 (all ICMP codes).",
          "nested_params": []
        },
        {
          "name": "UserIdGroupPairs",
          "type": "list",
          "required": false,
          "description": "The security group and Amazon Web Services account ID pairs.",
          "nested_params": [
            {
              "name": "Description",
              "type": "string",
              "required": false,
              "description": "A description for the security group rule that references this user ID group pair. Constraints: Up to 255 characters in length. Allowed characters are a-z, A-Z, 0-9, spaces, and ._-:/()#,@[]+=;{}!$*",
              "nested_params": []
            },
            {
              "name": "UserId",
              "type": "string",
              "required": false,
              "description": "The ID of an Amazon Web Services account. For a referenced security group in another VPC, the account ID of the referenced security group is returned in the response. If the referenced security group is deleted, this value is not returned.",
              "nested_params": []
            },
            {
              "name": "GroupName",
              "type": "string",
              "required": false,
              "description": "[Default VPC] The name of the security group. For a security group in a nondefault VPC, use the security group ID. For a referenced security group in another VPC, this value is not returned if the referenced security group is deleted.",
              "nested_params": []
            },
            {
              "name": "GroupId",
              "type": "string",
              "required": false,
              "description": "The ID of the security group.",
              "nested_params": []
            },
            {
              "name": "VpcId",
              "type": "string",
              "required": false,
              "description": "The ID of the VPC for the referenced security group, if applicable.",
              "nested_params": []
            },
            {
              "name": "VpcPeeringConnectionId",
              "type": "string",
              "required": false,
              "description": "The ID of the VPC peering connection, if applicable.",
              "nested_params": []
            },
            {
              "name": "PeeringStatus",
              "type": "string",
              "required": false,
              "description": "The status of a VPC peering connection, if applicable.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "IpRanges",
          "type": "list",
          "required": false,
          "description": "The IPv4 address ranges.",
          "nested_params": [
            {
              "name": "Description",
              "type": "string",
              "required": false,
              "description": "A description for the security group rule that references this IPv4 address range. Constraints: Up to 255 characters in length. Allowed characters are a-z, A-Z, 0-9, spaces, and ._-:/()#,@[]+=&;{}!$*",
              "nested_params": []
            },
            {
              "name": "CidrIp",
              "type": "string",
              "required": false,
              "description": "The IPv4 address range. You can either specify a CIDR block or a source security group, not both. To specify a single IPv4 address, use the /32 prefix length.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Ipv6Ranges",
          "type": "list",
          "required": false,
          "description": "The IPv6 address ranges.",
          "nested_params": [
            {
              "name": "Description",
              "type": "string",
              "required": false,
              "description": "A description for the security group rule that references this IPv6 address range. Constraints: Up to 255 characters in length. Allowed characters are a-z, A-Z, 0-9, spaces, and ._-:/()#,@[]+=&;{}!$*",
              "nested_params": []
            },
            {
              "name": "CidrIpv6",
              "type": "string",
              "required": false,
              "description": "The IPv6 address range. You can either specify a CIDR block or a source security group, not both. To specify a single IPv6 address, use the /128 prefix length.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "PrefixListIds",
          "type": "list",
          "required": false,
          "description": "The prefix list IDs.",
          "nested_params": [
            {
              "name": "Description",
              "type": "string",
              "required": false,
              "description": "A description for the security group rule that references this prefix list ID. Constraints: Up to 255 characters in length. Allowed characters are a-z, A-Z, 0-9, spaces, and ._-:/()#,@[]+=;{}!$*",
              "nested_params": []
            },
            {
              "name": "PrefixListId",
              "type": "string",
              "required": false,
              "description": "The ID of the prefix.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "SecurityGroupRuleDescriptions",
      "type": "list",
      "required": false,
      "description": "The description for the ingress security group rules. You must specify either a description or IP permissions. (dict) --- Describes the description of a security group rule. You can use this when you want to update the security group rule description for either an inbound or outbound rule. SecurityGroupRuleId (string) --- The ID of the security group rule. Description (string) --- The description of the security group rule.",
      "nested_params": [
        {
          "name": "SecurityGroupRuleId",
          "type": "string",
          "required": false,
          "description": "The ID of the security group rule.",
          "nested_params": []
        },
        {
          "name": "Description",
          "type": "string",
          "required": false,
          "description": "The description of the security group rule.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Return",
          "type": "boolean",
          "description": "Returns true if the request succeeds; otherwise, returns an error.",
          "nested_items": []
        }
      ]
    }
  ]
}