{
  "method_name": "associate_personas_to_entities",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kendra/client/associate_personas_to_entities.html",
  "description": "Defines the specific permissions of users or groups in your IAM Identity Center identity source with access to your Amazon Kendra experience. You can create an Amazon Kendra experience such as a search application. For more information on creating a search application experience, see Building a search experience with no code.",
  "parameters": [
    {
      "name": "Id",
      "type": "string",
      "required": true,
      "description": "The identifier of your Amazon Kendra experience.",
      "nested_params": []
    },
    {
      "name": "IndexId",
      "type": "string",
      "required": true,
      "description": "The identifier of the index for your Amazon Kendra experience.",
      "nested_params": []
    },
    {
      "name": "Personas",
      "type": "list",
      "required": true,
      "description": "The personas that define the specific permissions of users or groups in your IAM Identity Center identity source. The available personas or access roles are Owner and Viewer. For more information on these personas, see Providing access to your search page. (dict) --- Provides the configuration information for users or groups in your IAM Identity Center identity source for access to your Amazon Kendra experience. Specific permissions are defined for each user or group once they are granted access to your Amazon Kendra experience. The identifier of a user or group in your IAM Identity Center identity source. For example, a user ID could be an email. The persona that defines the specific permissions of the user or group in your IAM Identity Center identity source. For more information on these personas, see Providing access to your search page.",
      "nested_params": [
        {
          "name": "EntityId",
          "type": "string",
          "required": false,
          "description": "The identifier of a user or group in your IAM Identity Center identity source. For example, a user ID could be an email.",
          "nested_params": []
        },
        {
          "name": "Persona",
          "type": "string",
          "required": false,
          "description": "The persona that defines the specific permissions of the user or group in your IAM Identity Center identity source. The available personas or access roles are Owner and Viewer. For more information on these personas, see Providing access to your search page.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "FailedEntityList",
          "type": "list",
          "description": "Lists the users or groups in your IAM Identity Center identity source that failed to properly configure with your Amazon Kendra experience.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "EntityId",
                  "type": "string",
                  "description": "The identifier of the user or group in your IAM Identity Center identity source. For example, a user ID could be an email.",
                  "nested_items": []
                },
                {
                  "name": "ErrorMessage",
                  "type": "string",
                  "description": "The reason the user or group in your IAM Identity Center identity source failed to properly configure with your Amazon Kendra experience.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}