{
  "method_name": "batch_delete_document",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kendra/client/batch_delete_document.html",
  "description": "Removes one or more documents from an index. The documents must have been added with the BatchPutDocument API. The documents are deleted asynchronously. You can see the progress of the deletion by using Amazon Web Services CloudWatch. Any error messages related to the processing of the batch are sent to your Amazon Web Services CloudWatch log. You can also use the BatchGetDocumentStatus API to monitor the progress of deleting your documents. Deleting documents from an index using BatchDeleteDocument could take up to an hour or more, depending on the number of documents you want to delete.",
  "parameters": [
    {
      "name": "IndexId",
      "type": "string",
      "required": true,
      "description": "The identifier of the index that contains the documents to delete.",
      "nested_params": []
    },
    {
      "name": "DocumentIdList",
      "type": "list",
      "required": true,
      "description": "One or more identifiers for documents to delete from the index. (string) ---",
      "nested_params": []
    },
    {
      "name": "DataSourceSyncJobMetricTarget",
      "type": "dict",
      "required": true,
      "description": "Maps a particular data source sync job to a particular data source. The ID of the data source that is running the sync job. DataSourceSyncJobId (string) --- The ID of the sync job that is running on the data source. If the ID of a sync job is not provided and there is a sync job running, then the ID of this sync job is used and metrics are generated for this sync job. If the ID of a sync job is not provided and there is no sync job running, then no metrics are generated and documents are indexed/deleted at the index level without sync job metrics included.",
      "nested_params": [
        {
          "name": "DataSourceId",
          "type": "string",
          "required": false,
          "description": "The ID of the data source that is running the sync job.",
          "nested_params": []
        },
        {
          "name": "DataSourceSyncJobId",
          "type": "string",
          "required": false,
          "description": "The ID of the sync job that is running on the data source. If the ID of a sync job is not provided and there is a sync job running, then the ID of this sync job is used and metrics are generated for this sync job. If the ID of a sync job is not provided and there is no sync job running, then no metrics are generated and documents are indexed/deleted at the index level without sync job metrics included.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "FailedDocuments",
          "type": "list",
          "description": "A list of documents that could not be removed from the index. Each entry contains an error message that indicates why the document couldn't be removed from the index.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "Id",
                  "type": "string",
                  "description": "The identifier of the document that couldn't be removed from the index.",
                  "nested_items": []
                },
                {
                  "name": "DataSourceId",
                  "type": "string",
                  "description": "The identifier of the data source connector that the document belongs to.",
                  "nested_items": []
                },
                {
                  "name": "ErrorCode",
                  "type": "string",
                  "description": "The error code for why the document couldn't be removed from the index.",
                  "nested_items": []
                },
                {
                  "name": "ErrorMessage",
                  "type": "string",
                  "description": "An explanation for why the document couldn't be removed from the index.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}