{
  "method_name": "create_thesaurus",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kendra/client/create_thesaurus.html",
  "description": "Creates a thesaurus for an index. The thesaurus contains a list of synonyms in Solr format. For an example of adding a thesaurus file to an index, see Adding custom synonyms to an index.",
  "parameters": [
    {
      "name": "IndexId",
      "type": "string",
      "required": true,
      "description": "The identifier of the index for the thesaurus.",
      "nested_params": []
    },
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "A name for the thesaurus.",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "RoleArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of an IAM role with permission to access your S3 bucket that contains the thesaurus file. For more information, see IAM access roles for Amazon Kendra.",
      "nested_params": []
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "A list of key-value pairs that identify or categorize the thesaurus. You can also use tags to help control access to the thesaurus. Tag keys and values can consist of Unicode letters, digits, white space, and any of the following symbols: _ . : / = + - @. (dict) --- A key-value pair that identifies or categorizes an index, FAQ, data source, or other resource. TA tag key and value can consist of Unicode letters, digits, white space, and any of the following symbols: _ . The key for the tag. Keys are not case sensitive and must be unique for the index, FAQ, data source, or other resource. The value associated with the tag. The value may be an empty string but it can't be null.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key for the tag. Keys are not case sensitive and must be unique for the index, FAQ, data source, or other resource.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value associated with the tag. The value may be an empty string but it can't be null.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "SourceS3Path",
      "type": "dict",
      "required": true,
      "description": "The path to the thesaurus file in S3. The name of the S3 bucket that contains the file. The name of the file.",
      "nested_params": [
        {
          "name": "Bucket",
          "type": "string",
          "required": false,
          "description": "The name of the S3 bucket that contains the file.",
          "nested_params": []
        },
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The name of the file.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": false,
      "description": "A token that you provide to identify the request to create a thesaurus. Multiple calls to the CreateThesaurus API with the same client token will create only one thesaurus. This field is autopopulated if not provided.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Id",
          "type": "string",
          "description": "The identifier of the thesaurus.",
          "nested_items": []
        }
      ]
    }
  ]
}