{
  "method_name": "create_experience",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kendra/client/create_experience.html",
  "description": "Creates an Amazon Kendra experience such as a search application. For more information on creating a search application experience, including using the Python and Java SDKs, see Building a search experience with no code.",
  "parameters": [
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "A name for your Amazon Kendra experience.",
      "nested_params": []
    },
    {
      "name": "IndexId",
      "type": "string",
      "required": true,
      "description": "The identifier of the index for your Amazon Kendra experience.",
      "nested_params": []
    },
    {
      "name": "RoleArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Configuration",
      "type": "dict",
      "required": false,
      "description": "Configuration information for your Amazon Kendra experience. This includes ContentSourceConfiguration, which specifies the data source IDs and/or FAQ IDs, and UserIdentityConfiguration, which specifies the user or group information to grant access to your Amazon Kendra experience. ContentSourceConfiguration (dict) --- The identifiers of your data sources and FAQs. Or, you can specify that you want to use documents indexed via the BatchPutDocument API. This is the content you want to use for your Amazon Kendra experience. DataSourceIds (list) --- The identifier of the data sources you want to use for your Amazon Kendra experience. (string) --- FaqIds (list) --- The identifier of the FAQs that you want to use for your Amazon Kendra experience. (string) --- DirectPutContent (boolean) --- TRUE to use documents you indexed directly using the BatchPutDocument API. UserIdentityConfiguration (dict) --- The IAM Identity Center field name that contains the identifiers of your users, such as their emails. IdentityAttributeName (string) --- The IAM Identity Center field name that contains the identifiers of your users, such as their emails. This is used for user context filtering and for granting access to your Amazon Kendra experience. You must set up IAM Identity Center with Amazon Kendra. You must include your users and groups in your Access Control List when you ingest documents into your index. For more information, see Getting started with an IAM Identity Center identity source.",
      "nested_params": [
        {
          "name": "ContentSourceConfiguration",
          "type": "dict",
          "required": false,
          "description": "The identifiers of your data sources and FAQs. Or, you can specify that you want to use documents indexed via the BatchPutDocument API. This is the content you want to use for your Amazon Kendra experience.",
          "nested_params": [
            {
              "name": "DataSourceIds",
              "type": "list",
              "required": false,
              "description": "The identifier of the data sources you want to use for your Amazon Kendra experience.",
              "nested_params": []
            },
            {
              "name": "FaqIds",
              "type": "list",
              "required": false,
              "description": "The identifier of the FAQs that you want to use for your Amazon Kendra experience.",
              "nested_params": []
            },
            {
              "name": "DirectPutContent",
              "type": "boolean",
              "required": false,
              "description": "TRUE to use documents you indexed directly using the BatchPutDocument API.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "UserIdentityConfiguration",
          "type": "dict",
          "required": false,
          "description": "The IAM Identity Center field name that contains the identifiers of your users, such as their emails.",
          "nested_params": [
            {
              "name": "IdentityAttributeName",
              "type": "string",
              "required": false,
              "description": "The IAM Identity Center field name that contains the identifiers of your users, such as their emails. This is used for user context filtering and for granting access to your Amazon Kendra experience. You must set up IAM Identity Center with Amazon Kendra. You must include your users and groups in your Access Control List when you ingest documents into your index. For more information, see Getting started with an IAM Identity Center identity source.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": false,
      "description": "A token that you provide to identify the request to create your Amazon Kendra experience. Multiple calls to the CreateExperience API with the same client token creates only one Amazon Kendra experience. This field is autopopulated if not provided.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Id",
          "type": "string",
          "description": "The identifier of your Amazon Kendra experience.",
          "nested_items": []
        }
      ]
    }
  ]
}