{
  "method_name": "create_access_control_configuration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kendra/client/create_access_control_configuration.html",
  "description": "Creates an access configuration for your documents. This includes user and group access information for your documents. This is useful for user context filtering, where search results are filtered based on the user or their group access to documents. You can use this to re-configure your existing document level access control without indexing all of your documents again. For example, your index contains top-secret company documents that only certain employees or users should access. One of these users leaves the company or switches to a team that should be blocked from accessing top-secret documents. The user still has access to top-secret documents because the user had access when your documents were previously indexed. You can create a specific access control configuration for the user with deny access. You can later update the access control configuration to allow access if the user returns to the company and re-joins the --\u0098top-secret' team. You can re-configure access control for your documents as circumstances change. To apply your access control configuration to certain documents, you call the BatchPutDocument API with the AccessControlConfigurationId included in the Document object. If you use an S3 bucket as a data source, you update the .metadata.json with the AccessControlConfigurationId and synchronize your data source. Amazon Kendra currently only supports access control configuration for S3 data sources and documents indexed using the BatchPutDocument API.",
  "parameters": [
    {
      "name": "IndexId",
      "type": "string",
      "required": true,
      "description": "The identifier of the index to create an access control configuration for your documents.",
      "nested_params": []
    },
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "A name for the access control configuration.",
      "nested_params": []
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "AccessControlList",
      "type": "list",
      "required": true,
      "description": "Information on principals (users and/or groups) and which documents they should have access to. This is useful for user context filtering, where search results are filtered based on the user or their group access to documents. (dict) --- Provides user and group information for user context filtering. The name of the user or group. The type of principal. Whether to allow or deny document access to the principal. DataSourceId (string) --- The identifier of the data source the principal should access documents from.",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name of the user or group.",
          "nested_params": []
        },
        {
          "name": "Type",
          "type": "string",
          "required": false,
          "description": "The type of principal.",
          "nested_params": []
        },
        {
          "name": "Access",
          "type": "string",
          "required": false,
          "description": "Whether to allow or deny document access to the principal.",
          "nested_params": []
        },
        {
          "name": "DataSourceId",
          "type": "string",
          "required": false,
          "description": "The identifier of the data source the principal should access documents from.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "HierarchicalAccessControlList",
      "type": "list",
      "required": true,
      "description": "The list of principal lists that define the hierarchy for which documents users should have access to. (dict) --- Information to define the hierarchy for which documents users should have access to. A list of principal lists that define the hierarchy for which documents users should have access to. Each hierarchical list specifies which user or group has allow or deny access for each document. (dict) --- Provides user and group information for user context filtering. The name of the user or group. The type of principal. Whether to allow or deny document access to the principal. DataSourceId (string) --- The identifier of the data source the principal should access documents from.",
      "nested_params": [
        {
          "name": "PrincipalList",
          "type": "list",
          "required": false,
          "description": "A list of principal lists that define the hierarchy for which documents users should have access to. Each hierarchical list specifies which user or group has allow or deny access for each document.",
          "nested_params": [
            {
              "name": "Name",
              "type": "string",
              "required": false,
              "description": "The name of the user or group.",
              "nested_params": []
            },
            {
              "name": "Type",
              "type": "string",
              "required": false,
              "description": "The type of principal.",
              "nested_params": []
            },
            {
              "name": "Access",
              "type": "string",
              "required": false,
              "description": "Whether to allow or deny document access to the principal.",
              "nested_params": []
            },
            {
              "name": "DataSourceId",
              "type": "string",
              "required": false,
              "description": "The identifier of the data source the principal should access documents from.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": false,
      "description": "A token that you provide to identify the request to create an access control configuration. Multiple calls to the CreateAccessControlConfiguration API with the same client token will create only one access control configuration. This field is autopopulated if not provided.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Id",
          "type": "string",
          "description": "The identifier of the access control configuration for your documents in an index.",
          "nested_items": []
        }
      ]
    }
  ]
}