{
  "method_name": "describe_experience",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kendra/client/describe_experience.html",
  "description": "Gets information about your Amazon Kendra experience such as a search application. For more information on creating a search application experience, see Building a search experience with no code.",
  "parameters": [
    {
      "name": "Id",
      "type": "string",
      "required": true,
      "description": "The identifier of your Amazon Kendra experience you want to get information on.",
      "nested_params": []
    },
    {
      "name": "IndexId",
      "type": "string",
      "required": true,
      "description": "The identifier of the index for your Amazon Kendra experience.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Id",
          "type": "string",
          "description": "Shows the identifier of your Amazon Kendra experience.",
          "nested_items": []
        },
        {
          "name": "IndexId",
          "type": "string",
          "description": "Shows the identifier of the index for your Amazon Kendra experience.",
          "nested_items": []
        },
        {
          "name": "Name",
          "type": "string",
          "description": "Shows the name of your Amazon Kendra experience.",
          "nested_items": []
        },
        {
          "name": "Endpoints",
          "type": "list",
          "description": "Shows the endpoint URLs for your Amazon Kendra experiences. The URLs are unique and fully hosted by Amazon Web Services.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "EndpointType",
                  "type": "string",
                  "description": "The type of endpoint for your Amazon Kendra experience. The type currently available is HOME, which is a unique and fully hosted URL to the home page of your Amazon Kendra experience.",
                  "nested_items": []
                },
                {
                  "name": "Endpoint",
                  "type": "string",
                  "description": "The endpoint of your Amazon Kendra experience.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "Configuration",
          "type": "dict",
          "description": "Shows the configuration information for your Amazon Kendra experience. This includes ContentSourceConfiguration, which specifies the data source IDs and/or FAQ IDs, and UserIdentityConfiguration, which specifies the user or group information to grant access to your Amazon Kendra experience.",
          "nested_items": [
            {
              "name": "ContentSourceConfiguration",
              "type": "dict",
              "description": "The identifiers of your data sources and FAQs. Or, you can specify that you want to use documents indexed via the BatchPutDocument API. This is the content you want to use for your Amazon Kendra experience.",
              "nested_items": [
                {
                  "name": "DataSourceIds",
                  "type": "list",
                  "description": "The identifier of the data sources you want to use for your Amazon Kendra experience.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "FaqIds",
                  "type": "list",
                  "description": "The identifier of the FAQs that you want to use for your Amazon Kendra experience.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "DirectPutContent",
                  "type": "boolean",
                  "description": "TRUE to use documents you indexed directly using the BatchPutDocument API.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "UserIdentityConfiguration",
              "type": "dict",
              "description": "The IAM Identity Center field name that contains the identifiers of your users, such as their emails.",
              "nested_items": [
                {
                  "name": "IdentityAttributeName",
                  "type": "string",
                  "description": "The IAM Identity Center field name that contains the identifiers of your users, such as their emails. This is used for user context filtering and for granting access to your Amazon Kendra experience. You must set up IAM Identity Center with Amazon Kendra. You must include your users and groups in your Access Control List when you ingest documents into your index. For more information, see Getting started with an IAM Identity Center identity source.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "CreatedAt",
          "type": "datetime",
          "description": "The Unix timestamp when your Amazon Kendra experience was created.",
          "nested_items": []
        },
        {
          "name": "UpdatedAt",
          "type": "datetime",
          "description": "The Unix timestamp when your Amazon Kendra experience was last updated.",
          "nested_items": []
        },
        {
          "name": "Description",
          "type": "string",
          "description": "Shows the description for your Amazon Kendra experience.",
          "nested_items": []
        },
        {
          "name": "Status",
          "type": "string",
          "description": "The current processing status of your Amazon Kendra experience. When the status is ACTIVE, your Amazon Kendra experience is ready to use. When the status is FAILED, the ErrorMessage field contains the reason that this failed.",
          "nested_items": []
        },
        {
          "name": "RoleArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the IAM role with permission to access the Query API, QuerySuggestions API, SubmitFeedback API, and IAM Identity Center that stores your users and groups information.",
          "nested_items": []
        },
        {
          "name": "ErrorMessage",
          "type": "string",
          "description": "The reason your Amazon Kendra experience could not properly process.",
          "nested_items": []
        }
      ]
    }
  ]
}