{
  "method_name": "submit_feedback",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kendra/client/submit_feedback.html",
  "description": "Enables you to provide feedback to Amazon Kendra to improve the performance of your index. SubmitFeedback is currently not supported in the Amazon Web Services GovCloud (US-West) region.",
  "parameters": [
    {
      "name": "IndexId",
      "type": "string",
      "required": true,
      "description": "The identifier of the index that was queried.",
      "nested_params": []
    },
    {
      "name": "QueryId",
      "type": "string",
      "required": true,
      "description": "The identifier of the specific query for which you are submitting feedback. The query ID is returned in the response to the Query API.",
      "nested_params": []
    },
    {
      "name": "ClickFeedbackItems",
      "type": "list",
      "required": true,
      "description": "Tells Amazon Kendra that a particular search result link was chosen by the user. (dict) --- Gathers information about when a particular result was clicked by a user. Your application uses the SubmitFeedback API to provide click information. The identifier of the search result that was clicked. The Unix timestamp when the result was clicked.",
      "nested_params": [
        {
          "name": "ResultId",
          "type": "string",
          "required": false,
          "description": "The identifier of the search result that was clicked.",
          "nested_params": []
        },
        {
          "name": "ClickTime",
          "type": "datetime",
          "required": false,
          "description": "The Unix timestamp when the result was clicked.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "RelevanceFeedbackItems",
      "type": "list",
      "required": true,
      "description": "Provides Amazon Kendra with relevant or not relevant feedback for whether a particular item was relevant to the search. (dict) --- Provides feedback on how relevant a document is to a search. Your application uses the SubmitFeedback API to provide relevance information. The identifier of the search result that the user provided relevance feedback for. Whether the document was relevant or not relevant to the search.",
      "nested_params": [
        {
          "name": "ResultId",
          "type": "string",
          "required": false,
          "description": "The identifier of the search result that the user provided relevance feedback for.",
          "nested_params": []
        },
        {
          "name": "RelevanceValue",
          "type": "string",
          "required": false,
          "description": "Whether the document was relevant or not relevant to the search.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}