{
  "method_name": "update_data_source",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kendra/client/update_data_source.html",
  "description": "Updates an Amazon Kendra data source connector.",
  "parameters": [
    {
      "name": "Id",
      "type": "string",
      "required": true,
      "description": "The identifier of the data source connector you want to update.",
      "nested_params": []
    },
    {
      "name": "Name",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "IndexId",
      "type": "string",
      "required": true,
      "description": "The identifier of the index used with the data source connector.",
      "nested_params": []
    },
    {
      "name": "Configuration",
      "type": "dict",
      "required": true,
      "description": "Configuration information you want to update for the data source connector. S3Configuration (dict) --- Provides the configuration information to connect to an Amazon S3 bucket as your data source. The name of the bucket that contains the documents. InclusionPrefixes (list) --- A list of S3 prefixes for the documents that should be included in the index. (string) --- InclusionPatterns (list) --- A list of glob patterns (patterns that can expand a wildcard pattern into a list of path names that match the given pattern) for certain file names and file types to include in your index. If a document matches both an inclusion and exclusion prefix or pattern, the exclusion prefix takes precendence and the document is not indexed. Examples of glob patterns include: /myapp/config/*--\u0094All files inside config directory. **/.png*--\u0094All .png files in all directories. **/.{png, ico, md}*--\u0094All .png, .ico or .md files in all directories. /myapp/src/*/.ts--\u0094All .ts files inside src directory (and all its subdirectories). **/!(.module).ts*--\u0094All .ts files but not .module.ts **.png , .jpg--\u0094All PNG and JPEG image files in a directory (files with the extensions .png and .jpg). internal--\u0094All files in a directory that contain --\u0098internal' in the file name, such as --\u0098internal', --\u0098internal_only', --\u0098company_internal'. */*internal--\u0094All internal-related files in a directory and its subdirectories. For more examples, see Use of Exclude and Include Filters in the Amazon Web Services CLI Command Reference. (string) --- ExclusionPatterns (list) --- A list of glob patterns (patterns that can expand a wildcard pattern into a list of path names that match the given pattern) for certain file names and file types to exclude from your index. (string) --- DocumentsMetadataConfiguration (dict) --- Document metadata files that contain information such as the document access control information, source URI, document author, and custom attributes. Each metadata file contains metadata about a single document. S3Prefix (string) --- A prefix used to filter metadata configuration files in the Amazon Web Services S3 bucket. The S3 bucket might contain multiple metadata files. Use S3Prefix to include only the desired metadata files. AccessControlListConfiguration (dict) --- Provides the path to the S3 bucket that contains the user context filtering files for the data source. For the format of the file, see Access control for S3 data sources. KeyPath (string) --- Path to the Amazon S3 bucket that contains the ACL files. SharePointConfiguration (dict) --- Provides the configuration information to connect to Microsoft SharePoint as your data source. The version of Microsoft SharePoint that you use. The Microsoft SharePoint site URLs for the documents you want to index. (string) --- The Amazon Resource Name (ARN) of an Secrets Manager secret that contains the user name and password required to connect to the SharePoint instance. For more information, see Microsoft SharePoint. CrawlAttachments (boolean) --- TRUE to index document attachments. UseChangeLog (boolean) --- TRUE to use the SharePoint change log to determine which documents require updating in the index. Depending on the change log's size, it may take longer for Amazon Kendra to use the change log than to scan all of your documents in SharePoint. InclusionPatterns (list) --- A list of regular expression patterns to include certain documents in your SharePoint. Documents that match the patterns are included in the index. Documents that don't match the patterns are excluded from the index. If a document matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the document isn't included in the index. The regex applies to the display URL of the SharePoint document. (string) --- ExclusionPatterns (list) --- A list of regular expression patterns to exclude certain documents in your SharePoint. Documents that match the patterns are excluded from the index. Documents that don't match the patterns are included in the index. (string) --- VpcConfiguration (dict) --- Configuration information for an Amazon Virtual Private Cloud to connect to your Microsoft SharePoint. For more information, see Configuring a VPC. A list of identifiers for subnets within your Amazon VPC. The subnets should be able to connect to each other in the VPC, and they should have outgoing access to the Internet through a NAT device. (string) --- A list of identifiers of security groups within your Amazon VPC. The security groups should enable Amazon Kendra to connect to the data source. (string) --- FieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map SharePoint data source attributes or field names to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to SharePoint fields. For more information, see Mapping data source fields. The SharePoint data source field names must exist in your SharePoint custom metadata. (dict) --- Maps attributes or field names of the documents synced from the data source to Amazon Kendra index field names. You can set up field mappings for each data source when calling CreateDataSource or UpdateDataSource API. To create custom fields, use the UpdateIndex API to first create an index field and then map to the data source field. The name of the field in the data source. You must first create the index field using the UpdateIndex API. DateFieldFormat (string) --- The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown. The name of the index field to map to the data source field. The index field type must match the data source field type. DocumentTitleFieldName (string) --- The Microsoft SharePoint attribute field that contains the title of the document. DisableLocalGroups (boolean) --- TRUE to disable local groups information. SslCertificateS3Path (dict) --- The path to the SSL certificate stored in an Amazon S3 bucket. You use this to connect to SharePoint Server if you require a secure SSL connection. You can generate a self-signed X509 certificate on any computer using OpenSSL. For an example of using OpenSSL to create an X509 certificate, see Create and sign an X509 certificate. The name of the S3 bucket that contains the file. The name of the file. AuthenticationType (string) --- Whether you want to connect to SharePoint Online using basic authentication of user name and password, or OAuth authentication of user name, password, client ID, and client secret, or AD App-only authentication of client secret. ProxyConfiguration (dict) --- Configuration information to connect to your Microsoft SharePoint site URLs via instance via a web proxy. You can use this option for SharePoint Server. You must provide the website host name and port number. For example, the host name of https://a.example.com/page1.html is 'a.example.com' and the port is 443, the standard port for HTTPS. Web proxy credentials are optional and you can use them to connect to a web proxy server that requires basic authentication of user name and password. To store web proxy credentials, you use a secret in Secrets Manager. It is recommended that you follow best security practices when configuring your web proxy. This includes setting up throttling, setting up logging and monitoring, and applying security patches on a regular basis. If you use your web proxy with multiple data sources, sync jobs that occur at the same time could strain the load on your proxy. It is recommended you prepare your proxy beforehand for any security and load requirements. The name of the website host you want to connect to via a web proxy server. For example, the host name of https://a.example.com/page1.html is 'a.example.com'. The port number of the website host you want to connect to via a web proxy server. For example, the port for https://a.example.com/page1.html is 443, the standard port for HTTPS. Credentials (string) --- The Amazon Resource Name (ARN) of an Secrets Manager secret. You create a secret to store your credentials in Secrets Manager The credentials are optional. You use a secret if web proxy credentials are required to connect to a website host. Amazon Kendra currently support basic authentication to connect to a web proxy server. The secret stores your credentials. DatabaseConfiguration (dict) --- Provides the configuration information to connect to a database as your data source. The type of database engine that runs the database. Configuration information that's required to connect to a database. The name of the host for the database. Can be either a string (host.subdomain.domain.tld) or an IPv4 or IPv6 address. The port that the database uses for connections. The name of the database containing the document data. The name of the table that contains the document data. The Amazon Resource Name (ARN) of an Secrets Manager secret that stores the credentials. The credentials should be a user-password pair. For more information, see Using a Database Data Source. For more information about Secrets Manager, see What Is Secrets Manager in the Secrets Manager user guide. VpcConfiguration (dict) --- Provides the configuration information to connect to an Amazon VPC. (string) --- Information about where the index should get the document information from the database. The column that provides the document's identifier. The column that contains the contents of the document. DocumentTitleColumnName (string) --- The column that contains the title of the document. FieldMappings (list) --- An array of objects that map database column names to the corresponding fields in an index. You must first create the fields in the index using the UpdateIndex API. One to five columns that indicate when a document in the database has changed. (string) --- AclConfiguration (dict) --- Information about the database column that provides information for user context filtering. A list of groups, separated by semi-colons, that filters a query response based on user context. The document is only returned to users that are in one of the groups specified in the UserContext field of the Query API. SqlConfiguration (dict) --- Provides information about how Amazon Kendra uses quote marks around SQL identifiers when querying a database data source. QueryIdentifiersEnclosingOption (string) --- Determines whether Amazon Kendra encloses SQL identifiers for tables and column names in double quotes (') when making a database query. By default, Amazon Kendra passes SQL identifiers the way that they are entered into the data source configuration. It does not change the case of identifiers or enclose them in quotes. PostgreSQL internally converts uppercase characters to lower case characters in identifiers unless they are quoted. Choosing this option encloses identifiers in quotes so that PostgreSQL does not convert the character's case. For MySQL databases, you must enable the ansi_quotes option when you set this field to DOUBLE_QUOTES. SalesforceConfiguration (dict) --- Provides the configuration information to connect to Salesforce as your data source. The instance URL for the Salesforce site that you want to index. The Amazon Resource Name (ARN) of an Secrets Managersecret that contains the key/value pairs required to connect to your Salesforce instance. The secret must contain a JSON structure with the following keys: authenticationUrl - The OAUTH endpoint that Amazon Kendra connects to get an OAUTH token. consumerKey - The application public key generated when you created your Salesforce application. consumerSecret - The application private key generated when you created your Salesforce application. password - The password associated with the user logging in to the Salesforce instance. securityToken - The token associated with the user logging in to the Salesforce instance. username - The user name of the user logging in to the Salesforce instance. StandardObjectConfigurations (list) --- Configuration of the Salesforce standard objects that Amazon Kendra indexes. (dict) --- Provides the configuration information for indexing a single standard object. The name of the standard object. The name of the field in the standard object table that contains the document contents. DocumentTitleFieldName (string) --- The name of the field in the standard object table that contains the document title. FieldMappings (list) --- Maps attributes or field names of the standard object to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Salesforce fields. The Salesforce data source field names must exist in your Salesforce custom metadata. KnowledgeArticleConfiguration (dict) --- Configuration information for the knowledge article types that Amazon Kendra indexes. Amazon Kendra indexes standard knowledge articles and the standard fields of knowledge articles, or the custom fields of custom knowledge articles, but not both. Specifies the document states that should be included when Amazon Kendra indexes knowledge articles. You must specify at least one state. (string) --- StandardKnowledgeArticleTypeConfiguration (dict) --- Configuration information for standard Salesforce knowledge articles. The name of the field that contains the document data to index. DocumentTitleFieldName (string) --- The name of the field that contains the document title. FieldMappings (list) --- Maps attributes or field names of the knowledge article to Amazon Kendra index field names. CustomKnowledgeArticleTypeConfigurations (list) --- Configuration information for custom Salesforce knowledge articles. (dict) --- Provides the configuration information for indexing Salesforce custom articles. The name of the configuration. The name of the field in the custom knowledge article that contains the document data to index. DocumentTitleFieldName (string) --- The name of the field in the custom knowledge article that contains the document title. FieldMappings (list) --- Maps attributes or field names of the custom knowledge article to Amazon Kendra index field names. ChatterFeedConfiguration (dict) --- Configuration information for Salesforce chatter feeds. The name of the column in the Salesforce FeedItem table that contains the content to index. Typically this is the Body column. DocumentTitleFieldName (string) --- The name of the column in the Salesforce FeedItem table that contains the title of the document. This is typically the Title column. FieldMappings (list) --- Maps fields from a Salesforce chatter feed into Amazon Kendra index fields. IncludeFilterTypes (list) --- Filters the documents in the feed based on status of the user. When you specify ACTIVE_USERS only documents from users who have an active account are indexed. When you specify STANDARD_USER only documents for Salesforce standard users are documented. You can specify both. (string) --- CrawlAttachments (boolean) --- Indicates whether Amazon Kendra should index attachments to Salesforce objects. StandardObjectAttachmentConfiguration (dict) --- Configuration information for processing attachments to Salesforce standard objects. DocumentTitleFieldName (string) --- The name of the field used for the document title. FieldMappings (list) --- One or more objects that map fields in attachments to Amazon Kendra index fields. IncludeAttachmentFilePatterns (list) --- A list of regular expression patterns to include certain documents in your Salesforce. The pattern is applied to the name of the attached file. (string) --- ExcludeAttachmentFilePatterns (list) --- A list of regular expression patterns to exclude certain documents in your Salesforce. (string) --- OneDriveConfiguration (dict) --- Provides the configuration information to connect to Microsoft OneDrive as your data source. The Azure Active Directory domain of the organization. The Amazon Resource Name (ARN) of an Secrets Managersecret that contains the user name and password to connect to OneDrive. The user name should be the application ID for the OneDrive application, and the password is the application key for the OneDrive application. A list of user accounts whose documents should be indexed. OneDriveUserList (list) --- A list of users whose documents should be indexed. Specify the user names in email format, for example, username@tenantdomain. If you need to index the documents of more than 10 users, use the OneDriveUserS3Path field to specify the location of a file containing a list of users. (string) --- OneDriveUserS3Path (dict) --- The S3 bucket location of a file containing a list of users whose documents should be indexed. InclusionPatterns (list) --- A list of regular expression patterns to include certain documents in your OneDrive. The pattern is applied to the file name. (string) --- ExclusionPatterns (list) --- A list of regular expression patterns to exclude certain documents in your OneDrive. (string) --- FieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map OneDrive data source attributes or field names to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to OneDrive fields. The OneDrive data source field names must exist in your OneDrive custom metadata. ServiceNowConfiguration (dict) --- Provides the configuration information to connect to ServiceNow as your data source. The ServiceNow instance that the data source connects to. The host endpoint should look like the following: {instance}.service-now.com. The Amazon Resource Name (ARN) of the Secrets Manager secret that contains the user name and password required to connect to the ServiceNow instance. You can also provide OAuth authentication credentials of user name, password, client ID, and client secret. For more information, see Using a ServiceNow data source. The identifier of the release that the ServiceNow host is running. If the host is not running the LONDON release, use OTHERS. KnowledgeArticleConfiguration (dict) --- Configuration information for crawling knowledge articles in the ServiceNow site. CrawlAttachments (boolean) --- TRUE to index attachments to knowledge articles. IncludeAttachmentFilePatterns (list) --- A list of regular expression patterns applied to include knowledge article attachments. Attachments that match the patterns are included in the index. Items that don't match the patterns are excluded from the index. If an item matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the item isn't included in the index. (string) --- ExcludeAttachmentFilePatterns (list) --- A list of regular expression patterns applied to exclude certain knowledge article attachments. Attachments that match the patterns are excluded from the index. Items that don't match the patterns are included in the index. (string) --- The name of the ServiceNow field that is mapped to the index document contents field in the Amazon Kendra index. DocumentTitleFieldName (string) --- The name of the ServiceNow field that is mapped to the index document title field. FieldMappings (list) --- Maps attributes or field names of knoweldge articles to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to ServiceNow fields. The ServiceNow data source field names must exist in your ServiceNow custom metadata. FilterQuery (string) --- A query that selects the knowledge articles to index. The query can return articles from multiple knowledge bases, and the knowledge bases can be public or private. The query string must be one generated by the ServiceNow console. For more information, see Specifying documents to index with a query. ServiceCatalogConfiguration (dict) --- Configuration information for crawling service catalogs in the ServiceNow site. CrawlAttachments (boolean) --- TRUE to index attachments to service catalog items. IncludeAttachmentFilePatterns (list) --- A list of regular expression patterns to include certain attachments of catalogs in your ServiceNow. Item that match the patterns are included in the index. The regex is applied to the file name of the attachment. (string) --- ExcludeAttachmentFilePatterns (list) --- A list of regular expression patterns to exclude certain attachments of catalogs in your ServiceNow. Item that match the patterns are excluded from the index. FieldMappings (list) --- Maps attributes or field names of catalogs to Amazon Kendra index field names. AuthenticationType (string) --- The type of authentication used to connect to the ServiceNow instance. If you choose HTTP_BASIC, Amazon Kendra is authenticated using the user name and password provided in the Secrets Manager secret in the SecretArn field. If you choose OAUTH2, Amazon Kendra is authenticated using the credentials of client ID, client secret, user name and password. When you use OAUTH2 authentication, you must generate a token and a client secret using the ServiceNow console. ConfluenceConfiguration (dict) --- Provides the configuration information to connect to Confluence as your data source. The URL of your Confluence instance. Use the full URL of the server. For example, https://server.example.com:port/. You can also use an IP address, for example, https://192.168.1.113/. The Amazon Resource Name (ARN) of an Secrets Manager secret that contains the user name and password required to connect to the Confluence instance. If you use Confluence Cloud, you use a generated API token as the password. You can also provide authentication credentials in the form of a personal access token. For more information, see Using a Confluence data source. The version or the type of Confluence installation to connect to. SpaceConfiguration (dict) --- Configuration information for indexing Confluence spaces. CrawlPersonalSpaces (boolean) --- TRUE to index personal spaces. You can add restrictions to items in personal spaces. If personal spaces are indexed, queries without user context information may return restricted items from a personal space in their results. For more information, see Filtering on user context. CrawlArchivedSpaces (boolean) --- TRUE to index archived spaces. IncludeSpaces (list) --- A list of space keys for Confluence spaces. If you include a key, the blogs, documents, and attachments in the space are indexed. Spaces that aren't in the list aren't indexed. A space in the list must exist. Otherwise, Amazon Kendra logs an error when the data source is synchronized. If a space is in both the IncludeSpaces and the ExcludeSpaces list, the space is excluded. (string) --- ExcludeSpaces (list) --- A list of space keys of Confluence spaces. If you include a key, the blogs, documents, and attachments in the space are not indexed. If a space is in both the ExcludeSpaces and the IncludeSpaces list, the space is excluded. (string) --- SpaceFieldMappings (list) --- Maps attributes or field names of Confluence spaces to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Confluence fields. The Confluence data source field names must exist in your Confluence custom metadata. If you specify the SpaceFieldMappings parameter, you must specify at least one field mapping. (dict) --- Maps attributes or field names of Confluence spaces to Amazon Kendra index field names. DataSourceFieldName (string) --- The name of the field in the data source. If the field specified in DataSourceFieldName is a date field you must specify the date format. IndexFieldName (string) --- The name of the index field to map to the Confluence data source field. The index field type must match the Confluence field type. PageConfiguration (dict) --- Configuration information for indexing Confluence pages. PageFieldMappings (list) --- Maps attributes or field names of Confluence pages to Amazon Kendra index field names. If you specify the PageFieldMappings parameter, you must specify at least one field mapping. (dict) --- Maps attributes or field names of Confluence pages to Amazon Kendra index field names. BlogConfiguration (dict) --- Configuration information for indexing Confluence blogs. BlogFieldMappings (list) --- Maps attributes or field names of Confluence blogs to Amazon Kendra index field names. If you specify the BlogFieldMappings parameter, you must specify at least one field mapping. (dict) --- Maps attributes or field names of Confluence blog to Amazon Kendra index field names. AttachmentConfiguration (dict) --- Configuration information for indexing attachments to Confluence blogs and pages. CrawlAttachments (boolean) --- TRUE to index attachments of pages and blogs in Confluence. AttachmentFieldMappings (list) --- Maps attributes or field names of Confluence attachments to Amazon Kendra index field names. If you specify the AttachentFieldMappings parameter, you must specify at least one field mapping. (dict) --- Maps attributes or field names of Confluence attachments to Amazon Kendra index field names. The Confuence data source field names must exist in your Confluence custom metadata. VpcConfiguration (dict) --- Configuration information for an Amazon Virtual Private Cloud to connect to your Confluence. (string) --- InclusionPatterns (list) --- A list of regular expression patterns to include certain blog posts, pages, spaces, or attachments in your Confluence. Content that matches the patterns are included in the index. Content that doesn't match the patterns is excluded from the index. If content matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the content isn't included in the index. (string) --- ExclusionPatterns (list) --- A list of regular expression patterns to exclude certain blog posts, pages, spaces, or attachments in your Confluence. Content that matches the patterns are excluded from the index. Content that doesn't match the patterns is included in the index. (string) --- ProxyConfiguration (dict) --- Configuration information to connect to your Confluence URL instance via a web proxy. You can use this option for Confluence Server. AuthenticationType (string) --- Whether you want to connect to Confluence using basic authentication of user name and password, or a personal access token. You can use a personal access token for Confluence Server. GoogleDriveConfiguration (dict) --- Provides the configuration information to connect to Google Drive as your data source. The Amazon Resource Name (ARN) of a Secrets Managersecret that contains the credentials required to connect to Google Drive. For more information, see Using a Google Workspace Drive data source. InclusionPatterns (list) --- A list of regular expression patterns to include certain items in your Google Drive, including shared drives and users' My Drives. Items that match the patterns are included in the index. (string) --- ExclusionPatterns (list) --- A list of regular expression patterns to exclude certain items in your Google Drive, including shared drives and users' My Drives. Items that match the patterns are excluded from the index. (string) --- FieldMappings (list) --- Maps Google Drive data source attributes or field names to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Google Drive fields. The Google Drive data source field names must exist in your Google Drive custom metadata. ExcludeMimeTypes (list) --- A list of MIME types to exclude from the index. All documents matching the specified MIME type are excluded. For a list of MIME types, see Using a Google Workspace Drive data source. (string) --- ExcludeUserAccounts (list) --- A list of email addresses of the users. Documents owned by these users are excluded from the index. Documents shared with excluded users are indexed unless they are excluded in another way. (string) --- ExcludeSharedDrives (list) --- A list of identifiers or shared drives to exclude from the index. All files and folders stored on the shared drive are excluded. (string) --- WebCrawlerConfiguration (dict) --- Provides the configuration information required for Amazon Kendra Web Crawler. Specifies the seed or starting point URLs of the websites or the sitemap URLs of the websites you want to crawl. You can include website subdomains. You can list up to 100 seed URLs and up to three sitemap URLs. You can only crawl websites that use the secure communication protocol, Hypertext Transfer Protocol Secure (HTTPS). If you receive an error when crawling a website, it could be that the website is blocked from crawling. When selecting websites to index, you must adhere to the Amazon Acceptable Use Policy and all other Amazon terms. Remember that you must only use Amazon Kendra Web Crawler to index your own web pages, or web pages that you have authorization to index. SeedUrlConfiguration (dict) --- Configuration of the seed or starting point URLs of the websites you want to crawl. You can choose to crawl only the website host names, or the website host names with subdomains, or the website host names with subdomains and other domains that the web pages link to. You can list up to 100 seed URLs. The list of seed or starting point URLs of the websites you want to crawl. The list can include a maximum of 100 seed URLs. (string) --- WebCrawlerMode (string) --- You can choose one of the following modes: HOST_ONLY--\u0094crawl only the website host names. For example, if the seed URL is 'abc.example.com', then only URLs with host name 'abc.example.com' are crawled. SUBDOMAINS--\u0094crawl the website host names with subdomains. For example, if the seed URL is 'abc.example.com', then 'a.abc.example.com' and 'b.abc.example.com' are also crawled. EVERYTHING--\u0094crawl the website host names with subdomains and other domains that the web pages link to. The default mode is set to HOST_ONLY. SiteMapsConfiguration (dict) --- Configuration of the sitemap URLs of the websites you want to crawl. Only URLs belonging to the same website host names are crawled. You can list up to three sitemap URLs. The list of sitemap URLs of the websites you want to crawl. The list can include a maximum of three sitemap URLs. (string) --- CrawlDepth (integer) --- The --\u0098depth' or number of levels from the seed level to crawl. For example, the seed URL page is depth 1 and any hyperlinks on this page that are also crawled are depth 2. MaxLinksPerPage (integer) --- The maximum number of URLs on a web page to include when crawling a website. This number is per web page. As a website's web pages are crawled, any URLs the web pages link to are also crawled. URLs on a web page are crawled in order of appearance. The default maximum links per page is 100. MaxContentSizePerPageInMegaBytes (float) --- The maximum size (in MB) of a web page or attachment to crawl. Files larger than this size (in MB) are skipped/not crawled. The default maximum size of a web page or attachment is set to 50 MB. MaxUrlsPerMinuteCrawlRate (integer) --- The maximum number of URLs crawled per website host per minute. A minimum of one URL is required. The default maximum number of URLs crawled per website host per minute is 300. UrlInclusionPatterns (list) --- A list of regular expression patterns to include certain URLs to crawl. URLs that match the patterns are included in the index. URLs that don't match the patterns are excluded from the index. If a URL matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the URL file isn't included in the index. (string) --- UrlExclusionPatterns (list) --- A list of regular expression patterns to exclude certain URLs to crawl. URLs that match the patterns are excluded from the index. URLs that don't match the patterns are included in the index. (string) --- ProxyConfiguration (dict) --- Configuration information required to connect to your internal websites via a web proxy. Web proxy credentials are optional and you can use them to connect to a web proxy server that requires basic authentication. AuthenticationConfiguration (dict) --- Configuration information required to connect to websites using authentication. You can connect to websites using basic authentication of user name and password. You use a secret in Secrets Manager to store your authentication credentials. BasicAuthentication (list) --- The list of configuration information that's required to connect to and crawl a website host using basic authentication credentials. The list includes the name and port number of the website host. (dict) --- Provides the configuration information to connect to websites that require basic user authentication. The name of the website host you want to connect to using authentication credentials. The port number of the website host you want to connect to using authentication credentials. The Amazon Resource Name (ARN) of an Secrets Manager secret. You create a secret to store your credentials in Secrets Manager You use a secret if basic authentication credentials are required to connect to a website. The secret stores your credentials of user name and password. WorkDocsConfiguration (dict) --- Provides the configuration information to connect to Amazon WorkDocs as your data source. The identifier of the directory corresponding to your Amazon WorkDocs site repository. You can find the organization ID in the Directory Service by going to Active Directory, then Directories. Your Amazon WorkDocs site directory has an ID, which is the organization ID. You can also set up a new Amazon WorkDocs directory in the Directory Service console and enable a Amazon WorkDocs site for the directory in the Amazon WorkDocs console. CrawlComments (boolean) --- TRUE to include comments on documents in your index. Including comments in your index means each comment is a document that can be searched on. The default is set to FALSE. UseChangeLog (boolean) --- TRUE to use the Amazon WorkDocs change log to determine which documents require updating in the index. Depending on the change log's size, it may take longer for Amazon Kendra to use the change log than to scan all of your documents in Amazon WorkDocs. InclusionPatterns (list) --- A list of regular expression patterns to include certain files in your Amazon WorkDocs site repository. Files that match the patterns are included in the index. Files that don't match the patterns are excluded from the index. If a file matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the file isn't included in the index. (string) --- ExclusionPatterns (list) --- A list of regular expression patterns to exclude certain files in your Amazon WorkDocs site repository. Files that match the patterns are excluded from the index. Files that don't match the patterns are included in the index. (string) --- FieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map Amazon WorkDocs data source attributes or field names to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Amazon WorkDocs fields. The Amazon WorkDocs data source field names must exist in your Amazon WorkDocs custom metadata. FsxConfiguration (dict) --- Provides the configuration information to connect to Amazon FSx as your data source. The identifier of the Amazon FSx file system. You can find your file system ID on the file system dashboard in the Amazon FSx console. For information on how to create a file system in Amazon FSx console, using Windows File Server as an example, see Amazon FSx Getting started guide. The Amazon FSx file system type. Windows is currently the only supported type. Configuration information for an Amazon Virtual Private Cloud to connect to your Amazon FSx. Your Amazon FSx instance must reside inside your VPC. (string) --- SecretArn (string) --- The Amazon Resource Name (ARN) of an Secrets Manager secret that contains the key-value pairs required to connect to your Amazon FSx file system. The secret must contain a JSON structure with the following keys: username--\u0094The Active Directory user name, along with the Domain Name System (DNS) domain name. For example, user@corp.example.com. The Active Directory user account must have read and mounting access to the Amazon FSx file system for Windows. password--\u0094The password of the Active Directory user account with read and mounting access to the Amazon FSx Windows file system. InclusionPatterns (list) --- A list of regular expression patterns to include certain files in your Amazon FSx file system. (string) --- ExclusionPatterns (list) --- A list of regular expression patterns to exclude certain files in your Amazon FSx file system. (string) --- FieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map Amazon FSx data source attributes or field names to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Amazon FSx fields. The Amazon FSx data source field names must exist in your Amazon FSx custom metadata. SlackConfiguration (dict) --- Provides the configuration information to connect to Slack as your data source. The identifier of the team in the Slack workspace. For example, T0123456789. You can find your team ID in the URL of the main page of your Slack workspace. When you log in to Slack via a browser, you are directed to the URL of the main page. For example, https://app.slack.com/client/T0123456789/--¦. The Amazon Resource Name (ARN) of an Secrets Manager secret that contains the key-value pairs required to connect to your Slack workspace team. The secret must contain a JSON structure with the following keys: slackToken--\u0094The user or bot token created in Slack. For more information on creating a token in Slack, see Authentication for a Slack data source. VpcConfiguration (dict) --- Configuration information for an Amazon Virtual Private Cloud to connect to your Slack. (string) --- Specify whether to index public channels, private channels, group messages, and direct messages. You can specify one or more of these options. (string) --- UseChangeLog (boolean) --- TRUE to use the Slack change log to determine which documents require updating in the index. Depending on the Slack change log's size, it may take longer for Amazon Kendra to use the change log than to scan all of your documents in Slack. CrawlBotMessage (boolean) --- TRUE to index bot messages from your Slack workspace team. ExcludeArchived (boolean) --- TRUE to exclude archived messages to index from your Slack workspace team. The date to start crawling your data from your Slack workspace team. The date must follow this format: yyyy-mm-dd. LookBackPeriod (integer) --- The number of hours for change log to look back from when you last synchronized your data. You can look back up to 7 days or 168 hours. Change log updates your index only if new content was added since you last synced your data. Updated or deleted content from before you last synced does not get updated in your index. To capture updated or deleted content before you last synced, set the LookBackPeriod to the number of hours you want change log to look back. PrivateChannelFilter (list) --- The list of private channel names from your Slack workspace team. You use this if you want to index specific private channels, not all private channels. You can also use regular expression patterns to filter private channels. (string) --- PublicChannelFilter (list) --- The list of public channel names to index from your Slack workspace team. You use this if you want to index specific public channels, not all public channels. You can also use regular expression patterns to filter public channels. (string) --- InclusionPatterns (list) --- A list of regular expression patterns to include certain attached files in your Slack workspace team. (string) --- ExclusionPatterns (list) --- A list of regular expression patterns to exclude certain attached files in your Slack workspace team. (string) --- FieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map Slack data source attributes or field names to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Slack fields. The Slack data source field names must exist in your Slack custom metadata. BoxConfiguration (dict) --- Provides the configuration information to connect to Box as your data source. The identifier of the Box Enterprise platform. You can find the enterprise ID in the Box Developer Console settings or when you create an app in Box and download your authentication credentials. For example, 801234567. The Amazon Resource Name (ARN) of an Secrets Manager secret that contains the key-value pairs required to connect to your Box platform. The secret must contain a JSON structure with the following keys: clientID--\u0094The identifier of the client OAuth 2.0 authentication application created in Box. clientSecret--\u0094A set of characters known only to the OAuth 2.0 authentication application created in Box. publicKeyId--\u0094The identifier of the public key contained within an identity certificate. privateKey--\u0094A set of characters that make up an encryption key. passphrase--\u0094A set of characters that act like a password. You create an application in Box to generate the keys or credentials required for the secret. For more information, see Using a Box data source. UseChangeLog (boolean) --- TRUE to use the Slack change log to determine which documents require updating in the index. Depending on the data source change log's size, it may take longer for Amazon Kendra to use the change log than to scan all of your documents. CrawlComments (boolean) --- TRUE to index comments. CrawlTasks (boolean) --- TRUE to index the contents of tasks. CrawlWebLinks (boolean) --- TRUE to index web links. FileFieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Box files to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Box fields. The Box field names must exist in your Box custom metadata. TaskFieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Box tasks to Amazon Kendra index field names. CommentFieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Box comments to Amazon Kendra index field names. WebLinkFieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Box web links to Amazon Kendra index field names. InclusionPatterns (list) --- A list of regular expression patterns to include certain files and folders in your Box platform. Files and folders that match the patterns are included in the index. Files and folders that don't match the patterns are excluded from the index. If a file or folder matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the file or folder isn't included in the index. (string) --- ExclusionPatterns (list) --- A list of regular expression patterns to exclude certain files and folders from your Box platform. Files and folders that match the patterns are excluded from the index.Files and folders that don't match the patterns are included in the index. (string) --- VpcConfiguration (dict) --- Configuration information for an Amazon VPC to connect to your Box. (string) --- QuipConfiguration (dict) --- Provides the configuration information to connect to Quip as your data source. The Quip site domain. For example, https://quip-company.quipdomain.com/browse. The domain in this example is 'quipdomain'. The Amazon Resource Name (ARN) of an Secrets Manager secret that contains the key-value pairs that are required to connect to your Quip. The secret must contain a JSON structure with the following keys: accessToken--\u0094The token created in Quip. For more information, see Using a Quip data source. CrawlFileComments (boolean) --- TRUE to index file comments. CrawlChatRooms (boolean) --- TRUE to index the contents of chat rooms. CrawlAttachments (boolean) --- TRUE to index attachments. FolderIds (list) --- The identifiers of the Quip folders you want to index. You can find the folder ID in your browser URL when you access your folder in Quip. For example, https://quip-company.quipdomain.com/zlLuOVNSarTL/folder-name. The folder ID in this example is 'zlLuOVNSarTL'. (string) --- ThreadFieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Quip threads to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Quip fields. The Quip field names must exist in your Quip custom metadata. MessageFieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Quip messages to Amazon Kendra index field names. AttachmentFieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Quip attachments to Amazon Kendra index field names. InclusionPatterns (list) --- A list of regular expression patterns to include certain files in your Quip file system. If a file matches both an inclusion pattern and an exclusion pattern, the exclusion pattern takes precedence, and the file isn't included in the index. (string) --- ExclusionPatterns (list) --- A list of regular expression patterns to exclude certain files in your Quip file system. (string) --- VpcConfiguration (dict) --- Configuration information for an Amazon Virtual Private Cloud (VPC) to connect to your Quip. (string) --- JiraConfiguration (dict) --- Provides the configuration information to connect to Jira as your data source. The URL of the Jira account. For example, company.atlassian.net. The Amazon Resource Name (ARN) of a secret in Secrets Manager contains the key-value pairs required to connect to your Jira data source. The secret must contain a JSON structure with the following keys: jiraId--\u0094The Jira user name or email. jiraCredentials--\u0094The Jira API token. For more information, see Using a Jira data source. UseChangeLog (boolean) --- TRUE to use the Jira change log to determine which documents require updating in the index. Depending on the change log's size, it may take longer for Amazon Kendra to use the change log than to scan all of your documents in Jira. Project (list) --- Specify which projects to crawl in your Jira data source. You can specify one or more Jira project IDs. (string) --- IssueType (list) --- Specify which issue types to crawl in your Jira data source. You can specify one or more of these options to crawl. (string) --- Status (list) --- Specify which statuses to crawl in your Jira data source. (string) --- IssueSubEntityFilter (list) --- Specify whether to crawl comments, attachments, and work logs. (string) --- AttachmentFieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Jira attachments to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Jira fields. The Jira data source field names must exist in your Jira custom metadata. CommentFieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Jira comments to Amazon Kendra index field names. IssueFieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Jira issues to Amazon Kendra index field names. ProjectFieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Jira projects to Amazon Kendra index field names. WorkLogFieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Jira work logs to Amazon Kendra index field names. InclusionPatterns (list) --- A list of regular expression patterns to include certain file paths, file names, and file types in your Jira data source. If a file matches both an inclusion pattern and an exclusion pattern, the exclusion pattern takes precedence and the file isn't included in the index. (string) --- ExclusionPatterns (list) --- A list of regular expression patterns to exclude certain file paths, file names, and file types in your Jira data source. (string) --- VpcConfiguration (dict) --- Configuration information for an Amazon Virtual Private Cloud to connect to your Jira. (string) --- GitHubConfiguration (dict) --- Provides the configuration information to connect to GitHub as your data source. SaaSConfiguration (dict) --- Configuration information to connect to GitHub Enterprise Cloud (SaaS). The name of the organization of the GitHub Enterprise Cloud (SaaS) account you want to connect to. You can find your organization name by logging into GitHub desktop and selecting Your organizations under your profile picture dropdown. The GitHub host URL or API endpoint URL. For example, https://api.github.com. OnPremiseConfiguration (dict) --- Configuration information to connect to GitHub Enterprise Server (on premises). For example, https://on-prem-host-url/api/v3/ The name of the organization of the GitHub Enterprise Server (on-premises) account you want to connect to. The path to the SSL certificate stored in an Amazon S3 bucket. You use this to connect to GitHub if you require a secure SSL connection. You can simply generate a self-signed X509 certificate on any computer using OpenSSL. Type (string) --- The type of GitHub service you want to connect to--\u0094GitHub Enterprise Cloud (SaaS) or GitHub Enterprise Server (on premises). The Amazon Resource Name (ARN) of an Secrets Manager secret that contains the key-value pairs required to connect to your GitHub. The secret must contain a JSON structure with the following keys: personalToken--\u0094The access token created in GitHub. For more information on creating a token in GitHub, see Using a GitHub data source. UseChangeLog (boolean) --- TRUE to use the GitHub change log to determine which documents require updating in the index. Depending on the GitHub change log's size, it may take longer for Amazon Kendra to use the change log than to scan all of your documents in GitHub. GitHubDocumentCrawlProperties (dict) --- Configuration information to include certain types of GitHub content. You can configure to index repository files only, or also include issues and pull requests, comments, and comment attachments. CrawlRepositoryDocuments (boolean) --- TRUE to index all files with a repository. CrawlIssue (boolean) --- TRUE to index all issues within a repository. CrawlIssueComment (boolean) --- TRUE to index all comments on issues. CrawlIssueCommentAttachment (boolean) --- TRUE to include all comment attachments for issues. CrawlPullRequest (boolean) --- TRUE to index all pull requests within a repository. CrawlPullRequestComment (boolean) --- TRUE to index all comments on pull requests. CrawlPullRequestCommentAttachment (boolean) --- TRUE to include all comment attachments for pull requests. RepositoryFilter (list) --- A list of names of the specific repositories you want to index. (string) --- InclusionFolderNamePatterns (list) --- A list of regular expression patterns to include certain folder names in your GitHub repository or repositories. Folder names that match the patterns are included in the index. Folder names that don't match the patterns are excluded from the index. If a folder matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the folder isn't included in the index. (string) --- InclusionFileTypePatterns (list) --- A list of regular expression patterns to include certain file types in your GitHub repository or repositories. File types that match the patterns are included in the index. File types that don't match the patterns are excluded from the index. (string) --- InclusionFileNamePatterns (list) --- A list of regular expression patterns to include certain file names in your GitHub repository or repositories. File names that match the patterns are included in the index. File names that don't match the patterns are excluded from the index. (string) --- ExclusionFolderNamePatterns (list) --- A list of regular expression patterns to exclude certain folder names in your GitHub repository or repositories. Folder names that match the patterns are excluded from the index. Folder names that don't match the patterns are included in the index. If a folder matches both an exclusion and inclusion pattern, the exclusion pattern takes precedence and the folder isn't included in the index. (string) --- ExclusionFileTypePatterns (list) --- A list of regular expression patterns to exclude certain file types in your GitHub repository or repositories. File types that match the patterns are excluded from the index. File types that don't match the patterns are included in the index. If a file matches both an exclusion and inclusion pattern, the exclusion pattern takes precedence and the file isn't included in the index. (string) --- ExclusionFileNamePatterns (list) --- A list of regular expression patterns to exclude certain file names in your GitHub repository or repositories. File names that match the patterns are excluded from the index. File names that don't match the patterns are included in the index. (string) --- VpcConfiguration (dict) --- Configuration information of an Amazon Virtual Private Cloud to connect to your GitHub. (string) --- GitHubRepositoryConfigurationFieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map GitHub repository attributes or field names to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to GitHub fields. The GitHub data source field names must exist in your GitHub custom metadata. GitHubCommitConfigurationFieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map attributes or field names of GitHub commits to Amazon Kendra index field names. GitHubIssueDocumentConfigurationFieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map attributes or field names of GitHub issues to Amazon Kendra index field names. GitHubIssueCommentConfigurationFieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map attributes or field names of GitHub issue comments to Amazon Kendra index field names. GitHubIssueAttachmentConfigurationFieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map attributes or field names of GitHub issue attachments to Amazon Kendra index field names. GitHubPullRequestCommentConfigurationFieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map attributes or field names of GitHub pull request comments to Amazon Kendra index field names. GitHubPullRequestDocumentConfigurationFieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map attributes or field names of GitHub pull requests to Amazon Kendra index field names. GitHubPullRequestDocumentAttachmentConfigurationFieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map attributes or field names of GitHub pull request attachments to Amazon Kendra index field names. AlfrescoConfiguration (dict) --- Provides the configuration information to connect to Alfresco as your data source. The URL of the Alfresco site. For example, https://hostname:8080. The identifier of the Alfresco site. For example, my-site. The Amazon Resource Name (ARN) of an Secrets Manager secret that contains the key-value pairs required to connect to your Alfresco data source. The secret must contain a JSON structure with the following keys: username--\u0094The user name of the Alfresco account. password--\u0094The password of the Alfresco account. You use this to connect to Alfresco if you require a secure SSL connection. CrawlSystemFolders (boolean) --- TRUE to index shared files. CrawlComments (boolean) --- TRUE to index comments of blogs and other content. EntityFilter (list) --- Specify whether to index document libraries, wikis, or blogs. (string) --- DocumentLibraryFieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Alfresco document libraries to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Alfresco fields. The Alfresco data source field names must exist in your Alfresco custom metadata. BlogFieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Alfresco blogs to Amazon Kendra index field names. WikiFieldMappings (list) --- A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Alfresco wikis to Amazon Kendra index field names. InclusionPatterns (list) --- A list of regular expression patterns to include certain files in your Alfresco data source. (string) --- ExclusionPatterns (list) --- A list of regular expression patterns to exclude certain files in your Alfresco data source. (string) --- VpcConfiguration (dict) --- Configuration information for an Amazon Virtual Private Cloud to connect to your Alfresco. (string) --- TemplateConfiguration (dict) --- Provides a template for the configuration information to connect to your data source. Template (document) --- The template schema used for the data source, where templates schemas are supported. See Data source template schemas.",
      "nested_params": [
        {
          "name": "S3Configuration",
          "type": "dict",
          "required": false,
          "description": "Provides the configuration information to connect to an Amazon S3 bucket as your data source.",
          "nested_params": [
            {
              "name": "BucketName",
              "type": "string",
              "required": false,
              "description": "The name of the bucket that contains the documents.",
              "nested_params": []
            },
            {
              "name": "InclusionPrefixes",
              "type": "list",
              "required": false,
              "description": "A list of S3 prefixes for the documents that should be included in the index.",
              "nested_params": []
            },
            {
              "name": "InclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of glob patterns (patterns that can expand a wildcard pattern into a list of path names that match the given pattern) for certain file names and file types to include in your index. If a document matches both an inclusion and exclusion prefix or pattern, the exclusion prefix takes precendence and the document is not indexed. Examples of glob patterns include:",
              "nested_params": [
                {
                  "name": "internal",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "/*internal",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ExclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of glob patterns (patterns that can expand a wildcard pattern into a list of path names that match the given pattern) for certain file names and file types to exclude from your index. If a document matches both an inclusion and exclusion prefix or pattern, the exclusion prefix takes precendence and the document is not indexed. Examples of glob patterns include:",
              "nested_params": [
                {
                  "name": "internal",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "/*internal",
                  "type": "",
                  "required": false,
                  "description": "",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "DocumentsMetadataConfiguration",
              "type": "dict",
              "required": false,
              "description": "Document metadata files that contain information such as the document access control information, source URI, document author, and custom attributes. Each metadata file contains metadata about a single document.",
              "nested_params": [
                {
                  "name": "S3Prefix",
                  "type": "string",
                  "required": false,
                  "description": "A prefix used to filter metadata configuration files in the Amazon Web Services S3 bucket. The S3 bucket might contain multiple metadata files. Use S3Prefix to include only the desired metadata files.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "AccessControlListConfiguration",
              "type": "dict",
              "required": false,
              "description": "Provides the path to the S3 bucket that contains the user context filtering files for the data source. For the format of the file, see Access control for S3 data sources.",
              "nested_params": [
                {
                  "name": "KeyPath",
                  "type": "string",
                  "required": false,
                  "description": "Path to the Amazon S3 bucket that contains the ACL files.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "SharePointConfiguration",
          "type": "dict",
          "required": false,
          "description": "Provides the configuration information to connect to Microsoft SharePoint as your data source.",
          "nested_params": [
            {
              "name": "SharePointVersion",
              "type": "string",
              "required": false,
              "description": "The version of Microsoft SharePoint that you use.",
              "nested_params": []
            },
            {
              "name": "Urls",
              "type": "list",
              "required": false,
              "description": "The Microsoft SharePoint site URLs for the documents you want to index.",
              "nested_params": []
            },
            {
              "name": "SecretArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of an Secrets Manager secret that contains the user name and password required to connect to the SharePoint instance. For more information, see Microsoft SharePoint.",
              "nested_params": []
            },
            {
              "name": "CrawlAttachments",
              "type": "boolean",
              "required": false,
              "description": "TRUE to index document attachments.",
              "nested_params": []
            },
            {
              "name": "UseChangeLog",
              "type": "boolean",
              "required": false,
              "description": "TRUE to use the SharePoint change log to determine which documents require updating in the index. Depending on the change log's size, it may take longer for Amazon Kendra to use the change log than to scan all of your documents in SharePoint.",
              "nested_params": []
            },
            {
              "name": "InclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to include certain documents in your SharePoint. Documents that match the patterns are included in the index. Documents that don't match the patterns are excluded from the index. If a document matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the document isn't included in the index. The regex applies to the display URL of the SharePoint document.",
              "nested_params": []
            },
            {
              "name": "ExclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to exclude certain documents in your SharePoint. Documents that match the patterns are excluded from the index. Documents that don't match the patterns are included in the index. If a document matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the document isn't included in the index. The regex applies to the display URL of the SharePoint document.",
              "nested_params": []
            },
            {
              "name": "VpcConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration information for an Amazon Virtual Private Cloud to connect to your Microsoft SharePoint. For more information, see Configuring a VPC.",
              "nested_params": [
                {
                  "name": "SubnetIds",
                  "type": "list",
                  "required": false,
                  "description": "A list of identifiers for subnets within your Amazon VPC. The subnets should be able to connect to each other in the VPC, and they should have outgoing access to the Internet through a NAT device.",
                  "nested_params": []
                },
                {
                  "name": "SecurityGroupIds",
                  "type": "list",
                  "required": false,
                  "description": "A list of identifiers of security groups within your Amazon VPC. The security groups should enable Amazon Kendra to connect to the data source.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "FieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map SharePoint data source attributes or field names to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to SharePoint fields. For more information, see Mapping data source fields. The SharePoint data source field names must exist in your SharePoint custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "DocumentTitleFieldName",
              "type": "string",
              "required": false,
              "description": "The Microsoft SharePoint attribute field that contains the title of the document.",
              "nested_params": []
            },
            {
              "name": "DisableLocalGroups",
              "type": "boolean",
              "required": false,
              "description": "TRUE to disable local groups information.",
              "nested_params": []
            },
            {
              "name": "SslCertificateS3Path",
              "type": "dict",
              "required": false,
              "description": "The path to the SSL certificate stored in an Amazon S3 bucket. You use this to connect to SharePoint Server if you require a secure SSL connection. You can generate a self-signed X509 certificate on any computer using OpenSSL. For an example of using OpenSSL to create an X509 certificate, see Create and sign an X509 certificate.",
              "nested_params": [
                {
                  "name": "Bucket",
                  "type": "string",
                  "required": false,
                  "description": "The name of the S3 bucket that contains the file.",
                  "nested_params": []
                },
                {
                  "name": "Key",
                  "type": "string",
                  "required": false,
                  "description": "The name of the file.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "AuthenticationType",
              "type": "string",
              "required": false,
              "description": "Whether you want to connect to SharePoint Online using basic authentication of user name and password, or OAuth authentication of user name, password, client ID, and client secret, or AD App-only authentication of client secret.",
              "nested_params": []
            },
            {
              "name": "ProxyConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration information to connect to your Microsoft SharePoint site URLs via instance via a web proxy. You can use this option for SharePoint Server. You must provide the website host name and port number. For example, the host name of https://a.example.com/page1.html is 'a.example.com' and the port is 443, the standard port for HTTPS. Web proxy credentials are optional and you can use them to connect to a web proxy server that requires basic authentication of user name and password. To store web proxy credentials, you use a secret in Secrets Manager. It is recommended that you follow best security practices when configuring your web proxy. This includes setting up throttling, setting up logging and monitoring, and applying security patches on a regular basis. If you use your web proxy with multiple data sources, sync jobs that occur at the same time could strain the load on your proxy. It is recommended you prepare your proxy beforehand for any security and load requirements.",
              "nested_params": [
                {
                  "name": "Host",
                  "type": "string",
                  "required": false,
                  "description": "The name of the website host you want to connect to via a web proxy server. For example, the host name of https://a.example.com/page1.html is 'a.example.com'.",
                  "nested_params": []
                },
                {
                  "name": "Port",
                  "type": "integer",
                  "required": false,
                  "description": "The port number of the website host you want to connect to via a web proxy server. For example, the port for https://a.example.com/page1.html is 443, the standard port for HTTPS.",
                  "nested_params": []
                },
                {
                  "name": "Credentials",
                  "type": "string",
                  "required": false,
                  "description": "The Amazon Resource Name (ARN) of an Secrets Manager secret. You create a secret to store your credentials in Secrets Manager The credentials are optional. You use a secret if web proxy credentials are required to connect to a website host. Amazon Kendra currently support basic authentication to connect to a web proxy server. The secret stores your credentials.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "DatabaseConfiguration",
          "type": "dict",
          "required": false,
          "description": "Provides the configuration information to connect to a database as your data source.",
          "nested_params": [
            {
              "name": "DatabaseEngineType",
              "type": "string",
              "required": false,
              "description": "The type of database engine that runs the database.",
              "nested_params": []
            },
            {
              "name": "ConnectionConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration information that's required to connect to a database.",
              "nested_params": [
                {
                  "name": "DatabaseHost",
                  "type": "string",
                  "required": false,
                  "description": "The name of the host for the database. Can be either a string (host.subdomain.domain.tld) or an IPv4 or IPv6 address.",
                  "nested_params": []
                },
                {
                  "name": "DatabasePort",
                  "type": "integer",
                  "required": false,
                  "description": "The port that the database uses for connections.",
                  "nested_params": []
                },
                {
                  "name": "DatabaseName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the database containing the document data.",
                  "nested_params": []
                },
                {
                  "name": "TableName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the table that contains the document data.",
                  "nested_params": []
                },
                {
                  "name": "SecretArn",
                  "type": "string",
                  "required": false,
                  "description": "The Amazon Resource Name (ARN) of an Secrets Manager secret that stores the credentials. The credentials should be a user-password pair. For more information, see Using a Database Data Source. For more information about Secrets Manager, see What Is Secrets Manager in the Secrets Manager user guide.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "VpcConfiguration",
              "type": "dict",
              "required": false,
              "description": "Provides the configuration information to connect to an Amazon VPC.",
              "nested_params": [
                {
                  "name": "SubnetIds",
                  "type": "list",
                  "required": false,
                  "description": "A list of identifiers for subnets within your Amazon VPC. The subnets should be able to connect to each other in the VPC, and they should have outgoing access to the Internet through a NAT device.",
                  "nested_params": []
                },
                {
                  "name": "SecurityGroupIds",
                  "type": "list",
                  "required": false,
                  "description": "A list of identifiers of security groups within your Amazon VPC. The security groups should enable Amazon Kendra to connect to the data source.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ColumnConfiguration",
              "type": "dict",
              "required": false,
              "description": "Information about where the index should get the document information from the database.",
              "nested_params": [
                {
                  "name": "DocumentIdColumnName",
                  "type": "string",
                  "required": false,
                  "description": "The column that provides the document's identifier.",
                  "nested_params": []
                },
                {
                  "name": "DocumentDataColumnName",
                  "type": "string",
                  "required": false,
                  "description": "The column that contains the contents of the document.",
                  "nested_params": []
                },
                {
                  "name": "DocumentTitleColumnName",
                  "type": "string",
                  "required": false,
                  "description": "The column that contains the title of the document.",
                  "nested_params": []
                },
                {
                  "name": "FieldMappings",
                  "type": "list",
                  "required": false,
                  "description": "An array of objects that map database column names to the corresponding fields in an index. You must first create the fields in the index using the UpdateIndex API.",
                  "nested_params": [
                    {
                      "name": "DataSourceFieldName",
                      "type": "string",
                      "required": false,
                      "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                      "nested_params": []
                    },
                    {
                      "name": "DateFieldFormat",
                      "type": "string",
                      "required": false,
                      "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                      "nested_params": []
                    },
                    {
                      "name": "IndexFieldName",
                      "type": "string",
                      "required": false,
                      "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "ChangeDetectingColumns",
                  "type": "list",
                  "required": false,
                  "description": "One to five columns that indicate when a document in the database has changed.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "AclConfiguration",
              "type": "dict",
              "required": false,
              "description": "Information about the database column that provides information for user context filtering.",
              "nested_params": [
                {
                  "name": "AllowedGroupsColumnName",
                  "type": "string",
                  "required": false,
                  "description": "A list of groups, separated by semi-colons, that filters a query response based on user context. The document is only returned to users that are in one of the groups specified in the UserContext field of the Query API.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "SqlConfiguration",
              "type": "dict",
              "required": false,
              "description": "Provides information about how Amazon Kendra uses quote marks around SQL identifiers when querying a database data source.",
              "nested_params": [
                {
                  "name": "QueryIdentifiersEnclosingOption",
                  "type": "string",
                  "required": false,
                  "description": "Determines whether Amazon Kendra encloses SQL identifiers for tables and column names in double quotes (') when making a database query. By default, Amazon Kendra passes SQL identifiers the way that they are entered into the data source configuration. It does not change the case of identifiers or enclose them in quotes. PostgreSQL internally converts uppercase characters to lower case characters in identifiers unless they are quoted. Choosing this option encloses identifiers in quotes so that PostgreSQL does not convert the character's case. For MySQL databases, you must enable the ansi_quotes option when you set this field to DOUBLE_QUOTES.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "SalesforceConfiguration",
          "type": "dict",
          "required": false,
          "description": "Provides the configuration information to connect to Salesforce as your data source.",
          "nested_params": [
            {
              "name": "ServerUrl",
              "type": "string",
              "required": false,
              "description": "The instance URL for the Salesforce site that you want to index.",
              "nested_params": []
            },
            {
              "name": "SecretArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of an Secrets Managersecret that contains the key/value pairs required to connect to your Salesforce instance. The secret must contain a JSON structure with the following keys:",
              "nested_params": []
            },
            {
              "name": "StandardObjectConfigurations",
              "type": "list",
              "required": false,
              "description": "Configuration of the Salesforce standard objects that Amazon Kendra indexes.",
              "nested_params": [
                {
                  "name": "Name",
                  "type": "string",
                  "required": false,
                  "description": "The name of the standard object.",
                  "nested_params": []
                },
                {
                  "name": "DocumentDataFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the standard object table that contains the document contents.",
                  "nested_params": []
                },
                {
                  "name": "DocumentTitleFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the standard object table that contains the document title.",
                  "nested_params": []
                },
                {
                  "name": "FieldMappings",
                  "type": "list",
                  "required": false,
                  "description": "Maps attributes or field names of the standard object to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Salesforce fields. For more information, see Mapping data source fields. The Salesforce data source field names must exist in your Salesforce custom metadata.",
                  "nested_params": [
                    {
                      "name": "DataSourceFieldName",
                      "type": "string",
                      "required": false,
                      "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                      "nested_params": []
                    },
                    {
                      "name": "DateFieldFormat",
                      "type": "string",
                      "required": false,
                      "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                      "nested_params": []
                    },
                    {
                      "name": "IndexFieldName",
                      "type": "string",
                      "required": false,
                      "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "KnowledgeArticleConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration information for the knowledge article types that Amazon Kendra indexes. Amazon Kendra indexes standard knowledge articles and the standard fields of knowledge articles, or the custom fields of custom knowledge articles, but not both.",
              "nested_params": [
                {
                  "name": "IncludedStates",
                  "type": "list",
                  "required": false,
                  "description": "Specifies the document states that should be included when Amazon Kendra indexes knowledge articles. You must specify at least one state.",
                  "nested_params": []
                },
                {
                  "name": "StandardKnowledgeArticleTypeConfiguration",
                  "type": "dict",
                  "required": false,
                  "description": "Configuration information for standard Salesforce knowledge articles.",
                  "nested_params": [
                    {
                      "name": "DocumentDataFieldName",
                      "type": "string",
                      "required": false,
                      "description": "The name of the field that contains the document data to index.",
                      "nested_params": []
                    },
                    {
                      "name": "DocumentTitleFieldName",
                      "type": "string",
                      "required": false,
                      "description": "The name of the field that contains the document title.",
                      "nested_params": []
                    },
                    {
                      "name": "FieldMappings",
                      "type": "list",
                      "required": false,
                      "description": "Maps attributes or field names of the knowledge article to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Salesforce fields. For more information, see Mapping data source fields. The Salesforce data source field names must exist in your Salesforce custom metadata.",
                      "nested_params": [
                        {
                          "name": "DataSourceFieldName",
                          "type": "string",
                          "required": false,
                          "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                          "nested_params": []
                        },
                        {
                          "name": "DateFieldFormat",
                          "type": "string",
                          "required": false,
                          "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                          "nested_params": []
                        },
                        {
                          "name": "IndexFieldName",
                          "type": "string",
                          "required": false,
                          "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "CustomKnowledgeArticleTypeConfigurations",
                  "type": "list",
                  "required": false,
                  "description": "Configuration information for custom Salesforce knowledge articles.",
                  "nested_params": [
                    {
                      "name": "Name",
                      "type": "string",
                      "required": false,
                      "description": "The name of the configuration.",
                      "nested_params": []
                    },
                    {
                      "name": "DocumentDataFieldName",
                      "type": "string",
                      "required": false,
                      "description": "The name of the field in the custom knowledge article that contains the document data to index.",
                      "nested_params": []
                    },
                    {
                      "name": "DocumentTitleFieldName",
                      "type": "string",
                      "required": false,
                      "description": "The name of the field in the custom knowledge article that contains the document title.",
                      "nested_params": []
                    },
                    {
                      "name": "FieldMappings",
                      "type": "list",
                      "required": false,
                      "description": "Maps attributes or field names of the custom knowledge article to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Salesforce fields. For more information, see Mapping data source fields. The Salesforce data source field names must exist in your Salesforce custom metadata.",
                      "nested_params": [
                        {
                          "name": "DataSourceFieldName",
                          "type": "string",
                          "required": false,
                          "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                          "nested_params": []
                        },
                        {
                          "name": "DateFieldFormat",
                          "type": "string",
                          "required": false,
                          "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                          "nested_params": []
                        },
                        {
                          "name": "IndexFieldName",
                          "type": "string",
                          "required": false,
                          "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "ChatterFeedConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration information for Salesforce chatter feeds.",
              "nested_params": [
                {
                  "name": "DocumentDataFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the column in the Salesforce FeedItem table that contains the content to index. Typically this is the Body column.",
                  "nested_params": []
                },
                {
                  "name": "DocumentTitleFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the column in the Salesforce FeedItem table that contains the title of the document. This is typically the Title column.",
                  "nested_params": []
                },
                {
                  "name": "FieldMappings",
                  "type": "list",
                  "required": false,
                  "description": "Maps fields from a Salesforce chatter feed into Amazon Kendra index fields.",
                  "nested_params": [
                    {
                      "name": "DataSourceFieldName",
                      "type": "string",
                      "required": false,
                      "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                      "nested_params": []
                    },
                    {
                      "name": "DateFieldFormat",
                      "type": "string",
                      "required": false,
                      "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                      "nested_params": []
                    },
                    {
                      "name": "IndexFieldName",
                      "type": "string",
                      "required": false,
                      "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "IncludeFilterTypes",
                  "type": "list",
                  "required": false,
                  "description": "Filters the documents in the feed based on status of the user. When you specify ACTIVE_USERS only documents from users who have an active account are indexed. When you specify STANDARD_USER only documents for Salesforce standard users are documented. You can specify both.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "CrawlAttachments",
              "type": "boolean",
              "required": false,
              "description": "Indicates whether Amazon Kendra should index attachments to Salesforce objects.",
              "nested_params": []
            },
            {
              "name": "StandardObjectAttachmentConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration information for processing attachments to Salesforce standard objects.",
              "nested_params": [
                {
                  "name": "DocumentTitleFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field used for the document title.",
                  "nested_params": []
                },
                {
                  "name": "FieldMappings",
                  "type": "list",
                  "required": false,
                  "description": "One or more objects that map fields in attachments to Amazon Kendra index fields.",
                  "nested_params": [
                    {
                      "name": "DataSourceFieldName",
                      "type": "string",
                      "required": false,
                      "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                      "nested_params": []
                    },
                    {
                      "name": "DateFieldFormat",
                      "type": "string",
                      "required": false,
                      "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                      "nested_params": []
                    },
                    {
                      "name": "IndexFieldName",
                      "type": "string",
                      "required": false,
                      "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "IncludeAttachmentFilePatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to include certain documents in your Salesforce. Documents that match the patterns are included in the index. Documents that don't match the patterns are excluded from the index. If a document matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the document isn't included in the index. The pattern is applied to the name of the attached file.",
              "nested_params": []
            },
            {
              "name": "ExcludeAttachmentFilePatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to exclude certain documents in your Salesforce. Documents that match the patterns are excluded from the index. Documents that don't match the patterns are included in the index. If a document matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the document isn't included in the index. The pattern is applied to the name of the attached file.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "OneDriveConfiguration",
          "type": "dict",
          "required": false,
          "description": "Provides the configuration information to connect to Microsoft OneDrive as your data source.",
          "nested_params": [
            {
              "name": "TenantDomain",
              "type": "string",
              "required": false,
              "description": "The Azure Active Directory domain of the organization.",
              "nested_params": []
            },
            {
              "name": "SecretArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of an Secrets Managersecret that contains the user name and password to connect to OneDrive. The user name should be the application ID for the OneDrive application, and the password is the application key for the OneDrive application.",
              "nested_params": []
            },
            {
              "name": "OneDriveUsers",
              "type": "dict",
              "required": false,
              "description": "A list of user accounts whose documents should be indexed.",
              "nested_params": [
                {
                  "name": "OneDriveUserList",
                  "type": "list",
                  "required": false,
                  "description": "A list of users whose documents should be indexed. Specify the user names in email format, for example, username@tenantdomain. If you need to index the documents of more than 10 users, use the OneDriveUserS3Path field to specify the location of a file containing a list of users.",
                  "nested_params": []
                },
                {
                  "name": "OneDriveUserS3Path",
                  "type": "dict",
                  "required": false,
                  "description": "The S3 bucket location of a file containing a list of users whose documents should be indexed.",
                  "nested_params": [
                    {
                      "name": "Bucket",
                      "type": "string",
                      "required": false,
                      "description": "The name of the S3 bucket that contains the file.",
                      "nested_params": []
                    },
                    {
                      "name": "Key",
                      "type": "string",
                      "required": false,
                      "description": "The name of the file.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "InclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to include certain documents in your OneDrive. Documents that match the patterns are included in the index. Documents that don't match the patterns are excluded from the index. If a document matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the document isn't included in the index. The pattern is applied to the file name.",
              "nested_params": []
            },
            {
              "name": "ExclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to exclude certain documents in your OneDrive. Documents that match the patterns are excluded from the index. Documents that don't match the patterns are included in the index. If a document matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the document isn't included in the index. The pattern is applied to the file name.",
              "nested_params": []
            },
            {
              "name": "FieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map OneDrive data source attributes or field names to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to OneDrive fields. For more information, see Mapping data source fields. The OneDrive data source field names must exist in your OneDrive custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "DisableLocalGroups",
              "type": "boolean",
              "required": false,
              "description": "TRUE to disable local groups information.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ServiceNowConfiguration",
          "type": "dict",
          "required": false,
          "description": "Provides the configuration information to connect to ServiceNow as your data source.",
          "nested_params": [
            {
              "name": "HostUrl",
              "type": "string",
              "required": false,
              "description": "The ServiceNow instance that the data source connects to. The host endpoint should look like the following: {instance}.service-now.com.",
              "nested_params": []
            },
            {
              "name": "SecretArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of the Secrets Manager secret that contains the user name and password required to connect to the ServiceNow instance. You can also provide OAuth authentication credentials of user name, password, client ID, and client secret. For more information, see Using a ServiceNow data source.",
              "nested_params": []
            },
            {
              "name": "ServiceNowBuildVersion",
              "type": "string",
              "required": false,
              "description": "The identifier of the release that the ServiceNow host is running. If the host is not running the LONDON release, use OTHERS.",
              "nested_params": []
            },
            {
              "name": "KnowledgeArticleConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration information for crawling knowledge articles in the ServiceNow site.",
              "nested_params": [
                {
                  "name": "CrawlAttachments",
                  "type": "boolean",
                  "required": false,
                  "description": "TRUE to index attachments to knowledge articles.",
                  "nested_params": []
                },
                {
                  "name": "IncludeAttachmentFilePatterns",
                  "type": "list",
                  "required": false,
                  "description": "A list of regular expression patterns applied to include knowledge article attachments. Attachments that match the patterns are included in the index. Items that don't match the patterns are excluded from the index. If an item matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the item isn't included in the index.",
                  "nested_params": []
                },
                {
                  "name": "ExcludeAttachmentFilePatterns",
                  "type": "list",
                  "required": false,
                  "description": "A list of regular expression patterns applied to exclude certain knowledge article attachments. Attachments that match the patterns are excluded from the index. Items that don't match the patterns are included in the index. If an item matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the item isn't included in the index.",
                  "nested_params": []
                },
                {
                  "name": "DocumentDataFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the ServiceNow field that is mapped to the index document contents field in the Amazon Kendra index.",
                  "nested_params": []
                },
                {
                  "name": "DocumentTitleFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the ServiceNow field that is mapped to the index document title field.",
                  "nested_params": []
                },
                {
                  "name": "FieldMappings",
                  "type": "list",
                  "required": false,
                  "description": "Maps attributes or field names of knoweldge articles to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to ServiceNow fields. For more information, see Mapping data source fields. The ServiceNow data source field names must exist in your ServiceNow custom metadata.",
                  "nested_params": [
                    {
                      "name": "DataSourceFieldName",
                      "type": "string",
                      "required": false,
                      "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                      "nested_params": []
                    },
                    {
                      "name": "DateFieldFormat",
                      "type": "string",
                      "required": false,
                      "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                      "nested_params": []
                    },
                    {
                      "name": "IndexFieldName",
                      "type": "string",
                      "required": false,
                      "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "FilterQuery",
                  "type": "string",
                  "required": false,
                  "description": "A query that selects the knowledge articles to index. The query can return articles from multiple knowledge bases, and the knowledge bases can be public or private. The query string must be one generated by the ServiceNow console. For more information, see Specifying documents to index with a query.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ServiceCatalogConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration information for crawling service catalogs in the ServiceNow site.",
              "nested_params": [
                {
                  "name": "CrawlAttachments",
                  "type": "boolean",
                  "required": false,
                  "description": "TRUE to index attachments to service catalog items.",
                  "nested_params": []
                },
                {
                  "name": "IncludeAttachmentFilePatterns",
                  "type": "list",
                  "required": false,
                  "description": "A list of regular expression patterns to include certain attachments of catalogs in your ServiceNow. Item that match the patterns are included in the index. Items that don't match the patterns are excluded from the index. If an item matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the item isn't included in the index. The regex is applied to the file name of the attachment.",
                  "nested_params": []
                },
                {
                  "name": "ExcludeAttachmentFilePatterns",
                  "type": "list",
                  "required": false,
                  "description": "A list of regular expression patterns to exclude certain attachments of catalogs in your ServiceNow. Item that match the patterns are excluded from the index. Items that don't match the patterns are included in the index. If an item matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the item isn't included in the index. The regex is applied to the file name of the attachment.",
                  "nested_params": []
                },
                {
                  "name": "DocumentDataFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the ServiceNow field that is mapped to the index document contents field in the Amazon Kendra index.",
                  "nested_params": []
                },
                {
                  "name": "DocumentTitleFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the ServiceNow field that is mapped to the index document title field.",
                  "nested_params": []
                },
                {
                  "name": "FieldMappings",
                  "type": "list",
                  "required": false,
                  "description": "Maps attributes or field names of catalogs to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to ServiceNow fields. For more information, see Mapping data source fields. The ServiceNow data source field names must exist in your ServiceNow custom metadata.",
                  "nested_params": [
                    {
                      "name": "DataSourceFieldName",
                      "type": "string",
                      "required": false,
                      "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                      "nested_params": []
                    },
                    {
                      "name": "DateFieldFormat",
                      "type": "string",
                      "required": false,
                      "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                      "nested_params": []
                    },
                    {
                      "name": "IndexFieldName",
                      "type": "string",
                      "required": false,
                      "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "AuthenticationType",
              "type": "string",
              "required": false,
              "description": "The type of authentication used to connect to the ServiceNow instance. If you choose HTTP_BASIC, Amazon Kendra is authenticated using the user name and password provided in the Secrets Manager secret in the SecretArn field. If you choose OAUTH2, Amazon Kendra is authenticated using the credentials of client ID, client secret, user name and password. When you use OAUTH2 authentication, you must generate a token and a client secret using the ServiceNow console. For more information, see Using a ServiceNow data source.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ConfluenceConfiguration",
          "type": "dict",
          "required": false,
          "description": "Provides the configuration information to connect to Confluence as your data source.",
          "nested_params": [
            {
              "name": "ServerUrl",
              "type": "string",
              "required": false,
              "description": "The URL of your Confluence instance. Use the full URL of the server. For example, https://server.example.com:port/. You can also use an IP address, for example, https://192.168.1.113/.",
              "nested_params": []
            },
            {
              "name": "SecretArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of an Secrets Manager secret that contains the user name and password required to connect to the Confluence instance. If you use Confluence Cloud, you use a generated API token as the password. You can also provide authentication credentials in the form of a personal access token. For more information, see Using a Confluence data source.",
              "nested_params": []
            },
            {
              "name": "Version",
              "type": "string",
              "required": false,
              "description": "The version or the type of Confluence installation to connect to.",
              "nested_params": []
            },
            {
              "name": "SpaceConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration information for indexing Confluence spaces.",
              "nested_params": [
                {
                  "name": "CrawlPersonalSpaces",
                  "type": "boolean",
                  "required": false,
                  "description": "TRUE to index personal spaces. You can add restrictions to items in personal spaces. If personal spaces are indexed, queries without user context information may return restricted items from a personal space in their results. For more information, see Filtering on user context.",
                  "nested_params": []
                },
                {
                  "name": "CrawlArchivedSpaces",
                  "type": "boolean",
                  "required": false,
                  "description": "TRUE to index archived spaces.",
                  "nested_params": []
                },
                {
                  "name": "IncludeSpaces",
                  "type": "list",
                  "required": false,
                  "description": "A list of space keys for Confluence spaces. If you include a key, the blogs, documents, and attachments in the space are indexed. Spaces that aren't in the list aren't indexed. A space in the list must exist. Otherwise, Amazon Kendra logs an error when the data source is synchronized. If a space is in both the IncludeSpaces and the ExcludeSpaces list, the space is excluded.",
                  "nested_params": []
                },
                {
                  "name": "ExcludeSpaces",
                  "type": "list",
                  "required": false,
                  "description": "A list of space keys of Confluence spaces. If you include a key, the blogs, documents, and attachments in the space are not indexed. If a space is in both the ExcludeSpaces and the IncludeSpaces list, the space is excluded.",
                  "nested_params": []
                },
                {
                  "name": "SpaceFieldMappings",
                  "type": "list",
                  "required": false,
                  "description": "Maps attributes or field names of Confluence spaces to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Confluence fields. For more information, see Mapping data source fields. The Confluence data source field names must exist in your Confluence custom metadata. If you specify the SpaceFieldMappings parameter, you must specify at least one field mapping.",
                  "nested_params": [
                    {
                      "name": "DataSourceFieldName",
                      "type": "string",
                      "required": false,
                      "description": "The name of the field in the data source.",
                      "nested_params": []
                    },
                    {
                      "name": "DateFieldFormat",
                      "type": "string",
                      "required": false,
                      "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field you must specify the date format. If the field is not a date field, an exception is thrown.",
                      "nested_params": []
                    },
                    {
                      "name": "IndexFieldName",
                      "type": "string",
                      "required": false,
                      "description": "The name of the index field to map to the Confluence data source field. The index field type must match the Confluence field type.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "PageConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration information for indexing Confluence pages.",
              "nested_params": [
                {
                  "name": "PageFieldMappings",
                  "type": "list",
                  "required": false,
                  "description": "Maps attributes or field names of Confluence pages to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Confluence fields. For more information, see Mapping data source fields. The Confluence data source field names must exist in your Confluence custom metadata. If you specify the PageFieldMappings parameter, you must specify at least one field mapping.",
                  "nested_params": [
                    {
                      "name": "DataSourceFieldName",
                      "type": "string",
                      "required": false,
                      "description": "The name of the field in the data source.",
                      "nested_params": []
                    },
                    {
                      "name": "DateFieldFormat",
                      "type": "string",
                      "required": false,
                      "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field you must specify the date format. If the field is not a date field, an exception is thrown.",
                      "nested_params": []
                    },
                    {
                      "name": "IndexFieldName",
                      "type": "string",
                      "required": false,
                      "description": "The name of the index field to map to the Confluence data source field. The index field type must match the Confluence field type.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "BlogConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration information for indexing Confluence blogs.",
              "nested_params": [
                {
                  "name": "BlogFieldMappings",
                  "type": "list",
                  "required": false,
                  "description": "Maps attributes or field names of Confluence blogs to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Confluence fields. For more information, see Mapping data source fields. The Confluence data source field names must exist in your Confluence custom metadata. If you specify the BlogFieldMappings parameter, you must specify at least one field mapping.",
                  "nested_params": [
                    {
                      "name": "DataSourceFieldName",
                      "type": "string",
                      "required": false,
                      "description": "The name of the field in the data source.",
                      "nested_params": []
                    },
                    {
                      "name": "DateFieldFormat",
                      "type": "string",
                      "required": false,
                      "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field you must specify the date format. If the field is not a date field, an exception is thrown.",
                      "nested_params": []
                    },
                    {
                      "name": "IndexFieldName",
                      "type": "string",
                      "required": false,
                      "description": "The name of the index field to map to the Confluence data source field. The index field type must match the Confluence field type.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "AttachmentConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration information for indexing attachments to Confluence blogs and pages.",
              "nested_params": [
                {
                  "name": "CrawlAttachments",
                  "type": "boolean",
                  "required": false,
                  "description": "TRUE to index attachments of pages and blogs in Confluence.",
                  "nested_params": []
                },
                {
                  "name": "AttachmentFieldMappings",
                  "type": "list",
                  "required": false,
                  "description": "Maps attributes or field names of Confluence attachments to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Confluence fields. For more information, see Mapping data source fields. The Confluence data source field names must exist in your Confluence custom metadata. If you specify the AttachentFieldMappings parameter, you must specify at least one field mapping.",
                  "nested_params": [
                    {
                      "name": "DataSourceFieldName",
                      "type": "string",
                      "required": false,
                      "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                      "nested_params": []
                    },
                    {
                      "name": "DateFieldFormat",
                      "type": "string",
                      "required": false,
                      "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field you must specify the date format. If the field is not a date field, an exception is thrown.",
                      "nested_params": []
                    },
                    {
                      "name": "IndexFieldName",
                      "type": "string",
                      "required": false,
                      "description": "The name of the index field to map to the Confluence data source field. The index field type must match the Confluence field type.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "VpcConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration information for an Amazon Virtual Private Cloud to connect to your Confluence. For more information, see Configuring a VPC.",
              "nested_params": [
                {
                  "name": "SubnetIds",
                  "type": "list",
                  "required": false,
                  "description": "A list of identifiers for subnets within your Amazon VPC. The subnets should be able to connect to each other in the VPC, and they should have outgoing access to the Internet through a NAT device.",
                  "nested_params": []
                },
                {
                  "name": "SecurityGroupIds",
                  "type": "list",
                  "required": false,
                  "description": "A list of identifiers of security groups within your Amazon VPC. The security groups should enable Amazon Kendra to connect to the data source.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "InclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to include certain blog posts, pages, spaces, or attachments in your Confluence. Content that matches the patterns are included in the index. Content that doesn't match the patterns is excluded from the index. If content matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the content isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "ExclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to exclude certain blog posts, pages, spaces, or attachments in your Confluence. Content that matches the patterns are excluded from the index. Content that doesn't match the patterns is included in the index. If content matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the content isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "ProxyConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration information to connect to your Confluence URL instance via a web proxy. You can use this option for Confluence Server. You must provide the website host name and port number. For example, the host name of https://a.example.com/page1.html is 'a.example.com' and the port is 443, the standard port for HTTPS. Web proxy credentials are optional and you can use them to connect to a web proxy server that requires basic authentication of user name and password. To store web proxy credentials, you use a secret in Secrets Manager. It is recommended that you follow best security practices when configuring your web proxy. This includes setting up throttling, setting up logging and monitoring, and applying security patches on a regular basis. If you use your web proxy with multiple data sources, sync jobs that occur at the same time could strain the load on your proxy. It is recommended you prepare your proxy beforehand for any security and load requirements.",
              "nested_params": [
                {
                  "name": "Host",
                  "type": "string",
                  "required": false,
                  "description": "The name of the website host you want to connect to via a web proxy server. For example, the host name of https://a.example.com/page1.html is 'a.example.com'.",
                  "nested_params": []
                },
                {
                  "name": "Port",
                  "type": "integer",
                  "required": false,
                  "description": "The port number of the website host you want to connect to via a web proxy server. For example, the port for https://a.example.com/page1.html is 443, the standard port for HTTPS.",
                  "nested_params": []
                },
                {
                  "name": "Credentials",
                  "type": "string",
                  "required": false,
                  "description": "The Amazon Resource Name (ARN) of an Secrets Manager secret. You create a secret to store your credentials in Secrets Manager The credentials are optional. You use a secret if web proxy credentials are required to connect to a website host. Amazon Kendra currently support basic authentication to connect to a web proxy server. The secret stores your credentials.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "AuthenticationType",
              "type": "string",
              "required": false,
              "description": "Whether you want to connect to Confluence using basic authentication of user name and password, or a personal access token. You can use a personal access token for Confluence Server.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "GoogleDriveConfiguration",
          "type": "dict",
          "required": false,
          "description": "Provides the configuration information to connect to Google Drive as your data source.",
          "nested_params": [
            {
              "name": "SecretArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of a Secrets Managersecret that contains the credentials required to connect to Google Drive. For more information, see Using a Google Workspace Drive data source.",
              "nested_params": []
            },
            {
              "name": "InclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to include certain items in your Google Drive, including shared drives and users' My Drives. Items that match the patterns are included in the index. Items that don't match the patterns are excluded from the index. If an item matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the item isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "ExclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to exclude certain items in your Google Drive, including shared drives and users' My Drives. Items that match the patterns are excluded from the index. Items that don't match the patterns are included in the index. If an item matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the item isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "FieldMappings",
              "type": "list",
              "required": false,
              "description": "Maps Google Drive data source attributes or field names to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Google Drive fields. For more information, see Mapping data source fields. The Google Drive data source field names must exist in your Google Drive custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ExcludeMimeTypes",
              "type": "list",
              "required": false,
              "description": "A list of MIME types to exclude from the index. All documents matching the specified MIME type are excluded. For a list of MIME types, see Using a Google Workspace Drive data source.",
              "nested_params": []
            },
            {
              "name": "ExcludeUserAccounts",
              "type": "list",
              "required": false,
              "description": "A list of email addresses of the users. Documents owned by these users are excluded from the index. Documents shared with excluded users are indexed unless they are excluded in another way.",
              "nested_params": []
            },
            {
              "name": "ExcludeSharedDrives",
              "type": "list",
              "required": false,
              "description": "A list of identifiers or shared drives to exclude from the index. All files and folders stored on the shared drive are excluded.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "WebCrawlerConfiguration",
          "type": "dict",
          "required": false,
          "description": "Provides the configuration information required for Amazon Kendra Web Crawler.",
          "nested_params": [
            {
              "name": "Urls",
              "type": "dict",
              "required": false,
              "description": "Specifies the seed or starting point URLs of the websites or the sitemap URLs of the websites you want to crawl. You can include website subdomains. You can list up to 100 seed URLs and up to three sitemap URLs. You can only crawl websites that use the secure communication protocol, Hypertext Transfer Protocol Secure (HTTPS). If you receive an error when crawling a website, it could be that the website is blocked from crawling. When selecting websites to index, you must adhere to the Amazon Acceptable Use Policy and all other Amazon terms. Remember that you must only use Amazon Kendra Web Crawler to index your own web pages, or web pages that you have authorization to index.",
              "nested_params": [
                {
                  "name": "SeedUrlConfiguration",
                  "type": "dict",
                  "required": false,
                  "description": "Configuration of the seed or starting point URLs of the websites you want to crawl. You can choose to crawl only the website host names, or the website host names with subdomains, or the website host names with subdomains and other domains that the web pages link to. You can list up to 100 seed URLs.",
                  "nested_params": [
                    {
                      "name": "SeedUrls",
                      "type": "list",
                      "required": false,
                      "description": "The list of seed or starting point URLs of the websites you want to crawl. The list can include a maximum of 100 seed URLs.",
                      "nested_params": []
                    },
                    {
                      "name": "WebCrawlerMode",
                      "type": "string",
                      "required": false,
                      "description": "You can choose one of the following modes:",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "SiteMapsConfiguration",
                  "type": "dict",
                  "required": false,
                  "description": "Configuration of the sitemap URLs of the websites you want to crawl. Only URLs belonging to the same website host names are crawled. You can list up to three sitemap URLs.",
                  "nested_params": [
                    {
                      "name": "SiteMaps",
                      "type": "list",
                      "required": false,
                      "description": "The list of sitemap URLs of the websites you want to crawl. The list can include a maximum of three sitemap URLs.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "CrawlDepth",
              "type": "integer",
              "required": false,
              "description": "The --\u0098depth' or number of levels from the seed level to crawl. For example, the seed URL page is depth 1 and any hyperlinks on this page that are also crawled are depth 2.",
              "nested_params": []
            },
            {
              "name": "MaxLinksPerPage",
              "type": "integer",
              "required": false,
              "description": "The maximum number of URLs on a web page to include when crawling a website. This number is per web page. As a website's web pages are crawled, any URLs the web pages link to are also crawled. URLs on a web page are crawled in order of appearance. The default maximum links per page is 100.",
              "nested_params": []
            },
            {
              "name": "MaxContentSizePerPageInMegaBytes",
              "type": "float",
              "required": false,
              "description": "The maximum size (in MB) of a web page or attachment to crawl. Files larger than this size (in MB) are skipped/not crawled. The default maximum size of a web page or attachment is set to 50 MB.",
              "nested_params": []
            },
            {
              "name": "MaxUrlsPerMinuteCrawlRate",
              "type": "integer",
              "required": false,
              "description": "The maximum number of URLs crawled per website host per minute. A minimum of one URL is required. The default maximum number of URLs crawled per website host per minute is 300.",
              "nested_params": []
            },
            {
              "name": "UrlInclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to include certain URLs to crawl. URLs that match the patterns are included in the index. URLs that don't match the patterns are excluded from the index. If a URL matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the URL file isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "UrlExclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to exclude certain URLs to crawl. URLs that match the patterns are excluded from the index. URLs that don't match the patterns are included in the index. If a URL matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the URL file isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "ProxyConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration information required to connect to your internal websites via a web proxy. You must provide the website host name and port number. For example, the host name of https://a.example.com/page1.html is 'a.example.com' and the port is 443, the standard port for HTTPS. Web proxy credentials are optional and you can use them to connect to a web proxy server that requires basic authentication. To store web proxy credentials, you use a secret in Secrets Manager.",
              "nested_params": [
                {
                  "name": "Host",
                  "type": "string",
                  "required": false,
                  "description": "The name of the website host you want to connect to via a web proxy server. For example, the host name of https://a.example.com/page1.html is 'a.example.com'.",
                  "nested_params": []
                },
                {
                  "name": "Port",
                  "type": "integer",
                  "required": false,
                  "description": "The port number of the website host you want to connect to via a web proxy server. For example, the port for https://a.example.com/page1.html is 443, the standard port for HTTPS.",
                  "nested_params": []
                },
                {
                  "name": "Credentials",
                  "type": "string",
                  "required": false,
                  "description": "The Amazon Resource Name (ARN) of an Secrets Manager secret. You create a secret to store your credentials in Secrets Manager The credentials are optional. You use a secret if web proxy credentials are required to connect to a website host. Amazon Kendra currently support basic authentication to connect to a web proxy server. The secret stores your credentials.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "AuthenticationConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration information required to connect to websites using authentication. You can connect to websites using basic authentication of user name and password. You use a secret in Secrets Manager to store your authentication credentials. You must provide the website host name and port number. For example, the host name of https://a.example.com/page1.html is 'a.example.com' and the port is 443, the standard port for HTTPS.",
              "nested_params": [
                {
                  "name": "BasicAuthentication",
                  "type": "list",
                  "required": false,
                  "description": "The list of configuration information that's required to connect to and crawl a website host using basic authentication credentials. The list includes the name and port number of the website host.",
                  "nested_params": [
                    {
                      "name": "Host",
                      "type": "string",
                      "required": false,
                      "description": "The name of the website host you want to connect to using authentication credentials. For example, the host name of https://a.example.com/page1.html is 'a.example.com'.",
                      "nested_params": []
                    },
                    {
                      "name": "Port",
                      "type": "integer",
                      "required": false,
                      "description": "The port number of the website host you want to connect to using authentication credentials. For example, the port for https://a.example.com/page1.html is 443, the standard port for HTTPS.",
                      "nested_params": []
                    },
                    {
                      "name": "Credentials",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Resource Name (ARN) of an Secrets Manager secret. You create a secret to store your credentials in Secrets Manager You use a secret if basic authentication credentials are required to connect to a website. The secret stores your credentials of user name and password.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "WorkDocsConfiguration",
          "type": "dict",
          "required": false,
          "description": "Provides the configuration information to connect to Amazon WorkDocs as your data source.",
          "nested_params": [
            {
              "name": "OrganizationId",
              "type": "string",
              "required": false,
              "description": "The identifier of the directory corresponding to your Amazon WorkDocs site repository.",
              "nested_params": []
            },
            {
              "name": "CrawlComments",
              "type": "boolean",
              "required": false,
              "description": "TRUE to include comments on documents in your index. Including comments in your index means each comment is a document that can be searched on. The default is set to FALSE.",
              "nested_params": []
            },
            {
              "name": "UseChangeLog",
              "type": "boolean",
              "required": false,
              "description": "TRUE to use the Amazon WorkDocs change log to determine which documents require updating in the index. Depending on the change log's size, it may take longer for Amazon Kendra to use the change log than to scan all of your documents in Amazon WorkDocs.",
              "nested_params": []
            },
            {
              "name": "InclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to include certain files in your Amazon WorkDocs site repository. Files that match the patterns are included in the index. Files that don't match the patterns are excluded from the index. If a file matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the file isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "ExclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to exclude certain files in your Amazon WorkDocs site repository. Files that match the patterns are excluded from the index. Files that don't match the patterns are included in the index. If a file matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the file isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "FieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map Amazon WorkDocs data source attributes or field names to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Amazon WorkDocs fields. For more information, see Mapping data source fields. The Amazon WorkDocs data source field names must exist in your Amazon WorkDocs custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "FsxConfiguration",
          "type": "dict",
          "required": false,
          "description": "Provides the configuration information to connect to Amazon FSx as your data source.",
          "nested_params": [
            {
              "name": "FileSystemId",
              "type": "string",
              "required": false,
              "description": "The identifier of the Amazon FSx file system. You can find your file system ID on the file system dashboard in the Amazon FSx console. For information on how to create a file system in Amazon FSx console, using Windows File Server as an example, see Amazon FSx Getting started guide.",
              "nested_params": []
            },
            {
              "name": "FileSystemType",
              "type": "string",
              "required": false,
              "description": "The Amazon FSx file system type. Windows is currently the only supported type.",
              "nested_params": []
            },
            {
              "name": "VpcConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration information for an Amazon Virtual Private Cloud to connect to your Amazon FSx. Your Amazon FSx instance must reside inside your VPC.",
              "nested_params": [
                {
                  "name": "SubnetIds",
                  "type": "list",
                  "required": false,
                  "description": "A list of identifiers for subnets within your Amazon VPC. The subnets should be able to connect to each other in the VPC, and they should have outgoing access to the Internet through a NAT device.",
                  "nested_params": []
                },
                {
                  "name": "SecurityGroupIds",
                  "type": "list",
                  "required": false,
                  "description": "A list of identifiers of security groups within your Amazon VPC. The security groups should enable Amazon Kendra to connect to the data source.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "SecretArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of an Secrets Manager secret that contains the key-value pairs required to connect to your Amazon FSx file system. Windows is currently the only supported type. The secret must contain a JSON structure with the following keys:",
              "nested_params": []
            },
            {
              "name": "InclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to include certain files in your Amazon FSx file system. Files that match the patterns are included in the index. Files that don't match the patterns are excluded from the index. If a file matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the file isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "ExclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to exclude certain files in your Amazon FSx file system. Files that match the patterns are excluded from the index. Files that don't match the patterns are included in the index. If a file matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the file isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "FieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map Amazon FSx data source attributes or field names to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Amazon FSx fields. For more information, see Mapping data source fields. The Amazon FSx data source field names must exist in your Amazon FSx custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "SlackConfiguration",
          "type": "dict",
          "required": false,
          "description": "Provides the configuration information to connect to Slack as your data source.",
          "nested_params": [
            {
              "name": "TeamId",
              "type": "string",
              "required": false,
              "description": "The identifier of the team in the Slack workspace. For example, T0123456789.",
              "nested_params": []
            },
            {
              "name": "SecretArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of an Secrets Manager secret that contains the key-value pairs required to connect to your Slack workspace team. The secret must contain a JSON structure with the following keys:",
              "nested_params": []
            },
            {
              "name": "VpcConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration information for an Amazon Virtual Private Cloud to connect to your Slack. For more information, see Configuring a VPC.",
              "nested_params": [
                {
                  "name": "SubnetIds",
                  "type": "list",
                  "required": false,
                  "description": "A list of identifiers for subnets within your Amazon VPC. The subnets should be able to connect to each other in the VPC, and they should have outgoing access to the Internet through a NAT device.",
                  "nested_params": []
                },
                {
                  "name": "SecurityGroupIds",
                  "type": "list",
                  "required": false,
                  "description": "A list of identifiers of security groups within your Amazon VPC. The security groups should enable Amazon Kendra to connect to the data source.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "SlackEntityList",
              "type": "list",
              "required": false,
              "description": "Specify whether to index public channels, private channels, group messages, and direct messages. You can specify one or more of these options.",
              "nested_params": []
            },
            {
              "name": "UseChangeLog",
              "type": "boolean",
              "required": false,
              "description": "TRUE to use the Slack change log to determine which documents require updating in the index. Depending on the Slack change log's size, it may take longer for Amazon Kendra to use the change log than to scan all of your documents in Slack.",
              "nested_params": []
            },
            {
              "name": "CrawlBotMessage",
              "type": "boolean",
              "required": false,
              "description": "TRUE to index bot messages from your Slack workspace team.",
              "nested_params": []
            },
            {
              "name": "ExcludeArchived",
              "type": "boolean",
              "required": false,
              "description": "TRUE to exclude archived messages to index from your Slack workspace team.",
              "nested_params": []
            },
            {
              "name": "SinceCrawlDate",
              "type": "string",
              "required": false,
              "description": "The date to start crawling your data from your Slack workspace team. The date must follow this format: yyyy-mm-dd.",
              "nested_params": []
            },
            {
              "name": "LookBackPeriod",
              "type": "integer",
              "required": false,
              "description": "The number of hours for change log to look back from when you last synchronized your data. You can look back up to 7 days or 168 hours. Change log updates your index only if new content was added since you last synced your data. Updated or deleted content from before you last synced does not get updated in your index. To capture updated or deleted content before you last synced, set the LookBackPeriod to the number of hours you want change log to look back.",
              "nested_params": []
            },
            {
              "name": "PrivateChannelFilter",
              "type": "list",
              "required": false,
              "description": "The list of private channel names from your Slack workspace team. You use this if you want to index specific private channels, not all private channels. You can also use regular expression patterns to filter private channels.",
              "nested_params": []
            },
            {
              "name": "PublicChannelFilter",
              "type": "list",
              "required": false,
              "description": "The list of public channel names to index from your Slack workspace team. You use this if you want to index specific public channels, not all public channels. You can also use regular expression patterns to filter public channels.",
              "nested_params": []
            },
            {
              "name": "InclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to include certain attached files in your Slack workspace team. Files that match the patterns are included in the index. Files that don't match the patterns are excluded from the index. If a file matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the file isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "ExclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to exclude certain attached files in your Slack workspace team. Files that match the patterns are excluded from the index. Files that don't match the patterns are included in the index. If a file matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the file isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "FieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map Slack data source attributes or field names to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Slack fields. For more information, see Mapping data source fields. The Slack data source field names must exist in your Slack custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "BoxConfiguration",
          "type": "dict",
          "required": false,
          "description": "Provides the configuration information to connect to Box as your data source.",
          "nested_params": [
            {
              "name": "EnterpriseId",
              "type": "string",
              "required": false,
              "description": "The identifier of the Box Enterprise platform. You can find the enterprise ID in the Box Developer Console settings or when you create an app in Box and download your authentication credentials. For example, 801234567.",
              "nested_params": []
            },
            {
              "name": "SecretArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of an Secrets Manager secret that contains the key-value pairs required to connect to your Box platform. The secret must contain a JSON structure with the following keys:",
              "nested_params": []
            },
            {
              "name": "UseChangeLog",
              "type": "boolean",
              "required": false,
              "description": "TRUE to use the Slack change log to determine which documents require updating in the index. Depending on the data source change log's size, it may take longer for Amazon Kendra to use the change log than to scan all of your documents.",
              "nested_params": []
            },
            {
              "name": "CrawlComments",
              "type": "boolean",
              "required": false,
              "description": "TRUE to index comments.",
              "nested_params": []
            },
            {
              "name": "CrawlTasks",
              "type": "boolean",
              "required": false,
              "description": "TRUE to index the contents of tasks.",
              "nested_params": []
            },
            {
              "name": "CrawlWebLinks",
              "type": "boolean",
              "required": false,
              "description": "TRUE to index web links.",
              "nested_params": []
            },
            {
              "name": "FileFieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Box files to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Box fields. For more information, see Mapping data source fields. The Box field names must exist in your Box custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "TaskFieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Box tasks to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Box fields. For more information, see Mapping data source fields. The Box field names must exist in your Box custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "CommentFieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Box comments to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Box fields. For more information, see Mapping data source fields. The Box field names must exist in your Box custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "WebLinkFieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Box web links to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Box fields. For more information, see Mapping data source fields. The Box field names must exist in your Box custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "InclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to include certain files and folders in your Box platform. Files and folders that match the patterns are included in the index. Files and folders that don't match the patterns are excluded from the index. If a file or folder matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the file or folder isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "ExclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to exclude certain files and folders from your Box platform. Files and folders that match the patterns are excluded from the index.Files and folders that don't match the patterns are included in the index. If a file or folder matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the file or folder isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "VpcConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration information for an Amazon VPC to connect to your Box. For more information, see Configuring a VPC.",
              "nested_params": [
                {
                  "name": "SubnetIds",
                  "type": "list",
                  "required": false,
                  "description": "A list of identifiers for subnets within your Amazon VPC. The subnets should be able to connect to each other in the VPC, and they should have outgoing access to the Internet through a NAT device.",
                  "nested_params": []
                },
                {
                  "name": "SecurityGroupIds",
                  "type": "list",
                  "required": false,
                  "description": "A list of identifiers of security groups within your Amazon VPC. The security groups should enable Amazon Kendra to connect to the data source.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "QuipConfiguration",
          "type": "dict",
          "required": false,
          "description": "Provides the configuration information to connect to Quip as your data source.",
          "nested_params": [
            {
              "name": "Domain",
              "type": "string",
              "required": false,
              "description": "The Quip site domain. For example, https://quip-company.quipdomain.com/browse. The domain in this example is 'quipdomain'.",
              "nested_params": []
            },
            {
              "name": "SecretArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of an Secrets Manager secret that contains the key-value pairs that are required to connect to your Quip. The secret must contain a JSON structure with the following keys:",
              "nested_params": []
            },
            {
              "name": "CrawlFileComments",
              "type": "boolean",
              "required": false,
              "description": "TRUE to index file comments.",
              "nested_params": []
            },
            {
              "name": "CrawlChatRooms",
              "type": "boolean",
              "required": false,
              "description": "TRUE to index the contents of chat rooms.",
              "nested_params": []
            },
            {
              "name": "CrawlAttachments",
              "type": "boolean",
              "required": false,
              "description": "TRUE to index attachments.",
              "nested_params": []
            },
            {
              "name": "FolderIds",
              "type": "list",
              "required": false,
              "description": "The identifiers of the Quip folders you want to index. You can find the folder ID in your browser URL when you access your folder in Quip. For example, https://quip-company.quipdomain.com/zlLuOVNSarTL/folder-name. The folder ID in this example is 'zlLuOVNSarTL'.",
              "nested_params": []
            },
            {
              "name": "ThreadFieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Quip threads to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Quip fields. For more information, see Mapping data source fields. The Quip field names must exist in your Quip custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "MessageFieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Quip messages to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Quip fields. For more information, see Mapping data source fields. The Quip field names must exist in your Quip custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "AttachmentFieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Quip attachments to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Quip fields. For more information, see Mapping data source fields. The Quip field names must exist in your Quip custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "InclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to include certain files in your Quip file system. Files that match the patterns are included in the index. Files that don't match the patterns are excluded from the index. If a file matches both an inclusion pattern and an exclusion pattern, the exclusion pattern takes precedence, and the file isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "ExclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to exclude certain files in your Quip file system. Files that match the patterns are excluded from the index. Files that don't match the patterns are included in the index. If a file matches both an inclusion pattern and an exclusion pattern, the exclusion pattern takes precedence, and the file isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "VpcConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration information for an Amazon Virtual Private Cloud (VPC) to connect to your Quip. For more information, see Configuring a VPC.",
              "nested_params": [
                {
                  "name": "SubnetIds",
                  "type": "list",
                  "required": false,
                  "description": "A list of identifiers for subnets within your Amazon VPC. The subnets should be able to connect to each other in the VPC, and they should have outgoing access to the Internet through a NAT device.",
                  "nested_params": []
                },
                {
                  "name": "SecurityGroupIds",
                  "type": "list",
                  "required": false,
                  "description": "A list of identifiers of security groups within your Amazon VPC. The security groups should enable Amazon Kendra to connect to the data source.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "JiraConfiguration",
          "type": "dict",
          "required": false,
          "description": "Provides the configuration information to connect to Jira as your data source.",
          "nested_params": [
            {
              "name": "JiraAccountUrl",
              "type": "string",
              "required": false,
              "description": "The URL of the Jira account. For example, company.atlassian.net.",
              "nested_params": []
            },
            {
              "name": "SecretArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of a secret in Secrets Manager contains the key-value pairs required to connect to your Jira data source. The secret must contain a JSON structure with the following keys:",
              "nested_params": []
            },
            {
              "name": "UseChangeLog",
              "type": "boolean",
              "required": false,
              "description": "TRUE to use the Jira change log to determine which documents require updating in the index. Depending on the change log's size, it may take longer for Amazon Kendra to use the change log than to scan all of your documents in Jira.",
              "nested_params": []
            },
            {
              "name": "Project",
              "type": "list",
              "required": false,
              "description": "Specify which projects to crawl in your Jira data source. You can specify one or more Jira project IDs.",
              "nested_params": []
            },
            {
              "name": "IssueType",
              "type": "list",
              "required": false,
              "description": "Specify which issue types to crawl in your Jira data source. You can specify one or more of these options to crawl.",
              "nested_params": []
            },
            {
              "name": "Status",
              "type": "list",
              "required": false,
              "description": "Specify which statuses to crawl in your Jira data source. You can specify one or more of these options to crawl.",
              "nested_params": []
            },
            {
              "name": "IssueSubEntityFilter",
              "type": "list",
              "required": false,
              "description": "Specify whether to crawl comments, attachments, and work logs. You can specify one or more of these options.",
              "nested_params": []
            },
            {
              "name": "AttachmentFieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Jira attachments to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Jira fields. For more information, see Mapping data source fields. The Jira data source field names must exist in your Jira custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "CommentFieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Jira comments to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Jira fields. For more information, see Mapping data source fields. The Jira data source field names must exist in your Jira custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "IssueFieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Jira issues to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Jira fields. For more information, see Mapping data source fields. The Jira data source field names must exist in your Jira custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ProjectFieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Jira projects to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Jira fields. For more information, see Mapping data source fields. The Jira data source field names must exist in your Jira custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "WorkLogFieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Jira work logs to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Jira fields. For more information, see Mapping data source fields. The Jira data source field names must exist in your Jira custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "InclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to include certain file paths, file names, and file types in your Jira data source. Files that match the patterns are included in the index. Files that don't match the patterns are excluded from the index. If a file matches both an inclusion pattern and an exclusion pattern, the exclusion pattern takes precedence and the file isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "ExclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to exclude certain file paths, file names, and file types in your Jira data source. Files that match the patterns are excluded from the index. Files that don't match the patterns are included in the index. If a file matches both an inclusion pattern and an exclusion pattern, the exclusion pattern takes precedence and the file isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "VpcConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration information for an Amazon Virtual Private Cloud to connect to your Jira. For more information, see Configuring a VPC.",
              "nested_params": [
                {
                  "name": "SubnetIds",
                  "type": "list",
                  "required": false,
                  "description": "A list of identifiers for subnets within your Amazon VPC. The subnets should be able to connect to each other in the VPC, and they should have outgoing access to the Internet through a NAT device.",
                  "nested_params": []
                },
                {
                  "name": "SecurityGroupIds",
                  "type": "list",
                  "required": false,
                  "description": "A list of identifiers of security groups within your Amazon VPC. The security groups should enable Amazon Kendra to connect to the data source.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "GitHubConfiguration",
          "type": "dict",
          "required": false,
          "description": "Provides the configuration information to connect to GitHub as your data source.",
          "nested_params": [
            {
              "name": "SaaSConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration information to connect to GitHub Enterprise Cloud (SaaS).",
              "nested_params": [
                {
                  "name": "OrganizationName",
                  "type": "string",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "HostUrl",
                  "type": "string",
                  "required": false,
                  "description": "The GitHub host URL or API endpoint URL. For example, https://api.github.com.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "OnPremiseConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration information to connect to GitHub Enterprise Server (on premises).",
              "nested_params": [
                {
                  "name": "HostUrl",
                  "type": "string",
                  "required": false,
                  "description": "The GitHub host URL or API endpoint URL. For example, https://on-prem-host-url/api/v3/",
                  "nested_params": []
                },
                {
                  "name": "OrganizationName",
                  "type": "string",
                  "required": false,
                  "description": "",
                  "nested_params": []
                },
                {
                  "name": "SslCertificateS3Path",
                  "type": "dict",
                  "required": false,
                  "description": "The path to the SSL certificate stored in an Amazon S3 bucket. You use this to connect to GitHub if you require a secure SSL connection. You can simply generate a self-signed X509 certificate on any computer using OpenSSL. For an example of using OpenSSL to create an X509 certificate, see Create and sign an X509 certificate.",
                  "nested_params": [
                    {
                      "name": "Bucket",
                      "type": "string",
                      "required": false,
                      "description": "The name of the S3 bucket that contains the file.",
                      "nested_params": []
                    },
                    {
                      "name": "Key",
                      "type": "string",
                      "required": false,
                      "description": "The name of the file.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "Type",
              "type": "string",
              "required": false,
              "description": "The type of GitHub service you want to connect to--\u0094GitHub Enterprise Cloud (SaaS) or GitHub Enterprise Server (on premises).",
              "nested_params": []
            },
            {
              "name": "SecretArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of an Secrets Manager secret that contains the key-value pairs required to connect to your GitHub. The secret must contain a JSON structure with the following keys:",
              "nested_params": []
            },
            {
              "name": "UseChangeLog",
              "type": "boolean",
              "required": false,
              "description": "TRUE to use the GitHub change log to determine which documents require updating in the index. Depending on the GitHub change log's size, it may take longer for Amazon Kendra to use the change log than to scan all of your documents in GitHub.",
              "nested_params": []
            },
            {
              "name": "GitHubDocumentCrawlProperties",
              "type": "dict",
              "required": false,
              "description": "Configuration information to include certain types of GitHub content. You can configure to index repository files only, or also include issues and pull requests, comments, and comment attachments.",
              "nested_params": [
                {
                  "name": "CrawlRepositoryDocuments",
                  "type": "boolean",
                  "required": false,
                  "description": "TRUE to index all files with a repository.",
                  "nested_params": []
                },
                {
                  "name": "CrawlIssue",
                  "type": "boolean",
                  "required": false,
                  "description": "TRUE to index all issues within a repository.",
                  "nested_params": []
                },
                {
                  "name": "CrawlIssueComment",
                  "type": "boolean",
                  "required": false,
                  "description": "TRUE to index all comments on issues.",
                  "nested_params": []
                },
                {
                  "name": "CrawlIssueCommentAttachment",
                  "type": "boolean",
                  "required": false,
                  "description": "TRUE to include all comment attachments for issues.",
                  "nested_params": []
                },
                {
                  "name": "CrawlPullRequest",
                  "type": "boolean",
                  "required": false,
                  "description": "TRUE to index all pull requests within a repository.",
                  "nested_params": []
                },
                {
                  "name": "CrawlPullRequestComment",
                  "type": "boolean",
                  "required": false,
                  "description": "TRUE to index all comments on pull requests.",
                  "nested_params": []
                },
                {
                  "name": "CrawlPullRequestCommentAttachment",
                  "type": "boolean",
                  "required": false,
                  "description": "TRUE to include all comment attachments for pull requests.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "RepositoryFilter",
              "type": "list",
              "required": false,
              "description": "A list of names of the specific repositories you want to index.",
              "nested_params": []
            },
            {
              "name": "InclusionFolderNamePatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to include certain folder names in your GitHub repository or repositories. Folder names that match the patterns are included in the index. Folder names that don't match the patterns are excluded from the index. If a folder matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the folder isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "InclusionFileTypePatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to include certain file types in your GitHub repository or repositories. File types that match the patterns are included in the index. File types that don't match the patterns are excluded from the index. If a file matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the file isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "InclusionFileNamePatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to include certain file names in your GitHub repository or repositories. File names that match the patterns are included in the index. File names that don't match the patterns are excluded from the index. If a file matches both an inclusion and exclusion pattern, the exclusion pattern takes precedence and the file isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "ExclusionFolderNamePatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to exclude certain folder names in your GitHub repository or repositories. Folder names that match the patterns are excluded from the index. Folder names that don't match the patterns are included in the index. If a folder matches both an exclusion and inclusion pattern, the exclusion pattern takes precedence and the folder isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "ExclusionFileTypePatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to exclude certain file types in your GitHub repository or repositories. File types that match the patterns are excluded from the index. File types that don't match the patterns are included in the index. If a file matches both an exclusion and inclusion pattern, the exclusion pattern takes precedence and the file isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "ExclusionFileNamePatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to exclude certain file names in your GitHub repository or repositories. File names that match the patterns are excluded from the index. File names that don't match the patterns are included in the index. If a file matches both an exclusion and inclusion pattern, the exclusion pattern takes precedence and the file isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "VpcConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration information of an Amazon Virtual Private Cloud to connect to your GitHub. For more information, see Configuring a VPC.",
              "nested_params": [
                {
                  "name": "SubnetIds",
                  "type": "list",
                  "required": false,
                  "description": "A list of identifiers for subnets within your Amazon VPC. The subnets should be able to connect to each other in the VPC, and they should have outgoing access to the Internet through a NAT device.",
                  "nested_params": []
                },
                {
                  "name": "SecurityGroupIds",
                  "type": "list",
                  "required": false,
                  "description": "A list of identifiers of security groups within your Amazon VPC. The security groups should enable Amazon Kendra to connect to the data source.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "GitHubRepositoryConfigurationFieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map GitHub repository attributes or field names to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to GitHub fields. For more information, see Mapping data source fields. The GitHub data source field names must exist in your GitHub custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "GitHubCommitConfigurationFieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map attributes or field names of GitHub commits to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to GitHub fields. For more information, see Mapping data source fields. The GitHub data source field names must exist in your GitHub custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "GitHubIssueDocumentConfigurationFieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map attributes or field names of GitHub issues to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to GitHub fields. For more information, see Mapping data source fields. The GitHub data source field names must exist in your GitHub custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "GitHubIssueCommentConfigurationFieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map attributes or field names of GitHub issue comments to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to GitHub fields. For more information, see Mapping data source fields. The GitHub data source field names must exist in your GitHub custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "GitHubIssueAttachmentConfigurationFieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map attributes or field names of GitHub issue attachments to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to GitHub fields. For more information, see Mapping data source fields. The GitHub data source field names must exist in your GitHub custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "GitHubPullRequestCommentConfigurationFieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map attributes or field names of GitHub pull request comments to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to GitHub fields. For more information, see Mapping data source fields. The GitHub data source field names must exist in your GitHub custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "GitHubPullRequestDocumentConfigurationFieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map attributes or field names of GitHub pull requests to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to GitHub fields. For more information, see Mapping data source fields. The GitHub data source field names must exist in your GitHub custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "GitHubPullRequestDocumentAttachmentConfigurationFieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map attributes or field names of GitHub pull request attachments to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to GitHub fields. For more information, see Mapping data source fields. The GitHub data source field names must exist in your GitHub custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "AlfrescoConfiguration",
          "type": "dict",
          "required": false,
          "description": "Provides the configuration information to connect to Alfresco as your data source.",
          "nested_params": [
            {
              "name": "SiteUrl",
              "type": "string",
              "required": false,
              "description": "The URL of the Alfresco site. For example, https://hostname:8080.",
              "nested_params": []
            },
            {
              "name": "SiteId",
              "type": "string",
              "required": false,
              "description": "The identifier of the Alfresco site. For example, my-site.",
              "nested_params": []
            },
            {
              "name": "SecretArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of an Secrets Manager secret that contains the key-value pairs required to connect to your Alfresco data source. The secret must contain a JSON structure with the following keys:",
              "nested_params": []
            },
            {
              "name": "SslCertificateS3Path",
              "type": "dict",
              "required": false,
              "description": "The path to the SSL certificate stored in an Amazon S3 bucket. You use this to connect to Alfresco if you require a secure SSL connection. You can simply generate a self-signed X509 certificate on any computer using OpenSSL. For an example of using OpenSSL to create an X509 certificate, see Create and sign an X509 certificate.",
              "nested_params": [
                {
                  "name": "Bucket",
                  "type": "string",
                  "required": false,
                  "description": "The name of the S3 bucket that contains the file.",
                  "nested_params": []
                },
                {
                  "name": "Key",
                  "type": "string",
                  "required": false,
                  "description": "The name of the file.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "CrawlSystemFolders",
              "type": "boolean",
              "required": false,
              "description": "TRUE to index shared files.",
              "nested_params": []
            },
            {
              "name": "CrawlComments",
              "type": "boolean",
              "required": false,
              "description": "TRUE to index comments of blogs and other content.",
              "nested_params": []
            },
            {
              "name": "EntityFilter",
              "type": "list",
              "required": false,
              "description": "Specify whether to index document libraries, wikis, or blogs. You can specify one or more of these options.",
              "nested_params": []
            },
            {
              "name": "DocumentLibraryFieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Alfresco document libraries to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Alfresco fields. For more information, see Mapping data source fields. The Alfresco data source field names must exist in your Alfresco custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "BlogFieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Alfresco blogs to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Alfresco fields. For more information, see Mapping data source fields. The Alfresco data source field names must exist in your Alfresco custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "WikiFieldMappings",
              "type": "list",
              "required": false,
              "description": "A list of DataSourceToIndexFieldMapping objects that map attributes or field names of Alfresco wikis to Amazon Kendra index field names. To create custom fields, use the UpdateIndex API before you map to Alfresco fields. For more information, see Mapping data source fields. The Alfresco data source field names must exist in your Alfresco custom metadata.",
              "nested_params": [
                {
                  "name": "DataSourceFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the field in the data source. You must first create the index field using the UpdateIndex API.",
                  "nested_params": []
                },
                {
                  "name": "DateFieldFormat",
                  "type": "string",
                  "required": false,
                  "description": "The format for date fields in the data source. If the field specified in DataSourceFieldName is a date field, you must specify the date format. If the field is not a date field, an exception is thrown.",
                  "nested_params": []
                },
                {
                  "name": "IndexFieldName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the index field to map to the data source field. The index field type must match the data source field type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "InclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to include certain files in your Alfresco data source. Files that match the patterns are included in the index. Files that don't match the patterns are excluded from the index. If a file matches both an inclusion pattern and an exclusion pattern, the exclusion pattern takes precedence and the file isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "ExclusionPatterns",
              "type": "list",
              "required": false,
              "description": "A list of regular expression patterns to exclude certain files in your Alfresco data source. Files that match the patterns are excluded from the index. Files that don't match the patterns are included in the index. If a file matches both an inclusion pattern and an exclusion pattern, the exclusion pattern takes precedence and the file isn't included in the index.",
              "nested_params": []
            },
            {
              "name": "VpcConfiguration",
              "type": "dict",
              "required": false,
              "description": "Configuration information for an Amazon Virtual Private Cloud to connect to your Alfresco. For more information, see Configuring a VPC.",
              "nested_params": [
                {
                  "name": "SubnetIds",
                  "type": "list",
                  "required": false,
                  "description": "A list of identifiers for subnets within your Amazon VPC. The subnets should be able to connect to each other in the VPC, and they should have outgoing access to the Internet through a NAT device.",
                  "nested_params": []
                },
                {
                  "name": "SecurityGroupIds",
                  "type": "list",
                  "required": false,
                  "description": "A list of identifiers of security groups within your Amazon VPC. The security groups should enable Amazon Kendra to connect to the data source.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "TemplateConfiguration",
          "type": "dict",
          "required": false,
          "description": "Provides a template for the configuration information to connect to your data source.",
          "nested_params": [
            {
              "name": "Template",
              "type": "document",
              "required": false,
              "description": "The template schema used for the data source, where templates schemas are supported. See Data source template schemas.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "VpcConfiguration",
      "type": "dict",
      "required": true,
      "description": "Configuration information for an Amazon Virtual Private Cloud to connect to your data source. For more information, see Configuring a VPC. A list of identifiers for subnets within your Amazon VPC. The subnets should be able to connect to each other in the VPC, and they should have outgoing access to the Internet through a NAT device. (string) --- A list of identifiers of security groups within your Amazon VPC. The security groups should enable Amazon Kendra to connect to the data source. (string) ---",
      "nested_params": [
        {
          "name": "SubnetIds",
          "type": "list",
          "required": false,
          "description": "A list of identifiers for subnets within your Amazon VPC. The subnets should be able to connect to each other in the VPC, and they should have outgoing access to the Internet through a NAT device.",
          "nested_params": []
        },
        {
          "name": "SecurityGroupIds",
          "type": "list",
          "required": false,
          "description": "A list of identifiers of security groups within your Amazon VPC. The security groups should enable Amazon Kendra to connect to the data source.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Schedule",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "RoleArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "LanguageCode",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "CustomDocumentEnrichmentConfiguration",
      "type": "dict",
      "required": true,
      "description": "Configuration information you want to update for altering document metadata and content during the document ingestion process. For more information on how to create, modify and delete document metadata, or make other content alterations when you ingest documents into Amazon Kendra, see Customizing document metadata during the ingestion process. InlineConfigurations (list) --- Configuration information to alter document attributes or metadata fields and content when ingesting documents into Amazon Kendra. (dict) --- Provides the configuration information for applying basic logic to alter document metadata and content when ingesting documents into Amazon Kendra. To apply advanced logic, to go beyond what you can do with basic logic, see HookConfiguration. For more information, see Customizing document metadata during the ingestion process. Condition (dict) --- Configuration of the condition used for the target document attribute or metadata field when ingesting documents into Amazon Kendra. The identifier of the document attribute used for the condition. For example, --\u0098Source_URI' could be an identifier for the attribute or metadata field that contains source URIs associated with the documents. Amazon Kendra currently does not support _document_body as an attribute key used for the condition. The condition operator. For example, you can use --\u0098Contains' to partially match a string. ConditionOnValue (dict) --- The value used by the operator. For example, you can specify the value --\u0098financial' for strings in the --\u0098Source_URI' field that partially match or contain this value. StringValue (string) --- A string, such as 'department'. StringListValue (list) --- A list of strings. The default maximum length or number of strings is 10. (string) --- LongValue (integer) --- A long integer value. DateValue (datetime) --- A date expressed as an ISO 8601 string. It is important for the time zone to be included in the ISO 8601 date-time format. For example, 2012-03-25T12:30:10+01:00 is the ISO 8601 date-time format for March 25th 2012 at 12:30PM (plus 10 seconds) in Central European Time. Target (dict) --- Configuration of the target document attribute or metadata field when ingesting documents into Amazon Kendra. You can also include a value. TargetDocumentAttributeKey (string) --- The identifier of the target document attribute or metadata field. For example, --\u0098Department' could be an identifier for the target attribute or metadata field that includes the department names associated with the documents. TargetDocumentAttributeValueDeletion (boolean) --- TRUE to delete the existing target value for your specified target attribute key. You cannot create a target value and set this to TRUE. To create a target value ( TargetDocumentAttributeValue), set this to FALSE. TargetDocumentAttributeValue (dict) --- The target value you want to create for the target attribute. For example, --\u0098Finance' could be the target value for the target attribute key --\u0098Department'. DocumentContentDeletion (boolean) --- TRUE to delete content if the condition used for the target attribute is met. PreExtractionHookConfiguration (dict) --- Configuration information for invoking a Lambda function in Lambda on the original or raw documents before extracting their metadata and text. You can use a Lambda function to apply advanced logic for creating, modifying, or deleting document metadata and content. For more information, see Advanced data manipulation. InvocationCondition (dict) --- The condition used for when a Lambda function should be invoked. For example, you can specify a condition that if there are empty date-time values, then Amazon Kendra should invoke a function that inserts the current date-time. The Amazon Resource Name (ARN) of an IAM role with permission to run a Lambda function during ingestion. For more information, see an IAM roles for Amazon Kendra. Stores the original, raw documents or the structured, parsed documents before and after altering them. For more information, see Data contracts for Lambda functions. PostExtractionHookConfiguration (dict) --- Configuration information for invoking a Lambda function in Lambda on the structured documents with their metadata and text extracted. RoleArn (string) --- The Amazon Resource Name (ARN) of an IAM role with permission to run PreExtractionHookConfiguration and PostExtractionHookConfiguration for altering document metadata and content during the document ingestion process. For more information, see an IAM roles for Amazon Kendra.",
      "nested_params": [
        {
          "name": "InlineConfigurations",
          "type": "list",
          "required": false,
          "description": "Configuration information to alter document attributes or metadata fields and content when ingesting documents into Amazon Kendra.",
          "nested_params": [
            {
              "name": "Condition",
              "type": "dict",
              "required": false,
              "description": "Configuration of the condition used for the target document attribute or metadata field when ingesting documents into Amazon Kendra.",
              "nested_params": [
                {
                  "name": "ConditionDocumentAttributeKey",
                  "type": "string",
                  "required": false,
                  "description": "The identifier of the document attribute used for the condition. For example, --\u0098Source_URI' could be an identifier for the attribute or metadata field that contains source URIs associated with the documents. Amazon Kendra currently does not support _document_body as an attribute key used for the condition.",
                  "nested_params": []
                },
                {
                  "name": "Operator",
                  "type": "string",
                  "required": false,
                  "description": "The condition operator. For example, you can use --\u0098Contains' to partially match a string.",
                  "nested_params": []
                },
                {
                  "name": "ConditionOnValue",
                  "type": "dict",
                  "required": false,
                  "description": "The value used by the operator. For example, you can specify the value --\u0098financial' for strings in the --\u0098Source_URI' field that partially match or contain this value.",
                  "nested_params": [
                    {
                      "name": "StringValue",
                      "type": "string",
                      "required": false,
                      "description": "A string, such as 'department'.",
                      "nested_params": []
                    },
                    {
                      "name": "StringListValue",
                      "type": "list",
                      "required": false,
                      "description": "A list of strings. The default maximum length or number of strings is 10.",
                      "nested_params": []
                    },
                    {
                      "name": "LongValue",
                      "type": "integer",
                      "required": false,
                      "description": "A long integer value.",
                      "nested_params": []
                    },
                    {
                      "name": "DateValue",
                      "type": "datetime",
                      "required": false,
                      "description": "A date expressed as an ISO 8601 string. It is important for the time zone to be included in the ISO 8601 date-time format. For example, 2012-03-25T12:30:10+01:00 is the ISO 8601 date-time format for March 25th 2012 at 12:30PM (plus 10 seconds) in Central European Time.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "Target",
              "type": "dict",
              "required": false,
              "description": "Configuration of the target document attribute or metadata field when ingesting documents into Amazon Kendra. You can also include a value.",
              "nested_params": [
                {
                  "name": "TargetDocumentAttributeKey",
                  "type": "string",
                  "required": false,
                  "description": "The identifier of the target document attribute or metadata field. For example, --\u0098Department' could be an identifier for the target attribute or metadata field that includes the department names associated with the documents.",
                  "nested_params": []
                },
                {
                  "name": "TargetDocumentAttributeValueDeletion",
                  "type": "boolean",
                  "required": false,
                  "description": "TRUE to delete the existing target value for your specified target attribute key. You cannot create a target value and set this to TRUE. To create a target value ( TargetDocumentAttributeValue), set this to FALSE.",
                  "nested_params": []
                },
                {
                  "name": "TargetDocumentAttributeValue",
                  "type": "dict",
                  "required": false,
                  "description": "The target value you want to create for the target attribute. For example, --\u0098Finance' could be the target value for the target attribute key --\u0098Department'.",
                  "nested_params": [
                    {
                      "name": "StringValue",
                      "type": "string",
                      "required": false,
                      "description": "A string, such as 'department'.",
                      "nested_params": []
                    },
                    {
                      "name": "StringListValue",
                      "type": "list",
                      "required": false,
                      "description": "A list of strings. The default maximum length or number of strings is 10.",
                      "nested_params": []
                    },
                    {
                      "name": "LongValue",
                      "type": "integer",
                      "required": false,
                      "description": "A long integer value.",
                      "nested_params": []
                    },
                    {
                      "name": "DateValue",
                      "type": "datetime",
                      "required": false,
                      "description": "A date expressed as an ISO 8601 string. It is important for the time zone to be included in the ISO 8601 date-time format. For example, 2012-03-25T12:30:10+01:00 is the ISO 8601 date-time format for March 25th 2012 at 12:30PM (plus 10 seconds) in Central European Time.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "DocumentContentDeletion",
              "type": "boolean",
              "required": false,
              "description": "TRUE to delete content if the condition used for the target attribute is met.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "PreExtractionHookConfiguration",
          "type": "dict",
          "required": false,
          "description": "Configuration information for invoking a Lambda function in Lambda on the original or raw documents before extracting their metadata and text. You can use a Lambda function to apply advanced logic for creating, modifying, or deleting document metadata and content. For more information, see Advanced data manipulation.",
          "nested_params": [
            {
              "name": "InvocationCondition",
              "type": "dict",
              "required": false,
              "description": "The condition used for when a Lambda function should be invoked. For example, you can specify a condition that if there are empty date-time values, then Amazon Kendra should invoke a function that inserts the current date-time.",
              "nested_params": [
                {
                  "name": "ConditionDocumentAttributeKey",
                  "type": "string",
                  "required": false,
                  "description": "The identifier of the document attribute used for the condition. For example, --\u0098Source_URI' could be an identifier for the attribute or metadata field that contains source URIs associated with the documents. Amazon Kendra currently does not support _document_body as an attribute key used for the condition.",
                  "nested_params": []
                },
                {
                  "name": "Operator",
                  "type": "string",
                  "required": false,
                  "description": "The condition operator. For example, you can use --\u0098Contains' to partially match a string.",
                  "nested_params": []
                },
                {
                  "name": "ConditionOnValue",
                  "type": "dict",
                  "required": false,
                  "description": "The value used by the operator. For example, you can specify the value --\u0098financial' for strings in the --\u0098Source_URI' field that partially match or contain this value.",
                  "nested_params": [
                    {
                      "name": "StringValue",
                      "type": "string",
                      "required": false,
                      "description": "A string, such as 'department'.",
                      "nested_params": []
                    },
                    {
                      "name": "StringListValue",
                      "type": "list",
                      "required": false,
                      "description": "A list of strings. The default maximum length or number of strings is 10.",
                      "nested_params": []
                    },
                    {
                      "name": "LongValue",
                      "type": "integer",
                      "required": false,
                      "description": "A long integer value.",
                      "nested_params": []
                    },
                    {
                      "name": "DateValue",
                      "type": "datetime",
                      "required": false,
                      "description": "A date expressed as an ISO 8601 string. It is important for the time zone to be included in the ISO 8601 date-time format. For example, 2012-03-25T12:30:10+01:00 is the ISO 8601 date-time format for March 25th 2012 at 12:30PM (plus 10 seconds) in Central European Time.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "LambdaArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of an IAM role with permission to run a Lambda function during ingestion. For more information, see an IAM roles for Amazon Kendra.",
              "nested_params": []
            },
            {
              "name": "S3Bucket",
              "type": "string",
              "required": false,
              "description": "Stores the original, raw documents or the structured, parsed documents before and after altering them. For more information, see Data contracts for Lambda functions.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "PostExtractionHookConfiguration",
          "type": "dict",
          "required": false,
          "description": "Configuration information for invoking a Lambda function in Lambda on the structured documents with their metadata and text extracted. You can use a Lambda function to apply advanced logic for creating, modifying, or deleting document metadata and content. For more information, see Advanced data manipulation.",
          "nested_params": [
            {
              "name": "InvocationCondition",
              "type": "dict",
              "required": false,
              "description": "The condition used for when a Lambda function should be invoked. For example, you can specify a condition that if there are empty date-time values, then Amazon Kendra should invoke a function that inserts the current date-time.",
              "nested_params": [
                {
                  "name": "ConditionDocumentAttributeKey",
                  "type": "string",
                  "required": false,
                  "description": "The identifier of the document attribute used for the condition. For example, --\u0098Source_URI' could be an identifier for the attribute or metadata field that contains source URIs associated with the documents. Amazon Kendra currently does not support _document_body as an attribute key used for the condition.",
                  "nested_params": []
                },
                {
                  "name": "Operator",
                  "type": "string",
                  "required": false,
                  "description": "The condition operator. For example, you can use --\u0098Contains' to partially match a string.",
                  "nested_params": []
                },
                {
                  "name": "ConditionOnValue",
                  "type": "dict",
                  "required": false,
                  "description": "The value used by the operator. For example, you can specify the value --\u0098financial' for strings in the --\u0098Source_URI' field that partially match or contain this value.",
                  "nested_params": [
                    {
                      "name": "StringValue",
                      "type": "string",
                      "required": false,
                      "description": "A string, such as 'department'.",
                      "nested_params": []
                    },
                    {
                      "name": "StringListValue",
                      "type": "list",
                      "required": false,
                      "description": "A list of strings. The default maximum length or number of strings is 10.",
                      "nested_params": []
                    },
                    {
                      "name": "LongValue",
                      "type": "integer",
                      "required": false,
                      "description": "A long integer value.",
                      "nested_params": []
                    },
                    {
                      "name": "DateValue",
                      "type": "datetime",
                      "required": false,
                      "description": "A date expressed as an ISO 8601 string. It is important for the time zone to be included in the ISO 8601 date-time format. For example, 2012-03-25T12:30:10+01:00 is the ISO 8601 date-time format for March 25th 2012 at 12:30PM (plus 10 seconds) in Central European Time.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "LambdaArn",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of an IAM role with permission to run a Lambda function during ingestion. For more information, see an IAM roles for Amazon Kendra.",
              "nested_params": []
            },
            {
              "name": "S3Bucket",
              "type": "string",
              "required": false,
              "description": "Stores the original, raw documents or the structured, parsed documents before and after altering them. For more information, see Data contracts for Lambda functions.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "RoleArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of an IAM role with permission to run PreExtractionHookConfiguration and PostExtractionHookConfiguration for altering document metadata and content during the document ingestion process. For more information, see an IAM roles for Amazon Kendra.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}