{
  "method_name": "start_data_source_introspection",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/appsync/client/start_data_source_introspection.html",
  "description": "Creates a new introspection. Returns the introspectionId of the new introspection after its creation.",
  "parameters": [
    {
      "name": "rdsDataApiConfig",
      "type": "dict",
      "required": true,
      "description": "The rdsDataApiConfig object data. resourceArn (string) --- The resource ARN of the RDS cluster. secretArn (string) --- The secret's ARN that was obtained from Secrets Manager. A secret consists of secret information, the secret value, plus metadata about the secret. A secret value can be a string or binary. It typically includes the ARN, secret name and description, policies, tags, encryption key from the Key Management Service, and key rotation data. databaseName (string) --- The name of the database in the cluster.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "introspectionId",
          "type": "string",
          "description": "The introspection ID. Each introspection contains a unique ID that can be used to reference the instrospection record.",
          "nested_items": []
        },
        {
          "name": "introspectionStatus",
          "type": "string",
          "description": "The status of the introspection during creation. By default, when a new instrospection has been created, the status will be set to PROCESSING. Once the operation has been completed, the status will change to SUCCESS or FAILED depending on how the data was parsed. A FAILED operation will return an error and its details as an introspectionStatusDetail.",
          "nested_items": []
        },
        {
          "name": "introspectionStatusDetail",
          "type": "string",
          "description": "The error detail field. When a FAILED introspectionStatus is returned, the introspectionStatusDetail will also return the exact error that was generated during the operation.",
          "nested_items": []
        }
      ]
    }
  ]
}