{
  "method_name": "delete_data_repository_association",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/fsx/client/delete_data_repository_association.html",
  "description": "Deletes a data repository association on an Amazon FSx for Lustre file system. Deleting the data repository association unlinks the file system from the Amazon S3 bucket. When deleting a data repository association, you have the option of deleting the data in the file system that corresponds to the data repository association. Data repository associations are supported on all FSx for Lustre 2.12 and 2.15 file systems, excluding scratch_1 deployment type.",
  "parameters": [
    {
      "name": "AssociationId",
      "type": "string",
      "required": true,
      "description": "The ID of the data repository association that you want to delete.",
      "nested_params": []
    },
    {
      "name": "ClientRequestToken",
      "type": "string",
      "required": false,
      "description": "(Optional) An idempotency token for resource creation, in a string of up to 63 ASCII characters. This token is automatically filled on your behalf when you use the Command Line Interface (CLI) or an Amazon Web Services SDK. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "DeleteDataInFileSystem",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "AssociationId",
          "type": "string",
          "description": "The ID of the data repository association being deleted.",
          "nested_items": []
        },
        {
          "name": "Lifecycle",
          "type": "string",
          "description": "Describes the lifecycle state of the data repository association being deleted.",
          "nested_items": []
        },
        {
          "name": "DeleteDataInFileSystem",
          "type": "boolean",
          "description": "Indicates whether data in the file system that corresponds to the data repository association is being deleted. Default is false.",
          "nested_items": []
        }
      ]
    }
  ]
}