{
  "method_name": "describe_file_caches",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/fsx/client/describe_file_caches.html",
  "description": "Returns the description of a specific Amazon File Cache resource, if a FileCacheIds value is provided for that cache. Otherwise, it returns descriptions of all caches owned by your Amazon Web Services account in the Amazon Web Services Region of the endpoint that you're calling. When retrieving all cache descriptions, you can optionally specify the MaxResults parameter to limit the number of descriptions in a response. If more cache descriptions remain, the operation returns a NextToken value in the response. In this case, send a later request with the NextToken request parameter set to the value of NextToken from the last response. This operation is used in an iterative process to retrieve a list of your cache descriptions. DescribeFileCaches is called first without a NextToken``value. Then the operation continues to be called with the ``NextToken parameter set to the value of the last NextToken value until a response has no NextToken. When using this operation, keep the following in mind:",
  "parameters": [
    {
      "name": "FileCacheIds",
      "type": "list",
      "required": false,
      "description": "IDs of the caches whose descriptions you want to retrieve (String). (string) ---",
      "nested_params": []
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "FileCaches",
          "type": "list",
          "description": "The response object for the DescribeFileCaches operation.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "OwnerId",
                  "type": "string",
                  "description": "An Amazon Web Services account ID. This ID is a 12-digit number that you use to construct Amazon Resource Names (ARNs) for resources.",
                  "nested_items": []
                },
                {
                  "name": "CreationTime",
                  "type": "datetime",
                  "description": "The time that the resource was created, in seconds (since 1970-01-01T00:00:00Z), also known as Unix time.",
                  "nested_items": []
                },
                {
                  "name": "FileCacheId",
                  "type": "string",
                  "description": "The system-generated, unique ID of the cache.",
                  "nested_items": []
                },
                {
                  "name": "FileCacheType",
                  "type": "string",
                  "description": "The type of cache, which must be LUSTRE.",
                  "nested_items": []
                },
                {
                  "name": "FileCacheTypeVersion",
                  "type": "string",
                  "description": "The Lustre version of the cache, which must be 2.12.",
                  "nested_items": []
                },
                {
                  "name": "Lifecycle",
                  "type": "string",
                  "description": "The lifecycle status of the cache. The following are the possible values and what they mean:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "AVAILABLE - The cache is in a healthy state, and is reachable and available for use.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "CREATING - The new cache is being created.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "DELETING - An existing cache is being deleted.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "UPDATING - The cache is undergoing a customer-initiated update.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "FAILED - An existing cache has experienced an unrecoverable failure. When creating a new cache, the cache was unable to be created.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "FailureDetails",
                  "type": "dict",
                  "description": "A structure providing details of any failures that occurred.",
                  "nested_items": [
                    {
                      "name": "Message",
                      "type": "string",
                      "description": "A message describing any failures that occurred.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "StorageCapacity",
                  "type": "integer",
                  "description": "The storage capacity of the cache in gibibytes (GiB).",
                  "nested_items": []
                },
                {
                  "name": "VpcId",
                  "type": "string",
                  "description": "The ID of your virtual private cloud (VPC). For more information, see VPC and subnets in the Amazon VPC User Guide.",
                  "nested_items": []
                },
                {
                  "name": "SubnetIds",
                  "type": "list",
                  "description": "A list of subnet IDs that the cache will be accessible from. You can specify only one subnet ID in a call to the CreateFileCache operation.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "NetworkInterfaceIds",
                  "type": "list",
                  "description": "A list of network interface IDs.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "DNSName",
                  "type": "string",
                  "description": "The Domain Name System (DNS) name for the cache.",
                  "nested_items": []
                },
                {
                  "name": "KmsKeyId",
                  "type": "string",
                  "description": "Specifies the ID of the Key Management Service (KMS) key to use for encrypting data on an Amazon File Cache. If a KmsKeyId isn't specified, the Amazon FSx-managed KMS key for your account is used. For more information, see Encrypt in the Key Management Service API Reference.",
                  "nested_items": []
                },
                {
                  "name": "ResourceARN",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) for a given resource. ARNs uniquely identify Amazon Web Services resources. We require an ARN when you need to specify a resource unambiguously across all of Amazon Web Services. For more information, see Amazon Resource Names (ARNs) in the Amazon Web Services General Reference.",
                  "nested_items": []
                },
                {
                  "name": "LustreConfiguration",
                  "type": "dict",
                  "description": "The configuration for the Amazon File Cache resource.",
                  "nested_items": [
                    {
                      "name": "PerUnitStorageThroughput",
                      "type": "integer",
                      "description": "Per unit storage throughput represents the megabytes per second of read or write throughput per 1 tebibyte of storage provisioned. Cache throughput capacity is equal to Storage capacity (TiB) * PerUnitStorageThroughput (MB/s/TiB). The only supported value is 1000.",
                      "nested_items": []
                    },
                    {
                      "name": "DeploymentType",
                      "type": "string",
                      "description": "The deployment type of the Amazon File Cache resource, which must be CACHE_1.",
                      "nested_items": []
                    },
                    {
                      "name": "MountName",
                      "type": "string",
                      "description": "You use the MountName value when mounting the cache. If you pass a cache ID to the DescribeFileCaches operation, it returns the the MountName value as part of the cache's description.",
                      "nested_items": []
                    },
                    {
                      "name": "WeeklyMaintenanceStartTime",
                      "type": "string",
                      "description": "A recurring weekly time, in the format D:HH:MM.",
                      "nested_items": []
                    },
                    {
                      "name": "MetadataConfiguration",
                      "type": "dict",
                      "description": "The configuration for a Lustre MDT (Metadata Target) storage volume.",
                      "nested_items": [
                        {
                          "name": "StorageCapacity",
                          "type": "integer",
                          "description": "The storage capacity of the Lustre MDT (Metadata Target) storage volume in gibibytes (GiB). The only supported value is 2400 GiB.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "LogConfiguration",
                      "type": "dict",
                      "description": "The configuration for Lustre logging used to write the enabled logging events for your Amazon File Cache resource to Amazon CloudWatch Logs.",
                      "nested_items": [
                        {
                          "name": "Level",
                          "type": "string",
                          "description": "The data repository events that are logged by Amazon FSx.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "",
                              "description": "WARN_ONLY - only warning events are logged.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "ERROR_ONLY - only error events are logged.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "WARN_ERROR - both warning events and error events are logged.",
                              "nested_items": []
                            },
                            {
                              "name": "",
                              "type": "",
                              "description": "DISABLED - logging of data repository events is turned off.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "Destination",
                          "type": "string",
                          "description": "The Amazon Resource Name (ARN) that specifies the destination of the logs. The destination can be any Amazon CloudWatch Logs log group ARN. The destination ARN must be in the same Amazon Web Services partition, Amazon Web Services Region, and Amazon Web Services account as your Amazon FSx file system.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "DataRepositoryAssociationIds",
                  "type": "list",
                  "description": "A list of IDs of data repository associations that are associated with this cache.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "(Optional) Opaque pagination token returned from a previous operation (String). If present, this token indicates from what point you can continue processing the request, where the previous NextToken value left off.",
          "nested_items": []
        }
      ]
    }
  ]
}