{
  "method_name": "describe_data_repository_tasks",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/fsx/client/describe_data_repository_tasks.html",
  "description": "Returns the description of specific Amazon FSx for Lustre or Amazon File Cache data repository tasks, if one or more TaskIds values are provided in the request, or if filters are used in the request. You can use filters to narrow the response to include just tasks for specific file systems or caches, or tasks in a specific lifecycle state. Otherwise, it returns all data repository tasks owned by your Amazon Web Services account in the Amazon Web Services Region of the endpoint that you're calling. When retrieving all tasks, you can paginate the response by using the optional MaxResults parameter to limit the number of tasks returned in a response. If more tasks remain, a NextToken value is returned in the response. In this case, send a later request with the NextToken request parameter set to the value of NextToken from the last response.",
  "parameters": [
    {
      "name": "TaskIds",
      "type": "list",
      "required": false,
      "description": "(Optional) IDs of the tasks whose descriptions you want to retrieve (String). (string) ---",
      "nested_params": []
    },
    {
      "name": "Filters",
      "type": "list",
      "required": false,
      "description": "(Optional) You can use filters to narrow the DescribeDataRepositoryTasks response to include just tasks for specific file systems, or tasks in a specific lifecycle state. (dict) --- (Optional) An array of filter objects you can use to filter the response of data repository tasks you will see in the response. You can filter the tasks returned in the response by one or more file system IDs, task lifecycles, and by task type. A filter object consists of a filter Name, and one or more Values for the filter. Name (string) --- Name of the task property to use in filtering the tasks returned in the response. Use file-system-id to retrieve data repository tasks for specific file systems. Use task-lifecycle to retrieve data repository tasks with one or more specific lifecycle states, as follows: CANCELED, EXECUTING, FAILED, PENDING, and SUCCEEDED. Values (list) --- Use Values to include the specific file system IDs and task lifecycle states for the filters you are using. (string) ---",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "Name of the task property to use in filtering the tasks returned in the response.",
          "nested_params": []
        },
        {
          "name": "Values",
          "type": "list",
          "required": false,
          "description": "Use Values to include the specific file system IDs and task lifecycle states for the filters you are using.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "MaxResults",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "NextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "DataRepositoryTasks",
          "type": "list",
          "description": "The collection of data repository task descriptions returned.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "",
                  "type": "",
                  "description": "You use import and export data repository tasks to perform bulk transfer operations between an Amazon FSx for Lustre file system and a linked data repository.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "You use release data repository tasks to release files that have been exported to a linked S3 bucket from your Amazon FSx for Lustre file system.",
                  "nested_items": []
                },
                {
                  "name": "",
                  "type": "",
                  "description": "An Amazon File Cache resource uses a task to automatically release files from the cache.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "NextToken",
          "type": "string",
          "description": "(Optional) Opaque pagination token returned from a previous operation (String). If present, this token indicates from what point you can continue processing the request, where the previous NextToken value left off.",
          "nested_items": []
        }
      ]
    }
  ]
}