{
  "method_name": "create_export_task",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/logs/client/create_export_task.html",
  "description": "Creates an export task so that you can efficiently export data from a log group to an Amazon S3 bucket. When you perform a CreateExportTask operation, you must use credentials that have permission to write to the S3 bucket that you specify as the destination. Exporting log data to S3 buckets that are encrypted by KMS is supported. Exporting log data to Amazon S3 buckets that have S3 Object Lock enabled with a retention period is also supported. Exporting to S3 buckets that are encrypted with AES-256 is supported. This is an asynchronous call. If all the required information is provided, this operation initiates an export task and responds with the ID of the task. After the task has started, you can use DescribeExportTasks to get the status of the export task. Each account can only have one active ( RUNNING or PENDING) export task at a time. To cancel an export task, use CancelExportTask. You can export logs from multiple log groups or multiple time ranges to the same S3 bucket. To separate log data for each export task, specify a prefix to be used as the Amazon S3 key prefix for all exported objects.",
  "parameters": [
    {
      "name": "taskName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "logGroupName",
      "type": "string",
      "required": true,
      "description": "The name of the log group.",
      "nested_params": []
    },
    {
      "name": "logStreamNamePrefix",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "fromTime",
      "type": "integer",
      "required": true,
      "description": "The start time of the range for the request, expressed as the number of milliseconds after Jan 1, 1970 00:00:00 UTC. Events with a timestamp earlier than this time are not exported.",
      "nested_params": []
    },
    {
      "name": "to",
      "type": "integer",
      "required": true,
      "description": "The end time of the range for the request, expressed as the number of milliseconds after Jan 1, 1970 00:00:00 UTC. Events with a timestamp later than this time are not exported. You must specify a time that is not earlier than when this log group was created.",
      "nested_params": []
    },
    {
      "name": "destination",
      "type": "string",
      "required": true,
      "description": "The name of S3 bucket for the exported log data. The bucket must be in the same Amazon Web Services Region.",
      "nested_params": []
    },
    {
      "name": "destinationPrefix",
      "type": "string",
      "required": false,
      "description": "The prefix used as the start of the key for every object exported. If you don't specify a value, the default is exportedlogs. The length of this parameter must comply with the S3 object key name length limits. The object key name is a sequence of Unicode characters with UTF-8 encoding, and can be up to 1,024 bytes.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "taskId",
          "type": "string",
          "description": "The ID of the export task.",
          "nested_items": []
        }
      ]
    }
  ]
}