{
  "method_name": "describe_log_groups",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/logs/client/describe_log_groups.html",
  "description": "Lists the specified log groups. You can list all your log groups or filter the results by prefix. The results are ASCII-sorted by log group name. CloudWatch Logs doesn't support IAM policies that control access to the DescribeLogGroups action by using the aws:ResourceTag/key-name condition key. Other CloudWatch Logs actions do support the use of the aws:ResourceTag/key-name condition key to control access. For more information about using tags to control access, see Controlling access to Amazon Web Services resources using tags. If you are using CloudWatch cross-account observability, you can use this operation in a monitoring account and view data from the linked source accounts. For more information, see CloudWatch cross-account observability.",
  "parameters": [
    {
      "name": "accountIdentifiers",
      "type": "list",
      "required": false,
      "description": "When includeLinkedAccounts is set to True, use this parameter to specify the list of accounts to search. You can specify as many as 20 account IDs in the array. (string) ---",
      "nested_params": []
    },
    {
      "name": "logGroupNamePrefix",
      "type": "string",
      "required": false,
      "description": "The prefix to match.",
      "nested_params": []
    },
    {
      "name": "logGroupNamePattern",
      "type": "string",
      "required": false,
      "description": "If you specify a string for this parameter, the operation returns only log groups that have names that match the string based on a case-sensitive substring search. For example, if you specify Foo, log groups named FooBar, aws/Foo, and GroupFoo would match, but foo, F/o/o and Froo would not match. If you specify logGroupNamePattern in your request, then only arn, creationTime, and logGroupName are included in the response.",
      "nested_params": []
    },
    {
      "name": "nextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "limit",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "includeLinkedAccounts",
      "type": "boolean",
      "required": false,
      "description": "If you are using a monitoring account, set this to True to have the operation return log groups in the accounts listed in accountIdentifiers. If this parameter is set to true and accountIdentifiers contains a null value, the operation returns all log groups in the monitoring account and all log groups in all source accounts that are linked to the monitoring account.",
      "nested_params": []
    },
    {
      "name": "logGroupClass",
      "type": "string",
      "required": false,
      "description": "Specifies the log group class for this log group. There are three classes: The Standard log class supports all CloudWatch Logs features. The Infrequent Access log class supports a subset of CloudWatch Logs features and incurs lower costs. Use the Delivery log class only for delivering Lambda logs to store in Amazon S3 or Amazon Data Firehose. Log events in log groups in the Delivery class are kept in CloudWatch Logs for only one day. This log class doesn't offer rich CloudWatch Logs capabilities such as CloudWatch Logs Insights queries. For details about the features supported by each class, see Log classes.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "logGroups",
          "type": "list",
          "description": "The log groups.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "logGroupName",
                  "type": "string",
                  "description": "The name of the log group.",
                  "nested_items": []
                },
                {
                  "name": "creationTime",
                  "type": "integer",
                  "description": "The creation time of the log group, expressed as the number of milliseconds after Jan 1, 1970 00:00:00 UTC.",
                  "nested_items": []
                },
                {
                  "name": "retentionInDays",
                  "type": "integer",
                  "description": "The number of days to retain the log events in the specified log group. Possible values are: 1, 3, 5, 7, 14, 30, 60, 90, 120, 150, 180, 365, 400, 545, 731, 1096, 1827, 2192, 2557, 2922, 3288, and 3653.",
                  "nested_items": []
                },
                {
                  "name": "metricFilterCount",
                  "type": "integer",
                  "description": "The number of metric filters.",
                  "nested_items": []
                },
                {
                  "name": "arn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the log group. This version of the ARN includes a trailing :* after the log group name.",
                  "nested_items": []
                },
                {
                  "name": "storedBytes",
                  "type": "integer",
                  "description": "The number of bytes stored.",
                  "nested_items": []
                },
                {
                  "name": "kmsKeyId",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the KMS key to use when encrypting log data.",
                  "nested_items": []
                },
                {
                  "name": "dataProtectionStatus",
                  "type": "string",
                  "description": "Displays whether this log group has a protection policy, or whether it had one in the past. For more information, see PutDataProtectionPolicy.",
                  "nested_items": []
                },
                {
                  "name": "inheritedProperties",
                  "type": "list",
                  "description": "Displays all the properties that this log group has inherited from account-level settings.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "logGroupClass",
                  "type": "string",
                  "description": "This specifies the log group class for this log group. There are three classes:",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "The Standard log class supports all CloudWatch Logs features.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "The Infrequent Access log class supports a subset of CloudWatch Logs features and incurs lower costs.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "Use the Delivery log class only for delivering Lambda logs to store in Amazon S3 or Amazon Data Firehose. Log events in log groups in the Delivery class are kept in CloudWatch Logs for only one day. This log class doesn't offer rich CloudWatch Logs capabilities such as CloudWatch Logs Insights queries.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "logGroupArn",
                  "type": "string",
                  "description": "The Amazon Resource Name (ARN) of the log group. This version of the ARN doesn't include a trailing :* after the log group name.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "",
                      "description": "In the logGroupIdentifier input field in many CloudWatch Logs APIs.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "In the resourceArn field in tagging APIs.",
                      "nested_items": []
                    },
                    {
                      "name": "",
                      "type": "",
                      "description": "In IAM policies, when specifying permissions for TagResource, UntagResource, and ListTagsForResource.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "nextToken",
          "type": "string",
          "description": "The token for the next set of items to return. The token expires after 24 hours.",
          "nested_items": []
        }
      ]
    }
  ]
}