{
  "method_name": "describe_configuration_templates",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/logs/client/describe_configuration_templates.html",
  "description": "Use this operation to return the valid and default values that are used when creating delivery sources, delivery destinations, and deliveries. For more information about deliveries, see CreateDelivery.",
  "parameters": [
    {
      "name": "service",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "logTypes",
      "type": "list",
      "required": false,
      "description": "Use this parameter to filter the response to include only the configuration templates that apply to the log types that you specify here. (string) ---",
      "nested_params": []
    },
    {
      "name": "resourceTypes",
      "type": "list",
      "required": false,
      "description": "Use this parameter to filter the response to include only the configuration templates that apply to the resource types that you specify here. (string) ---",
      "nested_params": []
    },
    {
      "name": "deliveryDestinationTypes",
      "type": "list",
      "required": false,
      "description": "Use this parameter to filter the response to include only the configuration templates that apply to the delivery destination types that you specify here. (string) ---",
      "nested_params": []
    },
    {
      "name": "nextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "limit",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "configurationTemplates",
          "type": "list",
          "description": "An array of objects, where each object describes one configuration template that matches the filters that you specified in the request.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "service",
                  "type": "string",
                  "description": "A string specifying which service this configuration template applies to. For more information about supported services see Enable logging from Amazon Web Services services..",
                  "nested_items": []
                },
                {
                  "name": "logType",
                  "type": "string",
                  "description": "A string specifying which log type this configuration template applies to.",
                  "nested_items": []
                },
                {
                  "name": "resourceType",
                  "type": "string",
                  "description": "A string specifying which resource type this configuration template applies to.",
                  "nested_items": []
                },
                {
                  "name": "deliveryDestinationType",
                  "type": "string",
                  "description": "A string specifying which destination type this configuration template applies to.",
                  "nested_items": []
                },
                {
                  "name": "defaultDeliveryConfigValues",
                  "type": "dict",
                  "description": "A mapping that displays the default value of each property within a delivery's configuration, if it is not specified in the request.",
                  "nested_items": [
                    {
                      "name": "recordFields",
                      "type": "list",
                      "description": "The default record fields that will be delivered when a list of record fields is not provided in a CreateDelivery operation.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "fieldDelimiter",
                      "type": "string",
                      "description": "The default field delimiter that is used in a CreateDelivery operation when the field delimiter is not specified in that operation. The field delimiter is used only when the final output delivery is in Plain, W3C, or Raw format.",
                      "nested_items": []
                    },
                    {
                      "name": "s3DeliveryConfiguration",
                      "type": "dict",
                      "description": "The delivery parameters that are used when you create a delivery to a delivery destination that is an S3 Bucket.",
                      "nested_items": [
                        {
                          "name": "suffixPath",
                          "type": "string",
                          "description": "This string allows re-configuring the S3 object prefix to contain either static or variable sections. The valid variables to use in the suffix path will vary by each log source. To find the values supported for the suffix path for each log source, use the DescribeConfigurationTemplates operation and check the allowedSuffixPathFields field in the response.",
                          "nested_items": []
                        },
                        {
                          "name": "enableHiveCompatiblePath",
                          "type": "boolean",
                          "description": "This parameter causes the S3 objects that contain delivered logs to use a prefix structure that allows for integration with Apache Hive.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "allowedFields",
                  "type": "list",
                  "description": "The allowed fields that a caller can use in the recordFields parameter of a CreateDelivery or UpdateDeliveryConfiguration operation.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "name",
                          "type": "string",
                          "description": "The name to use when specifying this record field in a CreateDelivery or UpdateDeliveryConfiguration operation.",
                          "nested_items": []
                        },
                        {
                          "name": "mandatory",
                          "type": "boolean",
                          "description": "If this is true, the record field must be present in the recordFields parameter provided to a CreateDelivery or UpdateDeliveryConfiguration operation.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "allowedOutputFormats",
                  "type": "list",
                  "description": "The list of delivery destination output formats that are supported by this log source.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "allowedActionForAllowVendedLogsDeliveryForResource",
                  "type": "string",
                  "description": "The action permissions that a caller needs to have to be able to successfully create a delivery source on the desired resource type when calling PutDeliverySource.",
                  "nested_items": []
                },
                {
                  "name": "allowedFieldDelimiters",
                  "type": "list",
                  "description": "The valid values that a caller can use as field delimiters when calling CreateDelivery or UpdateDeliveryConfiguration on a delivery that delivers in Plain, W3C, or Raw format.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "allowedSuffixPathFields",
                  "type": "list",
                  "description": "The list of variable fields that can be used in the suffix path of a delivery that delivers to an S3 bucket.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "nextToken",
          "type": "string",
          "description": "The token for the next set of items to return. The token expires after 24 hours.",
          "nested_items": []
        }
      ]
    }
  ]
}