{
  "method_name": "filter_log_events",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/logs/client/filter_log_events.html",
  "description": "Lists log events from the specified log group. You can list all the log events or filter the results using one or more of the following: You must have the logs:FilterLogEvents permission to perform this operation. You can specify the log group to search by using either logGroupIdentifier or logGroupName. You must include one of these two parameters, but you can't include both. FilterLogEvents is a paginated operation. Each page returned can contain up to 1 MB of log events or up to 10,000 log events. A returned page might only be partially full, or even empty. For example, if the result of a query would return 15,000 log events, the first page isn't guaranteed to have 10,000 log events even if they all fit into 1 MB. Partially full or empty pages don't necessarily mean that pagination is finished. If the results include a nextToken, there might be more log events available. You can return these additional log events by providing the nextToken in a subsequent FilterLogEvents operation. If the results don't include a nextToken, then pagination is finished. The returned log events are sorted by event timestamp, the timestamp when the event was ingested by CloudWatch Logs, and the ID of the PutLogEvents request. If you are using CloudWatch cross-account observability, you can use this operation in a monitoring account and view data from the linked source accounts. For more information, see CloudWatch cross-account observability.",
  "parameters": [
    {
      "name": "logGroupName",
      "type": "string",
      "required": false,
      "description": "The name of the log group to search.",
      "nested_params": []
    },
    {
      "name": "logGroupIdentifier",
      "type": "string",
      "required": false,
      "description": "Specify either the name or ARN of the log group to view log events from. If the log group is in a source account and you are using a monitoring account, you must use the log group ARN.",
      "nested_params": []
    },
    {
      "name": "logStreamNames",
      "type": "list",
      "required": false,
      "description": "Filters the results to only logs from the log streams in this list. If you specify a value for both logStreamNames and logStreamNamePrefix, the action returns an InvalidParameterException error. (string) ---",
      "nested_params": []
    },
    {
      "name": "logStreamNamePrefix",
      "type": "string",
      "required": false,
      "description": "Filters the results to include only events from log streams that have names starting with this prefix. If you specify a value for both logStreamNamePrefix and logStreamNames, the action returns an InvalidParameterException error.",
      "nested_params": []
    },
    {
      "name": "startTime",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "endTime",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "filterPattern",
      "type": "string",
      "required": false,
      "description": "The filter pattern to use. For more information, see Filter and Pattern Syntax. If not provided, all the events are matched.",
      "nested_params": []
    },
    {
      "name": "nextToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "limit",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "interleaved",
      "type": "boolean",
      "required": false,
      "description": "If the value is true, the operation attempts to provide responses that contain events from multiple log streams within the log group, interleaved in a single response. If the value is false, all the matched log events in the first log stream are searched first, then those in the next log stream, and so on. Important As of June 17, 2019, this parameter is ignored and the value is assumed to be true. The response from this operation always interleaves events from multiple log streams within a log group.",
      "nested_params": []
    },
    {
      "name": "unmask",
      "type": "boolean",
      "required": false,
      "description": "Specify true to display the log event fields with all sensitive data unmasked and visible. The default is false. To use this operation with this parameter, you must be signed into an account with the logs:Unmask permission.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "events",
          "type": "list",
          "description": "The matched events.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "logStreamName",
                  "type": "string",
                  "description": "The name of the log stream to which this event belongs.",
                  "nested_items": []
                },
                {
                  "name": "timestamp",
                  "type": "integer",
                  "description": "The time the event occurred, expressed as the number of milliseconds after Jan 1, 1970 00:00:00 UTC.",
                  "nested_items": []
                },
                {
                  "name": "message",
                  "type": "string",
                  "description": "The data contained in the log event.",
                  "nested_items": []
                },
                {
                  "name": "ingestionTime",
                  "type": "integer",
                  "description": "The time the event was ingested, expressed as the number of milliseconds after Jan 1, 1970 00:00:00 UTC.",
                  "nested_items": []
                },
                {
                  "name": "eventId",
                  "type": "string",
                  "description": "The ID of the event.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "searchedLogStreams",
          "type": "list",
          "description": "Important As of May 15, 2020, this parameter is no longer supported. This parameter returns an empty list.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "logStreamName",
                  "type": "string",
                  "description": "The name of the log stream.",
                  "nested_items": []
                },
                {
                  "name": "searchedCompletely",
                  "type": "boolean",
                  "description": "Indicates whether all the events in this log stream were searched.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "nextToken",
          "type": "string",
          "description": "The token to use when requesting the next set of items. The token expires after 24 hours.",
          "nested_items": []
        }
      ]
    }
  ]
}