{
  "method_name": "get_log_anomaly_detector",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/logs/client/get_log_anomaly_detector.html",
  "description": "Retrieves information about the log anomaly detector that you specify. The KMS key ARN detected is valid.",
  "parameters": [
    {
      "name": "anomalyDetectorArn",
      "type": "string",
      "required": true,
      "description": "The ARN of the anomaly detector to retrieve information about. You can find the ARNs of log anomaly detectors in your account by using the ListLogAnomalyDetectors operation.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "detectorName",
          "type": "string",
          "description": "The name of the log anomaly detector.",
          "nested_items": []
        },
        {
          "name": "logGroupArnList",
          "type": "list",
          "description": "An array of structures, where each structure contains the ARN of a log group associated with this anomaly detector.",
          "nested_items": [
            {
              "name": "",
              "type": "string",
              "description": "(string) ---",
              "nested_items": []
            }
          ]
        },
        {
          "name": "evaluationFrequency",
          "type": "string",
          "description": "Specifies how often the anomaly detector runs and look for anomalies. Set this value according to the frequency that the log group receives new logs. For example, if the log group receives new log events every 10 minutes, then setting evaluationFrequency to FIFTEEN_MIN might be appropriate.",
          "nested_items": []
        },
        {
          "name": "filterPattern",
          "type": "string",
          "description": "A symbolic description of how CloudWatch Logs should interpret the data in each log event. For example, a log event can contain timestamps, IP addresses, strings, and so on. You use the filter pattern to specify what to look for in the log event message.",
          "nested_items": []
        },
        {
          "name": "anomalyDetectorStatus",
          "type": "string",
          "description": "Specifies whether the anomaly detector is currently active. To change its status, use the enabled parameter in the UpdateLogAnomalyDetector operation.",
          "nested_items": []
        },
        {
          "name": "kmsKeyId",
          "type": "string",
          "description": "The ARN of the KMS key assigned to this anomaly detector, if any.",
          "nested_items": []
        },
        {
          "name": "creationTimeStamp",
          "type": "integer",
          "description": "The date and time when this anomaly detector was created.",
          "nested_items": []
        },
        {
          "name": "lastModifiedTimeStamp",
          "type": "integer",
          "description": "The date and time when this anomaly detector was most recently modified.",
          "nested_items": []
        },
        {
          "name": "anomalyVisibilityTime",
          "type": "integer",
          "description": "The number of days used as the life cycle of anomalies. After this time, anomalies are automatically baselined and the anomaly detector model will treat new occurrences of similar event as normal.",
          "nested_items": []
        }
      ]
    }
  ]
}