{
  "method_name": "get_log_group_fields",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/logs/client/get_log_group_fields.html",
  "description": "Returns a list of the fields that are included in log events in the specified log group. Includes the percentage of log events that contain each field. The search is limited to a time period that you specify. You can specify the log group to search by using either logGroupIdentifier or logGroupName. You must specify one of these parameters, but you can't specify both. In the results, fields that start with @ are fields generated by CloudWatch Logs. For example, @timestamp is the timestamp of each log event. For more information about the fields that are generated by CloudWatch logs, see Supported Logs and Discovered Fields. The response results are sorted by the frequency percentage, starting with the highest percentage. If you are using CloudWatch cross-account observability, you can use this operation in a monitoring account and view data from the linked source accounts. For more information, see CloudWatch cross-account observability.",
  "parameters": [
    {
      "name": "logGroupName",
      "type": "string",
      "required": false,
      "description": "The name of the log group to search.",
      "nested_params": []
    },
    {
      "name": "time",
      "type": "integer",
      "required": false,
      "description": "The time to set as the center of the query. If you specify time, the 8 minutes before and 8 minutes after this time are searched. If you omit time, the most recent 15 minutes up to the current time are searched. The time value is specified as epoch time, which is the number of seconds since January 1, 1970, 00:00:00 UTC.",
      "nested_params": []
    },
    {
      "name": "logGroupIdentifier",
      "type": "string",
      "required": false,
      "description": "Specify either the name or ARN of the log group to view. If the log group is in a source account and you are using a monitoring account, you must specify the ARN.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "logGroupFields",
          "type": "list",
          "description": "The array of fields found in the query. Each object in the array contains the name of the field, along with the percentage of time it appeared in the log events that were queried.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "name",
                  "type": "string",
                  "description": "The name of a log field.",
                  "nested_items": []
                },
                {
                  "name": "percent",
                  "type": "integer",
                  "description": "The percentage of log events queried that contained the field.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}