{
  "method_name": "get_delivery",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/logs/client/get_delivery.html",
  "description": "Returns complete information about one logical delivery. A delivery is a connection between a delivery source and a delivery destination. A delivery source represents an Amazon Web Services resource that sends logs to an logs delivery destination. The destination can be CloudWatch Logs, Amazon S3, or Firehose. Only some Amazon Web Services services support being configured as a delivery source. These services are listed in Enable logging from Amazon Web Services services. You need to specify the delivery id in this operation. You can find the IDs of the deliveries in your account with the DescribeDeliveries operation.",
  "parameters": [
    {
      "name": "id",
      "type": "string",
      "required": true,
      "description": "The ID of the delivery that you want to retrieve.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "id",
              "type": "string",
              "description": "The unique ID that identifies this delivery in your account.",
              "nested_items": []
            },
            {
              "name": "arn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) that uniquely identifies this delivery.",
              "nested_items": []
            },
            {
              "name": "deliverySourceName",
              "type": "string",
              "description": "The name of the delivery source that is associated with this delivery.",
              "nested_items": []
            },
            {
              "name": "deliveryDestinationArn",
              "type": "string",
              "description": "The ARN of the delivery destination that is associated with this delivery.",
              "nested_items": []
            },
            {
              "name": "deliveryDestinationType",
              "type": "string",
              "description": "Displays whether the delivery destination associated with this delivery is CloudWatch Logs, Amazon S3, or Firehose.",
              "nested_items": []
            },
            {
              "name": "recordFields",
              "type": "list",
              "description": "The record fields used in this delivery.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "fieldDelimiter",
              "type": "string",
              "description": "The field delimiter that is used between record fields when the final output format of a delivery is in Plain, W3C, or Raw format.",
              "nested_items": []
            },
            {
              "name": "s3DeliveryConfiguration",
              "type": "dict",
              "description": "This structure contains delivery configurations that apply only when the delivery destination resource is an S3 bucket.",
              "nested_items": [
                {
                  "name": "suffixPath",
                  "type": "string",
                  "description": "This string allows re-configuring the S3 object prefix to contain either static or variable sections. The valid variables to use in the suffix path will vary by each log source. To find the values supported for the suffix path for each log source, use the DescribeConfigurationTemplates operation and check the allowedSuffixPathFields field in the response.",
                  "nested_items": []
                },
                {
                  "name": "enableHiveCompatiblePath",
                  "type": "boolean",
                  "description": "This parameter causes the S3 objects that contain delivered logs to use a prefix structure that allows for integration with Apache Hive.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}