{
  "method_name": "put_subscription_filter",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/logs/client/put_subscription_filter.html",
  "description": "Creates or updates a subscription filter and associates it with the specified log group. With subscription filters, you can subscribe to a real-time stream of log events ingested through PutLogEvents and have them delivered to a specific destination. When log events are sent to the receiving service, they are Base64 encoded and compressed with the GZIP format. The following destinations are supported for subscription filters: Each log group can have up to two subscription filters associated with it. If you are updating an existing filter, you must specify the correct name in filterName. Using regular expressions in filter patterns is supported. For these filters, there is a quotas of quota of two regular expression patterns within a single filter pattern. There is also a quota of five regular expression patterns per log group. For more information about using regular expressions in filter patterns, see Filter pattern syntax for metric filters, subscription filters, filter log events, and Live Tail. To perform a PutSubscriptionFilter operation for any destination except a Lambda function, you must also have the iam:PassRole permission.",
  "parameters": [
    {
      "name": "logGroupName",
      "type": "string",
      "required": true,
      "description": "The name of the log group.",
      "nested_params": []
    },
    {
      "name": "filterName",
      "type": "string",
      "required": true,
      "description": "A name for the subscription filter. If you are updating an existing filter, you must specify the correct name in filterName. To find the name of the filter currently associated with a log group, use DescribeSubscriptionFilters.",
      "nested_params": []
    },
    {
      "name": "filterPattern",
      "type": "string",
      "required": true,
      "description": "A filter pattern for subscribing to a filtered stream of log events.",
      "nested_params": []
    },
    {
      "name": "destinationArn",
      "type": "string",
      "required": true,
      "description": "The ARN of the destination to deliver matching log events to. Currently, the supported destinations are: An Amazon Kinesis stream belonging to the same account as the subscription filter, for same-account delivery. A logical destination (specified using an ARN) belonging to a different account, for cross-account delivery. If you're setting up a cross-account subscription, the destination must have an IAM policy associated with it. The IAM policy must allow the sender to send logs to the destination. For more information, see PutDestinationPolicy. A Kinesis Data Firehose delivery stream belonging to the same account as the subscription filter, for same-account delivery. A Lambda function belonging to the same account as the subscription filter, for same-account delivery.",
      "nested_params": []
    },
    {
      "name": "roleArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "distribution",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "applyOnTransformedLogs",
      "type": "boolean",
      "required": false,
      "description": "This parameter is valid only for log groups that have an active log transformer. For more information about log transformers, see PutTransformer. If the log group uses either a log-group level or account-level transformer, and you specify true, the subscription filter will be applied on the transformed version of the log events instead of the original ingested log events.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}