{
  "method_name": "put_delivery_source",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/logs/client/put_delivery_source.html",
  "description": "Creates or updates a logical delivery source. A delivery source represents an Amazon Web Services resource that sends logs to an logs delivery destination. The destination can be CloudWatch Logs, Amazon S3, or Firehose. To configure logs delivery between a delivery destination and an Amazon Web Services service that is supported as a delivery source, you must do the following: You can configure a single delivery source to send logs to multiple destinations by creating multiple deliveries. You can also create multiple deliveries to configure multiple delivery sources to send logs to the same delivery destination. Only some Amazon Web Services services support being configured as a delivery source. These services are listed as Supported [V2 Permissions] in the table at Enabling logging from Amazon Web Services services. If you use this operation to update an existing delivery source, all the current delivery source parameters are overwritten with the new parameter values that you specify.",
  "parameters": [
    {
      "name": "name",
      "type": "string",
      "required": true,
      "description": "A name for this delivery source. This name must be unique for all delivery sources in your account.",
      "nested_params": []
    },
    {
      "name": "resourceArn",
      "type": "string",
      "required": true,
      "description": "The ARN of the Amazon Web Services resource that is generating and sending logs. For example, arn:aws:workmail:us-east-1:123456789012:organization/m-1234EXAMPLEabcd1234abcd1234abcd1234",
      "nested_params": []
    },
    {
      "name": "logType",
      "type": "string",
      "required": true,
      "description": "Defines the type of log that the source is sending. For Amazon Bedrock, the valid value is APPLICATION_LOGS. For CloudFront, the valid value is ACCESS_LOGS. For Amazon CodeWhisperer, the valid value is EVENT_LOGS. For Elemental MediaPackage, the valid values are EGRESS_ACCESS_LOGS and INGRESS_ACCESS_LOGS. For Elemental MediaTailor, the valid values are AD_DECISION_SERVER_LOGS, MANIFEST_SERVICE_LOGS, and TRANSCODE_LOGS. For IAM Identity Center, the valid value is ERROR_LOGS. For Amazon Q, the valid value is EVENT_LOGS. For Amazon SES mail manager, the valid value is APPLICATION_LOG. For Amazon WorkMail, the valid values are ACCESS_CONTROL_LOGS, AUTHENTICATION_LOGS, WORKMAIL_AVAILABILITY_PROVIDER_LOGS, WORKMAIL_MAILBOX_ACCESS_LOGS, and WORKMAIL_PERSONAL_ACCESS_TOKEN_LOGS.",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "dict",
      "required": false,
      "description": "An optional list of key-value pairs to associate with the resource. For more information about tagging, see Tagging Amazon Web Services resources (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "deliverySource",
          "type": "dict",
          "description": "A structure containing information about the delivery source that was just created or updated.",
          "nested_items": [
            {
              "name": "name",
              "type": "string",
              "description": "The unique name of the delivery source.",
              "nested_items": []
            },
            {
              "name": "arn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) that uniquely identifies this delivery source.",
              "nested_items": []
            },
            {
              "name": "resourceArns",
              "type": "list",
              "description": "This array contains the ARN of the Amazon Web Services resource that sends logs and is represented by this delivery source. Currently, only one ARN can be in the array.",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "service",
              "type": "string",
              "description": "The Amazon Web Services service that is sending logs.",
              "nested_items": []
            },
            {
              "name": "logType",
              "type": "string",
              "description": "The type of log that the source is sending. For valid values for this parameter, see the documentation for the source service.",
              "nested_items": []
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}