{
  "method_name": "put_destination",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/logs/client/put_destination.html",
  "description": "Creates or updates a destination. This operation is used only to create destinations for cross-account subscriptions. A destination encapsulates a physical resource (such as an Amazon Kinesis stream). With a destination, you can subscribe to a real-time stream of log events for a different account, ingested using PutLogEvents. Through an access policy, a destination controls what is written to it. By default, PutDestination does not set any access policy with the destination, which means a cross-account user cannot call PutSubscriptionFilter against this destination. To enable this, the destination owner must call PutDestinationPolicy after PutDestination. To perform a PutDestination operation, you must also have the iam:PassRole permission.",
  "parameters": [
    {
      "name": "destinationName",
      "type": "string",
      "required": true,
      "description": "A name for the destination.",
      "nested_params": []
    },
    {
      "name": "targetArn",
      "type": "string",
      "required": true,
      "description": "The ARN of an Amazon Kinesis stream to which to deliver matching log events.",
      "nested_params": []
    },
    {
      "name": "roleArn",
      "type": "string",
      "required": true,
      "description": "The ARN of an IAM role that grants CloudWatch Logs permissions to call the Amazon Kinesis PutRecord operation on the destination stream.",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "dict",
      "required": false,
      "description": "An optional list of key-value pairs to associate with the resource. For more information about tagging, see Tagging Amazon Web Services resources (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "destination",
          "type": "dict",
          "description": "The destination.",
          "nested_items": [
            {
              "name": "destinationName",
              "type": "string",
              "description": "The name of the destination.",
              "nested_items": []
            },
            {
              "name": "targetArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the physical target where the log events are delivered (for example, a Kinesis stream).",
              "nested_items": []
            },
            {
              "name": "roleArn",
              "type": "string",
              "description": "A role for impersonation, used when delivering log events to the target.",
              "nested_items": []
            },
            {
              "name": "accessPolicy",
              "type": "string",
              "description": "An IAM policy document that governs which Amazon Web Services accounts can create subscription filters against this destination.",
              "nested_items": []
            },
            {
              "name": "arn",
              "type": "string",
              "description": "The ARN of this destination.",
              "nested_items": []
            },
            {
              "name": "creationTime",
              "type": "integer",
              "description": "The creation time of the destination, expressed as the number of milliseconds after Jan 1, 1970 00:00:00 UTC.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}