{
  "method_name": "put_delivery_destination",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/logs/client/put_delivery_destination.html",
  "description": "Creates or updates a logical delivery destination. A delivery destination is an Amazon Web Services resource that represents an Amazon Web Services service that logs can be sent to. CloudWatch Logs, Amazon S3, and Firehose are supported as logs delivery destinations. To configure logs delivery between a supported Amazon Web Services service and a destination, you must do the following: You can configure a single delivery source to send logs to multiple destinations by creating multiple deliveries. You can also create multiple deliveries to configure multiple delivery sources to send logs to the same delivery destination. Only some Amazon Web Services services support being configured as a delivery source. These services are listed as Supported [V2 Permissions] in the table at Enabling logging from Amazon Web Services services. If you use this operation to update an existing delivery destination, all the current delivery destination parameters are overwritten with the new parameter values that you specify.",
  "parameters": [
    {
      "name": "name",
      "type": "string",
      "required": true,
      "description": "A name for this delivery destination. This name must be unique for all delivery destinations in your account.",
      "nested_params": []
    },
    {
      "name": "outputFormat",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "deliveryDestinationConfiguration",
      "type": "dict",
      "required": true,
      "description": "A structure that contains the ARN of the Amazon Web Services resource that will receive the logs. The ARN of the Amazon Web Services destination that this delivery destination represents. That Amazon Web Services destination can be a log group in CloudWatch Logs, an Amazon S3 bucket, or a delivery stream in Firehose.",
      "nested_params": [
        {
          "name": "destinationResourceArn",
          "type": "string",
          "required": false,
          "description": "The ARN of the Amazon Web Services destination that this delivery destination represents. That Amazon Web Services destination can be a log group in CloudWatch Logs, an Amazon S3 bucket, or a delivery stream in Firehose.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "tags",
      "type": "dict",
      "required": false,
      "description": "An optional list of key-value pairs to associate with the resource. For more information about tagging, see Tagging Amazon Web Services resources (string) --- (string) ---",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "deliveryDestination",
          "type": "dict",
          "description": "A structure containing information about the delivery destination that you just created or updated.",
          "nested_items": [
            {
              "name": "name",
              "type": "string",
              "description": "The name of this delivery destination.",
              "nested_items": []
            },
            {
              "name": "arn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) that uniquely identifies this delivery destination.",
              "nested_items": []
            },
            {
              "name": "deliveryDestinationType",
              "type": "string",
              "description": "Displays whether this delivery destination is CloudWatch Logs, Amazon S3, or Firehose.",
              "nested_items": []
            },
            {
              "name": "outputFormat",
              "type": "string",
              "description": "The format of the logs that are sent to this delivery destination.",
              "nested_items": []
            },
            {
              "name": "deliveryDestinationConfiguration",
              "type": "dict",
              "description": "A structure that contains the ARN of the Amazon Web Services resource that will receive the logs.",
              "nested_items": [
                {
                  "name": "destinationResourceArn",
                  "type": "string",
                  "description": "The ARN of the Amazon Web Services destination that this delivery destination represents. That Amazon Web Services destination can be a log group in CloudWatch Logs, an Amazon S3 bucket, or a delivery stream in Firehose.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "",
                  "type": "string",
                  "description": "(string) ---",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}