{
  "method_name": "start_live_tail",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/logs/client/start_live_tail.html",
  "description": "Starts a Live Tail streaming session for one or more log groups. A Live Tail session returns a stream of log events that have been recently ingested in the log groups. For more information, see Use Live Tail to view logs in near real time. The response to this operation is a response stream, over which the server sends live log events and the client receives them. The following objects are sent over the stream: For examples of using an SDK to start a Live Tail session, see Start a Live Tail session using an Amazon Web Services SDK.",
  "parameters": [
    {
      "name": "logGroupIdentifiers",
      "type": "list",
      "required": true,
      "description": "An array where each item in the array is a log group to include in the Live Tail session. Specify each log group by its ARN. If you specify an ARN, the ARN can't end with an asterisk (*). (string) ---",
      "nested_params": []
    },
    {
      "name": "logStreamNames",
      "type": "list",
      "required": false,
      "description": "If you specify this parameter, then only log events in the log streams that you specify here are included in the Live Tail session. If you specify this field, you can't also specify the logStreamNamePrefixes field. (string) ---",
      "nested_params": []
    },
    {
      "name": "logStreamNamePrefixes",
      "type": "list",
      "required": false,
      "description": "If you specify this parameter, then only log events in the log streams that have names that start with the prefixes that you specify here are included in the Live Tail session. If you specify this field, you can't also specify the logStreamNames field. (string) ---",
      "nested_params": []
    },
    {
      "name": "logEventFilterPattern",
      "type": "string",
      "required": false,
      "description": "An optional pattern to use to filter the results to include only log events that match the pattern. For example, a filter pattern of error 404 causes only log events that include both error and 404 to be included in the Live Tail stream. Regular expression filter patterns are supported. For more information about filter pattern syntax, see Filter and Pattern Syntax.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "responseStream",
          "type": "EventStream",
          "description": "An object that includes the stream returned by your request. It can include both log events and exceptions.",
          "nested_items": [
            {
              "name": "sessionStart",
              "type": "dict",
              "description": "This object contains information about this Live Tail session, including the log groups included and the log stream filters, if any.",
              "nested_items": [
                {
                  "name": "requestId",
                  "type": "string",
                  "description": "The unique ID generated by CloudWatch Logs to identify this Live Tail session request.",
                  "nested_items": []
                },
                {
                  "name": "sessionId",
                  "type": "string",
                  "description": "The unique ID generated by CloudWatch Logs to identify this Live Tail session.",
                  "nested_items": []
                },
                {
                  "name": "logGroupIdentifiers",
                  "type": "list",
                  "description": "An array of the names and ARNs of the log groups included in this Live Tail session.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "logStreamNames",
                  "type": "list",
                  "description": "If your StartLiveTail operation request included a logStreamNames parameter that filtered the session to only include certain log streams, these streams are listed here.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "logStreamNamePrefixes",
                  "type": "list",
                  "description": "If your StartLiveTail operation request included a logStreamNamePrefixes parameter that filtered the session to only include log streams that have names that start with certain prefixes, these prefixes are listed here.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "logEventFilterPattern",
                  "type": "string",
                  "description": "An optional pattern to filter the results to include only log events that match the pattern. For example, a filter pattern of error 404 displays only log events that include both error and 404.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "sessionUpdate",
              "type": "dict",
              "description": "This object contains the log events and session metadata.",
              "nested_items": [
                {
                  "name": "sessionMetadata",
                  "type": "dict",
                  "description": "This object contains the session metadata for a Live Tail session.",
                  "nested_items": [
                    {
                      "name": "sampled",
                      "type": "boolean",
                      "description": "If this is true, then more than 500 log events matched the request for this update, and the sessionResults includes a sample of 500 of those events.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "sessionResults",
                  "type": "list",
                  "description": "An array, where each member of the array includes the information for one log event in the Live Tail session.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "logStreamName",
                          "type": "string",
                          "description": "The name of the log stream that ingested this log event.",
                          "nested_items": []
                        },
                        {
                          "name": "logGroupIdentifier",
                          "type": "string",
                          "description": "The name or ARN of the log group that ingested this log event.",
                          "nested_items": []
                        },
                        {
                          "name": "message",
                          "type": "string",
                          "description": "The log event message text.",
                          "nested_items": []
                        },
                        {
                          "name": "timestamp",
                          "type": "integer",
                          "description": "The timestamp specifying when this log event was created.",
                          "nested_items": []
                        },
                        {
                          "name": "ingestionTime",
                          "type": "integer",
                          "description": "The timestamp specifying when this log event was ingested into the log group.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "SessionTimeoutException",
              "type": "dict",
              "description": "This exception is returned in the stream when the Live Tail session times out. Live Tail sessions time out after three hours.",
              "nested_items": [
                {
                  "name": "message",
                  "type": "string",
                  "description": "",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "SessionStreamingException",
              "type": "dict",
              "description": "This exception is returned if an unknown error occurs.",
              "nested_items": [
                {
                  "name": "message",
                  "type": "string",
                  "description": "",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}