{
  "method_name": "update_anomaly",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/logs/client/update_anomaly.html",
  "description": "Use this operation to suppress anomaly detection for a specified anomaly or pattern. If you suppress an anomaly, CloudWatch Logs won't report new occurrences of that anomaly and won't update that anomaly with new data. If you suppress a pattern, CloudWatch Logs won't report any anomalies related to that pattern. You must specify either anomalyId or patternId, but you can't specify both parameters in the same operation. If you have previously used this operation to suppress detection of a pattern or anomaly, you can use it again to cause CloudWatch Logs to end the suppression. To do this, use this operation and specify the anomaly or pattern to stop suppressing, and omit the suppressionType and suppressionPeriod parameters.",
  "parameters": [
    {
      "name": "anomalyId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "patternId",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "anomalyDetectorArn",
      "type": "string",
      "required": true,
      "description": "The ARN of the anomaly detector that this operation is to act on.",
      "nested_params": []
    },
    {
      "name": "suppressionType",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "suppressionPeriod",
      "type": "dict",
      "required": false,
      "description": "If you are temporarily suppressing an anomaly or pattern, use this structure to specify how long the suppression is to last. value (integer) --- Specifies the number of seconds, minutes or hours to suppress this anomaly. There is no maximum. suppressionUnit (string) --- Specifies whether the value of value is in seconds, minutes, or hours.",
      "nested_params": [
        {
          "name": "value",
          "type": "integer",
          "required": false,
          "description": "Specifies the number of seconds, minutes or hours to suppress this anomaly. There is no maximum.",
          "nested_params": []
        },
        {
          "name": "suppressionUnit",
          "type": "string",
          "required": false,
          "description": "Specifies whether the value of value is in seconds, minutes, or hours.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "baseline",
      "type": "boolean",
      "required": false,
      "description": "Set this to true to prevent CloudWatch Logs from displaying this behavior as an anomaly in the future. The behavior is then treated as baseline behavior. However, if similar but more severe occurrences of this behavior occur in the future, those will still be reported as anomalies. The default is false.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}