{
  "method_name": "update_channel_flow",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/chime-sdk-messaging/client/update_channel_flow.html",
  "description": "Updates channel flow attributes. This is a developer API.",
  "parameters": [
    {
      "name": "ChannelFlowArn",
      "type": "string",
      "required": true,
      "description": "The ARN of the channel flow.",
      "nested_params": []
    },
    {
      "name": "Processors",
      "type": "list",
      "required": true,
      "description": "Information about the processor Lambda functions (dict) --- The information about a processor in a channel flow. The name of the channel flow. The information about the type of processor and its identifier. Indicates that the processor is of type Lambda. The ARN of the Lambda message processing function. Controls how the Lambda function is invoked. The sequence in which processors run. If you have multiple processors in a channel flow, message processing goes through each processor in the sequence. The value determines the sequence. At this point, we support only 1 processor within a flow. Determines whether to continue with message processing or stop it in cases where communication with a processor fails. If a processor has a fallback action of ABORT and communication with it fails, the processor sets the message status to FAILED and does not send the message to any recipients. Note that if the last processor in the channel flow sequence has a fallback action of CONTINUE and communication with the processor fails, then the message is considered processed and sent to recipients of the channel.",
      "nested_params": [
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name of the channel flow.",
          "nested_params": []
        },
        {
          "name": "Configuration",
          "type": "dict",
          "required": false,
          "description": "The information about the type of processor and its identifier.",
          "nested_params": [
            {
              "name": "Lambda",
              "type": "dict",
              "required": false,
              "description": "Indicates that the processor is of type Lambda.",
              "nested_params": [
                {
                  "name": "ResourceArn",
                  "type": "string",
                  "required": false,
                  "description": "The ARN of the Lambda message processing function.",
                  "nested_params": []
                },
                {
                  "name": "InvocationType",
                  "type": "string",
                  "required": false,
                  "description": "Controls how the Lambda function is invoked.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "ExecutionOrder",
          "type": "integer",
          "required": false,
          "description": "The sequence in which processors run. If you have multiple processors in a channel flow, message processing goes through each processor in the sequence. The value determines the sequence. At this point, we support only 1 processor within a flow.",
          "nested_params": []
        },
        {
          "name": "FallbackAction",
          "type": "string",
          "required": false,
          "description": "Determines whether to continue with message processing or stop it in cases where communication with a processor fails. If a processor has a fallback action of ABORT and communication with it fails, the processor sets the message status to FAILED and does not send the message to any recipients. Note that if the last processor in the channel flow sequence has a fallback action of CONTINUE and communication with the processor fails, then the message is considered processed and sent to recipients of the channel.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Name",
      "type": "string",
      "required": true,
      "description": "The name of the channel flow.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ChannelFlowArn",
          "type": "string",
          "description": "The ARN of the channel flow.",
          "nested_items": []
        }
      ]
    }
  ]
}