{
  "method_name": "initiate_vault_lock",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/glacier/client/initiate_vault_lock.html",
  "description": "This operation initiates the vault locking process by doing the following: You can set one vault lock policy for each vault and this policy can be up to 20 KB in size. For more information about vault lock policies, see Amazon Glacier Access Control with Vault Lock Policies. You must complete the vault locking process within 24 hours after the vault lock enters the InProgress state. After the 24 hour window ends, the lock ID expires, the vault automatically exits the InProgress state, and the vault lock policy is removed from the vault. You call  CompleteVaultLock to complete the vault locking process by setting the state of the vault lock to Locked. After a vault lock is in the Locked state, you cannot initiate a new vault lock for the vault. You can abort the vault locking process by calling  AbortVaultLock. You can get the state of the vault lock by calling  GetVaultLock. For more information about the vault locking process, Amazon Glacier Vault Lock. If this operation is called when the vault lock is in the InProgress state, the operation returns an AccessDeniedException error. When the vault lock is in the InProgress state you must call  AbortVaultLock before you can initiate a new vault lock policy.",
  "parameters": [
    {
      "name": "accountId",
      "type": "string",
      "required": false,
      "description": "The AccountId value is the AWS account ID. This value must match the AWS account ID associated with the credentials used to sign the request. You can either specify an AWS account ID or optionally a single --\u0098 -' (hyphen), in which case Amazon Glacier uses the AWS account ID associated with the credentials used to sign the request. If you specify your account ID, do not include any hyphens (--\u0098-') in the ID. Note: this parameter is set to '-' bydefault if no value is not specified.",
      "nested_params": []
    },
    {
      "name": "vaultName",
      "type": "string",
      "required": true,
      "description": "The name of the vault.",
      "nested_params": []
    },
    {
      "name": "policy",
      "type": "dict",
      "required": false,
      "description": "The vault lock policy as a JSON string, which uses '\" as an escape character. Policy (string) --- The vault lock policy.",
      "nested_params": [
        {
          "name": "Policy",
          "type": "string",
          "required": false,
          "description": "The vault lock policy.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "lockId",
          "type": "string",
          "description": "The lock ID, which is used to complete the vault locking process.",
          "nested_items": []
        }
      ]
    }
  ]
}