{
  "method_name": "list_parts",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/glacier/client/list_parts.html",
  "description": "This operation lists the parts of an archive that have been uploaded in a specific multipart upload. You can make this request at any time during an in-progress multipart upload before you complete the upload (see  CompleteMultipartUpload. List Parts returns an error for completed uploads. The list returned in the List Parts response is sorted by part range. The List Parts operation supports pagination. By default, this operation returns up to 50 uploaded parts in the response. You should always check the response for a marker at which to continue the list; if there are no more items the marker is null. To return a list of parts that begins at a specific part, set the marker request parameter to the value you obtained from a previous List Parts request. You can also limit the number of parts returned in the response by specifying the limit parameter in the request. An AWS account has full permission to perform all operations (actions). However, AWS Identity and Access Management (IAM) users don't have any permissions by default. You must grant them explicit permission to perform specific actions. For more information, see Access Control Using AWS Identity and Access Management (IAM). For conceptual information and the underlying REST API, see Working with Archives in Amazon S3 Glacier and List Parts in the Amazon Glacier Developer Guide.",
  "parameters": [
    {
      "name": "accountId",
      "type": "string",
      "required": false,
      "description": "The AccountId value is the AWS account ID of the account that owns the vault. You can either specify an AWS account ID or optionally a single --\u0098 -' (hyphen), in which case Amazon S3 Glacier uses the AWS account ID associated with the credentials used to sign the request. If you use an account ID, do not include any hyphens (--\u0098-') in the ID. Note: this parameter is set to '-' bydefault if no value is not specified.",
      "nested_params": []
    },
    {
      "name": "vaultName",
      "type": "string",
      "required": true,
      "description": "The name of the vault.",
      "nested_params": []
    },
    {
      "name": "uploadId",
      "type": "string",
      "required": true,
      "description": "The upload ID of the multipart upload.",
      "nested_params": []
    },
    {
      "name": "marker",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "limit",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "MultipartUploadId",
          "type": "string",
          "description": "The ID of the upload to which the parts are associated.",
          "nested_items": []
        },
        {
          "name": "VaultARN",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the vault to which the multipart upload was initiated.",
          "nested_items": []
        },
        {
          "name": "ArchiveDescription",
          "type": "string",
          "description": "The description of the archive that was specified in the Initiate Multipart Upload request.",
          "nested_items": []
        },
        {
          "name": "PartSizeInBytes",
          "type": "integer",
          "description": "The part size in bytes. This is the same value that you specified in the Initiate Multipart Upload request.",
          "nested_items": []
        },
        {
          "name": "CreationDate",
          "type": "string",
          "description": "The UTC time at which the multipart upload was initiated.",
          "nested_items": []
        },
        {
          "name": "Parts",
          "type": "list",
          "description": "A list of the part sizes of the multipart upload. Each object in the array contains a RangeBytes and sha256-tree-hash name/value pair.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "RangeInBytes",
                  "type": "string",
                  "description": "The byte range of a part, inclusive of the upper value of the range.",
                  "nested_items": []
                },
                {
                  "name": "SHA256TreeHash",
                  "type": "string",
                  "description": "The SHA256 tree hash value that Amazon S3 Glacier calculated for the part. This field is never null.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "Marker",
          "type": "string",
          "description": "An opaque string that represents where to continue pagination of the results. You use the marker in a new List Parts request to obtain more jobs in the list. If there are no more parts, this value is null.",
          "nested_items": []
        }
      ]
    }
  ]
}