{
  "method_name": "set_vault_notifications",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/glacier/client/set_vault_notifications.html",
  "description": "This operation configures notifications that will be sent when specific events happen to a vault. By default, you don't get any notifications. To configure vault notifications, send a PUT request to the notification-configuration subresource of the vault. The request should include a JSON document that provides an Amazon SNS topic and specific events for which you want Amazon S3 Glacier to send notifications to the topic. Amazon SNS topics must grant permission to the vault to be allowed to publish notifications to the topic. You can configure a vault to publish a notification for the following vault events: An AWS account has full permission to perform all operations (actions). However, AWS Identity and Access Management (IAM) users don't have any permissions by default. You must grant them explicit permission to perform specific actions. For more information, see Access Control Using AWS Identity and Access Management (IAM). For conceptual information and underlying REST API, see Configuring Vault Notifications in Amazon S3 Glacier and Set Vault Notification Configuration in the Amazon Glacier Developer Guide.",
  "parameters": [
    {
      "name": "accountId",
      "type": "string",
      "required": false,
      "description": "The AccountId value is the AWS account ID of the account that owns the vault. You can either specify an AWS account ID or optionally a single --\u0098 -' (hyphen), in which case Amazon S3 Glacier uses the AWS account ID associated with the credentials used to sign the request. If you use an account ID, do not include any hyphens (--\u0098-') in the ID. Note: this parameter is set to '-' bydefault if no value is not specified.",
      "nested_params": []
    },
    {
      "name": "vaultName",
      "type": "string",
      "required": true,
      "description": "The name of the vault.",
      "nested_params": []
    },
    {
      "name": "vaultNotificationConfig",
      "type": "dict",
      "required": false,
      "description": "Provides options for specifying notification configuration. SNSTopic (string) --- The Amazon Simple Notification Service (Amazon SNS) topic Amazon Resource Name (ARN). Events (list) --- A list of one or more events for which Amazon S3 Glacier will send a notification to the specified Amazon SNS topic. (string) ---",
      "nested_params": [
        {
          "name": "SNSTopic",
          "type": "string",
          "required": false,
          "description": "The Amazon Simple Notification Service (Amazon SNS) topic Amazon Resource Name (ARN).",
          "nested_params": []
        },
        {
          "name": "Events",
          "type": "list",
          "required": false,
          "description": "A list of one or more events for which Amazon S3 Glacier will send a notification to the specified Amazon SNS topic.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "type": null
    }
  ]
}