{
  "method_name": "upload_multipart_part",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/glacier/client/upload_multipart_part.html",
  "description": "This operation uploads a part of an archive. You can upload archive parts in any order. You can also upload them in parallel. You can upload up to 10,000 parts for a multipart upload. Amazon Glacier rejects your upload part request if any of the following conditions is true: This operation is idempotent. If you upload the same part multiple times, the data included in the most recent request overwrites the previously uploaded data. An AWS account has full permission to perform all operations (actions). However, AWS Identity and Access Management (IAM) users don't have any permissions by default. You must grant them explicit permission to perform specific actions. For more information, see Access Control Using AWS Identity and Access Management (IAM). For conceptual information and underlying REST API, see Uploading Large Archives in Parts (Multipart Upload) and Upload Part in the Amazon Glacier Developer Guide.",
  "parameters": [
    {
      "name": "accountId",
      "type": "string",
      "required": false,
      "description": "The AccountId value is the AWS account ID of the account that owns the vault. You can either specify an AWS account ID or optionally a single --\u0098 -' (hyphen), in which case Amazon S3 Glacier uses the AWS account ID associated with the credentials used to sign the request. If you use an account ID, do not include any hyphens (--\u0098-') in the ID. Note: this parameter is set to '-' bydefault if no value is not specified.",
      "nested_params": []
    },
    {
      "name": "vaultName",
      "type": "string",
      "required": true,
      "description": "The name of the vault.",
      "nested_params": []
    },
    {
      "name": "uploadId",
      "type": "string",
      "required": true,
      "description": "The upload ID of the multipart upload.",
      "nested_params": []
    },
    {
      "name": "checksum",
      "type": "string",
      "required": false,
      "description": "The SHA256 tree hash of the data being uploaded. Please note that this parameter is automatically populated if it is not provided. Including this parameter is not required.",
      "nested_params": []
    },
    {
      "name": "range",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "body",
      "type": "bytes or seekable file-like object",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "checksum",
          "type": "string",
          "description": "The SHA256 tree hash that Amazon S3 Glacier computed for the uploaded part.",
          "nested_items": []
        }
      ]
    }
  ]
}