{
  "method_name": "create_state_machine",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/stepfunctions/client/create_state_machine.html",
  "description": "Creates a state machine. A state machine consists of a collection of states that can do work ( Task states), determine to which states to transition next ( Choice states), stop an execution with an error ( Fail states), and so on. State machines are specified using a JSON-based, structured language. For more information, see Amazon States Language in the Step Functions User Guide. If you set the publish parameter of this API action to true, it publishes version 1 as the first revision of the state machine. For additional control over security, you can encrypt your data using a customer-managed key for Step Functions state machines. You can configure a symmetric KMS key and data key reuse period when creating or updating a State Machine. The execution history and state machine definition will be encrypted with the key applied to the State Machine.",
  "parameters": [
    {
      "name": "name",
      "type": "string",
      "required": true,
      "description": "The name of the state machine. A name must not contain: white space brackets < > { } [ ] wildcard characters ? * special characters \" # % \\ ^ | ~ ` $ & , ; : / control characters ( U+0000-001F, U+007F-009F) To enable logging with CloudWatch Logs, the name should only contain 0-9, A-Z, a-z, - and _.",
      "nested_params": []
    },
    {
      "name": "definition",
      "type": "string",
      "required": true,
      "description": "The Amazon States Language definition of the state machine. See Amazon States Language.",
      "nested_params": []
    },
    {
      "name": "roleArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the IAM role to use for this state machine.",
      "nested_params": []
    },
    {
      "name": "type",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "loggingConfiguration",
      "type": "dict",
      "required": false,
      "description": "Defines what execution history events are logged and where they are logged. level (string) --- Defines which category of execution history events are logged. includeExecutionData (boolean) --- Determines whether execution data is included in your log. When set to false, data is excluded. destinations (list) --- An array of objects that describes where your execution history events will be logged. Limited to size 1. Required, if your log level is not set to OFF. (dict) --- cloudWatchLogsLogGroup (dict) --- An object describing a CloudWatch log group. For more information, see AWS::Logs::LogGroup in the CloudFormation User Guide. logGroupArn (string) --- The ARN of the the CloudWatch log group to which you want your logs emitted to. The ARN must end with :*",
      "nested_params": [
        {
          "name": "level",
          "type": "string",
          "required": false,
          "description": "Defines which category of execution history events are logged.",
          "nested_params": []
        },
        {
          "name": "includeExecutionData",
          "type": "boolean",
          "required": false,
          "description": "Determines whether execution data is included in your log. When set to false, data is excluded.",
          "nested_params": []
        },
        {
          "name": "destinations",
          "type": "list",
          "required": false,
          "description": "An array of objects that describes where your execution history events will be logged. Limited to size 1. Required, if your log level is not set to OFF.",
          "nested_params": [
            {
              "name": "cloudWatchLogsLogGroup",
              "type": "dict",
              "required": false,
              "description": "An object describing a CloudWatch log group. For more information, see AWS::Logs::LogGroup in the CloudFormation User Guide.",
              "nested_params": [
                {
                  "name": "logGroupArn",
                  "type": "string",
                  "required": false,
                  "description": "The ARN of the the CloudWatch log group to which you want your logs emitted to. The ARN must end with :*",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "tags",
      "type": "list",
      "required": false,
      "description": "Tags to be added when creating a state machine. An array of key-value pairs. For more information, see Using Cost Allocation Tags in the Amazon Web Services Billing and Cost Management User Guide, and Controlling Access Using IAM Tags. Tags may only contain Unicode letters, digits, white space, or these symbols: _ . : / = + - @. (dict) --- Tags are key-value pairs that can be associated with Step Functions state machines and activities. key (string) --- The key of a tag. value (string) --- The value of a tag.",
      "nested_params": [
        {
          "name": "key",
          "type": "string",
          "required": false,
          "description": "The key of a tag.",
          "nested_params": []
        },
        {
          "name": "value",
          "type": "string",
          "required": false,
          "description": "The value of a tag.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "tracingConfiguration",
      "type": "dict",
      "required": false,
      "description": "Selects whether X-Ray tracing is enabled. enabled (boolean) --- When set to true, X-Ray tracing is enabled.",
      "nested_params": [
        {
          "name": "enabled",
          "type": "boolean",
          "required": false,
          "description": "When set to true, X-Ray tracing is enabled.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "publish",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "versionDescription",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "encryptionConfiguration",
      "type": "dict",
      "required": true,
      "description": "Settings to configure server-side encryption. kmsKeyId (string) --- An alias, alias ARN, key ID, or key ARN of a symmetric encryption KMS key to encrypt data. To specify a KMS key in a different Amazon Web Services account, you must use the key ARN or alias ARN. kmsDataKeyReusePeriodSeconds (integer) --- Maximum duration that Step Functions will reuse data keys. When the period expires, Step Functions will call GenerateDataKey. Only applies to customer managed keys. Encryption type.",
      "nested_params": [
        {
          "name": "kmsKeyId",
          "type": "string",
          "required": false,
          "description": "An alias, alias ARN, key ID, or key ARN of a symmetric encryption KMS key to encrypt data. To specify a KMS key in a different Amazon Web Services account, you must use the key ARN or alias ARN.",
          "nested_params": []
        },
        {
          "name": "kmsDataKeyReusePeriodSeconds",
          "type": "integer",
          "required": false,
          "description": "Maximum duration that Step Functions will reuse data keys. When the period expires, Step Functions will call GenerateDataKey. Only applies to customer managed keys.",
          "nested_params": []
        },
        {
          "name": "type",
          "type": "string",
          "required": false,
          "description": "Encryption type.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "stateMachineArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) that identifies the created state machine.",
          "nested_items": []
        },
        {
          "name": "creationDate",
          "type": "datetime",
          "description": "The date the state machine is created.",
          "nested_items": []
        },
        {
          "name": "stateMachineVersionArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) that identifies the created state machine version. If you do not set the publish parameter to true, this field returns null value.",
          "nested_items": []
        }
      ]
    }
  ]
}