{
  "method_name": "create_activity",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/stepfunctions/client/create_activity.html",
  "description": "Creates an activity. An activity is a task that you write in any programming language and host on any machine that has access to Step Functions. Activities must poll Step Functions using the GetActivityTask API action and respond using SendTask* API actions. This function lets Step Functions know the existence of your activity and returns an identifier for use in a state machine and when polling from the activity.",
  "parameters": [
    {
      "name": "name",
      "type": "string",
      "required": true,
      "description": "The name of the activity to create. This name must be unique for your Amazon Web Services account and region for 90 days. For more information, see Limits Related to State Machine Executions in the Step Functions Developer Guide. A name must not contain: white space brackets < > { } [ ] wildcard characters ? * special characters \" # % \\ ^ | ~ ` $ & , ; : / control characters ( U+0000-001F, U+007F-009F) To enable logging with CloudWatch Logs, the name should only contain 0-9, A-Z, a-z, - and _.",
      "nested_params": []
    },
    {
      "name": "tags",
      "type": "list",
      "required": false,
      "description": "The list of tags to add to a resource. An array of key-value pairs. For more information, see Using Cost Allocation Tags in the Amazon Web Services Billing and Cost Management User Guide, and Controlling Access Using IAM Tags. Tags may only contain Unicode letters, digits, white space, or these symbols: _ . : / = + - @. (dict) --- Tags are key-value pairs that can be associated with Step Functions state machines and activities. key (string) --- The key of a tag. value (string) --- The value of a tag.",
      "nested_params": [
        {
          "name": "key",
          "type": "string",
          "required": false,
          "description": "The key of a tag.",
          "nested_params": []
        },
        {
          "name": "value",
          "type": "string",
          "required": false,
          "description": "The value of a tag.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "encryptionConfiguration",
      "type": "dict",
      "required": true,
      "description": "Settings to configure server-side encryption. kmsKeyId (string) --- An alias, alias ARN, key ID, or key ARN of a symmetric encryption KMS key to encrypt data. To specify a KMS key in a different Amazon Web Services account, you must use the key ARN or alias ARN. kmsDataKeyReusePeriodSeconds (integer) --- Maximum duration that Step Functions will reuse data keys. When the period expires, Step Functions will call GenerateDataKey. Only applies to customer managed keys. Encryption type.",
      "nested_params": [
        {
          "name": "kmsKeyId",
          "type": "string",
          "required": false,
          "description": "An alias, alias ARN, key ID, or key ARN of a symmetric encryption KMS key to encrypt data. To specify a KMS key in a different Amazon Web Services account, you must use the key ARN or alias ARN.",
          "nested_params": []
        },
        {
          "name": "kmsDataKeyReusePeriodSeconds",
          "type": "integer",
          "required": false,
          "description": "Maximum duration that Step Functions will reuse data keys. When the period expires, Step Functions will call GenerateDataKey. Only applies to customer managed keys.",
          "nested_params": []
        },
        {
          "name": "type",
          "type": "string",
          "required": false,
          "description": "Encryption type.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "activityArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) that identifies the created activity.",
          "nested_items": []
        },
        {
          "name": "creationDate",
          "type": "datetime",
          "description": "The date the activity is created.",
          "nested_items": []
        }
      ]
    }
  ]
}