{
  "method_name": "describe_map_run",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/stepfunctions/client/describe_map_run.html",
  "description": "Provides information about a Map Run's configuration, progress, and results. If you've redriven a Map Run, this API action also returns information about the redrives of that Map Run. For more information, see Examining Map Run in the Step Functions Developer Guide.",
  "parameters": [
    {
      "name": "mapRunArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) that identifies a Map Run.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "mapRunArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) that identifies a Map Run.",
          "nested_items": []
        },
        {
          "name": "executionArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) that identifies the execution in which the Map Run was started.",
          "nested_items": []
        },
        {
          "name": "status",
          "type": "string",
          "description": "The current status of the Map Run.",
          "nested_items": []
        },
        {
          "name": "startDate",
          "type": "datetime",
          "description": "The date when the Map Run was started.",
          "nested_items": []
        },
        {
          "name": "stopDate",
          "type": "datetime",
          "description": "The date when the Map Run was stopped.",
          "nested_items": []
        },
        {
          "name": "maxConcurrency",
          "type": "integer",
          "description": "The maximum number of child workflow executions configured to run in parallel for the Map Run at the same time.",
          "nested_items": []
        },
        {
          "name": "toleratedFailurePercentage",
          "type": "float",
          "description": "The maximum percentage of failed child workflow executions before the Map Run fails.",
          "nested_items": []
        },
        {
          "name": "toleratedFailureCount",
          "type": "integer",
          "description": "The maximum number of failed child workflow executions before the Map Run fails.",
          "nested_items": []
        },
        {
          "name": "itemCounts",
          "type": "dict",
          "description": "A JSON object that contains information about the total number of items, and the item count for each processing status, such as pending and failed.",
          "nested_items": [
            {
              "name": "pending",
              "type": "integer",
              "description": "The total number of items to process in child workflow executions that haven't started running yet.",
              "nested_items": []
            },
            {
              "name": "running",
              "type": "integer",
              "description": "The total number of items being processed in child workflow executions that are currently in-progress.",
              "nested_items": []
            },
            {
              "name": "succeeded",
              "type": "integer",
              "description": "The total number of items processed in child workflow executions that have completed successfully.",
              "nested_items": []
            },
            {
              "name": "failed",
              "type": "integer",
              "description": "The total number of items processed in child workflow executions that have failed.",
              "nested_items": []
            },
            {
              "name": "timedOut",
              "type": "integer",
              "description": "The total number of items processed in child workflow executions that have timed out.",
              "nested_items": []
            },
            {
              "name": "aborted",
              "type": "integer",
              "description": "The total number of items processed in child workflow executions that were either stopped by the user or by Step Functions, because the Map Run failed.",
              "nested_items": []
            },
            {
              "name": "total",
              "type": "integer",
              "description": "The total number of items processed in all the child workflow executions started by a Map Run.",
              "nested_items": []
            },
            {
              "name": "resultsWritten",
              "type": "integer",
              "description": "Returns the count of items whose results were written by ResultWriter. For more information, see ResultWriter in the Step Functions Developer Guide.",
              "nested_items": []
            },
            {
              "name": "failuresNotRedrivable",
              "type": "integer",
              "description": "The number of FAILED, ABORTED, or TIMED_OUT items in child workflow executions that cannot be redriven because the execution status of those child workflows is terminal. For example, child workflows with an execution status of FAILED, ABORTED, or TIMED_OUT and a redriveStatus of NOT_REDRIVABLE.",
              "nested_items": []
            },
            {
              "name": "pendingRedrive",
              "type": "integer",
              "description": "The number of unsuccessful items in child workflow executions currently waiting to be redriven.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "executionCounts",
          "type": "dict",
          "description": "A JSON object that contains information about the total number of child workflow executions for the Map Run, and the count of child workflow executions for each status, such as failed and succeeded.",
          "nested_items": [
            {
              "name": "pending",
              "type": "integer",
              "description": "The total number of child workflow executions that were started by a Map Run, but haven't started executing yet.",
              "nested_items": []
            },
            {
              "name": "running",
              "type": "integer",
              "description": "The total number of child workflow executions that were started by a Map Run and are currently in-progress.",
              "nested_items": []
            },
            {
              "name": "succeeded",
              "type": "integer",
              "description": "The total number of child workflow executions that were started by a Map Run and have completed successfully.",
              "nested_items": []
            },
            {
              "name": "failed",
              "type": "integer",
              "description": "The total number of child workflow executions that were started by a Map Run, but have failed.",
              "nested_items": []
            },
            {
              "name": "timedOut",
              "type": "integer",
              "description": "The total number of child workflow executions that were started by a Map Run and have timed out.",
              "nested_items": []
            },
            {
              "name": "aborted",
              "type": "integer",
              "description": "The total number of child workflow executions that were started by a Map Run and were running, but were either stopped by the user or by Step Functions because the Map Run failed.",
              "nested_items": []
            },
            {
              "name": "total",
              "type": "integer",
              "description": "The total number of child workflow executions that were started by a Map Run.",
              "nested_items": []
            },
            {
              "name": "resultsWritten",
              "type": "integer",
              "description": "Returns the count of child workflow executions whose results were written by ResultWriter. For more information, see ResultWriter in the Step Functions Developer Guide.",
              "nested_items": []
            },
            {
              "name": "failuresNotRedrivable",
              "type": "integer",
              "description": "The number of FAILED, ABORTED, or TIMED_OUT child workflow executions that cannot be redriven because their execution status is terminal. For example, child workflows with an execution status of FAILED, ABORTED, or TIMED_OUT and a redriveStatus of NOT_REDRIVABLE.",
              "nested_items": []
            },
            {
              "name": "pendingRedrive",
              "type": "integer",
              "description": "The number of unsuccessful child workflow executions currently waiting to be redriven. The status of these child workflow executions could be FAILED, ABORTED, or TIMED_OUT in the original execution attempt or a previous redrive attempt.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "redriveCount",
          "type": "integer",
          "description": "The number of times you've redriven a Map Run. If you have not yet redriven a Map Run, the redriveCount is 0. This count is only updated if you successfully redrive a Map Run.",
          "nested_items": []
        },
        {
          "name": "redriveDate",
          "type": "datetime",
          "description": "The date a Map Run was last redriven. If you have not yet redriven a Map Run, the redriveDate is null.",
          "nested_items": []
        }
      ]
    }
  ]
}