{
  "method_name": "update_state_machine_alias",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/stepfunctions/client/update_state_machine_alias.html",
  "description": "Updates the configuration of an existing state machine alias by modifying its description or routingConfiguration. You must specify at least one of the description or routingConfiguration parameters to update a state machine alias.",
  "parameters": [
    {
      "name": "stateMachineAliasArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the state machine alias.",
      "nested_params": []
    },
    {
      "name": "description",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "routingConfiguration",
      "type": "list",
      "required": true,
      "description": "The routing configuration of the state machine alias. An array of RoutingConfig objects that specifies up to two state machine versions that the alias starts executions for. (dict) --- Contains details about the routing configuration of a state machine alias. In a routing configuration, you define an array of objects that specify up to two state machine versions. You also specify the percentage of traffic to be routed to each version. The Amazon Resource Name (ARN) that identifies one or two state machine versions defined in the routing configuration. If you specify the ARN of a second version, it must belong to the same state machine as the first version. The percentage of traffic you want to route to a state machine version. The sum of the weights in the routing configuration must be equal to 100.",
      "nested_params": [
        {
          "name": "stateMachineVersionArn",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) that identifies one or two state machine versions defined in the routing configuration. If you specify the ARN of a second version, it must belong to the same state machine as the first version.",
          "nested_params": []
        },
        {
          "name": "weight",
          "type": "integer",
          "required": false,
          "description": "The percentage of traffic you want to route to a state machine version. The sum of the weights in the routing configuration must be equal to 100.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "updateDate",
          "type": "datetime",
          "description": "The date and time the state machine alias was updated.",
          "nested_items": []
        }
      ]
    }
  ]
}