{
  "method_name": "update_state_machine",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/stepfunctions/client/update_state_machine.html",
  "description": "Updates an existing state machine by modifying its definition, roleArn, loggingConfiguration, or EncryptionConfiguration. Running executions will continue to use the previous definition and roleArn. You must include at least one of definition or roleArn or you will receive a MissingRequiredParameter error. A qualified state machine ARN refers to a Distributed Map state defined within a state machine. For example, the qualified state machine ARN arn:partition:states:region:account-id:stateMachine:stateMachineName/mapStateLabel refers to a Distributed Map state with a label mapStateLabel in the state machine named stateMachineName. A qualified state machine ARN can either refer to a Distributed Map state defined within a state machine, a version ARN, or an alias ARN. The following are some examples of qualified and unqualified state machine ARNs: After you update your state machine, you can set the publish parameter to true in the same action to publish a new version. This way, you can opt-in to strict versioning of your state machine.",
  "parameters": [
    {
      "name": "stateMachineArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the state machine.",
      "nested_params": []
    },
    {
      "name": "definition",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "roleArn",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "loggingConfiguration",
      "type": "dict",
      "required": false,
      "description": "Use the LoggingConfiguration data type to set CloudWatch Logs options. level (string) --- Defines which category of execution history events are logged. includeExecutionData (boolean) --- Determines whether execution data is included in your log. When set to false, data is excluded. destinations (list) --- An array of objects that describes where your execution history events will be logged. Limited to size 1. Required, if your log level is not set to OFF. (dict) --- cloudWatchLogsLogGroup (dict) --- An object describing a CloudWatch log group. For more information, see AWS::Logs::LogGroup in the CloudFormation User Guide. logGroupArn (string) --- The ARN of the the CloudWatch log group to which you want your logs emitted to. The ARN must end with :*",
      "nested_params": [
        {
          "name": "level",
          "type": "string",
          "required": false,
          "description": "Defines which category of execution history events are logged.",
          "nested_params": []
        },
        {
          "name": "includeExecutionData",
          "type": "boolean",
          "required": false,
          "description": "Determines whether execution data is included in your log. When set to false, data is excluded.",
          "nested_params": []
        },
        {
          "name": "destinations",
          "type": "list",
          "required": false,
          "description": "An array of objects that describes where your execution history events will be logged. Limited to size 1. Required, if your log level is not set to OFF.",
          "nested_params": [
            {
              "name": "cloudWatchLogsLogGroup",
              "type": "dict",
              "required": false,
              "description": "An object describing a CloudWatch log group. For more information, see AWS::Logs::LogGroup in the CloudFormation User Guide.",
              "nested_params": [
                {
                  "name": "logGroupArn",
                  "type": "string",
                  "required": false,
                  "description": "The ARN of the the CloudWatch log group to which you want your logs emitted to. The ARN must end with :*",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "tracingConfiguration",
      "type": "dict",
      "required": false,
      "description": "Selects whether X-Ray tracing is enabled. enabled (boolean) --- When set to true, X-Ray tracing is enabled.",
      "nested_params": [
        {
          "name": "enabled",
          "type": "boolean",
          "required": false,
          "description": "When set to true, X-Ray tracing is enabled.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "publish",
      "type": "boolean",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "versionDescription",
      "type": "string",
      "required": false,
      "description": "An optional description of the state machine version to publish. You can only specify the versionDescription parameter if you've set publish to true.",
      "nested_params": []
    },
    {
      "name": "encryptionConfiguration",
      "type": "dict",
      "required": true,
      "description": "Settings to configure server-side encryption. kmsKeyId (string) --- An alias, alias ARN, key ID, or key ARN of a symmetric encryption KMS key to encrypt data. To specify a KMS key in a different Amazon Web Services account, you must use the key ARN or alias ARN. kmsDataKeyReusePeriodSeconds (integer) --- Maximum duration that Step Functions will reuse data keys. When the period expires, Step Functions will call GenerateDataKey. Only applies to customer managed keys. Encryption type.",
      "nested_params": [
        {
          "name": "kmsKeyId",
          "type": "string",
          "required": false,
          "description": "An alias, alias ARN, key ID, or key ARN of a symmetric encryption KMS key to encrypt data. To specify a KMS key in a different Amazon Web Services account, you must use the key ARN or alias ARN.",
          "nested_params": []
        },
        {
          "name": "kmsDataKeyReusePeriodSeconds",
          "type": "integer",
          "required": false,
          "description": "Maximum duration that Step Functions will reuse data keys. When the period expires, Step Functions will call GenerateDataKey. Only applies to customer managed keys.",
          "nested_params": []
        },
        {
          "name": "type",
          "type": "string",
          "required": false,
          "description": "Encryption type.",
          "nested_params": []
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "updateDate",
          "type": "datetime",
          "description": "The date and time the state machine was updated.",
          "nested_items": []
        },
        {
          "name": "revisionId",
          "type": "string",
          "description": "The revision identifier for the updated state machine.",
          "nested_items": []
        },
        {
          "name": "stateMachineVersionArn",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the published state machine version.",
          "nested_items": []
        }
      ]
    }
  ]
}