{
  "method_name": "create_custom_action",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/chatbot/client/create_custom_action.html",
  "description": "Creates a custom action that can be invoked as an alias or as a button on a notification.",
  "parameters": [
    {
      "name": "Definition",
      "type": "dict",
      "required": true,
      "description": "The definition of the command to run when invoked as an alias or as an action button. The command string to run which may include variables by prefixing with a dollar sign ($).",
      "nested_params": [
        {
          "name": "CommandText",
          "type": "string",
          "required": false,
          "description": "The command string to run which may include variables by prefixing with a dollar sign ($).",
          "nested_params": []
        }
      ]
    },
    {
      "name": "AliasName",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "Attachments",
      "type": "list",
      "required": true,
      "description": "Defines when this custom action button should be attached to a notification. (dict) --- Defines when a custom action button should be attached to a notification. NotificationType (string) --- The type of notification that the custom action should be attached to. ButtonText (string) --- The text of the button that appears on the notification. Criteria (list) --- The criteria for when a button should be shown based on values in the notification. (dict) --- A criteria for when a button should be shown based on values in the notification The operation to perform on the named variable. The name of the variable to operate on. Value (string) --- A value that is compared with the actual value of the variable based on the behavior of the operator. Variables (dict) --- The variables to extract from the notification. (string) --- (string) ---",
      "nested_params": [
        {
          "name": "NotificationType",
          "type": "string",
          "required": false,
          "description": "The type of notification that the custom action should be attached to.",
          "nested_params": []
        },
        {
          "name": "ButtonText",
          "type": "string",
          "required": false,
          "description": "The text of the button that appears on the notification.",
          "nested_params": []
        },
        {
          "name": "Criteria",
          "type": "list",
          "required": false,
          "description": "The criteria for when a button should be shown based on values in the notification.",
          "nested_params": [
            {
              "name": "Operator",
              "type": "string",
              "required": false,
              "description": "The operation to perform on the named variable.",
              "nested_params": []
            },
            {
              "name": "VariableName",
              "type": "string",
              "required": false,
              "description": "The name of the variable to operate on.",
              "nested_params": []
            },
            {
              "name": "Value",
              "type": "string",
              "required": false,
              "description": "A value that is compared with the actual value of the variable based on the behavior of the operator.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Variables",
          "type": "dict",
          "required": false,
          "description": "The variables to extract from the notification.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "A map of tags assigned to a resource. A tag is a string-to-string map of key-value pairs. (dict) --- A key-value pair. A tag consists of a tag key and a tag value. Tag keys and tag values are both required, but tag values can be empty (null) strings. For more information, see User-Defined Tag Restrictions in the AWS Billing and Cost Management User Guide. The key of the tag. The value of the tag.",
      "nested_params": [
        {
          "name": "TagKey",
          "type": "string",
          "required": false,
          "description": "The key of the tag.",
          "nested_params": []
        },
        {
          "name": "TagValue",
          "type": "string",
          "required": false,
          "description": "The value of the tag.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ClientToken",
      "type": "string",
      "required": false,
      "description": "A unique, case-sensitive identifier that you provide to ensure the idempotency of the request. Idempotency ensures that an API request completes only once. With an idempotent request, if the original request completes successfully, subsequent retries with the same client token returns the result from the original successful request. If you do not specify a client token, one is automatically generated by the SDK. This field is autopopulated if not provided.",
      "nested_params": []
    },
    {
      "name": "ActionName",
      "type": "string",
      "required": true,
      "description": "The name of the custom action. This name is included in the Amazon Resource Name (ARN).",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "CustomActionArn",
          "type": "string",
          "description": "The fully defined ARN of the custom action.",
          "nested_items": []
        }
      ]
    }
  ]
}