{
  "method_name": "batch_put_tax_registration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/taxsettings/client/batch_put_tax_registration.html",
  "description": "Adds or updates tax registration for multiple accounts in batch. This can be used to add or update tax registrations for up to five accounts in one batch. You can't set a TRN if there's a pending TRN. You'll need to delete the pending TRN first. To call this API operation for specific countries, see the following country-specific requirements.",
  "parameters": [
    {
      "name": "accountIds",
      "type": "list",
      "required": true,
      "description": "List of unique account identifiers. (string) ---",
      "nested_params": []
    },
    {
      "name": "taxRegistrationEntry",
      "type": "dict",
      "required": true,
      "description": "Your TRN information that will be stored to the accounts mentioned in putEntries. additionalTaxInformation (dict) --- Additional tax information associated with your TRN. You only need to specify this parameter if Amazon Web Services collects any additional information for your country within  AdditionalInfoRequest. canadaAdditionalInfo (dict) --- Additional tax information associated with your TRN in Canada. canadaQuebecSalesTaxNumber (string) --- The Quebec Sales Tax ID number. Leave blank if you do not have a Quebec Sales Tax ID number. canadaRetailSalesTaxNumber (string) --- Manitoba Retail Sales Tax ID number. Customers purchasing Amazon Web Services services for resale in Manitoba must provide a valid Retail Sales Tax ID number for Manitoba. Leave this blank if you do not have a Retail Sales Tax ID number in Manitoba or are not purchasing Amazon Web Services services for resale. isResellerAccount (boolean) --- The value for this parameter must be true if the provincialSalesTaxId value is provided for a TRN in British Columbia, Saskatchewan, or Manitoba provinces. To claim a provincial sales tax (PST) and retail sales tax (RST) reseller exemption, you must confirm that purchases from this account were made for resale. Otherwise, remove the PST or RST number from the provincialSalesTaxId parameter from your request. provincialSalesTaxId (string) --- The provincial sales tax ID for your TRN in Canada. This parameter can represent the following: Provincial sales tax ID number for British Columbia and Saskatchewan provinces Manitoba retail sales tax ID number for Manitoba province Quebec sales tax ID number for Quebec province The Tax Setting API only accepts this parameter if the TRN is specified for the previous provinces. For other provinces, the Tax Settings API doesn't accept this parameter. egyptAdditionalInfo (dict) --- Additional tax information to specify for a TRN in Egypt. uniqueIdentificationNumber (string) --- The unique identification number provided by the Egypt Tax Authority. uniqueIdentificationNumberExpirationDate (string) --- The expiration date of the unique identification number provided by the Egypt Tax Authority. estoniaAdditionalInfo (dict) --- Additional tax information to specify for a TRN in Estonia. Registry commercial code (RCC) for your TRN in Estonia. This value is an eight-numeric string, such as 12345678. georgiaAdditionalInfo (dict) --- Additional tax information to specify for a TRN in Georgia. The legal person or physical person assigned to this TRN in Georgia. greeceAdditionalInfo (dict) --- Additional tax information to specify for a TRN in Greece. contractingAuthorityCode (string) --- The code of contracting authority for e-invoicing. indonesiaAdditionalInfo (dict) --- decisionNumber (string) --- VAT-exempt customers have a Directorate General of Taxation (DGT) exemption letter or certificate (Surat Keterangan Bebas) decision number. Non-collected VAT have a DGT letter or certificate (Surat Keterangan Tidak Dipungut). ppnExceptionDesignationCode (string) --- Exception code if you are designated by Directorate General of Taxation (DGT) as a VAT collector, non-collected VAT, or VAT-exempt customer. taxRegistrationNumberType (string) --- The tax registration number type. israelAdditionalInfo (dict) --- Additional tax information to specify for a TRN in Israel. Customer type for your TRN in Israel. The value can be Business or Individual. Use ``Business``for entities such as not-for-profit and financial institutions. Dealer type for your TRN in Israel. If you're not a local authorized dealer with an Israeli VAT ID, specify your tax identification number so that Amazon Web Services can send you a compliant tax invoice. italyAdditionalInfo (dict) --- Additional tax information to specify for a TRN in Italy. cigNumber (string) --- The tender procedure identification code. cupNumber (string) --- Additional tax information to specify for a TRN in Italy. This is managed by the Interministerial Committee for Economic Planning (CIPE) which characterizes every public investment project (Individual Project Code). sdiAccountId (string) --- Additional tax information to specify for a TRN in Italy. Use CodiceDestinatario to receive your invoices via web service (API) or FTP. taxCode (string) --- List of service tax codes for your TRN in Italy. You can use your customer tax code as part of a VAT Group. kenyaAdditionalInfo (dict) --- Additional tax information to specify for a TRN in Kenya. The legal person or physical person assigned to this TRN in Kenya. malaysiaAdditionalInfo (dict) --- Additional tax information to specify for a TRN in Malaysia. businessRegistrationNumber (string) --- The tax registration number (TRN) in Malaysia. For individual, you can specify the taxInformationNumber in MalaysiaAdditionalInfo with NRIC type, and a valid MyKad or NRIC number. For business, you must specify a businessRegistrationNumber in MalaysiaAdditionalInfo with a TIN type and tax identification number. For business resellers, you must specify a businessRegistrationNumber and taxInformationNumber in MalaysiaAdditionalInfo with a sales and service tax (SST) type and a valid SST number. For business resellers with service codes, you must specify businessRegistrationNumber, taxInformationNumber, and distinct serviceTaxCodes in MalaysiaAdditionalInfo with a SST type and valid sales and service tax (SST) number. By using this API operation, Amazon Web Services registers your self-declaration that you're an authorized business reseller registered with the Royal Malaysia Customs Department (RMCD), and have a valid SST number. serviceTaxCodes (list) --- List of service tax codes for your TRN in Malaysia. (string) --- taxInformationNumber (string) --- The tax information number in Malaysia. polandAdditionalInfo (dict) --- Additional tax information associated with your TRN in Poland. individualRegistrationNumber (string) --- The individual tax registration number (NIP). Individual NIP is valid for other taxes excluding VAT purposes. isGroupVatEnabled (boolean) --- True if your business is a member of a VAT group with a NIP active for VAT purposes. Otherwise, this is false. romaniaAdditionalInfo (dict) --- Additional tax information to specify for a TRN in Romania. The tax registration number type. The value can be TaxRegistrationNumber or LocalRegistrationNumber. saudiArabiaAdditionalInfo (dict) --- Additional tax information associated with your TRN in Saudi Arabia. southKoreaAdditionalInfo (dict) --- Additional tax information to specify for a TRN in South Korea. The business legal name based on the most recently uploaded tax registration certificate. Item of business based on the most recently uploaded tax registration certificate. Line of business based on the most recently uploaded tax registration certificate. spainAdditionalInfo (dict) --- Additional tax information to specify for a TRN in Spain. The registration type in Spain. turkeyAdditionalInfo (dict) --- Additional tax information to specify for a TRN in Turkey. industries (string) --- The industry information that tells the Tax Settings API if you're subject to additional withholding taxes. This information required for business-to-business (B2B) customers. This information is conditionally mandatory for B2B customers who are subject to KDV tax. kepEmailId (string) --- The Registered Electronic Mail (REM) that is used to send notarized communication. This parameter is optional for business-to-business (B2B) and business-to-government (B2G) customers. It's not required for business-to-consumer (B2C) customers. secondaryTaxId (string) --- Secondary tax ID ('harcama birimi VKN'si'). If one isn't provided, we will use your VKN as the secondary ID. taxOffice (string) --- The tax office where you're registered. You can enter this information as a string. The Tax Settings API will add this information to your invoice. This parameter is required for business-to-business (B2B) and business-to-government customers. ukraineAdditionalInfo (dict) --- Additional tax information associated with your TRN in Ukraine. The tax registration type. uzbekistanAdditionalInfo (dict) --- Additional tax information to specify for a TRN in Uzbekistan. The tax registration number type valid values are Business and Individual. vatRegistrationNumber (string) --- The unique 12-digit number issued to identify VAT-registered identities in Uzbekistan. vietnamAdditionalInfo (dict) --- Additional tax information to specify for a TRN in Vietnam. electronicTransactionCodeNumber (string) --- The electronic transaction code number on the tax return document. This field must be provided for successful API operation. enterpriseIdentificationNumber (string) --- The enterprise identification number for tax registration. paymentVoucherNumber (string) --- The payment voucher number on the tax return payment document. paymentVoucherNumberDate (string) --- The date on the tax return payment document. certifiedEmailId (string) --- The email address to receive VAT invoices. legalAddress (dict) --- The legal address associated with your TRN. The first line of the address. addressLine2 (string) --- The second line of the address, if applicable. addressLine3 (string) --- The third line of the address, if applicable. Currently, the Tax Settings API accepts the addressLine3 parameter only for Saudi Arabia. When you specify a TRN in Saudi Arabia, you must enter the addressLine3 and specify the building number for the address. For example, you might enter 1234. The city that the address is in. The country code for the country that the address is in. districtOrCounty (string) --- The district or county the address is located. The postal code associated with the address. stateOrRegion (string) --- The state, region, or province that the address is located. This field is only required for Canada, India, United Arab Emirates, Romania, and Brazil (CPF). It is optional for all other countries. If this is required for tax settings, use the same name as shown on the Tax Settings page. legalName (string) --- The legal name associated with your TRN. Your tax registration unique identifier. Your tax registration type. This can be either VAT or GST. sector (string) --- The industry that describes your business. For business-to-business (B2B) customers, specify Business. For business-to-consumer (B2C) customers, specify Individual. For business-to-government (B2G), specify Government.Note that certain values may not applicable for the request country. Please refer to country specific information in API document. verificationDetails (dict) --- Additional details needed to verify your TRN information in Brazil. You only need to specify this parameter when you set a TRN in Brazil that is the CPF tax type. dateOfBirth (string) --- Date of birth to verify your submitted TRN. Use the YYYY-MM-DD format. taxRegistrationDocuments (list) --- The tax registration document, which is required for specific countries such as Bangladesh, Kenya, South Korea and Spain. (dict) --- Tax registration document information. file (dict) --- The tax registration document. The tax registration document content. The tax registration document name. s3Location (dict) --- The Amazon S3 location where your tax registration document is stored. The name of your Amazon S3 bucket that your tax document is located. The object key of your tax document object in Amazon S3.",
      "nested_params": [
        {
          "name": "additionalTaxInformation",
          "type": "dict",
          "required": false,
          "description": "Additional tax information associated with your TRN. You only need to specify this parameter if Amazon Web Services collects any additional information for your country within  AdditionalInfoRequest.",
          "nested_params": [
            {
              "name": "canadaAdditionalInfo",
              "type": "dict",
              "required": false,
              "description": "Additional tax information associated with your TRN in Canada.",
              "nested_params": [
                {
                  "name": "canadaQuebecSalesTaxNumber",
                  "type": "string",
                  "required": false,
                  "description": "The Quebec Sales Tax ID number. Leave blank if you do not have a Quebec Sales Tax ID number.",
                  "nested_params": []
                },
                {
                  "name": "canadaRetailSalesTaxNumber",
                  "type": "string",
                  "required": false,
                  "description": "Manitoba Retail Sales Tax ID number. Customers purchasing Amazon Web Services services for resale in Manitoba must provide a valid Retail Sales Tax ID number for Manitoba. Leave this blank if you do not have a Retail Sales Tax ID number in Manitoba or are not purchasing Amazon Web Services services for resale.",
                  "nested_params": []
                },
                {
                  "name": "isResellerAccount",
                  "type": "boolean",
                  "required": false,
                  "description": "The value for this parameter must be true if the provincialSalesTaxId value is provided for a TRN in British Columbia, Saskatchewan, or Manitoba provinces. To claim a provincial sales tax (PST) and retail sales tax (RST) reseller exemption, you must confirm that purchases from this account were made for resale. Otherwise, remove the PST or RST number from the provincialSalesTaxId parameter from your request.",
                  "nested_params": []
                },
                {
                  "name": "provincialSalesTaxId",
                  "type": "string",
                  "required": false,
                  "description": "The provincial sales tax ID for your TRN in Canada. This parameter can represent the following:",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "egyptAdditionalInfo",
              "type": "dict",
              "required": false,
              "description": "Additional tax information to specify for a TRN in Egypt.",
              "nested_params": [
                {
                  "name": "uniqueIdentificationNumber",
                  "type": "string",
                  "required": false,
                  "description": "The unique identification number provided by the Egypt Tax Authority.",
                  "nested_params": []
                },
                {
                  "name": "uniqueIdentificationNumberExpirationDate",
                  "type": "string",
                  "required": false,
                  "description": "The expiration date of the unique identification number provided by the Egypt Tax Authority.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "estoniaAdditionalInfo",
              "type": "dict",
              "required": false,
              "description": "Additional tax information to specify for a TRN in Estonia.",
              "nested_params": [
                {
                  "name": "registryCommercialCode",
                  "type": "string",
                  "required": false,
                  "description": "Registry commercial code (RCC) for your TRN in Estonia. This value is an eight-numeric string, such as 12345678.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "georgiaAdditionalInfo",
              "type": "dict",
              "required": false,
              "description": "Additional tax information to specify for a TRN in Georgia.",
              "nested_params": [
                {
                  "name": "personType",
                  "type": "string",
                  "required": false,
                  "description": "The legal person or physical person assigned to this TRN in Georgia.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "greeceAdditionalInfo",
              "type": "dict",
              "required": false,
              "description": "Additional tax information to specify for a TRN in Greece.",
              "nested_params": [
                {
                  "name": "contractingAuthorityCode",
                  "type": "string",
                  "required": false,
                  "description": "The code of contracting authority for e-invoicing.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "indonesiaAdditionalInfo",
              "type": "dict",
              "required": false,
              "description": "",
              "nested_params": [
                {
                  "name": "decisionNumber",
                  "type": "string",
                  "required": false,
                  "description": "VAT-exempt customers have a Directorate General of Taxation (DGT) exemption letter or certificate (Surat Keterangan Bebas) decision number. Non-collected VAT have a DGT letter or certificate (Surat Keterangan Tidak Dipungut).",
                  "nested_params": []
                },
                {
                  "name": "ppnExceptionDesignationCode",
                  "type": "string",
                  "required": false,
                  "description": "Exception code if you are designated by Directorate General of Taxation (DGT) as a VAT collector, non-collected VAT, or VAT-exempt customer.",
                  "nested_params": []
                },
                {
                  "name": "taxRegistrationNumberType",
                  "type": "string",
                  "required": false,
                  "description": "The tax registration number type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "israelAdditionalInfo",
              "type": "dict",
              "required": false,
              "description": "Additional tax information to specify for a TRN in Israel.",
              "nested_params": [
                {
                  "name": "customerType",
                  "type": "string",
                  "required": false,
                  "description": "Customer type for your TRN in Israel. The value can be Business or Individual. Use ``Business``for entities such as not-for-profit and financial institutions.",
                  "nested_params": []
                },
                {
                  "name": "dealerType",
                  "type": "string",
                  "required": false,
                  "description": "Dealer type for your TRN in Israel. If you're not a local authorized dealer with an Israeli VAT ID, specify your tax identification number so that Amazon Web Services can send you a compliant tax invoice.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "italyAdditionalInfo",
              "type": "dict",
              "required": false,
              "description": "Additional tax information to specify for a TRN in Italy.",
              "nested_params": [
                {
                  "name": "cigNumber",
                  "type": "string",
                  "required": false,
                  "description": "The tender procedure identification code.",
                  "nested_params": []
                },
                {
                  "name": "cupNumber",
                  "type": "string",
                  "required": false,
                  "description": "Additional tax information to specify for a TRN in Italy. This is managed by the Interministerial Committee for Economic Planning (CIPE) which characterizes every public investment project (Individual Project Code).",
                  "nested_params": []
                },
                {
                  "name": "sdiAccountId",
                  "type": "string",
                  "required": false,
                  "description": "Additional tax information to specify for a TRN in Italy. Use CodiceDestinatario to receive your invoices via web service (API) or FTP.",
                  "nested_params": []
                },
                {
                  "name": "taxCode",
                  "type": "string",
                  "required": false,
                  "description": "List of service tax codes for your TRN in Italy. You can use your customer tax code as part of a VAT Group.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "kenyaAdditionalInfo",
              "type": "dict",
              "required": false,
              "description": "Additional tax information to specify for a TRN in Kenya.",
              "nested_params": [
                {
                  "name": "personType",
                  "type": "string",
                  "required": false,
                  "description": "The legal person or physical person assigned to this TRN in Kenya.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "malaysiaAdditionalInfo",
              "type": "dict",
              "required": false,
              "description": "Additional tax information to specify for a TRN in Malaysia.",
              "nested_params": [
                {
                  "name": "businessRegistrationNumber",
                  "type": "string",
                  "required": false,
                  "description": "The tax registration number (TRN) in Malaysia. For individual, you can specify the taxInformationNumber in MalaysiaAdditionalInfo with NRIC type, and a valid MyKad or NRIC number. For business, you must specify a businessRegistrationNumber in MalaysiaAdditionalInfo with a TIN type and tax identification number. For business resellers, you must specify a businessRegistrationNumber and taxInformationNumber in MalaysiaAdditionalInfo with a sales and service tax (SST) type and a valid SST number. For business resellers with service codes, you must specify businessRegistrationNumber, taxInformationNumber, and distinct serviceTaxCodes in MalaysiaAdditionalInfo with a SST type and valid sales and service tax (SST) number. By using this API operation, Amazon Web Services registers your self-declaration that you're an authorized business reseller registered with the Royal Malaysia Customs Department (RMCD), and have a valid SST number.",
                  "nested_params": []
                },
                {
                  "name": "serviceTaxCodes",
                  "type": "list",
                  "required": false,
                  "description": "List of service tax codes for your TRN in Malaysia.",
                  "nested_params": []
                },
                {
                  "name": "taxInformationNumber",
                  "type": "string",
                  "required": false,
                  "description": "The tax information number in Malaysia. For individual, you can specify the taxInformationNumber in MalaysiaAdditionalInfo with NRIC type, and a valid MyKad or NRIC number. For business resellers, you must specify a businessRegistrationNumber and taxInformationNumber in MalaysiaAdditionalInfo with a sales and service tax (SST) type and a valid SST number. For business resellers with service codes, you must specify businessRegistrationNumber, taxInformationNumber, and distinct serviceTaxCodes in MalaysiaAdditionalInfo with a SST type and valid sales and service tax (SST) number. By using this API operation, Amazon Web Services registers your self-declaration that you're an authorized business reseller registered with the Royal Malaysia Customs Department (RMCD), and have a valid SST number.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "polandAdditionalInfo",
              "type": "dict",
              "required": false,
              "description": "Additional tax information associated with your TRN in Poland.",
              "nested_params": [
                {
                  "name": "individualRegistrationNumber",
                  "type": "string",
                  "required": false,
                  "description": "The individual tax registration number (NIP). Individual NIP is valid for other taxes excluding VAT purposes.",
                  "nested_params": []
                },
                {
                  "name": "isGroupVatEnabled",
                  "type": "boolean",
                  "required": false,
                  "description": "True if your business is a member of a VAT group with a NIP active for VAT purposes. Otherwise, this is false.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "romaniaAdditionalInfo",
              "type": "dict",
              "required": false,
              "description": "Additional tax information to specify for a TRN in Romania.",
              "nested_params": [
                {
                  "name": "taxRegistrationNumberType",
                  "type": "string",
                  "required": false,
                  "description": "The tax registration number type. The value can be TaxRegistrationNumber or LocalRegistrationNumber.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "saudiArabiaAdditionalInfo",
              "type": "dict",
              "required": false,
              "description": "Additional tax information associated with your TRN in Saudi Arabia.",
              "nested_params": [
                {
                  "name": "taxRegistrationNumberType",
                  "type": "string",
                  "required": false,
                  "description": "The tax registration number type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "southKoreaAdditionalInfo",
              "type": "dict",
              "required": false,
              "description": "Additional tax information to specify for a TRN in South Korea.",
              "nested_params": [
                {
                  "name": "businessRepresentativeName",
                  "type": "string",
                  "required": false,
                  "description": "The business legal name based on the most recently uploaded tax registration certificate.",
                  "nested_params": []
                },
                {
                  "name": "itemOfBusiness",
                  "type": "string",
                  "required": false,
                  "description": "Item of business based on the most recently uploaded tax registration certificate.",
                  "nested_params": []
                },
                {
                  "name": "lineOfBusiness",
                  "type": "string",
                  "required": false,
                  "description": "Line of business based on the most recently uploaded tax registration certificate.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "spainAdditionalInfo",
              "type": "dict",
              "required": false,
              "description": "Additional tax information to specify for a TRN in Spain.",
              "nested_params": [
                {
                  "name": "registrationType",
                  "type": "string",
                  "required": false,
                  "description": "The registration type in Spain.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "turkeyAdditionalInfo",
              "type": "dict",
              "required": false,
              "description": "Additional tax information to specify for a TRN in Turkey.",
              "nested_params": [
                {
                  "name": "industries",
                  "type": "string",
                  "required": false,
                  "description": "The industry information that tells the Tax Settings API if you're subject to additional withholding taxes. This information required for business-to-business (B2B) customers. This information is conditionally mandatory for B2B customers who are subject to KDV tax.",
                  "nested_params": []
                },
                {
                  "name": "kepEmailId",
                  "type": "string",
                  "required": false,
                  "description": "The Registered Electronic Mail (REM) that is used to send notarized communication. This parameter is optional for business-to-business (B2B) and business-to-government (B2G) customers. It's not required for business-to-consumer (B2C) customers.",
                  "nested_params": []
                },
                {
                  "name": "secondaryTaxId",
                  "type": "string",
                  "required": false,
                  "description": "Secondary tax ID ('harcama birimi VKN'si'). If one isn't provided, we will use your VKN as the secondary ID.",
                  "nested_params": []
                },
                {
                  "name": "taxOffice",
                  "type": "string",
                  "required": false,
                  "description": "The tax office where you're registered. You can enter this information as a string. The Tax Settings API will add this information to your invoice. This parameter is required for business-to-business (B2B) and business-to-government customers. It's not required for business-to-consumer (B2C) customers.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ukraineAdditionalInfo",
              "type": "dict",
              "required": false,
              "description": "Additional tax information associated with your TRN in Ukraine.",
              "nested_params": [
                {
                  "name": "ukraineTrnType",
                  "type": "string",
                  "required": false,
                  "description": "The tax registration type.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "uzbekistanAdditionalInfo",
              "type": "dict",
              "required": false,
              "description": "Additional tax information to specify for a TRN in Uzbekistan.",
              "nested_params": [
                {
                  "name": "taxRegistrationNumberType",
                  "type": "string",
                  "required": false,
                  "description": "The tax registration number type. The tax registration number type valid values are Business and Individual.",
                  "nested_params": []
                },
                {
                  "name": "vatRegistrationNumber",
                  "type": "string",
                  "required": false,
                  "description": "The unique 12-digit number issued to identify VAT-registered identities in Uzbekistan.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "vietnamAdditionalInfo",
              "type": "dict",
              "required": false,
              "description": "Additional tax information to specify for a TRN in Vietnam.",
              "nested_params": [
                {
                  "name": "electronicTransactionCodeNumber",
                  "type": "string",
                  "required": false,
                  "description": "The electronic transaction code number on the tax return document. This field must be provided for successful API operation.",
                  "nested_params": []
                },
                {
                  "name": "enterpriseIdentificationNumber",
                  "type": "string",
                  "required": false,
                  "description": "The enterprise identification number for tax registration. This field must be provided for successful API operation.",
                  "nested_params": []
                },
                {
                  "name": "paymentVoucherNumber",
                  "type": "string",
                  "required": false,
                  "description": "The payment voucher number on the tax return payment document. This field must be provided for successful API operation.",
                  "nested_params": []
                },
                {
                  "name": "paymentVoucherNumberDate",
                  "type": "string",
                  "required": false,
                  "description": "The date on the tax return payment document. This field must be provided for successful API operation.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "certifiedEmailId",
          "type": "string",
          "required": false,
          "description": "The email address to receive VAT invoices.",
          "nested_params": []
        },
        {
          "name": "legalAddress",
          "type": "dict",
          "required": false,
          "description": "The legal address associated with your TRN.",
          "nested_params": [
            {
              "name": "addressLine1",
              "type": "string",
              "required": false,
              "description": "The first line of the address.",
              "nested_params": []
            },
            {
              "name": "addressLine2",
              "type": "string",
              "required": false,
              "description": "The second line of the address, if applicable.",
              "nested_params": []
            },
            {
              "name": "addressLine3",
              "type": "string",
              "required": false,
              "description": "The third line of the address, if applicable. Currently, the Tax Settings API accepts the addressLine3 parameter only for Saudi Arabia. When you specify a TRN in Saudi Arabia, you must enter the addressLine3 and specify the building number for the address. For example, you might enter 1234.",
              "nested_params": []
            },
            {
              "name": "city",
              "type": "string",
              "required": false,
              "description": "The city that the address is in.",
              "nested_params": []
            },
            {
              "name": "countryCode",
              "type": "string",
              "required": false,
              "description": "The country code for the country that the address is in.",
              "nested_params": []
            },
            {
              "name": "districtOrCounty",
              "type": "string",
              "required": false,
              "description": "The district or county the address is located.",
              "nested_params": []
            },
            {
              "name": "postalCode",
              "type": "string",
              "required": false,
              "description": "The postal code associated with the address.",
              "nested_params": []
            },
            {
              "name": "stateOrRegion",
              "type": "string",
              "required": false,
              "description": "The state, region, or province that the address is located. This field is only required for Canada, India, United Arab Emirates, Romania, and Brazil (CPF). It is optional for all other countries.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "legalName",
          "type": "string",
          "required": false,
          "description": "The legal name associated with your TRN.",
          "nested_params": []
        },
        {
          "name": "registrationId",
          "type": "string",
          "required": false,
          "description": "Your tax registration unique identifier.",
          "nested_params": []
        },
        {
          "name": "registrationType",
          "type": "string",
          "required": false,
          "description": "Your tax registration type. This can be either VAT or GST.",
          "nested_params": []
        },
        {
          "name": "sector",
          "type": "string",
          "required": false,
          "description": "The industry that describes your business. For business-to-business (B2B) customers, specify Business. For business-to-consumer (B2C) customers, specify Individual. For business-to-government (B2G), specify Government.Note that certain values may not applicable for the request country. Please refer to country specific information in API document.",
          "nested_params": []
        },
        {
          "name": "verificationDetails",
          "type": "dict",
          "required": false,
          "description": "Additional details needed to verify your TRN information in Brazil. You only need to specify this parameter when you set a TRN in Brazil that is the CPF tax type.",
          "nested_params": [
            {
              "name": "dateOfBirth",
              "type": "string",
              "required": false,
              "description": "Date of birth to verify your submitted TRN. Use the YYYY-MM-DD format.",
              "nested_params": []
            },
            {
              "name": "taxRegistrationDocuments",
              "type": "list",
              "required": false,
              "description": "The tax registration document, which is required for specific countries such as Bangladesh, Kenya, South Korea and Spain.",
              "nested_params": [
                {
                  "name": "file",
                  "type": "dict",
                  "required": false,
                  "description": "The tax registration document.",
                  "nested_params": [
                    {
                      "name": "fileContent",
                      "type": "bytes",
                      "required": false,
                      "description": "The tax registration document content.",
                      "nested_params": []
                    },
                    {
                      "name": "fileName",
                      "type": "string",
                      "required": false,
                      "description": "The tax registration document name.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "s3Location",
                  "type": "dict",
                  "required": false,
                  "description": "The Amazon S3 location where your tax registration document is stored.",
                  "nested_params": [
                    {
                      "name": "bucket",
                      "type": "string",
                      "required": false,
                      "description": "The name of your Amazon S3 bucket that your tax document is located.",
                      "nested_params": []
                    },
                    {
                      "name": "key",
                      "type": "string",
                      "required": false,
                      "description": "The object key of your tax document object in Amazon S3.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "errors",
          "type": "list",
          "description": "List of errors for the accounts the TRN information could not be added or updated to.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "accountId",
                  "type": "string",
                  "description": "The unique account identifier for the account that the tax registration couldn't be added, or updated during the BatchPutTaxRegistration operation.",
                  "nested_items": []
                },
                {
                  "name": "code",
                  "type": "string",
                  "description": "The error code for an individual failure in the BatchPutTaxRegistration operation.",
                  "nested_items": []
                },
                {
                  "name": "message",
                  "type": "string",
                  "description": "The error message for an individual failure in the BatchPutTaxRegistration operation.",
                  "nested_items": []
                }
              ]
            }
          ]
        },
        {
          "name": "status",
          "type": "string",
          "description": "The status of your TRN stored in the system after processing. Based on the validation occurring on the TRN, the status can be Verified, Pending or Rejected.",
          "nested_items": []
        }
      ]
    }
  ]
}