{
  "method_name": "add_application_input_processing_configuration",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kinesisanalyticsv2/client/add_application_input_processing_configuration.html",
  "description": "Adds an  InputProcessingConfiguration to a SQL-based Kinesis Data Analytics application. An input processor pre-processes records on the input stream before the application's SQL code executes. Currently, the only input processor available is Amazon Lambda.",
  "parameters": [
    {
      "name": "ApplicationName",
      "type": "string",
      "required": true,
      "description": "The name of the application to which you want to add the input processing configuration.",
      "nested_params": []
    },
    {
      "name": "CurrentApplicationVersionId",
      "type": "integer",
      "required": true,
      "description": "The version of the application to which you want to add the input processing configuration. You can use the  DescribeApplication operation to get the current application version. If the version specified is not the current version, the ConcurrentModificationException is returned.",
      "nested_params": []
    },
    {
      "name": "InputId",
      "type": "string",
      "required": true,
      "description": "The ID of the input configuration to add the input processing configuration to. You can get a list of the input IDs for an application using the  DescribeApplication operation.",
      "nested_params": []
    },
    {
      "name": "InputProcessingConfiguration",
      "type": "dict",
      "required": true,
      "description": "The  InputProcessingConfiguration to add to the application. The  InputLambdaProcessor that is used to preprocess the records in the stream before being processed by your application code. The ARN of the Amazon Lambda function that operates on records in the stream.",
      "nested_params": [
        {
          "name": "InputLambdaProcessor",
          "type": "dict",
          "required": false,
          "description": "The  InputLambdaProcessor that is used to preprocess the records in the stream before being processed by your application code.",
          "nested_params": [
            {
              "name": "ResourceARN",
              "type": "string",
              "required": false,
              "description": "The ARN of the Amazon Lambda function that operates on records in the stream.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ApplicationARN",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the application.",
          "nested_items": []
        },
        {
          "name": "ApplicationVersionId",
          "type": "integer",
          "description": "Provides the current application version.",
          "nested_items": []
        },
        {
          "name": "InputId",
          "type": "string",
          "description": "The input ID that is associated with the application input. This is the ID that Kinesis Data Analytics assigns to each input configuration that you add to your application.",
          "nested_items": []
        },
        {
          "name": "InputProcessingConfigurationDescription",
          "type": "dict",
          "description": "The description of the preprocessor that executes on records in this input before the application's code is run.",
          "nested_items": [
            {
              "name": "InputLambdaProcessorDescription",
              "type": "dict",
              "description": "Provides configuration information about the associated  InputLambdaProcessorDescription.",
              "nested_items": [
                {
                  "name": "ResourceARN",
                  "type": "string",
                  "description": "The ARN of the Amazon Lambda function that is used to preprocess the records in the stream.",
                  "nested_items": []
                },
                {
                  "name": "RoleARN",
                  "type": "string",
                  "description": "The ARN of the IAM role that is used to access the Amazon Lambda function.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}