{
  "method_name": "add_application_input",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kinesisanalyticsv2/client/add_application_input.html",
  "description": "Adds a streaming source to your SQL-based Kinesis Data Analytics application. You can add a streaming source when you create an application, or you can use this operation to add a streaming source after you create an application. For more information, see  CreateApplication. Any configuration update, including adding a streaming source using this operation, results in a new version of the application. You can use the  DescribeApplication operation to find the current application version.",
  "parameters": [
    {
      "name": "ApplicationName",
      "type": "string",
      "required": true,
      "description": "The name of your existing application to which you want to add the streaming source.",
      "nested_params": []
    },
    {
      "name": "CurrentApplicationVersionId",
      "type": "integer",
      "required": true,
      "description": "The current version of your application. You must provide the ApplicationVersionID or the ConditionalToken.You can use the  DescribeApplication operation to find the current application version.",
      "nested_params": []
    },
    {
      "name": "Input",
      "type": "dict",
      "required": true,
      "description": "The  Input to add. The name prefix to use when creating an in-application stream. Suppose that you specify a prefix ' MyInApplicationStream.' Kinesis Data Analytics then creates one or more (as per the InputParallelism count you specified) in-application streams with the names ' MyInApplicationStream_001,' ' MyInApplicationStream_002,' and so on. InputProcessingConfiguration (dict) --- The  InputProcessingConfiguration for the input. An input processor transforms records as they are received from the stream, before the application's SQL code executes. Currently, the only input processing configuration available is  InputLambdaProcessor. The  InputLambdaProcessor that is used to preprocess the records in the stream before being processed by your application code. The ARN of the Amazon Lambda function that operates on records in the stream. KinesisStreamsInput (dict) --- If the streaming source is an Amazon Kinesis data stream, identifies the stream's Amazon Resource Name (ARN). The ARN of the input Kinesis data stream to read. KinesisFirehoseInput (dict) --- If the streaming source is an Amazon Kinesis Data Firehose delivery stream, identifies the delivery stream's ARN. The Amazon Resource Name (ARN) of the delivery stream. InputParallelism (dict) --- Describes the number of in-application streams to create. Count (integer) --- The number of in-application streams to create. Describes the format of the data in the streaming source, and how each data element maps to corresponding columns in the in-application stream that is being created. Also used to describe the format of the reference data source. Specifies the format of the records on the streaming source. The type of record format. MappingParameters (dict) --- When you configure application input at the time of creating or updating an application, provides additional mapping information specific to the record format (such as JSON, CSV, or record fields delimited by some delimiter) on the streaming source. JSONMappingParameters (dict) --- Provides additional mapping information when JSON is the record format on the streaming source. The path to the top-level parent that contains the records. CSVMappingParameters (dict) --- Provides additional mapping information when the record format uses delimiters (for example, CSV). The row delimiter. For example, in a CSV format, --\u0098n' is the typical row delimiter. The column delimiter. For example, in a CSV format, a comma (',') is the typical column delimiter. RecordEncoding (string) --- Specifies the encoding of the records in the streaming source. For example, UTF-8. A list of RecordColumn objects. (dict) --- For a SQL-based Kinesis Data Analytics application, describes the mapping of each data element in the streaming source to the corresponding column in the in-application stream. The name of the column that is created in the in-application input stream or reference table. Mapping (string) --- A reference to the data element in the streaming input or the reference data source. The type of column created in the in-application input stream or reference table.",
      "nested_params": [
        {
          "name": "NamePrefix",
          "type": "string",
          "required": false,
          "description": "The name prefix to use when creating an in-application stream. Suppose that you specify a prefix ' MyInApplicationStream.' Kinesis Data Analytics then creates one or more (as per the InputParallelism count you specified) in-application streams with the names ' MyInApplicationStream_001,' ' MyInApplicationStream_002,' and so on.",
          "nested_params": []
        },
        {
          "name": "InputProcessingConfiguration",
          "type": "dict",
          "required": false,
          "description": "The  InputProcessingConfiguration for the input. An input processor transforms records as they are received from the stream, before the application's SQL code executes. Currently, the only input processing configuration available is  InputLambdaProcessor.",
          "nested_params": [
            {
              "name": "InputLambdaProcessor",
              "type": "dict",
              "required": false,
              "description": "The  InputLambdaProcessor that is used to preprocess the records in the stream before being processed by your application code.",
              "nested_params": [
                {
                  "name": "ResourceARN",
                  "type": "string",
                  "required": false,
                  "description": "The ARN of the Amazon Lambda function that operates on records in the stream.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "KinesisStreamsInput",
          "type": "dict",
          "required": false,
          "description": "If the streaming source is an Amazon Kinesis data stream, identifies the stream's Amazon Resource Name (ARN).",
          "nested_params": [
            {
              "name": "ResourceARN",
              "type": "string",
              "required": false,
              "description": "The ARN of the input Kinesis data stream to read.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "KinesisFirehoseInput",
          "type": "dict",
          "required": false,
          "description": "If the streaming source is an Amazon Kinesis Data Firehose delivery stream, identifies the delivery stream's ARN.",
          "nested_params": [
            {
              "name": "ResourceARN",
              "type": "string",
              "required": false,
              "description": "The Amazon Resource Name (ARN) of the delivery stream.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "InputParallelism",
          "type": "dict",
          "required": false,
          "description": "Describes the number of in-application streams to create.",
          "nested_params": [
            {
              "name": "Count",
              "type": "integer",
              "required": false,
              "description": "The number of in-application streams to create.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "InputSchema",
          "type": "dict",
          "required": false,
          "description": "Describes the format of the data in the streaming source, and how each data element maps to corresponding columns in the in-application stream that is being created. Also used to describe the format of the reference data source.",
          "nested_params": [
            {
              "name": "RecordFormat",
              "type": "dict",
              "required": false,
              "description": "Specifies the format of the records on the streaming source.",
              "nested_params": [
                {
                  "name": "RecordFormatType",
                  "type": "string",
                  "required": false,
                  "description": "The type of record format.",
                  "nested_params": []
                },
                {
                  "name": "MappingParameters",
                  "type": "dict",
                  "required": false,
                  "description": "When you configure application input at the time of creating or updating an application, provides additional mapping information specific to the record format (such as JSON, CSV, or record fields delimited by some delimiter) on the streaming source.",
                  "nested_params": [
                    {
                      "name": "JSONMappingParameters",
                      "type": "dict",
                      "required": false,
                      "description": "Provides additional mapping information when JSON is the record format on the streaming source.",
                      "nested_params": [
                        {
                          "name": "RecordRowPath",
                          "type": "string",
                          "required": false,
                          "description": "The path to the top-level parent that contains the records.",
                          "nested_params": []
                        }
                      ]
                    },
                    {
                      "name": "CSVMappingParameters",
                      "type": "dict",
                      "required": false,
                      "description": "Provides additional mapping information when the record format uses delimiters (for example, CSV).",
                      "nested_params": [
                        {
                          "name": "RecordRowDelimiter",
                          "type": "string",
                          "required": false,
                          "description": "The row delimiter. For example, in a CSV format, --\u0098n' is the typical row delimiter.",
                          "nested_params": []
                        },
                        {
                          "name": "RecordColumnDelimiter",
                          "type": "string",
                          "required": false,
                          "description": "The column delimiter. For example, in a CSV format, a comma (',') is the typical column delimiter.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "RecordEncoding",
              "type": "string",
              "required": false,
              "description": "Specifies the encoding of the records in the streaming source. For example, UTF-8.",
              "nested_params": []
            },
            {
              "name": "RecordColumns",
              "type": "list",
              "required": false,
              "description": "A list of RecordColumn objects.",
              "nested_params": [
                {
                  "name": "Name",
                  "type": "string",
                  "required": false,
                  "description": "The name of the column that is created in the in-application input stream or reference table.",
                  "nested_params": []
                },
                {
                  "name": "Mapping",
                  "type": "string",
                  "required": false,
                  "description": "A reference to the data element in the streaming input or the reference data source.",
                  "nested_params": []
                },
                {
                  "name": "SqlType",
                  "type": "string",
                  "required": false,
                  "description": "The type of column created in the in-application input stream or reference table.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ApplicationARN",
          "type": "string",
          "description": "The Amazon Resource Name (ARN) of the application.",
          "nested_items": []
        },
        {
          "name": "ApplicationVersionId",
          "type": "integer",
          "description": "Provides the current application version.",
          "nested_items": []
        },
        {
          "name": "InputDescriptions",
          "type": "list",
          "description": "Describes the application input configuration.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "InputId",
                  "type": "string",
                  "description": "The input ID that is associated with the application input. This is the ID that Kinesis Data Analytics assigns to each input configuration that you add to your application.",
                  "nested_items": []
                },
                {
                  "name": "NamePrefix",
                  "type": "string",
                  "description": "The in-application name prefix.",
                  "nested_items": []
                },
                {
                  "name": "InAppStreamNames",
                  "type": "list",
                  "description": "Returns the in-application stream names that are mapped to the stream source.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "string",
                      "description": "(string) ---",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "InputProcessingConfigurationDescription",
                  "type": "dict",
                  "description": "The description of the preprocessor that executes on records in this input before the application's code is run.",
                  "nested_items": [
                    {
                      "name": "InputLambdaProcessorDescription",
                      "type": "dict",
                      "description": "Provides configuration information about the associated  InputLambdaProcessorDescription.",
                      "nested_items": [
                        {
                          "name": "ResourceARN",
                          "type": "string",
                          "description": "The ARN of the Amazon Lambda function that is used to preprocess the records in the stream.",
                          "nested_items": []
                        },
                        {
                          "name": "RoleARN",
                          "type": "string",
                          "description": "The ARN of the IAM role that is used to access the Amazon Lambda function.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "KinesisStreamsInputDescription",
                  "type": "dict",
                  "description": "If a Kinesis data stream is configured as a streaming source, provides the Kinesis data stream's Amazon Resource Name (ARN).",
                  "nested_items": [
                    {
                      "name": "ResourceARN",
                      "type": "string",
                      "description": "The Amazon Resource Name (ARN) of the Kinesis data stream.",
                      "nested_items": []
                    },
                    {
                      "name": "RoleARN",
                      "type": "string",
                      "description": "The ARN of the IAM role that Kinesis Data Analytics can assume to access the stream.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "KinesisFirehoseInputDescription",
                  "type": "dict",
                  "description": "If a Kinesis Data Firehose delivery stream is configured as a streaming source, provides the delivery stream's ARN.",
                  "nested_items": [
                    {
                      "name": "ResourceARN",
                      "type": "string",
                      "description": "The Amazon Resource Name (ARN) of the delivery stream.",
                      "nested_items": []
                    },
                    {
                      "name": "RoleARN",
                      "type": "string",
                      "description": "The ARN of the IAM role that Kinesis Data Analytics assumes to access the stream.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "InputSchema",
                  "type": "dict",
                  "description": "Describes the format of the data in the streaming source, and how each data element maps to corresponding columns in the in-application stream that is being created.",
                  "nested_items": [
                    {
                      "name": "RecordFormat",
                      "type": "dict",
                      "description": "Specifies the format of the records on the streaming source.",
                      "nested_items": [
                        {
                          "name": "RecordFormatType",
                          "type": "string",
                          "description": "The type of record format.",
                          "nested_items": []
                        },
                        {
                          "name": "MappingParameters",
                          "type": "dict",
                          "description": "When you configure application input at the time of creating or updating an application, provides additional mapping information specific to the record format (such as JSON, CSV, or record fields delimited by some delimiter) on the streaming source.",
                          "nested_items": [
                            {
                              "name": "JSONMappingParameters",
                              "type": "dict",
                              "description": "Provides additional mapping information when JSON is the record format on the streaming source.",
                              "nested_items": [
                                {
                                  "name": "RecordRowPath",
                                  "type": "string",
                                  "description": "The path to the top-level parent that contains the records.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "CSVMappingParameters",
                              "type": "dict",
                              "description": "Provides additional mapping information when the record format uses delimiters (for example, CSV).",
                              "nested_items": [
                                {
                                  "name": "RecordRowDelimiter",
                                  "type": "string",
                                  "description": "The row delimiter. For example, in a CSV format, --\u0098n' is the typical row delimiter.",
                                  "nested_items": []
                                },
                                {
                                  "name": "RecordColumnDelimiter",
                                  "type": "string",
                                  "description": "The column delimiter. For example, in a CSV format, a comma (',') is the typical column delimiter.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "RecordEncoding",
                      "type": "string",
                      "description": "Specifies the encoding of the records in the streaming source. For example, UTF-8.",
                      "nested_items": []
                    },
                    {
                      "name": "RecordColumns",
                      "type": "list",
                      "description": "A list of RecordColumn objects.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "Name",
                              "type": "string",
                              "description": "The name of the column that is created in the in-application input stream or reference table.",
                              "nested_items": []
                            },
                            {
                              "name": "Mapping",
                              "type": "string",
                              "description": "A reference to the data element in the streaming input or the reference data source.",
                              "nested_items": []
                            },
                            {
                              "name": "SqlType",
                              "type": "string",
                              "description": "The type of column created in the in-application input stream or reference table.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "InputParallelism",
                  "type": "dict",
                  "description": "Describes the configured parallelism (number of in-application streams mapped to the streaming source).",
                  "nested_items": [
                    {
                      "name": "Count",
                      "type": "integer",
                      "description": "The number of in-application streams to create.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "InputStartingPositionConfiguration",
                  "type": "dict",
                  "description": "The point at which the application is configured to read from the input stream.",
                  "nested_items": [
                    {
                      "name": "InputStartingPosition",
                      "type": "string",
                      "description": "The starting position on the stream.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "",
                          "description": "NOW - Start reading just after the most recent record in the stream, and start at the request timestamp that the customer issued.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "TRIM_HORIZON - Start reading at the last untrimmed record in the stream, which is the oldest record available in the stream. This option is not available for an Amazon Kinesis Data Firehose delivery stream.",
                          "nested_items": []
                        },
                        {
                          "name": "",
                          "type": "",
                          "description": "LAST_STOPPED_POINT - Resume reading from where the application last stopped reading.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}