{
  "method_name": "create_application",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kinesisanalyticsv2/client/create_application.html",
  "description": "Creates a Managed Service for Apache Flink application. For information about creating a Managed Service for Apache Flink application, see Creating an Application.",
  "parameters": [
    {
      "name": "ApplicationName",
      "type": "string",
      "required": true,
      "description": "The name of your application (for example, sample-app).",
      "nested_params": []
    },
    {
      "name": "ApplicationDescription",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "RuntimeEnvironment",
      "type": "string",
      "required": true,
      "description": "The runtime environment for the application.",
      "nested_params": []
    },
    {
      "name": "ServiceExecutionRole",
      "type": "string",
      "required": true,
      "description": "The IAM role used by the application to access Kinesis data streams, Kinesis Data Firehose delivery streams, Amazon S3 objects, and other external resources.",
      "nested_params": []
    },
    {
      "name": "ApplicationConfiguration",
      "type": "dict",
      "required": true,
      "description": "Use this parameter to configure the application. SqlApplicationConfiguration (dict) --- The creation and update parameters for a SQL-based Kinesis Data Analytics application. Inputs (list) --- The array of  Input objects describing the input streams used by the application. (dict) --- When you configure the application input for a SQL-based Kinesis Data Analytics application, you specify the streaming source, the in-application stream name that is created, and the mapping between the two. The name prefix to use when creating an in-application stream. Suppose that you specify a prefix ' MyInApplicationStream.' Kinesis Data Analytics then creates one or more (as per the InputParallelism count you specified) in-application streams with the names ' MyInApplicationStream_001,' ' MyInApplicationStream_002,' and so on. InputProcessingConfiguration (dict) --- The  InputProcessingConfiguration for the input. An input processor transforms records as they are received from the stream, before the application's SQL code executes. Currently, the only input processing configuration available is  InputLambdaProcessor. The  InputLambdaProcessor that is used to preprocess the records in the stream before being processed by your application code. The ARN of the Amazon Lambda function that operates on records in the stream. KinesisStreamsInput (dict) --- If the streaming source is an Amazon Kinesis data stream, identifies the stream's Amazon Resource Name (ARN). The ARN of the input Kinesis data stream to read. KinesisFirehoseInput (dict) --- If the streaming source is an Amazon Kinesis Data Firehose delivery stream, identifies the delivery stream's ARN. The Amazon Resource Name (ARN) of the delivery stream. InputParallelism (dict) --- Describes the number of in-application streams to create. Count (integer) --- The number of in-application streams to create. Describes the format of the data in the streaming source, and how each data element maps to corresponding columns in the in-application stream that is being created. Also used to describe the format of the reference data source. Specifies the format of the records on the streaming source. The type of record format. MappingParameters (dict) --- When you configure application input at the time of creating or updating an application, provides additional mapping information specific to the record format (such as JSON, CSV, or record fields delimited by some delimiter) on the streaming source. JSONMappingParameters (dict) --- Provides additional mapping information when JSON is the record format on the streaming source. The path to the top-level parent that contains the records. CSVMappingParameters (dict) --- Provides additional mapping information when the record format uses delimiters (for example, CSV). The row delimiter. For example, in a CSV format, --\u0098n' is the typical row delimiter. The column delimiter. For example, in a CSV format, a comma (',') is the typical column delimiter. RecordEncoding (string) --- Specifies the encoding of the records in the streaming source. For example, UTF-8. A list of RecordColumn objects. (dict) --- For a SQL-based Kinesis Data Analytics application, describes the mapping of each data element in the streaming source to the corresponding column in the in-application stream. The name of the column that is created in the in-application input stream or reference table. Mapping (string) --- A reference to the data element in the streaming input or the reference data source. The type of column created in the in-application input stream or reference table. Outputs (list) --- The array of  Output objects describing the destination streams used by the application. (dict) --- Describes a SQL-based Kinesis Data Analytics application's output configuration, in which you identify an in-application stream and a destination where you want the in-application stream data to be written. The destination can be a Kinesis data stream or a Kinesis Data Firehose delivery stream. The name of the in-application stream. KinesisStreamsOutput (dict) --- Identifies a Kinesis data stream as the destination. The ARN of the destination Kinesis data stream to write to. KinesisFirehoseOutput (dict) --- Identifies a Kinesis Data Firehose delivery stream as the destination. The ARN of the destination delivery stream to write to. LambdaOutput (dict) --- Identifies an Amazon Lambda function as the destination. The Amazon Resource Name (ARN) of the destination Lambda function to write to. Describes the data format when records are written to the destination. Specifies the format of the records on the output stream. ReferenceDataSources (list) --- The array of  ReferenceDataSource objects describing the reference data sources used by the application. (dict) --- For a SQL-based Kinesis Data Analytics application, describes the reference data source by providing the source information (Amazon S3 bucket name and object key name), the resulting in-application table name that is created, and the necessary schema to map the data elements in the Amazon S3 object to the in-application table. The name of the in-application table to create. S3ReferenceDataSource (dict) --- Identifies the S3 bucket and object that contains the reference data. A SQL-based Kinesis Data Analytics application loads reference data only once. If the data changes, you call the  UpdateApplication operation to trigger reloading of data into your application. BucketARN (string) --- The Amazon Resource Name (ARN) of the S3 bucket. FileKey (string) --- The object key name containing the reference data. Describes the format of the data in the streaming source, and how each data element maps to corresponding columns created in the in-application stream. FlinkApplicationConfiguration (dict) --- The creation and update parameters for a Managed Service for Apache Flink application. CheckpointConfiguration (dict) --- Describes an application's checkpointing configuration. Checkpointing is the process of persisting application state for fault tolerance. For more information, see Checkpoints for Fault Tolerance in the Apache Flink Documentation. Describes whether the application uses Managed Service for Apache Flink' default checkpointing behavior. You must set this property to CUSTOM in order to set the CheckpointingEnabled, CheckpointInterval, or MinPauseBetweenCheckpoints parameters. CheckpointingEnabled (boolean) --- Describes whether checkpointing is enabled for a Managed Service for Apache Flink application. CheckpointInterval (integer) --- Describes the interval in milliseconds between checkpoint operations. MinPauseBetweenCheckpoints (integer) --- Describes the minimum time in milliseconds after a checkpoint operation completes that a new checkpoint operation can start. If a checkpoint operation takes longer than the CheckpointInterval, the application otherwise performs continual checkpoint operations. For more information, see Tuning Checkpointing in the Apache Flink Documentation. MonitoringConfiguration (dict) --- Describes configuration parameters for Amazon CloudWatch logging for an application. Describes whether to use the default CloudWatch logging configuration for an application. You must set this property to CUSTOM in order to set the LogLevel or MetricsLevel parameters. MetricsLevel (string) --- Describes the granularity of the CloudWatch Logs for an application. The Parallelism level is not recommended for applications with a Parallelism over 64 due to excessive costs. LogLevel (string) --- Describes the verbosity of the CloudWatch Logs for an application. ParallelismConfiguration (dict) --- Describes parameters for how an application executes multiple tasks simultaneously. Describes whether the application uses the default parallelism for the Managed Service for Apache Flink service. You must set this property to CUSTOM in order to change your application's AutoScalingEnabled, Parallelism, or ParallelismPerKPU properties. Parallelism (integer) --- Describes the initial number of parallel tasks that a Managed Service for Apache Flink application can perform. If AutoScalingEnabled is set to True, Managed Service for Apache Flink increases the CurrentParallelism value in response to application load. The service can increase the CurrentParallelism value up to the maximum parallelism, which is ParalellismPerKPU times the maximum KPUs for the application. The maximum KPUs for an application is 32 by default, and can be increased by requesting a limit increase. If application load is reduced, the service can reduce the CurrentParallelism value down to the Parallelism setting. ParallelismPerKPU (integer) --- Describes the number of parallel tasks that a Managed Service for Apache Flink application can perform per Kinesis Processing Unit (KPU) used by the application. For more information about KPUs, see Amazon Managed Service for Apache Flink Pricing. AutoScalingEnabled (boolean) --- Describes whether the Managed Service for Apache Flink service can increase the parallelism of the application in response to increased throughput. EnvironmentProperties (dict) --- Describes execution properties for a Managed Service for Apache Flink application. Describes the execution property groups. (dict) --- Property key-value pairs passed into an application. Describes the key of an application execution property key-value pair. Describes the value of an application execution property key-value pair. (string) --- (string) --- ApplicationCodeConfiguration (dict) --- The code location and type parameters for a Managed Service for Apache Flink application. CodeContent (dict) --- The location and type of the application code. TextContent (string) --- The text-format code for a Managed Service for Apache Flink application. ZipFileContent (bytes) --- The zip-format code for a Managed Service for Apache Flink application. S3ContentLocation (dict) --- Information about the Amazon S3 bucket that contains the application code. The Amazon Resource Name (ARN) for the S3 bucket containing the application code. The file key for the object containing the application code. ObjectVersion (string) --- The version of the object containing the application code. Specifies whether the code content is in text or zip format. ApplicationSnapshotConfiguration (dict) --- Describes whether snapshots are enabled for a Managed Service for Apache Flink application. Describes whether snapshots are enabled for a Managed Service for Apache Flink application. ApplicationSystemRollbackConfiguration (dict) --- Describes system rollback configuration for a Managed Service for Apache Flink application VpcConfigurations (list) --- The array of descriptions of VPC configurations available to the application. (dict) --- Describes the parameters of a VPC used by the application. The array of Subnet IDs used by the VPC configuration. (string) --- The array of SecurityGroup IDs used by the VPC configuration. (string) --- ZeppelinApplicationConfiguration (dict) --- The configuration parameters for a Managed Service for Apache Flink Studio notebook. MonitoringConfiguration (dict) --- The monitoring configuration of a Managed Service for Apache Flink Studio notebook. The verbosity of the CloudWatch Logs for an application. CatalogConfiguration (dict) --- The Amazon Glue Data Catalog that you use in queries in a Managed Service for Apache Flink Studio notebook. The configuration parameters for the default Amazon Glue database. You use this database for Apache Flink SQL queries and table API transforms that you write in a Managed Service for Apache Flink Studio notebook. The Amazon Resource Name (ARN) of the database. DeployAsApplicationConfiguration (dict) --- The information required to deploy a Managed Service for Apache Flink Studio notebook as an application with durable state. The description of an Amazon S3 object that contains the Amazon Data Analytics application, including the Amazon Resource Name (ARN) of the S3 bucket, the name of the Amazon S3 object that contains the data, and the version number of the Amazon S3 object that contains the data. The Amazon Resource Name (ARN) of the S3 bucket. BasePath (string) --- The base path for the S3 bucket. CustomArtifactsConfiguration (list) --- Custom artifacts are dependency JARs and user-defined functions (UDF). (dict) --- Specifies dependency JARs, as well as JAR files that contain user-defined functions (UDF). UDF stands for user-defined functions. This type of artifact must be in an S3 bucket. A DEPENDENCY_JAR can be in either Maven or an S3 bucket. S3ContentLocation (dict) --- For a Managed Service for Apache Flink application provides a description of an Amazon S3 object, including the Amazon Resource Name (ARN) of the S3 bucket, the name of the Amazon S3 object that contains the data, and the version number of the Amazon S3 object that contains the data. MavenReference (dict) --- The parameters required to fully specify a Maven reference. The group ID of the Maven reference. The artifact ID of the Maven reference. The version of the Maven reference.",
      "nested_params": [
        {
          "name": "SqlApplicationConfiguration",
          "type": "dict",
          "required": false,
          "description": "The creation and update parameters for a SQL-based Kinesis Data Analytics application.",
          "nested_params": [
            {
              "name": "Inputs",
              "type": "list",
              "required": false,
              "description": "The array of  Input objects describing the input streams used by the application.",
              "nested_params": [
                {
                  "name": "NamePrefix",
                  "type": "string",
                  "required": false,
                  "description": "The name prefix to use when creating an in-application stream. Suppose that you specify a prefix ' MyInApplicationStream.' Kinesis Data Analytics then creates one or more (as per the InputParallelism count you specified) in-application streams with the names ' MyInApplicationStream_001,' ' MyInApplicationStream_002,' and so on.",
                  "nested_params": []
                },
                {
                  "name": "InputProcessingConfiguration",
                  "type": "dict",
                  "required": false,
                  "description": "The  InputProcessingConfiguration for the input. An input processor transforms records as they are received from the stream, before the application's SQL code executes. Currently, the only input processing configuration available is  InputLambdaProcessor.",
                  "nested_params": [
                    {
                      "name": "InputLambdaProcessor",
                      "type": "dict",
                      "required": false,
                      "description": "The  InputLambdaProcessor that is used to preprocess the records in the stream before being processed by your application code.",
                      "nested_params": [
                        {
                          "name": "ResourceARN",
                          "type": "string",
                          "required": false,
                          "description": "The ARN of the Amazon Lambda function that operates on records in the stream.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "KinesisStreamsInput",
                  "type": "dict",
                  "required": false,
                  "description": "If the streaming source is an Amazon Kinesis data stream, identifies the stream's Amazon Resource Name (ARN).",
                  "nested_params": [
                    {
                      "name": "ResourceARN",
                      "type": "string",
                      "required": false,
                      "description": "The ARN of the input Kinesis data stream to read.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "KinesisFirehoseInput",
                  "type": "dict",
                  "required": false,
                  "description": "If the streaming source is an Amazon Kinesis Data Firehose delivery stream, identifies the delivery stream's ARN.",
                  "nested_params": [
                    {
                      "name": "ResourceARN",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Resource Name (ARN) of the delivery stream.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "InputParallelism",
                  "type": "dict",
                  "required": false,
                  "description": "Describes the number of in-application streams to create.",
                  "nested_params": [
                    {
                      "name": "Count",
                      "type": "integer",
                      "required": false,
                      "description": "The number of in-application streams to create.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "InputSchema",
                  "type": "dict",
                  "required": false,
                  "description": "Describes the format of the data in the streaming source, and how each data element maps to corresponding columns in the in-application stream that is being created. Also used to describe the format of the reference data source.",
                  "nested_params": [
                    {
                      "name": "RecordFormat",
                      "type": "dict",
                      "required": false,
                      "description": "Specifies the format of the records on the streaming source.",
                      "nested_params": [
                        {
                          "name": "RecordFormatType",
                          "type": "string",
                          "required": false,
                          "description": "The type of record format.",
                          "nested_params": []
                        },
                        {
                          "name": "MappingParameters",
                          "type": "dict",
                          "required": false,
                          "description": "When you configure application input at the time of creating or updating an application, provides additional mapping information specific to the record format (such as JSON, CSV, or record fields delimited by some delimiter) on the streaming source.",
                          "nested_params": [
                            {
                              "name": "JSONMappingParameters",
                              "type": "dict",
                              "required": false,
                              "description": "Provides additional mapping information when JSON is the record format on the streaming source.",
                              "nested_params": [
                                {
                                  "name": "RecordRowPath",
                                  "type": "string",
                                  "required": false,
                                  "description": "The path to the top-level parent that contains the records.",
                                  "nested_params": []
                                }
                              ]
                            },
                            {
                              "name": "CSVMappingParameters",
                              "type": "dict",
                              "required": false,
                              "description": "Provides additional mapping information when the record format uses delimiters (for example, CSV).",
                              "nested_params": [
                                {
                                  "name": "RecordRowDelimiter",
                                  "type": "string",
                                  "required": false,
                                  "description": "The row delimiter. For example, in a CSV format, --\u0098n' is the typical row delimiter.",
                                  "nested_params": []
                                },
                                {
                                  "name": "RecordColumnDelimiter",
                                  "type": "string",
                                  "required": false,
                                  "description": "The column delimiter. For example, in a CSV format, a comma (',') is the typical column delimiter.",
                                  "nested_params": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "RecordEncoding",
                      "type": "string",
                      "required": false,
                      "description": "Specifies the encoding of the records in the streaming source. For example, UTF-8.",
                      "nested_params": []
                    },
                    {
                      "name": "RecordColumns",
                      "type": "list",
                      "required": false,
                      "description": "A list of RecordColumn objects.",
                      "nested_params": [
                        {
                          "name": "Name",
                          "type": "string",
                          "required": false,
                          "description": "The name of the column that is created in the in-application input stream or reference table.",
                          "nested_params": []
                        },
                        {
                          "name": "Mapping",
                          "type": "string",
                          "required": false,
                          "description": "A reference to the data element in the streaming input or the reference data source.",
                          "nested_params": []
                        },
                        {
                          "name": "SqlType",
                          "type": "string",
                          "required": false,
                          "description": "The type of column created in the in-application input stream or reference table.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "Outputs",
              "type": "list",
              "required": false,
              "description": "The array of  Output objects describing the destination streams used by the application.",
              "nested_params": [
                {
                  "name": "Name",
                  "type": "string",
                  "required": false,
                  "description": "The name of the in-application stream.",
                  "nested_params": []
                },
                {
                  "name": "KinesisStreamsOutput",
                  "type": "dict",
                  "required": false,
                  "description": "Identifies a Kinesis data stream as the destination.",
                  "nested_params": [
                    {
                      "name": "ResourceARN",
                      "type": "string",
                      "required": false,
                      "description": "The ARN of the destination Kinesis data stream to write to.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "KinesisFirehoseOutput",
                  "type": "dict",
                  "required": false,
                  "description": "Identifies a Kinesis Data Firehose delivery stream as the destination.",
                  "nested_params": [
                    {
                      "name": "ResourceARN",
                      "type": "string",
                      "required": false,
                      "description": "The ARN of the destination delivery stream to write to.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "LambdaOutput",
                  "type": "dict",
                  "required": false,
                  "description": "Identifies an Amazon Lambda function as the destination.",
                  "nested_params": [
                    {
                      "name": "ResourceARN",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Resource Name (ARN) of the destination Lambda function to write to.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "DestinationSchema",
                  "type": "dict",
                  "required": false,
                  "description": "Describes the data format when records are written to the destination.",
                  "nested_params": [
                    {
                      "name": "RecordFormatType",
                      "type": "string",
                      "required": false,
                      "description": "Specifies the format of the records on the output stream.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "ReferenceDataSources",
              "type": "list",
              "required": false,
              "description": "The array of  ReferenceDataSource objects describing the reference data sources used by the application.",
              "nested_params": [
                {
                  "name": "TableName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the in-application table to create.",
                  "nested_params": []
                },
                {
                  "name": "S3ReferenceDataSource",
                  "type": "dict",
                  "required": false,
                  "description": "Identifies the S3 bucket and object that contains the reference data. A SQL-based Kinesis Data Analytics application loads reference data only once. If the data changes, you call the  UpdateApplication operation to trigger reloading of data into your application.",
                  "nested_params": [
                    {
                      "name": "BucketARN",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Resource Name (ARN) of the S3 bucket.",
                      "nested_params": []
                    },
                    {
                      "name": "FileKey",
                      "type": "string",
                      "required": false,
                      "description": "The object key name containing the reference data.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "ReferenceSchema",
                  "type": "dict",
                  "required": false,
                  "description": "Describes the format of the data in the streaming source, and how each data element maps to corresponding columns created in the in-application stream.",
                  "nested_params": [
                    {
                      "name": "RecordFormat",
                      "type": "dict",
                      "required": false,
                      "description": "Specifies the format of the records on the streaming source.",
                      "nested_params": [
                        {
                          "name": "RecordFormatType",
                          "type": "string",
                          "required": false,
                          "description": "The type of record format.",
                          "nested_params": []
                        },
                        {
                          "name": "MappingParameters",
                          "type": "dict",
                          "required": false,
                          "description": "When you configure application input at the time of creating or updating an application, provides additional mapping information specific to the record format (such as JSON, CSV, or record fields delimited by some delimiter) on the streaming source.",
                          "nested_params": [
                            {
                              "name": "JSONMappingParameters",
                              "type": "dict",
                              "required": false,
                              "description": "Provides additional mapping information when JSON is the record format on the streaming source.",
                              "nested_params": [
                                {
                                  "name": "RecordRowPath",
                                  "type": "string",
                                  "required": false,
                                  "description": "The path to the top-level parent that contains the records.",
                                  "nested_params": []
                                }
                              ]
                            },
                            {
                              "name": "CSVMappingParameters",
                              "type": "dict",
                              "required": false,
                              "description": "Provides additional mapping information when the record format uses delimiters (for example, CSV).",
                              "nested_params": [
                                {
                                  "name": "RecordRowDelimiter",
                                  "type": "string",
                                  "required": false,
                                  "description": "The row delimiter. For example, in a CSV format, --\u0098n' is the typical row delimiter.",
                                  "nested_params": []
                                },
                                {
                                  "name": "RecordColumnDelimiter",
                                  "type": "string",
                                  "required": false,
                                  "description": "The column delimiter. For example, in a CSV format, a comma (',') is the typical column delimiter.",
                                  "nested_params": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "RecordEncoding",
                      "type": "string",
                      "required": false,
                      "description": "Specifies the encoding of the records in the streaming source. For example, UTF-8.",
                      "nested_params": []
                    },
                    {
                      "name": "RecordColumns",
                      "type": "list",
                      "required": false,
                      "description": "A list of RecordColumn objects.",
                      "nested_params": [
                        {
                          "name": "Name",
                          "type": "string",
                          "required": false,
                          "description": "The name of the column that is created in the in-application input stream or reference table.",
                          "nested_params": []
                        },
                        {
                          "name": "Mapping",
                          "type": "string",
                          "required": false,
                          "description": "A reference to the data element in the streaming input or the reference data source.",
                          "nested_params": []
                        },
                        {
                          "name": "SqlType",
                          "type": "string",
                          "required": false,
                          "description": "The type of column created in the in-application input stream or reference table.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "FlinkApplicationConfiguration",
          "type": "dict",
          "required": false,
          "description": "The creation and update parameters for a Managed Service for Apache Flink application.",
          "nested_params": [
            {
              "name": "CheckpointConfiguration",
              "type": "dict",
              "required": false,
              "description": "Describes an application's checkpointing configuration. Checkpointing is the process of persisting application state for fault tolerance. For more information, see Checkpoints for Fault Tolerance in the Apache Flink Documentation.",
              "nested_params": [
                {
                  "name": "ConfigurationType",
                  "type": "string",
                  "required": false,
                  "description": "Describes whether the application uses Managed Service for Apache Flink' default checkpointing behavior. You must set this property to CUSTOM in order to set the CheckpointingEnabled, CheckpointInterval, or MinPauseBetweenCheckpoints parameters.",
                  "nested_params": []
                },
                {
                  "name": "CheckpointingEnabled",
                  "type": "boolean",
                  "required": false,
                  "description": "Describes whether checkpointing is enabled for a Managed Service for Apache Flink application.",
                  "nested_params": []
                },
                {
                  "name": "CheckpointInterval",
                  "type": "integer",
                  "required": false,
                  "description": "Describes the interval in milliseconds between checkpoint operations.",
                  "nested_params": []
                },
                {
                  "name": "MinPauseBetweenCheckpoints",
                  "type": "integer",
                  "required": false,
                  "description": "Describes the minimum time in milliseconds after a checkpoint operation completes that a new checkpoint operation can start. If a checkpoint operation takes longer than the CheckpointInterval, the application otherwise performs continual checkpoint operations. For more information, see Tuning Checkpointing in the Apache Flink Documentation.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "MonitoringConfiguration",
              "type": "dict",
              "required": false,
              "description": "Describes configuration parameters for Amazon CloudWatch logging for an application.",
              "nested_params": [
                {
                  "name": "ConfigurationType",
                  "type": "string",
                  "required": false,
                  "description": "Describes whether to use the default CloudWatch logging configuration for an application. You must set this property to CUSTOM in order to set the LogLevel or MetricsLevel parameters.",
                  "nested_params": []
                },
                {
                  "name": "MetricsLevel",
                  "type": "string",
                  "required": false,
                  "description": "Describes the granularity of the CloudWatch Logs for an application. The Parallelism level is not recommended for applications with a Parallelism over 64 due to excessive costs.",
                  "nested_params": []
                },
                {
                  "name": "LogLevel",
                  "type": "string",
                  "required": false,
                  "description": "Describes the verbosity of the CloudWatch Logs for an application.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ParallelismConfiguration",
              "type": "dict",
              "required": false,
              "description": "Describes parameters for how an application executes multiple tasks simultaneously.",
              "nested_params": [
                {
                  "name": "ConfigurationType",
                  "type": "string",
                  "required": false,
                  "description": "Describes whether the application uses the default parallelism for the Managed Service for Apache Flink service. You must set this property to CUSTOM in order to change your application's AutoScalingEnabled, Parallelism, or ParallelismPerKPU properties.",
                  "nested_params": []
                },
                {
                  "name": "Parallelism",
                  "type": "integer",
                  "required": false,
                  "description": "Describes the initial number of parallel tasks that a Managed Service for Apache Flink application can perform. If AutoScalingEnabled is set to True, Managed Service for Apache Flink increases the CurrentParallelism value in response to application load. The service can increase the CurrentParallelism value up to the maximum parallelism, which is ParalellismPerKPU times the maximum KPUs for the application. The maximum KPUs for an application is 32 by default, and can be increased by requesting a limit increase. If application load is reduced, the service can reduce the CurrentParallelism value down to the Parallelism setting.",
                  "nested_params": []
                },
                {
                  "name": "ParallelismPerKPU",
                  "type": "integer",
                  "required": false,
                  "description": "Describes the number of parallel tasks that a Managed Service for Apache Flink application can perform per Kinesis Processing Unit (KPU) used by the application. For more information about KPUs, see Amazon Managed Service for Apache Flink Pricing.",
                  "nested_params": []
                },
                {
                  "name": "AutoScalingEnabled",
                  "type": "boolean",
                  "required": false,
                  "description": "Describes whether the Managed Service for Apache Flink service can increase the parallelism of the application in response to increased throughput.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "EnvironmentProperties",
          "type": "dict",
          "required": false,
          "description": "Describes execution properties for a Managed Service for Apache Flink application.",
          "nested_params": [
            {
              "name": "PropertyGroups",
              "type": "list",
              "required": false,
              "description": "Describes the execution property groups.",
              "nested_params": [
                {
                  "name": "PropertyGroupId",
                  "type": "string",
                  "required": false,
                  "description": "Describes the key of an application execution property key-value pair.",
                  "nested_params": []
                },
                {
                  "name": "PropertyMap",
                  "type": "dict",
                  "required": false,
                  "description": "Describes the value of an application execution property key-value pair.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "ApplicationCodeConfiguration",
          "type": "dict",
          "required": false,
          "description": "The code location and type parameters for a Managed Service for Apache Flink application.",
          "nested_params": [
            {
              "name": "CodeContent",
              "type": "dict",
              "required": false,
              "description": "The location and type of the application code.",
              "nested_params": [
                {
                  "name": "TextContent",
                  "type": "string",
                  "required": false,
                  "description": "The text-format code for a Managed Service for Apache Flink application.",
                  "nested_params": []
                },
                {
                  "name": "ZipFileContent",
                  "type": "bytes",
                  "required": false,
                  "description": "The zip-format code for a Managed Service for Apache Flink application.",
                  "nested_params": []
                },
                {
                  "name": "S3ContentLocation",
                  "type": "dict",
                  "required": false,
                  "description": "Information about the Amazon S3 bucket that contains the application code.",
                  "nested_params": [
                    {
                      "name": "BucketARN",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Resource Name (ARN) for the S3 bucket containing the application code.",
                      "nested_params": []
                    },
                    {
                      "name": "FileKey",
                      "type": "string",
                      "required": false,
                      "description": "The file key for the object containing the application code.",
                      "nested_params": []
                    },
                    {
                      "name": "ObjectVersion",
                      "type": "string",
                      "required": false,
                      "description": "The version of the object containing the application code.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "CodeContentType",
              "type": "string",
              "required": false,
              "description": "Specifies whether the code content is in text or zip format.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ApplicationSnapshotConfiguration",
          "type": "dict",
          "required": false,
          "description": "Describes whether snapshots are enabled for a Managed Service for Apache Flink application.",
          "nested_params": [
            {
              "name": "SnapshotsEnabled",
              "type": "boolean",
              "required": false,
              "description": "Describes whether snapshots are enabled for a Managed Service for Apache Flink application.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ApplicationSystemRollbackConfiguration",
          "type": "dict",
          "required": false,
          "description": "",
          "nested_params": [
            {
              "name": "RollbackEnabled",
              "type": "boolean",
              "required": false,
              "description": "",
              "nested_params": []
            }
          ]
        },
        {
          "name": "VpcConfigurations",
          "type": "list",
          "required": false,
          "description": "The array of descriptions of VPC configurations available to the application.",
          "nested_params": [
            {
              "name": "SubnetIds",
              "type": "list",
              "required": false,
              "description": "The array of Subnet IDs used by the VPC configuration.",
              "nested_params": []
            },
            {
              "name": "SecurityGroupIds",
              "type": "list",
              "required": false,
              "description": "The array of SecurityGroup IDs used by the VPC configuration.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ZeppelinApplicationConfiguration",
          "type": "dict",
          "required": false,
          "description": "The configuration parameters for a Managed Service for Apache Flink Studio notebook.",
          "nested_params": [
            {
              "name": "MonitoringConfiguration",
              "type": "dict",
              "required": false,
              "description": "The monitoring configuration of a Managed Service for Apache Flink Studio notebook.",
              "nested_params": [
                {
                  "name": "LogLevel",
                  "type": "string",
                  "required": false,
                  "description": "The verbosity of the CloudWatch Logs for an application.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "CatalogConfiguration",
              "type": "dict",
              "required": false,
              "description": "The Amazon Glue Data Catalog that you use in queries in a Managed Service for Apache Flink Studio notebook.",
              "nested_params": [
                {
                  "name": "GlueDataCatalogConfiguration",
                  "type": "dict",
                  "required": false,
                  "description": "The configuration parameters for the default Amazon Glue database. You use this database for Apache Flink SQL queries and table API transforms that you write in a Managed Service for Apache Flink Studio notebook.",
                  "nested_params": [
                    {
                      "name": "DatabaseARN",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Resource Name (ARN) of the database.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "DeployAsApplicationConfiguration",
              "type": "dict",
              "required": false,
              "description": "The information required to deploy a Managed Service for Apache Flink Studio notebook as an application with durable state.",
              "nested_params": [
                {
                  "name": "S3ContentLocation",
                  "type": "dict",
                  "required": false,
                  "description": "The description of an Amazon S3 object that contains the Amazon Data Analytics application, including the Amazon Resource Name (ARN) of the S3 bucket, the name of the Amazon S3 object that contains the data, and the version number of the Amazon S3 object that contains the data.",
                  "nested_params": [
                    {
                      "name": "BucketARN",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Resource Name (ARN) of the S3 bucket.",
                      "nested_params": []
                    },
                    {
                      "name": "BasePath",
                      "type": "string",
                      "required": false,
                      "description": "The base path for the S3 bucket.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "CustomArtifactsConfiguration",
              "type": "list",
              "required": false,
              "description": "Custom artifacts are dependency JARs and user-defined functions (UDF).",
              "nested_params": [
                {
                  "name": "ArtifactType",
                  "type": "string",
                  "required": false,
                  "description": "UDF stands for user-defined functions. This type of artifact must be in an S3 bucket. A DEPENDENCY_JAR can be in either Maven or an S3 bucket.",
                  "nested_params": []
                },
                {
                  "name": "S3ContentLocation",
                  "type": "dict",
                  "required": false,
                  "description": "For a Managed Service for Apache Flink application provides a description of an Amazon S3 object, including the Amazon Resource Name (ARN) of the S3 bucket, the name of the Amazon S3 object that contains the data, and the version number of the Amazon S3 object that contains the data.",
                  "nested_params": [
                    {
                      "name": "BucketARN",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Resource Name (ARN) for the S3 bucket containing the application code.",
                      "nested_params": []
                    },
                    {
                      "name": "FileKey",
                      "type": "string",
                      "required": false,
                      "description": "The file key for the object containing the application code.",
                      "nested_params": []
                    },
                    {
                      "name": "ObjectVersion",
                      "type": "string",
                      "required": false,
                      "description": "The version of the object containing the application code.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "MavenReference",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters required to fully specify a Maven reference.",
                  "nested_params": [
                    {
                      "name": "GroupId",
                      "type": "string",
                      "required": false,
                      "description": "The group ID of the Maven reference.",
                      "nested_params": []
                    },
                    {
                      "name": "ArtifactId",
                      "type": "string",
                      "required": false,
                      "description": "The artifact ID of the Maven reference.",
                      "nested_params": []
                    },
                    {
                      "name": "Version",
                      "type": "string",
                      "required": false,
                      "description": "The version of the Maven reference.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "CloudWatchLoggingOptions",
      "type": "list",
      "required": true,
      "description": "Use this parameter to configure an Amazon CloudWatch log stream to monitor application configuration errors. (dict) --- Provides a description of Amazon CloudWatch logging options, including the log stream Amazon Resource Name (ARN). The ARN of the CloudWatch log to receive application messages.",
      "nested_params": [
        {
          "name": "LogStreamARN",
          "type": "string",
          "required": false,
          "description": "The ARN of the CloudWatch log to receive application messages.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Tags",
      "type": "list",
      "required": true,
      "description": "A list of one or more tags to assign to the application. A tag is a key-value pair that identifies an application. Note that the maximum number of application tags includes system tags. The maximum number of user-defined application tags is 50. For more information, see Using Tagging. (dict) --- A key-value pair (the value is optional) that you can define and assign to Amazon resources. If you specify a tag that already exists, the tag value is replaced with the value that you specify in the request. The key of the key-value tag. Value (string) --- The value of the key-value tag. The value is optional.",
      "nested_params": [
        {
          "name": "Key",
          "type": "string",
          "required": false,
          "description": "The key of the key-value tag.",
          "nested_params": []
        },
        {
          "name": "Value",
          "type": "string",
          "required": false,
          "description": "The value of the key-value tag. The value is optional.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ApplicationMode",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ApplicationDetail",
          "type": "dict",
          "description": "In response to your CreateApplication request, Managed Service for Apache Flink returns a response with details of the application it created.",
          "nested_items": [
            {
              "name": "ApplicationARN",
              "type": "string",
              "description": "The ARN of the application.",
              "nested_items": []
            },
            {
              "name": "ApplicationDescription",
              "type": "string",
              "description": "The description of the application.",
              "nested_items": []
            },
            {
              "name": "ApplicationName",
              "type": "string",
              "description": "The name of the application.",
              "nested_items": []
            },
            {
              "name": "RuntimeEnvironment",
              "type": "string",
              "description": "The runtime environment for the application.",
              "nested_items": []
            },
            {
              "name": "ServiceExecutionRole",
              "type": "string",
              "description": "Specifies the IAM role that the application uses to access external resources.",
              "nested_items": []
            },
            {
              "name": "ApplicationStatus",
              "type": "string",
              "description": "The status of the application.",
              "nested_items": []
            },
            {
              "name": "ApplicationVersionId",
              "type": "integer",
              "description": "Provides the current application version. Managed Service for Apache Flink updates the ApplicationVersionId each time you update the application.",
              "nested_items": []
            },
            {
              "name": "CreateTimestamp",
              "type": "datetime",
              "description": "The current timestamp when the application was created.",
              "nested_items": []
            },
            {
              "name": "LastUpdateTimestamp",
              "type": "datetime",
              "description": "The current timestamp when the application was last updated.",
              "nested_items": []
            },
            {
              "name": "ApplicationConfigurationDescription",
              "type": "dict",
              "description": "Describes details about the application code and starting parameters for a Managed Service for Apache Flink application.",
              "nested_items": [
                {
                  "name": "SqlApplicationConfigurationDescription",
                  "type": "dict",
                  "description": "The details about inputs, outputs, and reference data sources for a SQL-based Kinesis Data Analytics application.",
                  "nested_items": [
                    {
                      "name": "InputDescriptions",
                      "type": "list",
                      "description": "The array of  InputDescription objects describing the input streams used by the application.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "InputId",
                              "type": "string",
                              "description": "The input ID that is associated with the application input. This is the ID that Kinesis Data Analytics assigns to each input configuration that you add to your application.",
                              "nested_items": []
                            },
                            {
                              "name": "NamePrefix",
                              "type": "string",
                              "description": "The in-application name prefix.",
                              "nested_items": []
                            },
                            {
                              "name": "InAppStreamNames",
                              "type": "list",
                              "description": "Returns the in-application stream names that are mapped to the stream source.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "string",
                                  "description": "(string) ---",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "InputProcessingConfigurationDescription",
                              "type": "dict",
                              "description": "The description of the preprocessor that executes on records in this input before the application's code is run.",
                              "nested_items": [
                                {
                                  "name": "InputLambdaProcessorDescription",
                                  "type": "dict",
                                  "description": "Provides configuration information about the associated  InputLambdaProcessorDescription.",
                                  "nested_items": [
                                    {
                                      "name": "ResourceARN",
                                      "type": "string",
                                      "description": "The ARN of the Amazon Lambda function that is used to preprocess the records in the stream.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "RoleARN",
                                      "type": "string",
                                      "description": "The ARN of the IAM role that is used to access the Amazon Lambda function.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "KinesisStreamsInputDescription",
                              "type": "dict",
                              "description": "If a Kinesis data stream is configured as a streaming source, provides the Kinesis data stream's Amazon Resource Name (ARN).",
                              "nested_items": [
                                {
                                  "name": "ResourceARN",
                                  "type": "string",
                                  "description": "The Amazon Resource Name (ARN) of the Kinesis data stream.",
                                  "nested_items": []
                                },
                                {
                                  "name": "RoleARN",
                                  "type": "string",
                                  "description": "The ARN of the IAM role that Kinesis Data Analytics can assume to access the stream.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "KinesisFirehoseInputDescription",
                              "type": "dict",
                              "description": "If a Kinesis Data Firehose delivery stream is configured as a streaming source, provides the delivery stream's ARN.",
                              "nested_items": [
                                {
                                  "name": "ResourceARN",
                                  "type": "string",
                                  "description": "The Amazon Resource Name (ARN) of the delivery stream.",
                                  "nested_items": []
                                },
                                {
                                  "name": "RoleARN",
                                  "type": "string",
                                  "description": "The ARN of the IAM role that Kinesis Data Analytics assumes to access the stream.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "InputSchema",
                              "type": "dict",
                              "description": "Describes the format of the data in the streaming source, and how each data element maps to corresponding columns in the in-application stream that is being created.",
                              "nested_items": [
                                {
                                  "name": "RecordFormat",
                                  "type": "dict",
                                  "description": "Specifies the format of the records on the streaming source.",
                                  "nested_items": [
                                    {
                                      "name": "RecordFormatType",
                                      "type": "string",
                                      "description": "The type of record format.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "MappingParameters",
                                      "type": "dict",
                                      "description": "When you configure application input at the time of creating or updating an application, provides additional mapping information specific to the record format (such as JSON, CSV, or record fields delimited by some delimiter) on the streaming source.",
                                      "nested_items": [
                                        {
                                          "name": "JSONMappingParameters",
                                          "type": "dict",
                                          "description": "Provides additional mapping information when JSON is the record format on the streaming source.",
                                          "nested_items": [
                                            {
                                              "name": "RecordRowPath",
                                              "type": "string",
                                              "description": "The path to the top-level parent that contains the records.",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "CSVMappingParameters",
                                          "type": "dict",
                                          "description": "Provides additional mapping information when the record format uses delimiters (for example, CSV).",
                                          "nested_items": [
                                            {
                                              "name": "RecordRowDelimiter",
                                              "type": "string",
                                              "description": "The row delimiter. For example, in a CSV format, --\u0098n' is the typical row delimiter.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "RecordColumnDelimiter",
                                              "type": "string",
                                              "description": "The column delimiter. For example, in a CSV format, a comma (',') is the typical column delimiter.",
                                              "nested_items": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "name": "RecordEncoding",
                                  "type": "string",
                                  "description": "Specifies the encoding of the records in the streaming source. For example, UTF-8.",
                                  "nested_items": []
                                },
                                {
                                  "name": "RecordColumns",
                                  "type": "list",
                                  "description": "A list of RecordColumn objects.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "dict",
                                      "description": "",
                                      "nested_items": [
                                        {
                                          "name": "Name",
                                          "type": "string",
                                          "description": "The name of the column that is created in the in-application input stream or reference table.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "Mapping",
                                          "type": "string",
                                          "description": "A reference to the data element in the streaming input or the reference data source.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "SqlType",
                                          "type": "string",
                                          "description": "The type of column created in the in-application input stream or reference table.",
                                          "nested_items": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "InputParallelism",
                              "type": "dict",
                              "description": "Describes the configured parallelism (number of in-application streams mapped to the streaming source).",
                              "nested_items": [
                                {
                                  "name": "Count",
                                  "type": "integer",
                                  "description": "The number of in-application streams to create.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "InputStartingPositionConfiguration",
                              "type": "dict",
                              "description": "The point at which the application is configured to read from the input stream.",
                              "nested_items": [
                                {
                                  "name": "InputStartingPosition",
                                  "type": "string",
                                  "description": "The starting position on the stream.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "NOW - Start reading just after the most recent record in the stream, and start at the request timestamp that the customer issued.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "TRIM_HORIZON - Start reading at the last untrimmed record in the stream, which is the oldest record available in the stream. This option is not available for an Amazon Kinesis Data Firehose delivery stream.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "LAST_STOPPED_POINT - Resume reading from where the application last stopped reading.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "OutputDescriptions",
                      "type": "list",
                      "description": "The array of  OutputDescription objects describing the destination streams used by the application.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "OutputId",
                              "type": "string",
                              "description": "A unique identifier for the output configuration.",
                              "nested_items": []
                            },
                            {
                              "name": "Name",
                              "type": "string",
                              "description": "The name of the in-application stream that is configured as output.",
                              "nested_items": []
                            },
                            {
                              "name": "KinesisStreamsOutputDescription",
                              "type": "dict",
                              "description": "Describes the Kinesis data stream that is configured as the destination where output is written.",
                              "nested_items": [
                                {
                                  "name": "ResourceARN",
                                  "type": "string",
                                  "description": "The Amazon Resource Name (ARN) of the Kinesis data stream.",
                                  "nested_items": []
                                },
                                {
                                  "name": "RoleARN",
                                  "type": "string",
                                  "description": "The ARN of the IAM role that Kinesis Data Analytics can assume to access the stream.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "KinesisFirehoseOutputDescription",
                              "type": "dict",
                              "description": "Describes the Kinesis Data Firehose delivery stream that is configured as the destination where output is written.",
                              "nested_items": [
                                {
                                  "name": "ResourceARN",
                                  "type": "string",
                                  "description": "The Amazon Resource Name (ARN) of the delivery stream.",
                                  "nested_items": []
                                },
                                {
                                  "name": "RoleARN",
                                  "type": "string",
                                  "description": "The ARN of the IAM role that Kinesis Data Analytics can assume to access the stream.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "LambdaOutputDescription",
                              "type": "dict",
                              "description": "Describes the Lambda function that is configured as the destination where output is written.",
                              "nested_items": [
                                {
                                  "name": "ResourceARN",
                                  "type": "string",
                                  "description": "The Amazon Resource Name (ARN) of the destination Lambda function.",
                                  "nested_items": []
                                },
                                {
                                  "name": "RoleARN",
                                  "type": "string",
                                  "description": "The ARN of the IAM role that Kinesis Data Analytics can assume to write to the destination function.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "DestinationSchema",
                              "type": "dict",
                              "description": "The data format used for writing data to the destination.",
                              "nested_items": [
                                {
                                  "name": "RecordFormatType",
                                  "type": "string",
                                  "description": "Specifies the format of the records on the output stream.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "ReferenceDataSourceDescriptions",
                      "type": "list",
                      "description": "The array of  ReferenceDataSourceDescription objects describing the reference data sources used by the application.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "ReferenceId",
                              "type": "string",
                              "description": "The ID of the reference data source. This is the ID that Kinesis Data Analytics assigns when you add the reference data source to your application using the  CreateApplication or  UpdateApplication operation.",
                              "nested_items": []
                            },
                            {
                              "name": "TableName",
                              "type": "string",
                              "description": "The in-application table name created by the specific reference data source configuration.",
                              "nested_items": []
                            },
                            {
                              "name": "S3ReferenceDataSourceDescription",
                              "type": "dict",
                              "description": "Provides the Amazon S3 bucket name, the object key name that contains the reference data.",
                              "nested_items": [
                                {
                                  "name": "BucketARN",
                                  "type": "string",
                                  "description": "The Amazon Resource Name (ARN) of the S3 bucket.",
                                  "nested_items": []
                                },
                                {
                                  "name": "FileKey",
                                  "type": "string",
                                  "description": "Amazon S3 object key name.",
                                  "nested_items": []
                                },
                                {
                                  "name": "ReferenceRoleARN",
                                  "type": "string",
                                  "description": "The ARN of the IAM role that Kinesis Data Analytics can assume to read the Amazon S3 object on your behalf to populate the in-application reference table.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "ReferenceSchema",
                              "type": "dict",
                              "description": "Describes the format of the data in the streaming source, and how each data element maps to corresponding columns created in the in-application stream.",
                              "nested_items": [
                                {
                                  "name": "RecordFormat",
                                  "type": "dict",
                                  "description": "Specifies the format of the records on the streaming source.",
                                  "nested_items": [
                                    {
                                      "name": "RecordFormatType",
                                      "type": "string",
                                      "description": "The type of record format.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "MappingParameters",
                                      "type": "dict",
                                      "description": "When you configure application input at the time of creating or updating an application, provides additional mapping information specific to the record format (such as JSON, CSV, or record fields delimited by some delimiter) on the streaming source.",
                                      "nested_items": [
                                        {
                                          "name": "JSONMappingParameters",
                                          "type": "dict",
                                          "description": "Provides additional mapping information when JSON is the record format on the streaming source.",
                                          "nested_items": [
                                            {
                                              "name": "RecordRowPath",
                                              "type": "string",
                                              "description": "The path to the top-level parent that contains the records.",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "CSVMappingParameters",
                                          "type": "dict",
                                          "description": "Provides additional mapping information when the record format uses delimiters (for example, CSV).",
                                          "nested_items": [
                                            {
                                              "name": "RecordRowDelimiter",
                                              "type": "string",
                                              "description": "The row delimiter. For example, in a CSV format, --\u0098n' is the typical row delimiter.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "RecordColumnDelimiter",
                                              "type": "string",
                                              "description": "The column delimiter. For example, in a CSV format, a comma (',') is the typical column delimiter.",
                                              "nested_items": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "name": "RecordEncoding",
                                  "type": "string",
                                  "description": "Specifies the encoding of the records in the streaming source. For example, UTF-8.",
                                  "nested_items": []
                                },
                                {
                                  "name": "RecordColumns",
                                  "type": "list",
                                  "description": "A list of RecordColumn objects.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "dict",
                                      "description": "",
                                      "nested_items": [
                                        {
                                          "name": "Name",
                                          "type": "string",
                                          "description": "The name of the column that is created in the in-application input stream or reference table.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "Mapping",
                                          "type": "string",
                                          "description": "A reference to the data element in the streaming input or the reference data source.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "SqlType",
                                          "type": "string",
                                          "description": "The type of column created in the in-application input stream or reference table.",
                                          "nested_items": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "ApplicationCodeConfigurationDescription",
                  "type": "dict",
                  "description": "The details about the application code for a Managed Service for Apache Flink application.",
                  "nested_items": [
                    {
                      "name": "CodeContentType",
                      "type": "string",
                      "description": "Specifies whether the code content is in text or zip format.",
                      "nested_items": []
                    },
                    {
                      "name": "CodeContentDescription",
                      "type": "dict",
                      "description": "Describes details about the location and format of the application code.",
                      "nested_items": [
                        {
                          "name": "TextContent",
                          "type": "string",
                          "description": "The text-format code.",
                          "nested_items": []
                        },
                        {
                          "name": "CodeMD5",
                          "type": "string",
                          "description": "The checksum that can be used to validate zip-format code.",
                          "nested_items": []
                        },
                        {
                          "name": "CodeSize",
                          "type": "integer",
                          "description": "The size in bytes of the application code. Can be used to validate zip-format code.",
                          "nested_items": []
                        },
                        {
                          "name": "S3ApplicationCodeLocationDescription",
                          "type": "dict",
                          "description": "The S3 bucket Amazon Resource Name (ARN), file key, and object version of the application code stored in Amazon S3.",
                          "nested_items": [
                            {
                              "name": "BucketARN",
                              "type": "string",
                              "description": "The Amazon Resource Name (ARN) for the S3 bucket containing the application code.",
                              "nested_items": []
                            },
                            {
                              "name": "FileKey",
                              "type": "string",
                              "description": "The file key for the object containing the application code.",
                              "nested_items": []
                            },
                            {
                              "name": "ObjectVersion",
                              "type": "string",
                              "description": "The version of the object containing the application code.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "RunConfigurationDescription",
                  "type": "dict",
                  "description": "The details about the starting properties for a Managed Service for Apache Flink application.",
                  "nested_items": [
                    {
                      "name": "ApplicationRestoreConfigurationDescription",
                      "type": "dict",
                      "description": "Describes the restore behavior of a restarting application.",
                      "nested_items": [
                        {
                          "name": "ApplicationRestoreType",
                          "type": "string",
                          "description": "Specifies how the application should be restored.",
                          "nested_items": []
                        },
                        {
                          "name": "SnapshotName",
                          "type": "string",
                          "description": "The identifier of an existing snapshot of application state to use to restart an application. The application uses this value if RESTORE_FROM_CUSTOM_SNAPSHOT is specified for the ApplicationRestoreType.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "FlinkRunConfigurationDescription",
                      "type": "dict",
                      "description": "Describes the starting parameters for a Managed Service for Apache Flink application.",
                      "nested_items": [
                        {
                          "name": "AllowNonRestoredState",
                          "type": "boolean",
                          "description": "When restoring from a snapshot, specifies whether the runtime is allowed to skip a state that cannot be mapped to the new program. This will happen if the program is updated between snapshots to remove stateful parameters, and state data in the snapshot no longer corresponds to valid application data. For more information, see Allowing Non-Restored State in the Apache Flink documentation.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "FlinkApplicationConfigurationDescription",
                  "type": "dict",
                  "description": "The details about a Managed Service for Apache Flink application.",
                  "nested_items": [
                    {
                      "name": "CheckpointConfigurationDescription",
                      "type": "dict",
                      "description": "Describes an application's checkpointing configuration. Checkpointing is the process of persisting application state for fault tolerance.",
                      "nested_items": [
                        {
                          "name": "ConfigurationType",
                          "type": "string",
                          "description": "Describes whether the application uses the default checkpointing behavior in Managed Service for Apache Flink.",
                          "nested_items": []
                        },
                        {
                          "name": "CheckpointingEnabled",
                          "type": "boolean",
                          "description": "Describes whether checkpointing is enabled for a Managed Service for Apache Flink application.",
                          "nested_items": []
                        },
                        {
                          "name": "CheckpointInterval",
                          "type": "integer",
                          "description": "Describes the interval in milliseconds between checkpoint operations.",
                          "nested_items": []
                        },
                        {
                          "name": "MinPauseBetweenCheckpoints",
                          "type": "integer",
                          "description": "Describes the minimum time in milliseconds after a checkpoint operation completes that a new checkpoint operation can start.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "MonitoringConfigurationDescription",
                      "type": "dict",
                      "description": "Describes configuration parameters for Amazon CloudWatch logging for an application.",
                      "nested_items": [
                        {
                          "name": "ConfigurationType",
                          "type": "string",
                          "description": "Describes whether to use the default CloudWatch logging configuration for an application.",
                          "nested_items": []
                        },
                        {
                          "name": "MetricsLevel",
                          "type": "string",
                          "description": "Describes the granularity of the CloudWatch Logs for an application.",
                          "nested_items": []
                        },
                        {
                          "name": "LogLevel",
                          "type": "string",
                          "description": "Describes the verbosity of the CloudWatch Logs for an application.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "ParallelismConfigurationDescription",
                      "type": "dict",
                      "description": "Describes parameters for how an application executes multiple tasks simultaneously.",
                      "nested_items": [
                        {
                          "name": "ConfigurationType",
                          "type": "string",
                          "description": "Describes whether the application uses the default parallelism for the Managed Service for Apache Flink service.",
                          "nested_items": []
                        },
                        {
                          "name": "Parallelism",
                          "type": "integer",
                          "description": "Describes the initial number of parallel tasks that a Managed Service for Apache Flink application can perform. If AutoScalingEnabled is set to True, then Managed Service for Apache Flink can increase the CurrentParallelism value in response to application load. The service can increase CurrentParallelism up to the maximum parallelism, which is ParalellismPerKPU times the maximum KPUs for the application. The maximum KPUs for an application is 32 by default, and can be increased by requesting a limit increase. If application load is reduced, the service can reduce the CurrentParallelism value down to the Parallelism setting.",
                          "nested_items": []
                        },
                        {
                          "name": "ParallelismPerKPU",
                          "type": "integer",
                          "description": "Describes the number of parallel tasks that a Managed Service for Apache Flink application can perform per Kinesis Processing Unit (KPU) used by the application.",
                          "nested_items": []
                        },
                        {
                          "name": "CurrentParallelism",
                          "type": "integer",
                          "description": "Describes the current number of parallel tasks that a Managed Service for Apache Flink application can perform. If AutoScalingEnabled is set to True, Managed Service for Apache Flink can increase this value in response to application load. The service can increase this value up to the maximum parallelism, which is ParalellismPerKPU times the maximum KPUs for the application. The maximum KPUs for an application is 32 by default, and can be increased by requesting a limit increase. If application load is reduced, the service can reduce the CurrentParallelism value down to the Parallelism setting.",
                          "nested_items": []
                        },
                        {
                          "name": "AutoScalingEnabled",
                          "type": "boolean",
                          "description": "Describes whether the Managed Service for Apache Flink service can increase the parallelism of the application in response to increased throughput.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "JobPlanDescription",
                      "type": "string",
                      "description": "The job plan for an application. For more information about the job plan, see Jobs and Scheduling in the Apache Flink Documentation. To retrieve the job plan for the application, use the  DescribeApplicationRequest$IncludeAdditionalDetails parameter of the  DescribeApplication operation.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "EnvironmentPropertyDescriptions",
                  "type": "dict",
                  "description": "Describes execution properties for a Managed Service for Apache Flink application.",
                  "nested_items": [
                    {
                      "name": "PropertyGroupDescriptions",
                      "type": "list",
                      "description": "Describes the execution property groups.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "PropertyGroupId",
                              "type": "string",
                              "description": "Describes the key of an application execution property key-value pair.",
                              "nested_items": []
                            },
                            {
                              "name": "PropertyMap",
                              "type": "dict",
                              "description": "Describes the value of an application execution property key-value pair.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "string",
                                  "description": "(string) ---",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "string",
                                      "description": "(string) ---",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "ApplicationSnapshotConfigurationDescription",
                  "type": "dict",
                  "description": "Describes whether snapshots are enabled for a Managed Service for Apache Flink application.",
                  "nested_items": [
                    {
                      "name": "SnapshotsEnabled",
                      "type": "boolean",
                      "description": "Describes whether snapshots are enabled for a Managed Service for Apache Flink application.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "ApplicationSystemRollbackConfigurationDescription",
                  "type": "dict",
                  "description": "Describes whether system rollbacks are enabled for a Managed Service for Apache Flink application.",
                  "nested_items": [
                    {
                      "name": "RollbackEnabled",
                      "type": "boolean",
                      "description": "",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "VpcConfigurationDescriptions",
                  "type": "list",
                  "description": "The array of descriptions of VPC configurations available to the application.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "VpcConfigurationId",
                          "type": "string",
                          "description": "The ID of the VPC configuration.",
                          "nested_items": []
                        },
                        {
                          "name": "VpcId",
                          "type": "string",
                          "description": "The ID of the associated VPC.",
                          "nested_items": []
                        },
                        {
                          "name": "SubnetIds",
                          "type": "list",
                          "description": "The array of Subnet IDs used by the VPC configuration.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "SecurityGroupIds",
                          "type": "list",
                          "description": "The array of SecurityGroup IDs used by the VPC configuration.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "ZeppelinApplicationConfigurationDescription",
                  "type": "dict",
                  "description": "The configuration parameters for a Managed Service for Apache Flink Studio notebook.",
                  "nested_items": [
                    {
                      "name": "MonitoringConfigurationDescription",
                      "type": "dict",
                      "description": "The monitoring configuration of a Managed Service for Apache Flink Studio notebook.",
                      "nested_items": [
                        {
                          "name": "LogLevel",
                          "type": "string",
                          "description": "Describes the verbosity of the CloudWatch Logs for an application.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "CatalogConfigurationDescription",
                      "type": "dict",
                      "description": "The Amazon Glue Data Catalog that is associated with the Managed Service for Apache Flink Studio notebook.",
                      "nested_items": [
                        {
                          "name": "GlueDataCatalogConfigurationDescription",
                          "type": "dict",
                          "description": "The configuration parameters for the default Amazon Glue database. You use this database for SQL queries that you write in a Managed Service for Apache Flink Studio notebook.",
                          "nested_items": [
                            {
                              "name": "DatabaseARN",
                              "type": "string",
                              "description": "The Amazon Resource Name (ARN) of the database.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "DeployAsApplicationConfigurationDescription",
                      "type": "dict",
                      "description": "The parameters required to deploy a Managed Service for Apache Flink Studio notebook as an application with durable state.",
                      "nested_items": [
                        {
                          "name": "S3ContentLocationDescription",
                          "type": "dict",
                          "description": "The location that holds the data required to specify an Amazon Data Analytics application.",
                          "nested_items": [
                            {
                              "name": "BucketARN",
                              "type": "string",
                              "description": "The Amazon Resource Name (ARN) of the S3 bucket.",
                              "nested_items": []
                            },
                            {
                              "name": "BasePath",
                              "type": "string",
                              "description": "The base path for the S3 bucket.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "CustomArtifactsConfigurationDescription",
                      "type": "list",
                      "description": "Custom artifacts are dependency JARs and user-defined functions (UDF).",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "ArtifactType",
                              "type": "string",
                              "description": "UDF stands for user-defined functions. This type of artifact must be in an S3 bucket. A DEPENDENCY_JAR can be in either Maven or an S3 bucket.",
                              "nested_items": []
                            },
                            {
                              "name": "S3ContentLocationDescription",
                              "type": "dict",
                              "description": "For a Managed Service for Apache Flink application provides a description of an Amazon S3 object, including the Amazon Resource Name (ARN) of the S3 bucket, the name of the Amazon S3 object that contains the data, and the version number of the Amazon S3 object that contains the data.",
                              "nested_items": [
                                {
                                  "name": "BucketARN",
                                  "type": "string",
                                  "description": "The Amazon Resource Name (ARN) for the S3 bucket containing the application code.",
                                  "nested_items": []
                                },
                                {
                                  "name": "FileKey",
                                  "type": "string",
                                  "description": "The file key for the object containing the application code.",
                                  "nested_items": []
                                },
                                {
                                  "name": "ObjectVersion",
                                  "type": "string",
                                  "description": "The version of the object containing the application code.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "MavenReferenceDescription",
                              "type": "dict",
                              "description": "The parameters that are required to specify a Maven dependency.",
                              "nested_items": [
                                {
                                  "name": "GroupId",
                                  "type": "string",
                                  "description": "The group ID of the Maven reference.",
                                  "nested_items": []
                                },
                                {
                                  "name": "ArtifactId",
                                  "type": "string",
                                  "description": "The artifact ID of the Maven reference.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Version",
                                  "type": "string",
                                  "description": "The version of the Maven reference.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "CloudWatchLoggingOptionDescriptions",
              "type": "list",
              "description": "Describes the application Amazon CloudWatch logging options.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "CloudWatchLoggingOptionId",
                      "type": "string",
                      "description": "The ID of the CloudWatch logging option description.",
                      "nested_items": []
                    },
                    {
                      "name": "LogStreamARN",
                      "type": "string",
                      "description": "The Amazon Resource Name (ARN) of the CloudWatch log to receive application messages.",
                      "nested_items": []
                    },
                    {
                      "name": "RoleARN",
                      "type": "string",
                      "description": "The IAM ARN of the role to use to send application messages.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "ApplicationMaintenanceConfigurationDescription",
              "type": "dict",
              "description": "The details of the maintenance configuration for the application.",
              "nested_items": [
                {
                  "name": "ApplicationMaintenanceWindowStartTime",
                  "type": "string",
                  "description": "The start time for the maintenance window.",
                  "nested_items": []
                },
                {
                  "name": "ApplicationMaintenanceWindowEndTime",
                  "type": "string",
                  "description": "The end time for the maintenance window.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "ApplicationVersionUpdatedFrom",
              "type": "integer",
              "description": "The previous application version before the latest application update.  RollbackApplication reverts the application to this version.",
              "nested_items": []
            },
            {
              "name": "ApplicationVersionRolledBackFrom",
              "type": "integer",
              "description": "If you reverted the application using  RollbackApplication, the application version when RollbackApplication was called.",
              "nested_items": []
            },
            {
              "name": "ApplicationVersionCreateTimestamp",
              "type": "datetime",
              "description": "",
              "nested_items": []
            },
            {
              "name": "ConditionalToken",
              "type": "string",
              "description": "A value you use to implement strong concurrency for application updates.",
              "nested_items": []
            },
            {
              "name": "ApplicationVersionRolledBackTo",
              "type": "integer",
              "description": "The version to which you want to roll back the application.",
              "nested_items": []
            },
            {
              "name": "ApplicationMode",
              "type": "string",
              "description": "To create a Managed Service for Apache Flink Studio notebook, you must set the mode to INTERACTIVE. However, for a Managed Service for Apache Flink application, the mode is optional.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}