{
  "method_name": "update_application",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/kinesisanalyticsv2/client/update_application.html",
  "description": "Updates an existing Managed Service for Apache Flink application. Using this operation, you can update application code, input configuration, and output configuration. Managed Service for Apache Flink updates the ApplicationVersionId each time you update your application.",
  "parameters": [
    {
      "name": "ApplicationName",
      "type": "string",
      "required": true,
      "description": "The name of the application to update.",
      "nested_params": []
    },
    {
      "name": "CurrentApplicationVersionId",
      "type": "integer",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "ApplicationConfigurationUpdate",
      "type": "dict",
      "required": true,
      "description": "Describes application configuration updates. SqlApplicationConfigurationUpdate (dict) --- Describes updates to a SQL-based Kinesis Data Analytics application's configuration. InputUpdates (list) --- The array of  InputUpdate objects describing the new input streams used by the application. (dict) --- For a SQL-based Kinesis Data Analytics application, describes updates to a specific input configuration (identified by the InputId of an application). The input ID of the application input to be updated. NamePrefixUpdate (string) --- The name prefix for in-application streams that Kinesis Data Analytics creates for the specific streaming source. InputProcessingConfigurationUpdate (dict) --- Describes updates to an  InputProcessingConfiguration. Provides update information for an  InputLambdaProcessor. The Amazon Resource Name (ARN) of the new Amazon Lambda function that is used to preprocess the records in the stream. KinesisStreamsInputUpdate (dict) --- If a Kinesis data stream is the streaming source to be updated, provides an updated stream Amazon Resource Name (ARN). The Amazon Resource Name (ARN) of the input Kinesis data stream to read. KinesisFirehoseInputUpdate (dict) --- If a Kinesis Data Firehose delivery stream is the streaming source to be updated, provides an updated stream ARN. The Amazon Resource Name (ARN) of the input delivery stream to read. InputSchemaUpdate (dict) --- Describes the data format on the streaming source, and how record elements on the streaming source map to columns of the in-application stream that is created. RecordFormatUpdate (dict) --- Specifies the format of the records on the streaming source. The type of record format. MappingParameters (dict) --- When you configure application input at the time of creating or updating an application, provides additional mapping information specific to the record format (such as JSON, CSV, or record fields delimited by some delimiter) on the streaming source. JSONMappingParameters (dict) --- Provides additional mapping information when JSON is the record format on the streaming source. The path to the top-level parent that contains the records. CSVMappingParameters (dict) --- Provides additional mapping information when the record format uses delimiters (for example, CSV). The row delimiter. For example, in a CSV format, --\u0098n' is the typical row delimiter. The column delimiter. For example, in a CSV format, a comma (',') is the typical column delimiter. RecordEncodingUpdate (string) --- Specifies the encoding of the records in the streaming source; for example, UTF-8. RecordColumnUpdates (list) --- A list of RecordColumn objects. Each object describes the mapping of the streaming source element to the corresponding column in the in-application stream. (dict) --- For a SQL-based Kinesis Data Analytics application, describes the mapping of each data element in the streaming source to the corresponding column in the in-application stream. Also used to describe the format of the reference data source. The name of the column that is created in the in-application input stream or reference table. Mapping (string) --- A reference to the data element in the streaming input or the reference data source. The type of column created in the in-application input stream or reference table. InputParallelismUpdate (dict) --- Describes the parallelism updates (the number of in-application streams Kinesis Data Analytics creates for the specific streaming source). The number of in-application streams to create for the specified streaming source. OutputUpdates (list) --- The array of  OutputUpdate objects describing the new destination streams used by the application. (dict) --- For a SQL-based Kinesis Data Analytics application, describes updates to the output configuration identified by the OutputId. Identifies the specific output configuration that you want to update. NameUpdate (string) --- If you want to specify a different in-application stream for this output configuration, use this field to specify the new in-application stream name. KinesisStreamsOutputUpdate (dict) --- Describes a Kinesis data stream as the destination for the output. The Amazon Resource Name (ARN) of the Kinesis data stream where you want to write the output. KinesisFirehoseOutputUpdate (dict) --- Describes a Kinesis Data Firehose delivery stream as the destination for the output. The Amazon Resource Name (ARN) of the delivery stream to write to. LambdaOutputUpdate (dict) --- Describes an Amazon Lambda function as the destination for the output. The Amazon Resource Name (ARN) of the destination Amazon Lambda function. DestinationSchemaUpdate (dict) --- Describes the data format when records are written to the destination. Specifies the format of the records on the output stream. ReferenceDataSourceUpdates (list) --- The array of  ReferenceDataSourceUpdate objects describing the new reference data sources used by the application. (dict) --- When you update a reference data source configuration for a SQL-based Kinesis Data Analytics application, this object provides all the updated values (such as the source bucket name and object key name), the in-application table name that is created, and updated mapping information that maps the data in the Amazon S3 object to the in-application reference table that is created. The ID of the reference data source that is being updated. You can use the  DescribeApplication operation to get this value. TableNameUpdate (string) --- The in-application table name that is created by this update. S3ReferenceDataSourceUpdate (dict) --- Describes the S3 bucket name, object key name, and IAM role that Kinesis Data Analytics can assume to read the Amazon S3 object on your behalf and populate the in-application reference table. BucketARNUpdate (string) --- The Amazon Resource Name (ARN) of the S3 bucket. FileKeyUpdate (string) --- The object key name. ReferenceSchemaUpdate (dict) --- Describes the format of the data in the streaming source, and how each data element maps to corresponding columns created in the in-application stream. Specifies the format of the records on the streaming source. RecordEncoding (string) --- Specifies the encoding of the records in the streaming source. For example, UTF-8. A list of RecordColumn objects. ApplicationCodeConfigurationUpdate (dict) --- Describes updates to an application's code configuration. CodeContentTypeUpdate (string) --- Describes updates to the code content type. CodeContentUpdate (dict) --- Describes updates to the code content of an application. TextContentUpdate (string) --- Describes an update to the text code for an application. ZipFileContentUpdate (bytes) --- Describes an update to the zipped code for an application. S3ContentLocationUpdate (dict) --- Describes an update to the location of code for an application. BucketARNUpdate (string) --- The new Amazon Resource Name (ARN) for the S3 bucket containing the application code. FileKeyUpdate (string) --- The new file key for the object containing the application code. ObjectVersionUpdate (string) --- The new version of the object containing the application code. FlinkApplicationConfigurationUpdate (dict) --- Describes updates to a Managed Service for Apache Flink application's configuration. CheckpointConfigurationUpdate (dict) --- Describes updates to an application's checkpointing configuration. Checkpointing is the process of persisting application state for fault tolerance. ConfigurationTypeUpdate (string) --- Describes updates to whether the application uses the default checkpointing behavior of Managed Service for Apache Flink. You must set this property to CUSTOM in order to set the CheckpointingEnabled, CheckpointInterval, or MinPauseBetweenCheckpoints parameters. CheckpointingEnabledUpdate (boolean) --- Describes updates to whether checkpointing is enabled for an application. CheckpointIntervalUpdate (integer) --- Describes updates to the interval in milliseconds between checkpoint operations. MinPauseBetweenCheckpointsUpdate (integer) --- Describes updates to the minimum time in milliseconds after a checkpoint operation completes that a new checkpoint operation can start. MonitoringConfigurationUpdate (dict) --- Describes updates to the configuration parameters for Amazon CloudWatch logging for an application. ConfigurationTypeUpdate (string) --- Describes updates to whether to use the default CloudWatch logging configuration for an application. You must set this property to CUSTOM in order to set the LogLevel or MetricsLevel parameters. MetricsLevelUpdate (string) --- Describes updates to the granularity of the CloudWatch Logs for an application. The Parallelism level is not recommended for applications with a Parallelism over 64 due to excessive costs. LogLevelUpdate (string) --- Describes updates to the verbosity of the CloudWatch Logs for an application. ParallelismConfigurationUpdate (dict) --- Describes updates to the parameters for how an application executes multiple tasks simultaneously. ConfigurationTypeUpdate (string) --- Describes updates to whether the application uses the default parallelism for the Managed Service for Apache Flink service, or if a custom parallelism is used. You must set this property to CUSTOM in order to change your application's AutoScalingEnabled, Parallelism, or ParallelismPerKPU properties. ParallelismUpdate (integer) --- Describes updates to the initial number of parallel tasks an application can perform. If AutoScalingEnabled is set to True, then Managed Service for Apache Flink can increase the CurrentParallelism value in response to application load. The service can increase CurrentParallelism up to the maximum parallelism, which is ParalellismPerKPU times the maximum KPUs for the application. The maximum KPUs for an application is 32 by default, and can be increased by requesting a limit increase. If application load is reduced, the service will reduce CurrentParallelism down to the Parallelism setting. ParallelismPerKPUUpdate (integer) --- Describes updates to the number of parallel tasks an application can perform per Kinesis Processing Unit (KPU) used by the application. AutoScalingEnabledUpdate (boolean) --- Describes updates to whether the Managed Service for Apache Flink service can increase the parallelism of a Managed Service for Apache Flink application in response to increased throughput. EnvironmentPropertyUpdates (dict) --- Describes updates to the environment properties for a Managed Service for Apache Flink application. Describes updates to the execution property groups. (dict) --- Property key-value pairs passed into an application. Describes the key of an application execution property key-value pair. Describes the value of an application execution property key-value pair. (string) --- (string) --- ApplicationSnapshotConfigurationUpdate (dict) --- Describes whether snapshots are enabled for a Managed Service for Apache Flink application. Describes updates to whether snapshots are enabled for an application. ApplicationSystemRollbackConfigurationUpdate (dict) --- Describes system rollback configuration for a Managed Service for Apache Flink application VpcConfigurationUpdates (list) --- Updates to the array of descriptions of VPC configurations available to the application. (dict) --- Describes updates to the VPC configuration used by the application. Describes an update to the ID of the VPC configuration. SubnetIdUpdates (list) --- Describes updates to the array of Subnet IDs used by the VPC configuration. (string) --- SecurityGroupIdUpdates (list) --- Describes updates to the array of SecurityGroup IDs used by the VPC configuration. (string) --- ZeppelinApplicationConfigurationUpdate (dict) --- Updates to the configuration of a Managed Service for Apache Flink Studio notebook. MonitoringConfigurationUpdate (dict) --- Updates to the monitoring configuration of a Managed Service for Apache Flink Studio notebook. Updates to the logging level for Apache Zeppelin within a Managed Service for Apache Flink Studio notebook. CatalogConfigurationUpdate (dict) --- Updates to the configuration of the Amazon Glue Data Catalog that is associated with the Managed Service for Apache Flink Studio notebook. Updates to the configuration parameters for the default Amazon Glue database. You use this database for SQL queries that you write in a Managed Service for Apache Flink Studio notebook. The updated Amazon Resource Name (ARN) of the database. DeployAsApplicationConfigurationUpdate (dict) --- Updates to the configuration information required to deploy an Amazon Data Analytics Studio notebook as an application with durable state. S3ContentLocationUpdate (dict) --- Updates to the location that holds the data required to specify an Amazon Data Analytics application. BucketARNUpdate (string) --- The updated Amazon Resource Name (ARN) of the S3 bucket. BasePathUpdate (string) --- The updated S3 bucket path. CustomArtifactsConfigurationUpdate (list) --- Updates to the customer artifacts. Custom artifacts are dependency JAR files and user-defined functions (UDF). (dict) --- Specifies dependency JARs, as well as JAR files that contain user-defined functions (UDF). UDF stands for user-defined functions. This type of artifact must be in an S3 bucket. A DEPENDENCY_JAR can be in either Maven or an S3 bucket. S3ContentLocation (dict) --- For a Managed Service for Apache Flink application provides a description of an Amazon S3 object, including the Amazon Resource Name (ARN) of the S3 bucket, the name of the Amazon S3 object that contains the data, and the version number of the Amazon S3 object that contains the data. The Amazon Resource Name (ARN) for the S3 bucket containing the application code. The file key for the object containing the application code. ObjectVersion (string) --- The version of the object containing the application code. MavenReference (dict) --- The parameters required to fully specify a Maven reference. The group ID of the Maven reference. The artifact ID of the Maven reference. The version of the Maven reference.",
      "nested_params": [
        {
          "name": "SqlApplicationConfigurationUpdate",
          "type": "dict",
          "required": false,
          "description": "Describes updates to a SQL-based Kinesis Data Analytics application's configuration.",
          "nested_params": [
            {
              "name": "InputUpdates",
              "type": "list",
              "required": false,
              "description": "The array of  InputUpdate objects describing the new input streams used by the application.",
              "nested_params": [
                {
                  "name": "InputId",
                  "type": "string",
                  "required": false,
                  "description": "The input ID of the application input to be updated.",
                  "nested_params": []
                },
                {
                  "name": "NamePrefixUpdate",
                  "type": "string",
                  "required": false,
                  "description": "The name prefix for in-application streams that Kinesis Data Analytics creates for the specific streaming source.",
                  "nested_params": []
                },
                {
                  "name": "InputProcessingConfigurationUpdate",
                  "type": "dict",
                  "required": false,
                  "description": "Describes updates to an  InputProcessingConfiguration.",
                  "nested_params": [
                    {
                      "name": "InputLambdaProcessorUpdate",
                      "type": "dict",
                      "required": false,
                      "description": "Provides update information for an  InputLambdaProcessor.",
                      "nested_params": [
                        {
                          "name": "ResourceARNUpdate",
                          "type": "string",
                          "required": false,
                          "description": "The Amazon Resource Name (ARN) of the new Amazon Lambda function that is used to preprocess the records in the stream.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "KinesisStreamsInputUpdate",
                  "type": "dict",
                  "required": false,
                  "description": "If a Kinesis data stream is the streaming source to be updated, provides an updated stream Amazon Resource Name (ARN).",
                  "nested_params": [
                    {
                      "name": "ResourceARNUpdate",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Resource Name (ARN) of the input Kinesis data stream to read.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "KinesisFirehoseInputUpdate",
                  "type": "dict",
                  "required": false,
                  "description": "If a Kinesis Data Firehose delivery stream is the streaming source to be updated, provides an updated stream ARN.",
                  "nested_params": [
                    {
                      "name": "ResourceARNUpdate",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Resource Name (ARN) of the input delivery stream to read.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "InputSchemaUpdate",
                  "type": "dict",
                  "required": false,
                  "description": "Describes the data format on the streaming source, and how record elements on the streaming source map to columns of the in-application stream that is created.",
                  "nested_params": [
                    {
                      "name": "RecordFormatUpdate",
                      "type": "dict",
                      "required": false,
                      "description": "Specifies the format of the records on the streaming source.",
                      "nested_params": [
                        {
                          "name": "RecordFormatType",
                          "type": "string",
                          "required": false,
                          "description": "The type of record format.",
                          "nested_params": []
                        },
                        {
                          "name": "MappingParameters",
                          "type": "dict",
                          "required": false,
                          "description": "When you configure application input at the time of creating or updating an application, provides additional mapping information specific to the record format (such as JSON, CSV, or record fields delimited by some delimiter) on the streaming source.",
                          "nested_params": [
                            {
                              "name": "JSONMappingParameters",
                              "type": "dict",
                              "required": false,
                              "description": "Provides additional mapping information when JSON is the record format on the streaming source.",
                              "nested_params": [
                                {
                                  "name": "RecordRowPath",
                                  "type": "string",
                                  "required": false,
                                  "description": "The path to the top-level parent that contains the records.",
                                  "nested_params": []
                                }
                              ]
                            },
                            {
                              "name": "CSVMappingParameters",
                              "type": "dict",
                              "required": false,
                              "description": "Provides additional mapping information when the record format uses delimiters (for example, CSV).",
                              "nested_params": [
                                {
                                  "name": "RecordRowDelimiter",
                                  "type": "string",
                                  "required": false,
                                  "description": "The row delimiter. For example, in a CSV format, --\u0098n' is the typical row delimiter.",
                                  "nested_params": []
                                },
                                {
                                  "name": "RecordColumnDelimiter",
                                  "type": "string",
                                  "required": false,
                                  "description": "The column delimiter. For example, in a CSV format, a comma (',') is the typical column delimiter.",
                                  "nested_params": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "RecordEncodingUpdate",
                      "type": "string",
                      "required": false,
                      "description": "Specifies the encoding of the records in the streaming source; for example, UTF-8.",
                      "nested_params": []
                    },
                    {
                      "name": "RecordColumnUpdates",
                      "type": "list",
                      "required": false,
                      "description": "A list of RecordColumn objects. Each object describes the mapping of the streaming source element to the corresponding column in the in-application stream.",
                      "nested_params": [
                        {
                          "name": "Name",
                          "type": "string",
                          "required": false,
                          "description": "The name of the column that is created in the in-application input stream or reference table.",
                          "nested_params": []
                        },
                        {
                          "name": "Mapping",
                          "type": "string",
                          "required": false,
                          "description": "A reference to the data element in the streaming input or the reference data source.",
                          "nested_params": []
                        },
                        {
                          "name": "SqlType",
                          "type": "string",
                          "required": false,
                          "description": "The type of column created in the in-application input stream or reference table.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "InputParallelismUpdate",
                  "type": "dict",
                  "required": false,
                  "description": "Describes the parallelism updates (the number of in-application streams Kinesis Data Analytics creates for the specific streaming source).",
                  "nested_params": [
                    {
                      "name": "CountUpdate",
                      "type": "integer",
                      "required": false,
                      "description": "The number of in-application streams to create for the specified streaming source.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "OutputUpdates",
              "type": "list",
              "required": false,
              "description": "The array of  OutputUpdate objects describing the new destination streams used by the application.",
              "nested_params": [
                {
                  "name": "OutputId",
                  "type": "string",
                  "required": false,
                  "description": "Identifies the specific output configuration that you want to update.",
                  "nested_params": []
                },
                {
                  "name": "NameUpdate",
                  "type": "string",
                  "required": false,
                  "description": "If you want to specify a different in-application stream for this output configuration, use this field to specify the new in-application stream name.",
                  "nested_params": []
                },
                {
                  "name": "KinesisStreamsOutputUpdate",
                  "type": "dict",
                  "required": false,
                  "description": "Describes a Kinesis data stream as the destination for the output.",
                  "nested_params": [
                    {
                      "name": "ResourceARNUpdate",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Resource Name (ARN) of the Kinesis data stream where you want to write the output.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "KinesisFirehoseOutputUpdate",
                  "type": "dict",
                  "required": false,
                  "description": "Describes a Kinesis Data Firehose delivery stream as the destination for the output.",
                  "nested_params": [
                    {
                      "name": "ResourceARNUpdate",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Resource Name (ARN) of the delivery stream to write to.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "LambdaOutputUpdate",
                  "type": "dict",
                  "required": false,
                  "description": "Describes an Amazon Lambda function as the destination for the output.",
                  "nested_params": [
                    {
                      "name": "ResourceARNUpdate",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Resource Name (ARN) of the destination Amazon Lambda function.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "DestinationSchemaUpdate",
                  "type": "dict",
                  "required": false,
                  "description": "Describes the data format when records are written to the destination.",
                  "nested_params": [
                    {
                      "name": "RecordFormatType",
                      "type": "string",
                      "required": false,
                      "description": "Specifies the format of the records on the output stream.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "ReferenceDataSourceUpdates",
              "type": "list",
              "required": false,
              "description": "The array of  ReferenceDataSourceUpdate objects describing the new reference data sources used by the application.",
              "nested_params": [
                {
                  "name": "ReferenceId",
                  "type": "string",
                  "required": false,
                  "description": "The ID of the reference data source that is being updated. You can use the  DescribeApplication operation to get this value.",
                  "nested_params": []
                },
                {
                  "name": "TableNameUpdate",
                  "type": "string",
                  "required": false,
                  "description": "The in-application table name that is created by this update.",
                  "nested_params": []
                },
                {
                  "name": "S3ReferenceDataSourceUpdate",
                  "type": "dict",
                  "required": false,
                  "description": "Describes the S3 bucket name, object key name, and IAM role that Kinesis Data Analytics can assume to read the Amazon S3 object on your behalf and populate the in-application reference table.",
                  "nested_params": [
                    {
                      "name": "BucketARNUpdate",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Resource Name (ARN) of the S3 bucket.",
                      "nested_params": []
                    },
                    {
                      "name": "FileKeyUpdate",
                      "type": "string",
                      "required": false,
                      "description": "The object key name.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "ReferenceSchemaUpdate",
                  "type": "dict",
                  "required": false,
                  "description": "Describes the format of the data in the streaming source, and how each data element maps to corresponding columns created in the in-application stream.",
                  "nested_params": [
                    {
                      "name": "RecordFormat",
                      "type": "dict",
                      "required": false,
                      "description": "Specifies the format of the records on the streaming source.",
                      "nested_params": [
                        {
                          "name": "RecordFormatType",
                          "type": "string",
                          "required": false,
                          "description": "The type of record format.",
                          "nested_params": []
                        },
                        {
                          "name": "MappingParameters",
                          "type": "dict",
                          "required": false,
                          "description": "When you configure application input at the time of creating or updating an application, provides additional mapping information specific to the record format (such as JSON, CSV, or record fields delimited by some delimiter) on the streaming source.",
                          "nested_params": [
                            {
                              "name": "JSONMappingParameters",
                              "type": "dict",
                              "required": false,
                              "description": "Provides additional mapping information when JSON is the record format on the streaming source.",
                              "nested_params": [
                                {
                                  "name": "RecordRowPath",
                                  "type": "string",
                                  "required": false,
                                  "description": "The path to the top-level parent that contains the records.",
                                  "nested_params": []
                                }
                              ]
                            },
                            {
                              "name": "CSVMappingParameters",
                              "type": "dict",
                              "required": false,
                              "description": "Provides additional mapping information when the record format uses delimiters (for example, CSV).",
                              "nested_params": [
                                {
                                  "name": "RecordRowDelimiter",
                                  "type": "string",
                                  "required": false,
                                  "description": "The row delimiter. For example, in a CSV format, --\u0098n' is the typical row delimiter.",
                                  "nested_params": []
                                },
                                {
                                  "name": "RecordColumnDelimiter",
                                  "type": "string",
                                  "required": false,
                                  "description": "The column delimiter. For example, in a CSV format, a comma (',') is the typical column delimiter.",
                                  "nested_params": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "RecordEncoding",
                      "type": "string",
                      "required": false,
                      "description": "Specifies the encoding of the records in the streaming source. For example, UTF-8.",
                      "nested_params": []
                    },
                    {
                      "name": "RecordColumns",
                      "type": "list",
                      "required": false,
                      "description": "A list of RecordColumn objects.",
                      "nested_params": [
                        {
                          "name": "Name",
                          "type": "string",
                          "required": false,
                          "description": "The name of the column that is created in the in-application input stream or reference table.",
                          "nested_params": []
                        },
                        {
                          "name": "Mapping",
                          "type": "string",
                          "required": false,
                          "description": "A reference to the data element in the streaming input or the reference data source.",
                          "nested_params": []
                        },
                        {
                          "name": "SqlType",
                          "type": "string",
                          "required": false,
                          "description": "The type of column created in the in-application input stream or reference table.",
                          "nested_params": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "ApplicationCodeConfigurationUpdate",
          "type": "dict",
          "required": false,
          "description": "Describes updates to an application's code configuration.",
          "nested_params": [
            {
              "name": "CodeContentTypeUpdate",
              "type": "string",
              "required": false,
              "description": "Describes updates to the code content type.",
              "nested_params": []
            },
            {
              "name": "CodeContentUpdate",
              "type": "dict",
              "required": false,
              "description": "Describes updates to the code content of an application.",
              "nested_params": [
                {
                  "name": "TextContentUpdate",
                  "type": "string",
                  "required": false,
                  "description": "Describes an update to the text code for an application.",
                  "nested_params": []
                },
                {
                  "name": "ZipFileContentUpdate",
                  "type": "bytes",
                  "required": false,
                  "description": "Describes an update to the zipped code for an application.",
                  "nested_params": []
                },
                {
                  "name": "S3ContentLocationUpdate",
                  "type": "dict",
                  "required": false,
                  "description": "Describes an update to the location of code for an application.",
                  "nested_params": [
                    {
                      "name": "BucketARNUpdate",
                      "type": "string",
                      "required": false,
                      "description": "The new Amazon Resource Name (ARN) for the S3 bucket containing the application code.",
                      "nested_params": []
                    },
                    {
                      "name": "FileKeyUpdate",
                      "type": "string",
                      "required": false,
                      "description": "The new file key for the object containing the application code.",
                      "nested_params": []
                    },
                    {
                      "name": "ObjectVersionUpdate",
                      "type": "string",
                      "required": false,
                      "description": "The new version of the object containing the application code.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "FlinkApplicationConfigurationUpdate",
          "type": "dict",
          "required": false,
          "description": "Describes updates to a Managed Service for Apache Flink application's configuration.",
          "nested_params": [
            {
              "name": "CheckpointConfigurationUpdate",
              "type": "dict",
              "required": false,
              "description": "Describes updates to an application's checkpointing configuration. Checkpointing is the process of persisting application state for fault tolerance.",
              "nested_params": [
                {
                  "name": "ConfigurationTypeUpdate",
                  "type": "string",
                  "required": false,
                  "description": "Describes updates to whether the application uses the default checkpointing behavior of Managed Service for Apache Flink. You must set this property to CUSTOM in order to set the CheckpointingEnabled, CheckpointInterval, or MinPauseBetweenCheckpoints parameters.",
                  "nested_params": []
                },
                {
                  "name": "CheckpointingEnabledUpdate",
                  "type": "boolean",
                  "required": false,
                  "description": "Describes updates to whether checkpointing is enabled for an application.",
                  "nested_params": []
                },
                {
                  "name": "CheckpointIntervalUpdate",
                  "type": "integer",
                  "required": false,
                  "description": "Describes updates to the interval in milliseconds between checkpoint operations.",
                  "nested_params": []
                },
                {
                  "name": "MinPauseBetweenCheckpointsUpdate",
                  "type": "integer",
                  "required": false,
                  "description": "Describes updates to the minimum time in milliseconds after a checkpoint operation completes that a new checkpoint operation can start.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "MonitoringConfigurationUpdate",
              "type": "dict",
              "required": false,
              "description": "Describes updates to the configuration parameters for Amazon CloudWatch logging for an application.",
              "nested_params": [
                {
                  "name": "ConfigurationTypeUpdate",
                  "type": "string",
                  "required": false,
                  "description": "Describes updates to whether to use the default CloudWatch logging configuration for an application. You must set this property to CUSTOM in order to set the LogLevel or MetricsLevel parameters.",
                  "nested_params": []
                },
                {
                  "name": "MetricsLevelUpdate",
                  "type": "string",
                  "required": false,
                  "description": "Describes updates to the granularity of the CloudWatch Logs for an application. The Parallelism level is not recommended for applications with a Parallelism over 64 due to excessive costs.",
                  "nested_params": []
                },
                {
                  "name": "LogLevelUpdate",
                  "type": "string",
                  "required": false,
                  "description": "Describes updates to the verbosity of the CloudWatch Logs for an application.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "ParallelismConfigurationUpdate",
              "type": "dict",
              "required": false,
              "description": "Describes updates to the parameters for how an application executes multiple tasks simultaneously.",
              "nested_params": [
                {
                  "name": "ConfigurationTypeUpdate",
                  "type": "string",
                  "required": false,
                  "description": "Describes updates to whether the application uses the default parallelism for the Managed Service for Apache Flink service, or if a custom parallelism is used. You must set this property to CUSTOM in order to change your application's AutoScalingEnabled, Parallelism, or ParallelismPerKPU properties.",
                  "nested_params": []
                },
                {
                  "name": "ParallelismUpdate",
                  "type": "integer",
                  "required": false,
                  "description": "Describes updates to the initial number of parallel tasks an application can perform. If AutoScalingEnabled is set to True, then Managed Service for Apache Flink can increase the CurrentParallelism value in response to application load. The service can increase CurrentParallelism up to the maximum parallelism, which is ParalellismPerKPU times the maximum KPUs for the application. The maximum KPUs for an application is 32 by default, and can be increased by requesting a limit increase. If application load is reduced, the service will reduce CurrentParallelism down to the Parallelism setting.",
                  "nested_params": []
                },
                {
                  "name": "ParallelismPerKPUUpdate",
                  "type": "integer",
                  "required": false,
                  "description": "Describes updates to the number of parallel tasks an application can perform per Kinesis Processing Unit (KPU) used by the application.",
                  "nested_params": []
                },
                {
                  "name": "AutoScalingEnabledUpdate",
                  "type": "boolean",
                  "required": false,
                  "description": "Describes updates to whether the Managed Service for Apache Flink service can increase the parallelism of a Managed Service for Apache Flink application in response to increased throughput.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "EnvironmentPropertyUpdates",
          "type": "dict",
          "required": false,
          "description": "Describes updates to the environment properties for a Managed Service for Apache Flink application.",
          "nested_params": [
            {
              "name": "PropertyGroups",
              "type": "list",
              "required": false,
              "description": "Describes updates to the execution property groups.",
              "nested_params": [
                {
                  "name": "PropertyGroupId",
                  "type": "string",
                  "required": false,
                  "description": "Describes the key of an application execution property key-value pair.",
                  "nested_params": []
                },
                {
                  "name": "PropertyMap",
                  "type": "dict",
                  "required": false,
                  "description": "Describes the value of an application execution property key-value pair.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "ApplicationSnapshotConfigurationUpdate",
          "type": "dict",
          "required": false,
          "description": "Describes whether snapshots are enabled for a Managed Service for Apache Flink application.",
          "nested_params": [
            {
              "name": "SnapshotsEnabledUpdate",
              "type": "boolean",
              "required": false,
              "description": "Describes updates to whether snapshots are enabled for an application.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ApplicationSystemRollbackConfigurationUpdate",
          "type": "dict",
          "required": false,
          "description": "",
          "nested_params": [
            {
              "name": "RollbackEnabledUpdate",
              "type": "boolean",
              "required": false,
              "description": "",
              "nested_params": []
            }
          ]
        },
        {
          "name": "VpcConfigurationUpdates",
          "type": "list",
          "required": false,
          "description": "Updates to the array of descriptions of VPC configurations available to the application.",
          "nested_params": [
            {
              "name": "VpcConfigurationId",
              "type": "string",
              "required": false,
              "description": "Describes an update to the ID of the VPC configuration.",
              "nested_params": []
            },
            {
              "name": "SubnetIdUpdates",
              "type": "list",
              "required": false,
              "description": "Describes updates to the array of Subnet IDs used by the VPC configuration.",
              "nested_params": []
            },
            {
              "name": "SecurityGroupIdUpdates",
              "type": "list",
              "required": false,
              "description": "Describes updates to the array of SecurityGroup IDs used by the VPC configuration.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ZeppelinApplicationConfigurationUpdate",
          "type": "dict",
          "required": false,
          "description": "Updates to the configuration of a Managed Service for Apache Flink Studio notebook.",
          "nested_params": [
            {
              "name": "MonitoringConfigurationUpdate",
              "type": "dict",
              "required": false,
              "description": "Updates to the monitoring configuration of a Managed Service for Apache Flink Studio notebook.",
              "nested_params": [
                {
                  "name": "LogLevelUpdate",
                  "type": "string",
                  "required": false,
                  "description": "Updates to the logging level for Apache Zeppelin within a Managed Service for Apache Flink Studio notebook.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "CatalogConfigurationUpdate",
              "type": "dict",
              "required": false,
              "description": "Updates to the configuration of the Amazon Glue Data Catalog that is associated with the Managed Service for Apache Flink Studio notebook.",
              "nested_params": [
                {
                  "name": "GlueDataCatalogConfigurationUpdate",
                  "type": "dict",
                  "required": false,
                  "description": "Updates to the configuration parameters for the default Amazon Glue database. You use this database for SQL queries that you write in a Managed Service for Apache Flink Studio notebook.",
                  "nested_params": [
                    {
                      "name": "DatabaseARNUpdate",
                      "type": "string",
                      "required": false,
                      "description": "The updated Amazon Resource Name (ARN) of the database.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "DeployAsApplicationConfigurationUpdate",
              "type": "dict",
              "required": false,
              "description": "Updates to the configuration information required to deploy an Amazon Data Analytics Studio notebook as an application with durable state.",
              "nested_params": [
                {
                  "name": "S3ContentLocationUpdate",
                  "type": "dict",
                  "required": false,
                  "description": "Updates to the location that holds the data required to specify an Amazon Data Analytics application.",
                  "nested_params": [
                    {
                      "name": "BucketARNUpdate",
                      "type": "string",
                      "required": false,
                      "description": "The updated Amazon Resource Name (ARN) of the S3 bucket.",
                      "nested_params": []
                    },
                    {
                      "name": "BasePathUpdate",
                      "type": "string",
                      "required": false,
                      "description": "The updated S3 bucket path.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "CustomArtifactsConfigurationUpdate",
              "type": "list",
              "required": false,
              "description": "Updates to the customer artifacts. Custom artifacts are dependency JAR files and user-defined functions (UDF).",
              "nested_params": [
                {
                  "name": "ArtifactType",
                  "type": "string",
                  "required": false,
                  "description": "UDF stands for user-defined functions. This type of artifact must be in an S3 bucket. A DEPENDENCY_JAR can be in either Maven or an S3 bucket.",
                  "nested_params": []
                },
                {
                  "name": "S3ContentLocation",
                  "type": "dict",
                  "required": false,
                  "description": "For a Managed Service for Apache Flink application provides a description of an Amazon S3 object, including the Amazon Resource Name (ARN) of the S3 bucket, the name of the Amazon S3 object that contains the data, and the version number of the Amazon S3 object that contains the data.",
                  "nested_params": [
                    {
                      "name": "BucketARN",
                      "type": "string",
                      "required": false,
                      "description": "The Amazon Resource Name (ARN) for the S3 bucket containing the application code.",
                      "nested_params": []
                    },
                    {
                      "name": "FileKey",
                      "type": "string",
                      "required": false,
                      "description": "The file key for the object containing the application code.",
                      "nested_params": []
                    },
                    {
                      "name": "ObjectVersion",
                      "type": "string",
                      "required": false,
                      "description": "The version of the object containing the application code.",
                      "nested_params": []
                    }
                  ]
                },
                {
                  "name": "MavenReference",
                  "type": "dict",
                  "required": false,
                  "description": "The parameters required to fully specify a Maven reference.",
                  "nested_params": [
                    {
                      "name": "GroupId",
                      "type": "string",
                      "required": false,
                      "description": "The group ID of the Maven reference.",
                      "nested_params": []
                    },
                    {
                      "name": "ArtifactId",
                      "type": "string",
                      "required": false,
                      "description": "The artifact ID of the Maven reference.",
                      "nested_params": []
                    },
                    {
                      "name": "Version",
                      "type": "string",
                      "required": false,
                      "description": "The version of the Maven reference.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "ServiceExecutionRoleUpdate",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "RunConfigurationUpdate",
      "type": "dict",
      "required": true,
      "description": "Describes updates to the application's starting parameters. FlinkRunConfiguration (dict) --- Describes the starting parameters for a Managed Service for Apache Flink application. AllowNonRestoredState (boolean) --- When restoring from a snapshot, specifies whether the runtime is allowed to skip a state that cannot be mapped to the new program. This will happen if the program is updated between snapshots to remove stateful parameters, and state data in the snapshot no longer corresponds to valid application data. For more information, see Allowing Non-Restored State in the Apache Flink documentation. ApplicationRestoreConfiguration (dict) --- Describes updates to the restore behavior of a restarting application. Specifies how the application should be restored. SnapshotName (string) --- The identifier of an existing snapshot of application state to use to restart an application. The application uses this value if RESTORE_FROM_CUSTOM_SNAPSHOT is specified for the ApplicationRestoreType.",
      "nested_params": [
        {
          "name": "FlinkRunConfiguration",
          "type": "dict",
          "required": false,
          "description": "Describes the starting parameters for a Managed Service for Apache Flink application.",
          "nested_params": [
            {
              "name": "AllowNonRestoredState",
              "type": "boolean",
              "required": false,
              "description": "When restoring from a snapshot, specifies whether the runtime is allowed to skip a state that cannot be mapped to the new program. This will happen if the program is updated between snapshots to remove stateful parameters, and state data in the snapshot no longer corresponds to valid application data. For more information, see Allowing Non-Restored State in the Apache Flink documentation.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "ApplicationRestoreConfiguration",
          "type": "dict",
          "required": false,
          "description": "Describes updates to the restore behavior of a restarting application.",
          "nested_params": [
            {
              "name": "ApplicationRestoreType",
              "type": "string",
              "required": false,
              "description": "Specifies how the application should be restored.",
              "nested_params": []
            },
            {
              "name": "SnapshotName",
              "type": "string",
              "required": false,
              "description": "The identifier of an existing snapshot of application state to use to restart an application. The application uses this value if RESTORE_FROM_CUSTOM_SNAPSHOT is specified for the ApplicationRestoreType.",
              "nested_params": []
            }
          ]
        }
      ]
    },
    {
      "name": "CloudWatchLoggingOptionUpdates",
      "type": "list",
      "required": true,
      "description": "Describes application Amazon CloudWatch logging option updates. You can only update existing CloudWatch logging options with this action. To add a new CloudWatch logging option, use  AddApplicationCloudWatchLoggingOption. (dict) --- Describes the Amazon CloudWatch logging option updates. The ID of the CloudWatch logging option to update LogStreamARNUpdate (string) --- The Amazon Resource Name (ARN) of the CloudWatch log to receive application messages.",
      "nested_params": [
        {
          "name": "CloudWatchLoggingOptionId",
          "type": "string",
          "required": false,
          "description": "The ID of the CloudWatch logging option to update.",
          "nested_params": []
        },
        {
          "name": "LogStreamARNUpdate",
          "type": "string",
          "required": false,
          "description": "The Amazon Resource Name (ARN) of the CloudWatch log to receive application messages.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "ConditionalToken",
      "type": "string",
      "required": false,
      "description": "",
      "nested_params": []
    },
    {
      "name": "RuntimeEnvironmentUpdate",
      "type": "string",
      "required": false,
      "description": "Updates the Managed Service for Apache Flink runtime environment used to run your code. To avoid issues you must: Ensure your new jar and dependencies are compatible with the new runtime selected. Ensure your new code's state is compatible with the snapshot from which your application will start.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "ApplicationDetail",
          "type": "dict",
          "description": "Describes application updates.",
          "nested_items": [
            {
              "name": "ApplicationARN",
              "type": "string",
              "description": "The ARN of the application.",
              "nested_items": []
            },
            {
              "name": "ApplicationDescription",
              "type": "string",
              "description": "The description of the application.",
              "nested_items": []
            },
            {
              "name": "ApplicationName",
              "type": "string",
              "description": "The name of the application.",
              "nested_items": []
            },
            {
              "name": "RuntimeEnvironment",
              "type": "string",
              "description": "The runtime environment for the application.",
              "nested_items": []
            },
            {
              "name": "ServiceExecutionRole",
              "type": "string",
              "description": "Specifies the IAM role that the application uses to access external resources.",
              "nested_items": []
            },
            {
              "name": "ApplicationStatus",
              "type": "string",
              "description": "The status of the application.",
              "nested_items": []
            },
            {
              "name": "ApplicationVersionId",
              "type": "integer",
              "description": "Provides the current application version. Managed Service for Apache Flink updates the ApplicationVersionId each time you update the application.",
              "nested_items": []
            },
            {
              "name": "CreateTimestamp",
              "type": "datetime",
              "description": "The current timestamp when the application was created.",
              "nested_items": []
            },
            {
              "name": "LastUpdateTimestamp",
              "type": "datetime",
              "description": "The current timestamp when the application was last updated.",
              "nested_items": []
            },
            {
              "name": "ApplicationConfigurationDescription",
              "type": "dict",
              "description": "Describes details about the application code and starting parameters for a Managed Service for Apache Flink application.",
              "nested_items": [
                {
                  "name": "SqlApplicationConfigurationDescription",
                  "type": "dict",
                  "description": "The details about inputs, outputs, and reference data sources for a SQL-based Kinesis Data Analytics application.",
                  "nested_items": [
                    {
                      "name": "InputDescriptions",
                      "type": "list",
                      "description": "The array of  InputDescription objects describing the input streams used by the application.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "InputId",
                              "type": "string",
                              "description": "The input ID that is associated with the application input. This is the ID that Kinesis Data Analytics assigns to each input configuration that you add to your application.",
                              "nested_items": []
                            },
                            {
                              "name": "NamePrefix",
                              "type": "string",
                              "description": "The in-application name prefix.",
                              "nested_items": []
                            },
                            {
                              "name": "InAppStreamNames",
                              "type": "list",
                              "description": "Returns the in-application stream names that are mapped to the stream source.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "string",
                                  "description": "(string) ---",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "InputProcessingConfigurationDescription",
                              "type": "dict",
                              "description": "The description of the preprocessor that executes on records in this input before the application's code is run.",
                              "nested_items": [
                                {
                                  "name": "InputLambdaProcessorDescription",
                                  "type": "dict",
                                  "description": "Provides configuration information about the associated  InputLambdaProcessorDescription.",
                                  "nested_items": [
                                    {
                                      "name": "ResourceARN",
                                      "type": "string",
                                      "description": "The ARN of the Amazon Lambda function that is used to preprocess the records in the stream.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "RoleARN",
                                      "type": "string",
                                      "description": "The ARN of the IAM role that is used to access the Amazon Lambda function.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "KinesisStreamsInputDescription",
                              "type": "dict",
                              "description": "If a Kinesis data stream is configured as a streaming source, provides the Kinesis data stream's Amazon Resource Name (ARN).",
                              "nested_items": [
                                {
                                  "name": "ResourceARN",
                                  "type": "string",
                                  "description": "The Amazon Resource Name (ARN) of the Kinesis data stream.",
                                  "nested_items": []
                                },
                                {
                                  "name": "RoleARN",
                                  "type": "string",
                                  "description": "The ARN of the IAM role that Kinesis Data Analytics can assume to access the stream.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "KinesisFirehoseInputDescription",
                              "type": "dict",
                              "description": "If a Kinesis Data Firehose delivery stream is configured as a streaming source, provides the delivery stream's ARN.",
                              "nested_items": [
                                {
                                  "name": "ResourceARN",
                                  "type": "string",
                                  "description": "The Amazon Resource Name (ARN) of the delivery stream.",
                                  "nested_items": []
                                },
                                {
                                  "name": "RoleARN",
                                  "type": "string",
                                  "description": "The ARN of the IAM role that Kinesis Data Analytics assumes to access the stream.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "InputSchema",
                              "type": "dict",
                              "description": "Describes the format of the data in the streaming source, and how each data element maps to corresponding columns in the in-application stream that is being created.",
                              "nested_items": [
                                {
                                  "name": "RecordFormat",
                                  "type": "dict",
                                  "description": "Specifies the format of the records on the streaming source.",
                                  "nested_items": [
                                    {
                                      "name": "RecordFormatType",
                                      "type": "string",
                                      "description": "The type of record format.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "MappingParameters",
                                      "type": "dict",
                                      "description": "When you configure application input at the time of creating or updating an application, provides additional mapping information specific to the record format (such as JSON, CSV, or record fields delimited by some delimiter) on the streaming source.",
                                      "nested_items": [
                                        {
                                          "name": "JSONMappingParameters",
                                          "type": "dict",
                                          "description": "Provides additional mapping information when JSON is the record format on the streaming source.",
                                          "nested_items": [
                                            {
                                              "name": "RecordRowPath",
                                              "type": "string",
                                              "description": "The path to the top-level parent that contains the records.",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "CSVMappingParameters",
                                          "type": "dict",
                                          "description": "Provides additional mapping information when the record format uses delimiters (for example, CSV).",
                                          "nested_items": [
                                            {
                                              "name": "RecordRowDelimiter",
                                              "type": "string",
                                              "description": "The row delimiter. For example, in a CSV format, --\u0098n' is the typical row delimiter.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "RecordColumnDelimiter",
                                              "type": "string",
                                              "description": "The column delimiter. For example, in a CSV format, a comma (',') is the typical column delimiter.",
                                              "nested_items": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "name": "RecordEncoding",
                                  "type": "string",
                                  "description": "Specifies the encoding of the records in the streaming source. For example, UTF-8.",
                                  "nested_items": []
                                },
                                {
                                  "name": "RecordColumns",
                                  "type": "list",
                                  "description": "A list of RecordColumn objects.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "dict",
                                      "description": "",
                                      "nested_items": [
                                        {
                                          "name": "Name",
                                          "type": "string",
                                          "description": "The name of the column that is created in the in-application input stream or reference table.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "Mapping",
                                          "type": "string",
                                          "description": "A reference to the data element in the streaming input or the reference data source.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "SqlType",
                                          "type": "string",
                                          "description": "The type of column created in the in-application input stream or reference table.",
                                          "nested_items": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "InputParallelism",
                              "type": "dict",
                              "description": "Describes the configured parallelism (number of in-application streams mapped to the streaming source).",
                              "nested_items": [
                                {
                                  "name": "Count",
                                  "type": "integer",
                                  "description": "The number of in-application streams to create.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "InputStartingPositionConfiguration",
                              "type": "dict",
                              "description": "The point at which the application is configured to read from the input stream.",
                              "nested_items": [
                                {
                                  "name": "InputStartingPosition",
                                  "type": "string",
                                  "description": "The starting position on the stream.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "NOW - Start reading just after the most recent record in the stream, and start at the request timestamp that the customer issued.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "TRIM_HORIZON - Start reading at the last untrimmed record in the stream, which is the oldest record available in the stream. This option is not available for an Amazon Kinesis Data Firehose delivery stream.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "",
                                      "type": "",
                                      "description": "LAST_STOPPED_POINT - Resume reading from where the application last stopped reading.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "OutputDescriptions",
                      "type": "list",
                      "description": "The array of  OutputDescription objects describing the destination streams used by the application.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "OutputId",
                              "type": "string",
                              "description": "A unique identifier for the output configuration.",
                              "nested_items": []
                            },
                            {
                              "name": "Name",
                              "type": "string",
                              "description": "The name of the in-application stream that is configured as output.",
                              "nested_items": []
                            },
                            {
                              "name": "KinesisStreamsOutputDescription",
                              "type": "dict",
                              "description": "Describes the Kinesis data stream that is configured as the destination where output is written.",
                              "nested_items": [
                                {
                                  "name": "ResourceARN",
                                  "type": "string",
                                  "description": "The Amazon Resource Name (ARN) of the Kinesis data stream.",
                                  "nested_items": []
                                },
                                {
                                  "name": "RoleARN",
                                  "type": "string",
                                  "description": "The ARN of the IAM role that Kinesis Data Analytics can assume to access the stream.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "KinesisFirehoseOutputDescription",
                              "type": "dict",
                              "description": "Describes the Kinesis Data Firehose delivery stream that is configured as the destination where output is written.",
                              "nested_items": [
                                {
                                  "name": "ResourceARN",
                                  "type": "string",
                                  "description": "The Amazon Resource Name (ARN) of the delivery stream.",
                                  "nested_items": []
                                },
                                {
                                  "name": "RoleARN",
                                  "type": "string",
                                  "description": "The ARN of the IAM role that Kinesis Data Analytics can assume to access the stream.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "LambdaOutputDescription",
                              "type": "dict",
                              "description": "Describes the Lambda function that is configured as the destination where output is written.",
                              "nested_items": [
                                {
                                  "name": "ResourceARN",
                                  "type": "string",
                                  "description": "The Amazon Resource Name (ARN) of the destination Lambda function.",
                                  "nested_items": []
                                },
                                {
                                  "name": "RoleARN",
                                  "type": "string",
                                  "description": "The ARN of the IAM role that Kinesis Data Analytics can assume to write to the destination function.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "DestinationSchema",
                              "type": "dict",
                              "description": "The data format used for writing data to the destination.",
                              "nested_items": [
                                {
                                  "name": "RecordFormatType",
                                  "type": "string",
                                  "description": "Specifies the format of the records on the output stream.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "ReferenceDataSourceDescriptions",
                      "type": "list",
                      "description": "The array of  ReferenceDataSourceDescription objects describing the reference data sources used by the application.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "ReferenceId",
                              "type": "string",
                              "description": "The ID of the reference data source. This is the ID that Kinesis Data Analytics assigns when you add the reference data source to your application using the  CreateApplication or  UpdateApplication operation.",
                              "nested_items": []
                            },
                            {
                              "name": "TableName",
                              "type": "string",
                              "description": "The in-application table name created by the specific reference data source configuration.",
                              "nested_items": []
                            },
                            {
                              "name": "S3ReferenceDataSourceDescription",
                              "type": "dict",
                              "description": "Provides the Amazon S3 bucket name, the object key name that contains the reference data.",
                              "nested_items": [
                                {
                                  "name": "BucketARN",
                                  "type": "string",
                                  "description": "The Amazon Resource Name (ARN) of the S3 bucket.",
                                  "nested_items": []
                                },
                                {
                                  "name": "FileKey",
                                  "type": "string",
                                  "description": "Amazon S3 object key name.",
                                  "nested_items": []
                                },
                                {
                                  "name": "ReferenceRoleARN",
                                  "type": "string",
                                  "description": "The ARN of the IAM role that Kinesis Data Analytics can assume to read the Amazon S3 object on your behalf to populate the in-application reference table.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "ReferenceSchema",
                              "type": "dict",
                              "description": "Describes the format of the data in the streaming source, and how each data element maps to corresponding columns created in the in-application stream.",
                              "nested_items": [
                                {
                                  "name": "RecordFormat",
                                  "type": "dict",
                                  "description": "Specifies the format of the records on the streaming source.",
                                  "nested_items": [
                                    {
                                      "name": "RecordFormatType",
                                      "type": "string",
                                      "description": "The type of record format.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "MappingParameters",
                                      "type": "dict",
                                      "description": "When you configure application input at the time of creating or updating an application, provides additional mapping information specific to the record format (such as JSON, CSV, or record fields delimited by some delimiter) on the streaming source.",
                                      "nested_items": [
                                        {
                                          "name": "JSONMappingParameters",
                                          "type": "dict",
                                          "description": "Provides additional mapping information when JSON is the record format on the streaming source.",
                                          "nested_items": [
                                            {
                                              "name": "RecordRowPath",
                                              "type": "string",
                                              "description": "The path to the top-level parent that contains the records.",
                                              "nested_items": []
                                            }
                                          ]
                                        },
                                        {
                                          "name": "CSVMappingParameters",
                                          "type": "dict",
                                          "description": "Provides additional mapping information when the record format uses delimiters (for example, CSV).",
                                          "nested_items": [
                                            {
                                              "name": "RecordRowDelimiter",
                                              "type": "string",
                                              "description": "The row delimiter. For example, in a CSV format, --\u0098n' is the typical row delimiter.",
                                              "nested_items": []
                                            },
                                            {
                                              "name": "RecordColumnDelimiter",
                                              "type": "string",
                                              "description": "The column delimiter. For example, in a CSV format, a comma (',') is the typical column delimiter.",
                                              "nested_items": []
                                            }
                                          ]
                                        }
                                      ]
                                    }
                                  ]
                                },
                                {
                                  "name": "RecordEncoding",
                                  "type": "string",
                                  "description": "Specifies the encoding of the records in the streaming source. For example, UTF-8.",
                                  "nested_items": []
                                },
                                {
                                  "name": "RecordColumns",
                                  "type": "list",
                                  "description": "A list of RecordColumn objects.",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "dict",
                                      "description": "",
                                      "nested_items": [
                                        {
                                          "name": "Name",
                                          "type": "string",
                                          "description": "The name of the column that is created in the in-application input stream or reference table.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "Mapping",
                                          "type": "string",
                                          "description": "A reference to the data element in the streaming input or the reference data source.",
                                          "nested_items": []
                                        },
                                        {
                                          "name": "SqlType",
                                          "type": "string",
                                          "description": "The type of column created in the in-application input stream or reference table.",
                                          "nested_items": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "ApplicationCodeConfigurationDescription",
                  "type": "dict",
                  "description": "The details about the application code for a Managed Service for Apache Flink application.",
                  "nested_items": [
                    {
                      "name": "CodeContentType",
                      "type": "string",
                      "description": "Specifies whether the code content is in text or zip format.",
                      "nested_items": []
                    },
                    {
                      "name": "CodeContentDescription",
                      "type": "dict",
                      "description": "Describes details about the location and format of the application code.",
                      "nested_items": [
                        {
                          "name": "TextContent",
                          "type": "string",
                          "description": "The text-format code.",
                          "nested_items": []
                        },
                        {
                          "name": "CodeMD5",
                          "type": "string",
                          "description": "The checksum that can be used to validate zip-format code.",
                          "nested_items": []
                        },
                        {
                          "name": "CodeSize",
                          "type": "integer",
                          "description": "The size in bytes of the application code. Can be used to validate zip-format code.",
                          "nested_items": []
                        },
                        {
                          "name": "S3ApplicationCodeLocationDescription",
                          "type": "dict",
                          "description": "The S3 bucket Amazon Resource Name (ARN), file key, and object version of the application code stored in Amazon S3.",
                          "nested_items": [
                            {
                              "name": "BucketARN",
                              "type": "string",
                              "description": "The Amazon Resource Name (ARN) for the S3 bucket containing the application code.",
                              "nested_items": []
                            },
                            {
                              "name": "FileKey",
                              "type": "string",
                              "description": "The file key for the object containing the application code.",
                              "nested_items": []
                            },
                            {
                              "name": "ObjectVersion",
                              "type": "string",
                              "description": "The version of the object containing the application code.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "RunConfigurationDescription",
                  "type": "dict",
                  "description": "The details about the starting properties for a Managed Service for Apache Flink application.",
                  "nested_items": [
                    {
                      "name": "ApplicationRestoreConfigurationDescription",
                      "type": "dict",
                      "description": "Describes the restore behavior of a restarting application.",
                      "nested_items": [
                        {
                          "name": "ApplicationRestoreType",
                          "type": "string",
                          "description": "Specifies how the application should be restored.",
                          "nested_items": []
                        },
                        {
                          "name": "SnapshotName",
                          "type": "string",
                          "description": "The identifier of an existing snapshot of application state to use to restart an application. The application uses this value if RESTORE_FROM_CUSTOM_SNAPSHOT is specified for the ApplicationRestoreType.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "FlinkRunConfigurationDescription",
                      "type": "dict",
                      "description": "Describes the starting parameters for a Managed Service for Apache Flink application.",
                      "nested_items": [
                        {
                          "name": "AllowNonRestoredState",
                          "type": "boolean",
                          "description": "When restoring from a snapshot, specifies whether the runtime is allowed to skip a state that cannot be mapped to the new program. This will happen if the program is updated between snapshots to remove stateful parameters, and state data in the snapshot no longer corresponds to valid application data. For more information, see Allowing Non-Restored State in the Apache Flink documentation.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "FlinkApplicationConfigurationDescription",
                  "type": "dict",
                  "description": "The details about a Managed Service for Apache Flink application.",
                  "nested_items": [
                    {
                      "name": "CheckpointConfigurationDescription",
                      "type": "dict",
                      "description": "Describes an application's checkpointing configuration. Checkpointing is the process of persisting application state for fault tolerance.",
                      "nested_items": [
                        {
                          "name": "ConfigurationType",
                          "type": "string",
                          "description": "Describes whether the application uses the default checkpointing behavior in Managed Service for Apache Flink.",
                          "nested_items": []
                        },
                        {
                          "name": "CheckpointingEnabled",
                          "type": "boolean",
                          "description": "Describes whether checkpointing is enabled for a Managed Service for Apache Flink application.",
                          "nested_items": []
                        },
                        {
                          "name": "CheckpointInterval",
                          "type": "integer",
                          "description": "Describes the interval in milliseconds between checkpoint operations.",
                          "nested_items": []
                        },
                        {
                          "name": "MinPauseBetweenCheckpoints",
                          "type": "integer",
                          "description": "Describes the minimum time in milliseconds after a checkpoint operation completes that a new checkpoint operation can start.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "MonitoringConfigurationDescription",
                      "type": "dict",
                      "description": "Describes configuration parameters for Amazon CloudWatch logging for an application.",
                      "nested_items": [
                        {
                          "name": "ConfigurationType",
                          "type": "string",
                          "description": "Describes whether to use the default CloudWatch logging configuration for an application.",
                          "nested_items": []
                        },
                        {
                          "name": "MetricsLevel",
                          "type": "string",
                          "description": "Describes the granularity of the CloudWatch Logs for an application.",
                          "nested_items": []
                        },
                        {
                          "name": "LogLevel",
                          "type": "string",
                          "description": "Describes the verbosity of the CloudWatch Logs for an application.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "ParallelismConfigurationDescription",
                      "type": "dict",
                      "description": "Describes parameters for how an application executes multiple tasks simultaneously.",
                      "nested_items": [
                        {
                          "name": "ConfigurationType",
                          "type": "string",
                          "description": "Describes whether the application uses the default parallelism for the Managed Service for Apache Flink service.",
                          "nested_items": []
                        },
                        {
                          "name": "Parallelism",
                          "type": "integer",
                          "description": "Describes the initial number of parallel tasks that a Managed Service for Apache Flink application can perform. If AutoScalingEnabled is set to True, then Managed Service for Apache Flink can increase the CurrentParallelism value in response to application load. The service can increase CurrentParallelism up to the maximum parallelism, which is ParalellismPerKPU times the maximum KPUs for the application. The maximum KPUs for an application is 32 by default, and can be increased by requesting a limit increase. If application load is reduced, the service can reduce the CurrentParallelism value down to the Parallelism setting.",
                          "nested_items": []
                        },
                        {
                          "name": "ParallelismPerKPU",
                          "type": "integer",
                          "description": "Describes the number of parallel tasks that a Managed Service for Apache Flink application can perform per Kinesis Processing Unit (KPU) used by the application.",
                          "nested_items": []
                        },
                        {
                          "name": "CurrentParallelism",
                          "type": "integer",
                          "description": "Describes the current number of parallel tasks that a Managed Service for Apache Flink application can perform. If AutoScalingEnabled is set to True, Managed Service for Apache Flink can increase this value in response to application load. The service can increase this value up to the maximum parallelism, which is ParalellismPerKPU times the maximum KPUs for the application. The maximum KPUs for an application is 32 by default, and can be increased by requesting a limit increase. If application load is reduced, the service can reduce the CurrentParallelism value down to the Parallelism setting.",
                          "nested_items": []
                        },
                        {
                          "name": "AutoScalingEnabled",
                          "type": "boolean",
                          "description": "Describes whether the Managed Service for Apache Flink service can increase the parallelism of the application in response to increased throughput.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "JobPlanDescription",
                      "type": "string",
                      "description": "The job plan for an application. For more information about the job plan, see Jobs and Scheduling in the Apache Flink Documentation. To retrieve the job plan for the application, use the  DescribeApplicationRequest$IncludeAdditionalDetails parameter of the  DescribeApplication operation.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "EnvironmentPropertyDescriptions",
                  "type": "dict",
                  "description": "Describes execution properties for a Managed Service for Apache Flink application.",
                  "nested_items": [
                    {
                      "name": "PropertyGroupDescriptions",
                      "type": "list",
                      "description": "Describes the execution property groups.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "PropertyGroupId",
                              "type": "string",
                              "description": "Describes the key of an application execution property key-value pair.",
                              "nested_items": []
                            },
                            {
                              "name": "PropertyMap",
                              "type": "dict",
                              "description": "Describes the value of an application execution property key-value pair.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "string",
                                  "description": "(string) ---",
                                  "nested_items": [
                                    {
                                      "name": "",
                                      "type": "string",
                                      "description": "(string) ---",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "ApplicationSnapshotConfigurationDescription",
                  "type": "dict",
                  "description": "Describes whether snapshots are enabled for a Managed Service for Apache Flink application.",
                  "nested_items": [
                    {
                      "name": "SnapshotsEnabled",
                      "type": "boolean",
                      "description": "Describes whether snapshots are enabled for a Managed Service for Apache Flink application.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "ApplicationSystemRollbackConfigurationDescription",
                  "type": "dict",
                  "description": "Describes whether system rollbacks are enabled for a Managed Service for Apache Flink application.",
                  "nested_items": [
                    {
                      "name": "RollbackEnabled",
                      "type": "boolean",
                      "description": "",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "VpcConfigurationDescriptions",
                  "type": "list",
                  "description": "The array of descriptions of VPC configurations available to the application.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "VpcConfigurationId",
                          "type": "string",
                          "description": "The ID of the VPC configuration.",
                          "nested_items": []
                        },
                        {
                          "name": "VpcId",
                          "type": "string",
                          "description": "The ID of the associated VPC.",
                          "nested_items": []
                        },
                        {
                          "name": "SubnetIds",
                          "type": "list",
                          "description": "The array of Subnet IDs used by the VPC configuration.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "SecurityGroupIds",
                          "type": "list",
                          "description": "The array of SecurityGroup IDs used by the VPC configuration.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "ZeppelinApplicationConfigurationDescription",
                  "type": "dict",
                  "description": "The configuration parameters for a Managed Service for Apache Flink Studio notebook.",
                  "nested_items": [
                    {
                      "name": "MonitoringConfigurationDescription",
                      "type": "dict",
                      "description": "The monitoring configuration of a Managed Service for Apache Flink Studio notebook.",
                      "nested_items": [
                        {
                          "name": "LogLevel",
                          "type": "string",
                          "description": "Describes the verbosity of the CloudWatch Logs for an application.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "CatalogConfigurationDescription",
                      "type": "dict",
                      "description": "The Amazon Glue Data Catalog that is associated with the Managed Service for Apache Flink Studio notebook.",
                      "nested_items": [
                        {
                          "name": "GlueDataCatalogConfigurationDescription",
                          "type": "dict",
                          "description": "The configuration parameters for the default Amazon Glue database. You use this database for SQL queries that you write in a Managed Service for Apache Flink Studio notebook.",
                          "nested_items": [
                            {
                              "name": "DatabaseARN",
                              "type": "string",
                              "description": "The Amazon Resource Name (ARN) of the database.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "DeployAsApplicationConfigurationDescription",
                      "type": "dict",
                      "description": "The parameters required to deploy a Managed Service for Apache Flink Studio notebook as an application with durable state.",
                      "nested_items": [
                        {
                          "name": "S3ContentLocationDescription",
                          "type": "dict",
                          "description": "The location that holds the data required to specify an Amazon Data Analytics application.",
                          "nested_items": [
                            {
                              "name": "BucketARN",
                              "type": "string",
                              "description": "The Amazon Resource Name (ARN) of the S3 bucket.",
                              "nested_items": []
                            },
                            {
                              "name": "BasePath",
                              "type": "string",
                              "description": "The base path for the S3 bucket.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "CustomArtifactsConfigurationDescription",
                      "type": "list",
                      "description": "Custom artifacts are dependency JARs and user-defined functions (UDF).",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "ArtifactType",
                              "type": "string",
                              "description": "UDF stands for user-defined functions. This type of artifact must be in an S3 bucket. A DEPENDENCY_JAR can be in either Maven or an S3 bucket.",
                              "nested_items": []
                            },
                            {
                              "name": "S3ContentLocationDescription",
                              "type": "dict",
                              "description": "For a Managed Service for Apache Flink application provides a description of an Amazon S3 object, including the Amazon Resource Name (ARN) of the S3 bucket, the name of the Amazon S3 object that contains the data, and the version number of the Amazon S3 object that contains the data.",
                              "nested_items": [
                                {
                                  "name": "BucketARN",
                                  "type": "string",
                                  "description": "The Amazon Resource Name (ARN) for the S3 bucket containing the application code.",
                                  "nested_items": []
                                },
                                {
                                  "name": "FileKey",
                                  "type": "string",
                                  "description": "The file key for the object containing the application code.",
                                  "nested_items": []
                                },
                                {
                                  "name": "ObjectVersion",
                                  "type": "string",
                                  "description": "The version of the object containing the application code.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "MavenReferenceDescription",
                              "type": "dict",
                              "description": "The parameters that are required to specify a Maven dependency.",
                              "nested_items": [
                                {
                                  "name": "GroupId",
                                  "type": "string",
                                  "description": "The group ID of the Maven reference.",
                                  "nested_items": []
                                },
                                {
                                  "name": "ArtifactId",
                                  "type": "string",
                                  "description": "The artifact ID of the Maven reference.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Version",
                                  "type": "string",
                                  "description": "The version of the Maven reference.",
                                  "nested_items": []
                                }
                              ]
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "CloudWatchLoggingOptionDescriptions",
              "type": "list",
              "description": "Describes the application Amazon CloudWatch logging options.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "CloudWatchLoggingOptionId",
                      "type": "string",
                      "description": "The ID of the CloudWatch logging option description.",
                      "nested_items": []
                    },
                    {
                      "name": "LogStreamARN",
                      "type": "string",
                      "description": "The Amazon Resource Name (ARN) of the CloudWatch log to receive application messages.",
                      "nested_items": []
                    },
                    {
                      "name": "RoleARN",
                      "type": "string",
                      "description": "The IAM ARN of the role to use to send application messages.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "ApplicationMaintenanceConfigurationDescription",
              "type": "dict",
              "description": "The details of the maintenance configuration for the application.",
              "nested_items": [
                {
                  "name": "ApplicationMaintenanceWindowStartTime",
                  "type": "string",
                  "description": "The start time for the maintenance window.",
                  "nested_items": []
                },
                {
                  "name": "ApplicationMaintenanceWindowEndTime",
                  "type": "string",
                  "description": "The end time for the maintenance window.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "ApplicationVersionUpdatedFrom",
              "type": "integer",
              "description": "The previous application version before the latest application update.  RollbackApplication reverts the application to this version.",
              "nested_items": []
            },
            {
              "name": "ApplicationVersionRolledBackFrom",
              "type": "integer",
              "description": "If you reverted the application using  RollbackApplication, the application version when RollbackApplication was called.",
              "nested_items": []
            },
            {
              "name": "ApplicationVersionCreateTimestamp",
              "type": "datetime",
              "description": "",
              "nested_items": []
            },
            {
              "name": "ConditionalToken",
              "type": "string",
              "description": "A value you use to implement strong concurrency for application updates.",
              "nested_items": []
            },
            {
              "name": "ApplicationVersionRolledBackTo",
              "type": "integer",
              "description": "The version to which you want to roll back the application.",
              "nested_items": []
            },
            {
              "name": "ApplicationMode",
              "type": "string",
              "description": "To create a Managed Service for Apache Flink Studio notebook, you must set the mode to INTERACTIVE. However, for a Managed Service for Apache Flink application, the mode is optional.",
              "nested_items": []
            }
          ]
        },
        {
          "name": "OperationId",
          "type": "string",
          "description": "",
          "nested_items": []
        }
      ]
    }
  ]
}