{
  "method_name": "add_flow_sources",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/mediaconnect/client/add_flow_sources.html",
  "description": "Adds sources to a flow.",
  "parameters": [
    {
      "name": "FlowArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the flow that you want to update.",
      "nested_params": []
    },
    {
      "name": "Sources",
      "type": "list",
      "required": true,
      "description": "A list of sources that you want to add to the flow. (dict) --- The settings for the source of the flow. Decryption (dict) --- The type of encryption that is used on the content ingested from this source. Allowable encryption types: static-key. Algorithm (string) --- The type of algorithm that is used for the encryption (such as aes128, aes192, or aes256). ConstantInitializationVector (string) --- A 128-bit, 16-byte hex value represented by a 32-character string, to be used with the key for encrypting content. This parameter is not valid for static key encryption. DeviceId (string) --- The value of one of the devices that you configured with your digital rights management (DRM) platform key provider. This parameter is required for SPEKE encryption and is not valid for static key encryption. KeyType (string) --- The type of key that is used for the encryption. If no keyType is provided, the service will use the default setting (static-key). Region (string) --- The Amazon Web Services Region that the API Gateway proxy endpoint was created in. ResourceId (string) --- An identifier for the content. The service sends this value to the key server to identify the current endpoint. The resource ID is also known as the content ID. The ARN of the role that you created during setup (when you set up MediaConnect as a trusted entity). SecretArn (string) --- The ARN of the secret that you created in Secrets Manager to store the encryption key. This parameter is required for static key encryption and is not valid for SPEKE encryption. Url (string) --- The URL from the API Gateway proxy that you set up to talk to your key server. Description (string) --- A description for the source. This value is not used or seen outside of the current MediaConnect account. EntitlementArn (string) --- The ARN of the entitlement that allows you to subscribe to this flow. The entitlement is set by the flow originator, and the ARN is generated as part of the originator's flow. IngestPort (integer) --- The port that the flow will be listening on for incoming content. MaxBitrate (integer) --- The smoothing max bitrate (in bps) for RIST, RTP, and RTP-FEC streams. MaxLatency (integer) --- The maximum latency in milliseconds. This parameter applies only to RIST-based and Zixi-based streams. MaxSyncBuffer (integer) --- The size of the buffer (in milliseconds) to use to sync incoming source data. MediaStreamSourceConfigurations (list) --- The media streams that are associated with the source, and the parameters for those associations. (dict) --- The media stream that you want to associate with the source, and the parameters for that association. The format that was used to encode the data. For ancillary data streams, set the encoding name to smpte291. For audio streams, set the encoding name to pcm. For video, 2110 streams, set the encoding name to raw. For video, JPEG XS streams, set the encoding name to jxsv. InputConfigurations (list) --- The media streams that you want to associate with the source. (dict) --- The transport parameters that you want to associate with an incoming media stream. The port that you want the flow to listen on for an incoming media stream. The VPC interface that you want to use for the incoming media stream. The name of the VPC interface. The name of the media stream. MinLatency (integer) --- The minimum latency in milliseconds for SRT-based streams. In streams that use the SRT protocol, this value that you set on your MediaConnect source or output represents the minimal potential latency of that connection. The latency of the stream is set to the highest number between the sender's minimum latency and the receiver's minimum latency. Name (string) --- The name of the source. Protocol (string) --- The protocol that is used by the source. SenderControlPort (integer) --- The port that the flow uses to send outbound requests to initiate connection with the sender. SenderIpAddress (string) --- The IP address that the flow communicates with to initiate connection with the sender. SourceListenerAddress (string) --- Source IP or domain name for SRT-caller protocol. SourceListenerPort (integer) --- Source port for SRT-caller protocol. StreamId (string) --- The stream ID that you want to use for this transport. This parameter applies only to Zixi and SRT caller-based streams. VpcInterfaceName (string) --- The name of the VPC interface to use for this source. WhitelistCidr (string) --- The range of IP addresses that should be allowed to contribute content to your source. These IP addresses should be in the form of a Classless Inter-Domain Routing (CIDR) block; for example, 10.0.0.0/16. GatewayBridgeSource (dict) --- The source configuration for cloud flows receiving a stream from a bridge. The ARN of the bridge feeding this flow. VpcInterfaceAttachment (dict) --- The name of the VPC interface attachment to use for this bridge source. VpcInterfaceName (string) --- The name of the VPC interface to use for this resource.",
      "nested_params": [
        {
          "name": "Decryption",
          "type": "dict",
          "required": false,
          "description": "The type of encryption that is used on the content ingested from this source. Allowable encryption types: static-key.",
          "nested_params": [
            {
              "name": "Algorithm",
              "type": "string",
              "required": false,
              "description": "The type of algorithm that is used for the encryption (such as aes128, aes192, or aes256).",
              "nested_params": []
            },
            {
              "name": "ConstantInitializationVector",
              "type": "string",
              "required": false,
              "description": "A 128-bit, 16-byte hex value represented by a 32-character string, to be used with the key for encrypting content. This parameter is not valid for static key encryption.",
              "nested_params": []
            },
            {
              "name": "DeviceId",
              "type": "string",
              "required": false,
              "description": "The value of one of the devices that you configured with your digital rights management (DRM) platform key provider. This parameter is required for SPEKE encryption and is not valid for static key encryption.",
              "nested_params": []
            },
            {
              "name": "KeyType",
              "type": "string",
              "required": false,
              "description": "The type of key that is used for the encryption. If no keyType is provided, the service will use the default setting (static-key).",
              "nested_params": []
            },
            {
              "name": "Region",
              "type": "string",
              "required": false,
              "description": "The Amazon Web Services Region that the API Gateway proxy endpoint was created in. This parameter is required for SPEKE encryption and is not valid for static key encryption.",
              "nested_params": []
            },
            {
              "name": "ResourceId",
              "type": "string",
              "required": false,
              "description": "An identifier for the content. The service sends this value to the key server to identify the current endpoint. The resource ID is also known as the content ID. This parameter is required for SPEKE encryption and is not valid for static key encryption.",
              "nested_params": []
            },
            {
              "name": "RoleArn",
              "type": "string",
              "required": false,
              "description": "The ARN of the role that you created during setup (when you set up MediaConnect as a trusted entity).",
              "nested_params": []
            },
            {
              "name": "SecretArn",
              "type": "string",
              "required": false,
              "description": "The ARN of the secret that you created in Secrets Manager to store the encryption key. This parameter is required for static key encryption and is not valid for SPEKE encryption.",
              "nested_params": []
            },
            {
              "name": "Url",
              "type": "string",
              "required": false,
              "description": "The URL from the API Gateway proxy that you set up to talk to your key server. This parameter is required for SPEKE encryption and is not valid for static key encryption.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "Description",
          "type": "string",
          "required": false,
          "description": "A description for the source. This value is not used or seen outside of the current MediaConnect account.",
          "nested_params": []
        },
        {
          "name": "EntitlementArn",
          "type": "string",
          "required": false,
          "description": "The ARN of the entitlement that allows you to subscribe to this flow. The entitlement is set by the flow originator, and the ARN is generated as part of the originator's flow.",
          "nested_params": []
        },
        {
          "name": "IngestPort",
          "type": "integer",
          "required": false,
          "description": "The port that the flow will be listening on for incoming content.",
          "nested_params": []
        },
        {
          "name": "MaxBitrate",
          "type": "integer",
          "required": false,
          "description": "The smoothing max bitrate (in bps) for RIST, RTP, and RTP-FEC streams.",
          "nested_params": []
        },
        {
          "name": "MaxLatency",
          "type": "integer",
          "required": false,
          "description": "The maximum latency in milliseconds. This parameter applies only to RIST-based and Zixi-based streams.",
          "nested_params": []
        },
        {
          "name": "MaxSyncBuffer",
          "type": "integer",
          "required": false,
          "description": "The size of the buffer (in milliseconds) to use to sync incoming source data.",
          "nested_params": []
        },
        {
          "name": "MediaStreamSourceConfigurations",
          "type": "list",
          "required": false,
          "description": "The media streams that are associated with the source, and the parameters for those associations.",
          "nested_params": [
            {
              "name": "EncodingName",
              "type": "string",
              "required": false,
              "description": "The format that was used to encode the data. For ancillary data streams, set the encoding name to smpte291. For audio streams, set the encoding name to pcm. For video, 2110 streams, set the encoding name to raw. For video, JPEG XS streams, set the encoding name to jxsv.",
              "nested_params": []
            },
            {
              "name": "InputConfigurations",
              "type": "list",
              "required": false,
              "description": "The media streams that you want to associate with the source.",
              "nested_params": [
                {
                  "name": "InputPort",
                  "type": "integer",
                  "required": false,
                  "description": "The port that you want the flow to listen on for an incoming media stream.",
                  "nested_params": []
                },
                {
                  "name": "Interface",
                  "type": "dict",
                  "required": false,
                  "description": "The VPC interface that you want to use for the incoming media stream.",
                  "nested_params": [
                    {
                      "name": "Name",
                      "type": "string",
                      "required": false,
                      "description": "The name of the VPC interface.",
                      "nested_params": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "MediaStreamName",
              "type": "string",
              "required": false,
              "description": "The name of the media stream.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "MinLatency",
          "type": "integer",
          "required": false,
          "description": "The minimum latency in milliseconds for SRT-based streams. In streams that use the SRT protocol, this value that you set on your MediaConnect source or output represents the minimal potential latency of that connection. The latency of the stream is set to the highest number between the sender's minimum latency and the receiver's minimum latency.",
          "nested_params": []
        },
        {
          "name": "Name",
          "type": "string",
          "required": false,
          "description": "The name of the source.",
          "nested_params": []
        },
        {
          "name": "Protocol",
          "type": "string",
          "required": false,
          "description": "The protocol that is used by the source.",
          "nested_params": []
        },
        {
          "name": "SenderControlPort",
          "type": "integer",
          "required": false,
          "description": "The port that the flow uses to send outbound requests to initiate connection with the sender.",
          "nested_params": []
        },
        {
          "name": "SenderIpAddress",
          "type": "string",
          "required": false,
          "description": "The IP address that the flow communicates with to initiate connection with the sender.",
          "nested_params": []
        },
        {
          "name": "SourceListenerAddress",
          "type": "string",
          "required": false,
          "description": "Source IP or domain name for SRT-caller protocol.",
          "nested_params": []
        },
        {
          "name": "SourceListenerPort",
          "type": "integer",
          "required": false,
          "description": "Source port for SRT-caller protocol.",
          "nested_params": []
        },
        {
          "name": "StreamId",
          "type": "string",
          "required": false,
          "description": "The stream ID that you want to use for this transport. This parameter applies only to Zixi and SRT caller-based streams.",
          "nested_params": []
        },
        {
          "name": "VpcInterfaceName",
          "type": "string",
          "required": false,
          "description": "The name of the VPC interface to use for this source.",
          "nested_params": []
        },
        {
          "name": "WhitelistCidr",
          "type": "string",
          "required": false,
          "description": "The range of IP addresses that should be allowed to contribute content to your source. These IP addresses should be in the form of a Classless Inter-Domain Routing (CIDR) block; for example, 10.0.0.0/16.",
          "nested_params": []
        },
        {
          "name": "GatewayBridgeSource",
          "type": "dict",
          "required": false,
          "description": "The source configuration for cloud flows receiving a stream from a bridge.",
          "nested_params": [
            {
              "name": "BridgeArn",
              "type": "string",
              "required": false,
              "description": "The ARN of the bridge feeding this flow.",
              "nested_params": []
            },
            {
              "name": "VpcInterfaceAttachment",
              "type": "dict",
              "required": false,
              "description": "The name of the VPC interface attachment to use for this bridge source.",
              "nested_params": [
                {
                  "name": "VpcInterfaceName",
                  "type": "string",
                  "required": false,
                  "description": "The name of the VPC interface to use for this resource.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "FlowArn",
          "type": "string",
          "description": "The ARN of the flow that these sources were added to.",
          "nested_items": []
        },
        {
          "name": "Sources",
          "type": "list",
          "description": "The details of the newly added sources.",
          "nested_items": [
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "DataTransferSubscriberFeePercent",
                  "type": "integer",
                  "description": "Percentage from 0-100 of the data transfer cost to be billed to the subscriber.",
                  "nested_items": []
                },
                {
                  "name": "Decryption",
                  "type": "dict",
                  "description": "The type of encryption that is used on the content ingested from this source.",
                  "nested_items": [
                    {
                      "name": "Algorithm",
                      "type": "string",
                      "description": "The type of algorithm that is used for the encryption (such as aes128, aes192, or aes256).",
                      "nested_items": []
                    },
                    {
                      "name": "ConstantInitializationVector",
                      "type": "string",
                      "description": "A 128-bit, 16-byte hex value represented by a 32-character string, to be used with the key for encrypting content. This parameter is not valid for static key encryption.",
                      "nested_items": []
                    },
                    {
                      "name": "DeviceId",
                      "type": "string",
                      "description": "The value of one of the devices that you configured with your digital rights management (DRM) platform key provider. This parameter is required for SPEKE encryption and is not valid for static key encryption.",
                      "nested_items": []
                    },
                    {
                      "name": "KeyType",
                      "type": "string",
                      "description": "The type of key that is used for the encryption. If no keyType is provided, the service will use the default setting (static-key).",
                      "nested_items": []
                    },
                    {
                      "name": "Region",
                      "type": "string",
                      "description": "The Amazon Web Services Region that the API Gateway proxy endpoint was created in. This parameter is required for SPEKE encryption and is not valid for static key encryption.",
                      "nested_items": []
                    },
                    {
                      "name": "ResourceId",
                      "type": "string",
                      "description": "An identifier for the content. The service sends this value to the key server to identify the current endpoint. The resource ID is also known as the content ID. This parameter is required for SPEKE encryption and is not valid for static key encryption.",
                      "nested_items": []
                    },
                    {
                      "name": "RoleArn",
                      "type": "string",
                      "description": "The ARN of the role that you created during setup (when you set up MediaConnect as a trusted entity).",
                      "nested_items": []
                    },
                    {
                      "name": "SecretArn",
                      "type": "string",
                      "description": "The ARN of the secret that you created in Secrets Manager to store the encryption key. This parameter is required for static key encryption and is not valid for SPEKE encryption.",
                      "nested_items": []
                    },
                    {
                      "name": "Url",
                      "type": "string",
                      "description": "The URL from the API Gateway proxy that you set up to talk to your key server. This parameter is required for SPEKE encryption and is not valid for static key encryption.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Description",
                  "type": "string",
                  "description": "A description for the source. This value is not used or seen outside of the current MediaConnect account.",
                  "nested_items": []
                },
                {
                  "name": "EntitlementArn",
                  "type": "string",
                  "description": "The ARN of the entitlement that allows you to subscribe to content that comes from another Amazon Web Services account. The entitlement is set by the content originator and the ARN is generated as part of the originator's flow.",
                  "nested_items": []
                },
                {
                  "name": "IngestIp",
                  "type": "string",
                  "description": "The IP address that the flow will be listening on for incoming content.",
                  "nested_items": []
                },
                {
                  "name": "IngestPort",
                  "type": "integer",
                  "description": "The port that the flow will be listening on for incoming content.",
                  "nested_items": []
                },
                {
                  "name": "MediaStreamSourceConfigurations",
                  "type": "list",
                  "description": "The media streams that are associated with the source, and the parameters for those associations.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "EncodingName",
                          "type": "string",
                          "description": "The format that was used to encode the data. For ancillary data streams, set the encoding name to smpte291. For audio streams, set the encoding name to pcm. For video, 2110 streams, set the encoding name to raw. For video, JPEG XS streams, set the encoding name to jxsv.",
                          "nested_items": []
                        },
                        {
                          "name": "InputConfigurations",
                          "type": "list",
                          "description": "The media streams that you want to associate with the source.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "dict",
                              "description": "",
                              "nested_items": [
                                {
                                  "name": "InputIp",
                                  "type": "string",
                                  "description": "The IP address that the flow listens on for incoming content for a media stream.",
                                  "nested_items": []
                                },
                                {
                                  "name": "InputPort",
                                  "type": "integer",
                                  "description": "The port that the flow listens on for an incoming media stream.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Interface",
                                  "type": "dict",
                                  "description": "The VPC interface where the media stream comes in from.",
                                  "nested_items": [
                                    {
                                      "name": "Name",
                                      "type": "string",
                                      "description": "The name of the VPC interface.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "name": "MediaStreamName",
                          "type": "string",
                          "description": "A name that helps you distinguish one media stream from another.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The name of the source.",
                  "nested_items": []
                },
                {
                  "name": "SenderControlPort",
                  "type": "integer",
                  "description": "The IP address that the flow communicates with to initiate connection with the sender.",
                  "nested_items": []
                },
                {
                  "name": "SenderIpAddress",
                  "type": "string",
                  "description": "The port that the flow uses to send outbound requests to initiate connection with the sender.",
                  "nested_items": []
                },
                {
                  "name": "SourceArn",
                  "type": "string",
                  "description": "The ARN of the source.",
                  "nested_items": []
                },
                {
                  "name": "Transport",
                  "type": "dict",
                  "description": "Attributes related to the transport stream that are used in the source.",
                  "nested_items": [
                    {
                      "name": "CidrAllowList",
                      "type": "list",
                      "description": "The range of IP addresses that should be allowed to initiate output requests to this flow. These IP addresses should be in the form of a Classless Inter-Domain Routing (CIDR) block; for example, 10.0.0.0/16",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "MaxBitrate",
                      "type": "integer",
                      "description": "The smoothing max bitrate (in bps) for RIST, RTP, and RTP-FEC streams.",
                      "nested_items": []
                    },
                    {
                      "name": "MaxLatency",
                      "type": "integer",
                      "description": "The maximum latency in milliseconds. This parameter applies only to RIST-based and Zixi-based streams.",
                      "nested_items": []
                    },
                    {
                      "name": "MaxSyncBuffer",
                      "type": "integer",
                      "description": "The size of the buffer (in milliseconds) to use to sync incoming source data.",
                      "nested_items": []
                    },
                    {
                      "name": "MinLatency",
                      "type": "integer",
                      "description": "The minimum latency in milliseconds for SRT-based streams. In streams that use the SRT protocol, this value that you set on your MediaConnect source or output represents the minimal potential latency of that connection. The latency of the stream is set to the highest number between the sender's minimum latency and the receiver's minimum latency.",
                      "nested_items": []
                    },
                    {
                      "name": "Protocol",
                      "type": "string",
                      "description": "The protocol that is used by the source or output.",
                      "nested_items": []
                    },
                    {
                      "name": "RemoteId",
                      "type": "string",
                      "description": "The remote ID for the Zixi-pull stream.",
                      "nested_items": []
                    },
                    {
                      "name": "SenderControlPort",
                      "type": "integer",
                      "description": "The port that the flow uses to send outbound requests to initiate connection with the sender.",
                      "nested_items": []
                    },
                    {
                      "name": "SenderIpAddress",
                      "type": "string",
                      "description": "The IP address that the flow communicates with to initiate connection with the sender.",
                      "nested_items": []
                    },
                    {
                      "name": "SmoothingLatency",
                      "type": "integer",
                      "description": "The smoothing latency in milliseconds for RIST, RTP, and RTP-FEC streams.",
                      "nested_items": []
                    },
                    {
                      "name": "SourceListenerAddress",
                      "type": "string",
                      "description": "Source IP or domain name for SRT-caller protocol.",
                      "nested_items": []
                    },
                    {
                      "name": "SourceListenerPort",
                      "type": "integer",
                      "description": "Source port for SRT-caller protocol.",
                      "nested_items": []
                    },
                    {
                      "name": "StreamId",
                      "type": "string",
                      "description": "The stream ID that you want to use for this transport. This parameter applies only to Zixi and SRT caller-based streams.",
                      "nested_items": []
                    },
                    {
                      "name": "NdiSpeedHqQuality",
                      "type": "integer",
                      "description": "A quality setting for the NDI Speed HQ encoder.",
                      "nested_items": []
                    },
                    {
                      "name": "NdiProgramName",
                      "type": "string",
                      "description": "A suffix for the names of the NDI sources that the flow creates. If a custom name isn't specified, MediaConnect uses the output name.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "VpcInterfaceName",
                  "type": "string",
                  "description": "The name of the VPC interface that is used for this source.",
                  "nested_items": []
                },
                {
                  "name": "WhitelistCidr",
                  "type": "string",
                  "description": "The range of IP addresses that should be allowed to contribute content to your source. These IP addresses should be in the form of a Classless Inter-Domain Routing (CIDR) block; for example, 10.0.0.0/16.",
                  "nested_items": []
                },
                {
                  "name": "GatewayBridgeSource",
                  "type": "dict",
                  "description": "The source configuration for cloud flows receiving a stream from a bridge.",
                  "nested_items": [
                    {
                      "name": "BridgeArn",
                      "type": "string",
                      "description": "The ARN of the bridge feeding this flow.",
                      "nested_items": []
                    },
                    {
                      "name": "VpcInterfaceAttachment",
                      "type": "dict",
                      "description": "The name of the VPC interface attachment to use for this bridge source.",
                      "nested_items": [
                        {
                          "name": "VpcInterfaceName",
                          "type": "string",
                          "description": "The name of the VPC interface to use for this resource.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "PeerIpAddress",
                  "type": "string",
                  "description": "The IP address of the device that is currently sending content to this source.",
                  "nested_items": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}