{
  "method_name": "purchase_offering",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/mediaconnect/client/purchase_offering.html",
  "description": "Submits a request to purchase an offering. If you already have an active reservation, you can't purchase another offering.",
  "parameters": [
    {
      "name": "OfferingArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the offering.",
      "nested_params": []
    },
    {
      "name": "ReservationName",
      "type": "string",
      "required": true,
      "description": "The name that you want to use for the reservation.",
      "nested_params": []
    },
    {
      "name": "Start",
      "type": "string",
      "required": true,
      "description": "The date and time that you want the reservation to begin, in Coordinated Universal Time (UTC). You can specify any date and time between 12:00am on the first day of the current month to the current time on today's date, inclusive. Specify the start in a 24-hour notation. Use the following format: YYYY-MM-DDTHH:mm:SSZ, where T and Z are literal characters. For example, to specify 11:30pm on March 5, 2020, enter 2020-03-05T23:30:00Z.",
      "nested_params": []
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "Reservation",
          "type": "dict",
          "description": "The details of the reservation that you just created when you purchased the offering.",
          "nested_items": [
            {
              "name": "CurrencyCode",
              "type": "string",
              "description": "The type of currency that is used for billing. The currencyCode used for your reservation is US dollars.",
              "nested_items": []
            },
            {
              "name": "Duration",
              "type": "integer",
              "description": "The length of time that this reservation is active. MediaConnect defines this value in the offering.",
              "nested_items": []
            },
            {
              "name": "DurationUnits",
              "type": "string",
              "description": "The unit of measurement for the duration of the reservation. MediaConnect defines this value in the offering.",
              "nested_items": []
            },
            {
              "name": "End",
              "type": "string",
              "description": "The day and time that this reservation expires. This value is calculated based on the start date and time that you set and the offering's duration.",
              "nested_items": []
            },
            {
              "name": "OfferingArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) that MediaConnect assigns to the offering.",
              "nested_items": []
            },
            {
              "name": "OfferingDescription",
              "type": "string",
              "description": "A description of the offering. MediaConnect defines this value in the offering.",
              "nested_items": []
            },
            {
              "name": "PricePerUnit",
              "type": "string",
              "description": "The cost of a single unit. This value, in combination with priceUnits, makes up the rate. MediaConnect defines this value in the offering.",
              "nested_items": []
            },
            {
              "name": "PriceUnits",
              "type": "string",
              "description": "The unit of measurement that is used for billing. This value, in combination with pricePerUnit, makes up the rate. MediaConnect defines this value in the offering.",
              "nested_items": []
            },
            {
              "name": "ReservationArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) that MediaConnect assigns to the reservation when you purchase an offering.",
              "nested_items": []
            },
            {
              "name": "ReservationName",
              "type": "string",
              "description": "The name that you assigned to the reservation when you purchased the offering.",
              "nested_items": []
            },
            {
              "name": "ReservationState",
              "type": "string",
              "description": "The status of your reservation.",
              "nested_items": []
            },
            {
              "name": "ResourceSpecification",
              "type": "dict",
              "description": "A definition of the amount of outbound bandwidth that you would be reserving if you purchase the offering. MediaConnect defines the values that make up the resourceSpecification in the offering.",
              "nested_items": [
                {
                  "name": "ReservedBitrate",
                  "type": "integer",
                  "description": "The amount of outbound bandwidth that is discounted in the offering.",
                  "nested_items": []
                },
                {
                  "name": "ResourceType",
                  "type": "string",
                  "description": "The type of resource and the unit that is being billed for.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Start",
              "type": "string",
              "description": "The day and time that the reservation becomes active. You set this value when you purchase the offering.",
              "nested_items": []
            }
          ]
        }
      ]
    }
  ]
}