{
  "method_name": "update_flow",
  "url": "https://boto3.amazonaws.com/v1/documentation/api/latest/reference/services/mediaconnect/client/update_flow.html",
  "description": "Updates an existing flow.",
  "parameters": [
    {
      "name": "FlowArn",
      "type": "string",
      "required": true,
      "description": "The Amazon Resource Name (ARN) of the flow that you want to update.",
      "nested_params": []
    },
    {
      "name": "SourceFailoverConfig",
      "type": "dict",
      "required": false,
      "description": "The settings for source failover. FailoverMode (string) --- The type of failover you choose for this flow. MERGE combines the source streams into a single stream, allowing graceful recovery from any single-source loss. FAILOVER allows switching between different streams. RecoveryWindow (integer) --- Recovery window time to look for dash-7 packets. SourcePriority (dict) --- The priority you want to assign to a source. You can have a primary stream and a backup stream or two equally prioritized streams. PrimarySource (string) --- The name of the source you choose as the primary source for this flow. State (string) --- The state of source failover on the flow. If the state is inactive, the flow can have only one source. If the state is active, the flow can have one or two sources.",
      "nested_params": [
        {
          "name": "FailoverMode",
          "type": "string",
          "required": false,
          "description": "The type of failover you choose for this flow. MERGE combines the source streams into a single stream, allowing graceful recovery from any single-source loss. FAILOVER allows switching between different streams.",
          "nested_params": []
        },
        {
          "name": "RecoveryWindow",
          "type": "integer",
          "required": false,
          "description": "Recovery window time to look for dash-7 packets.",
          "nested_params": []
        },
        {
          "name": "SourcePriority",
          "type": "dict",
          "required": false,
          "description": "The priority you want to assign to a source. You can have a primary stream and a backup stream or two equally prioritized streams.",
          "nested_params": [
            {
              "name": "PrimarySource",
              "type": "string",
              "required": false,
              "description": "The name of the source you choose as the primary source for this flow.",
              "nested_params": []
            }
          ]
        },
        {
          "name": "State",
          "type": "string",
          "required": false,
          "description": "The state of source failover on the flow. If the state is inactive, the flow can have only one source. If the state is active, the flow can have one or two sources.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "Maintenance",
      "type": "dict",
      "required": false,
      "description": "The maintenance setting of the flow. MaintenanceDay (string) --- A day of a week when the maintenance will happen. MaintenanceScheduledDate (string) --- A scheduled date in ISO UTC format when the maintenance will happen. Use YYYY-MM-DD format. Example: 2021-01-30. MaintenanceStartHour (string) --- UTC time when the maintenance will happen. Use 24-hour HH:MM format. Minutes must be 00. Example: 13:00. The default value is 02:00.",
      "nested_params": [
        {
          "name": "MaintenanceDay",
          "type": "string",
          "required": false,
          "description": "A day of a week when the maintenance will happen.",
          "nested_params": []
        },
        {
          "name": "MaintenanceScheduledDate",
          "type": "string",
          "required": false,
          "description": "A scheduled date in ISO UTC format when the maintenance will happen. Use YYYY-MM-DD format. Example: 2021-01-30.",
          "nested_params": []
        },
        {
          "name": "MaintenanceStartHour",
          "type": "string",
          "required": false,
          "description": "UTC time when the maintenance will happen. Use 24-hour HH:MM format. Minutes must be 00. Example: 13:00. The default value is 02:00.",
          "nested_params": []
        }
      ]
    },
    {
      "name": "SourceMonitoringConfig",
      "type": "dict",
      "required": false,
      "description": "The settings for source monitoring. ThumbnailState (string) --- Indicates whether thumbnails are enabled or disabled. AudioMonitoringSettings (list) --- Contains the settings for audio stream metrics monitoring. (dict) --- Specifies the configuration for audio stream metrics monitoring. SilentAudio (dict) --- Detects periods of silence. State (string) --- Indicates whether the SilentAudio metric is enabled or disabled. ThresholdSeconds (integer) --- Specifies the number of consecutive seconds of silence that triggers an event or alert. ContentQualityAnalysisState (string) --- Indicates whether content quality analysis is enabled or disabled. VideoMonitoringSettings (list) --- Contains the settings for video stream metrics monitoring. (dict) --- Specifies the configuration for video stream metrics monitoring. BlackFrames (dict) --- Detects video frames that are black. State (string) --- Indicates whether the BlackFrames metric is enabled or disabled.. ThresholdSeconds (integer) --- Specifies the number of consecutive seconds of black frames that triggers an event or alert. FrozenFrames (dict) --- Detects video frames that have not changed. State (string) --- Indicates whether the FrozenFrames metric is enabled or disabled. ThresholdSeconds (integer) --- Specifies the number of consecutive seconds of a static image that triggers an event or alert.",
      "nested_params": [
        {
          "name": "ThumbnailState",
          "type": "string",
          "required": false,
          "description": "Indicates whether thumbnails are enabled or disabled.",
          "nested_params": []
        },
        {
          "name": "AudioMonitoringSettings",
          "type": "list",
          "required": false,
          "description": "Contains the settings for audio stream metrics monitoring.",
          "nested_params": [
            {
              "name": "SilentAudio",
              "type": "dict",
              "required": false,
              "description": "Detects periods of silence.",
              "nested_params": [
                {
                  "name": "State",
                  "type": "string",
                  "required": false,
                  "description": "Indicates whether the SilentAudio metric is enabled or disabled.",
                  "nested_params": []
                },
                {
                  "name": "ThresholdSeconds",
                  "type": "integer",
                  "required": false,
                  "description": "Specifies the number of consecutive seconds of silence that triggers an event or alert.",
                  "nested_params": []
                }
              ]
            }
          ]
        },
        {
          "name": "ContentQualityAnalysisState",
          "type": "string",
          "required": false,
          "description": "Indicates whether content quality analysis is enabled or disabled.",
          "nested_params": []
        },
        {
          "name": "VideoMonitoringSettings",
          "type": "list",
          "required": false,
          "description": "Contains the settings for video stream metrics monitoring.",
          "nested_params": [
            {
              "name": "BlackFrames",
              "type": "dict",
              "required": false,
              "description": "Detects video frames that are black.",
              "nested_params": [
                {
                  "name": "State",
                  "type": "string",
                  "required": false,
                  "description": "Indicates whether the BlackFrames metric is enabled or disabled..",
                  "nested_params": []
                },
                {
                  "name": "ThresholdSeconds",
                  "type": "integer",
                  "required": false,
                  "description": "Specifies the number of consecutive seconds of black frames that triggers an event or alert.",
                  "nested_params": []
                }
              ]
            },
            {
              "name": "FrozenFrames",
              "type": "dict",
              "required": false,
              "description": "Detects video frames that have not changed.",
              "nested_params": [
                {
                  "name": "State",
                  "type": "string",
                  "required": false,
                  "description": "Indicates whether the FrozenFrames metric is enabled or disabled.",
                  "nested_params": []
                },
                {
                  "name": "ThresholdSeconds",
                  "type": "integer",
                  "required": false,
                  "description": "Specifies the number of consecutive seconds of a static image that triggers an event or alert.",
                  "nested_params": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "NdiConfig",
      "type": "dict",
      "required": true,
      "description": "Specifies the configuration settings for NDI outputs. Required when the flow includes NDI outputs. NdiState (string) --- A setting that controls whether NDI outputs can be used in the flow. Must be ENABLED to add NDI outputs. Default is DISABLED. MachineName (string) --- A prefix for the names of the NDI sources that the flow creates. If a custom name isn't specified, MediaConnect generates a unique 12-character ID as the prefix. NdiDiscoveryServers (list) --- A list of up to three NDI discovery server configurations. While not required by the API, this configuration is necessary for NDI functionality to work properly. (dict) --- Specifies the configuration settings for individual NDI discovery servers. A maximum of 3 servers is allowed. The unique network address of the NDI discovery server. DiscoveryServerPort (integer) --- The port for the NDI discovery server. Defaults to 5959 if a custom port isn't specified. The identifier for the Virtual Private Cloud (VPC) network interface used by the flow.",
      "nested_params": [
        {
          "name": "NdiState",
          "type": "string",
          "required": false,
          "description": "A setting that controls whether NDI outputs can be used in the flow. Must be ENABLED to add NDI outputs. Default is DISABLED.",
          "nested_params": []
        },
        {
          "name": "MachineName",
          "type": "string",
          "required": false,
          "description": "A prefix for the names of the NDI sources that the flow creates. If a custom name isn't specified, MediaConnect generates a unique 12-character ID as the prefix.",
          "nested_params": []
        },
        {
          "name": "NdiDiscoveryServers",
          "type": "list",
          "required": false,
          "description": "A list of up to three NDI discovery server configurations. While not required by the API, this configuration is necessary for NDI functionality to work properly.",
          "nested_params": [
            {
              "name": "DiscoveryServerAddress",
              "type": "string",
              "required": false,
              "description": "The unique network address of the NDI discovery server.",
              "nested_params": []
            },
            {
              "name": "DiscoveryServerPort",
              "type": "integer",
              "required": false,
              "description": "The port for the NDI discovery server. Defaults to 5959 if a custom port isn't specified.",
              "nested_params": []
            },
            {
              "name": "VpcInterfaceAdapter",
              "type": "string",
              "required": false,
              "description": "The identifier for the Virtual Private Cloud (VPC) network interface used by the flow.",
              "nested_params": []
            }
          ]
        }
      ]
    }
  ],
  "return_structure": [
    {
      "name": "",
      "type": "dict",
      "description": "",
      "nested_items": [
        {
          "name": "",
          "type": "dict",
          "description": "",
          "nested_items": [
            {
              "name": "AvailabilityZone",
              "type": "string",
              "description": "The Availability Zone that you want to create the flow in. These options are limited to the Availability Zones within the current Amazon Web Services Region.",
              "nested_items": []
            },
            {
              "name": "Description",
              "type": "string",
              "description": "A description of the flow. This value is not used or seen outside of the current MediaConnect account.",
              "nested_items": []
            },
            {
              "name": "EgressIp",
              "type": "string",
              "description": "The IP address from which video will be sent to output destinations.",
              "nested_items": []
            },
            {
              "name": "Entitlements",
              "type": "list",
              "description": "The entitlements in this flow.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "DataTransferSubscriberFeePercent",
                      "type": "integer",
                      "description": "Percentage from 0-100 of the data transfer cost to be billed to the subscriber.",
                      "nested_items": []
                    },
                    {
                      "name": "Description",
                      "type": "string",
                      "description": "A description of the entitlement.",
                      "nested_items": []
                    },
                    {
                      "name": "Encryption",
                      "type": "dict",
                      "description": "The type of encryption that will be used on the output that is associated with this entitlement.",
                      "nested_items": [
                        {
                          "name": "Algorithm",
                          "type": "string",
                          "description": "The type of algorithm that is used for the encryption (such as aes128, aes192, or aes256).",
                          "nested_items": []
                        },
                        {
                          "name": "ConstantInitializationVector",
                          "type": "string",
                          "description": "A 128-bit, 16-byte hex value represented by a 32-character string, to be used with the key for encrypting content. This parameter is not valid for static key encryption.",
                          "nested_items": []
                        },
                        {
                          "name": "DeviceId",
                          "type": "string",
                          "description": "The value of one of the devices that you configured with your digital rights management (DRM) platform key provider. This parameter is required for SPEKE encryption and is not valid for static key encryption.",
                          "nested_items": []
                        },
                        {
                          "name": "KeyType",
                          "type": "string",
                          "description": "The type of key that is used for the encryption. If no keyType is provided, the service will use the default setting (static-key).",
                          "nested_items": []
                        },
                        {
                          "name": "Region",
                          "type": "string",
                          "description": "The Amazon Web Services Region that the API Gateway proxy endpoint was created in. This parameter is required for SPEKE encryption and is not valid for static key encryption.",
                          "nested_items": []
                        },
                        {
                          "name": "ResourceId",
                          "type": "string",
                          "description": "An identifier for the content. The service sends this value to the key server to identify the current endpoint. The resource ID is also known as the content ID. This parameter is required for SPEKE encryption and is not valid for static key encryption.",
                          "nested_items": []
                        },
                        {
                          "name": "RoleArn",
                          "type": "string",
                          "description": "The ARN of the role that you created during setup (when you set up MediaConnect as a trusted entity).",
                          "nested_items": []
                        },
                        {
                          "name": "SecretArn",
                          "type": "string",
                          "description": "The ARN of the secret that you created in Secrets Manager to store the encryption key. This parameter is required for static key encryption and is not valid for SPEKE encryption.",
                          "nested_items": []
                        },
                        {
                          "name": "Url",
                          "type": "string",
                          "description": "The URL from the API Gateway proxy that you set up to talk to your key server. This parameter is required for SPEKE encryption and is not valid for static key encryption.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "EntitlementArn",
                      "type": "string",
                      "description": "The ARN of the entitlement.",
                      "nested_items": []
                    },
                    {
                      "name": "EntitlementStatus",
                      "type": "string",
                      "description": "An indication of whether the entitlement is enabled.",
                      "nested_items": []
                    },
                    {
                      "name": "Name",
                      "type": "string",
                      "description": "The name of the entitlement.",
                      "nested_items": []
                    },
                    {
                      "name": "Subscribers",
                      "type": "list",
                      "description": "The Amazon Web Services account IDs that you want to share your content with. The receiving accounts (subscribers) will be allowed to create their own flow using your content as the source.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "FlowArn",
              "type": "string",
              "description": "The Amazon Resource Name (ARN) of the flow.",
              "nested_items": []
            },
            {
              "name": "MediaStreams",
              "type": "list",
              "description": "The media streams that are associated with the flow. After you associate a media stream with a source, you can also associate it with outputs on the flow.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Attributes",
                      "type": "dict",
                      "description": "Attributes that are related to the media stream.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "ChannelOrder",
                              "type": "string",
                              "description": "The format of the audio channel.",
                              "nested_items": []
                            },
                            {
                              "name": "Colorimetry",
                              "type": "string",
                              "description": "The format used for the representation of color.",
                              "nested_items": []
                            },
                            {
                              "name": "ExactFramerate",
                              "type": "string",
                              "description": "The frame rate for the video stream, in frames/second. For example: 60000/1001.",
                              "nested_items": []
                            },
                            {
                              "name": "Par",
                              "type": "string",
                              "description": "The pixel aspect ratio (PAR) of the video.",
                              "nested_items": []
                            },
                            {
                              "name": "Range",
                              "type": "string",
                              "description": "The encoding range of the video.",
                              "nested_items": []
                            },
                            {
                              "name": "ScanMode",
                              "type": "string",
                              "description": "The type of compression that was used to smooth the video's appearance.",
                              "nested_items": []
                            },
                            {
                              "name": "Tcs",
                              "type": "string",
                              "description": "The transfer characteristic system (TCS) that is used in the video.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "Lang",
                          "type": "string",
                          "description": "The audio language, in a format that is recognized by the receiver.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "ClockRate",
                      "type": "integer",
                      "description": "The sample rate for the stream. This value is measured in Hz.",
                      "nested_items": []
                    },
                    {
                      "name": "Description",
                      "type": "string",
                      "description": "A description that can help you quickly identify what your media stream is used for.",
                      "nested_items": []
                    },
                    {
                      "name": "Fmt",
                      "type": "integer",
                      "description": "The format type number (sometimes referred to as RTP payload type) of the media stream. MediaConnect assigns this value to the media stream. For ST 2110 JPEG XS outputs, you need to provide this value to the receiver.",
                      "nested_items": []
                    },
                    {
                      "name": "MediaStreamId",
                      "type": "integer",
                      "description": "A unique identifier for the media stream.",
                      "nested_items": []
                    },
                    {
                      "name": "MediaStreamName",
                      "type": "string",
                      "description": "A name that helps you distinguish one media stream from another.",
                      "nested_items": []
                    },
                    {
                      "name": "MediaStreamType",
                      "type": "string",
                      "description": "The type of media stream.",
                      "nested_items": []
                    },
                    {
                      "name": "VideoFormat",
                      "type": "string",
                      "description": "The resolution of the video.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "Name",
              "type": "string",
              "description": "The name of the flow.",
              "nested_items": []
            },
            {
              "name": "Outputs",
              "type": "list",
              "description": "The outputs in this flow.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "DataTransferSubscriberFeePercent",
                      "type": "integer",
                      "description": "Percentage from 0-100 of the data transfer cost to be billed to the subscriber.",
                      "nested_items": []
                    },
                    {
                      "name": "Description",
                      "type": "string",
                      "description": "A description of the output.",
                      "nested_items": []
                    },
                    {
                      "name": "Destination",
                      "type": "string",
                      "description": "The address where you want to send the output.",
                      "nested_items": []
                    },
                    {
                      "name": "Encryption",
                      "type": "dict",
                      "description": "The type of key used for the encryption. If no keyType is provided, the service will use the default setting (static-key).",
                      "nested_items": [
                        {
                          "name": "Algorithm",
                          "type": "string",
                          "description": "The type of algorithm that is used for the encryption (such as aes128, aes192, or aes256).",
                          "nested_items": []
                        },
                        {
                          "name": "ConstantInitializationVector",
                          "type": "string",
                          "description": "A 128-bit, 16-byte hex value represented by a 32-character string, to be used with the key for encrypting content. This parameter is not valid for static key encryption.",
                          "nested_items": []
                        },
                        {
                          "name": "DeviceId",
                          "type": "string",
                          "description": "The value of one of the devices that you configured with your digital rights management (DRM) platform key provider. This parameter is required for SPEKE encryption and is not valid for static key encryption.",
                          "nested_items": []
                        },
                        {
                          "name": "KeyType",
                          "type": "string",
                          "description": "The type of key that is used for the encryption. If no keyType is provided, the service will use the default setting (static-key).",
                          "nested_items": []
                        },
                        {
                          "name": "Region",
                          "type": "string",
                          "description": "The Amazon Web Services Region that the API Gateway proxy endpoint was created in. This parameter is required for SPEKE encryption and is not valid for static key encryption.",
                          "nested_items": []
                        },
                        {
                          "name": "ResourceId",
                          "type": "string",
                          "description": "An identifier for the content. The service sends this value to the key server to identify the current endpoint. The resource ID is also known as the content ID. This parameter is required for SPEKE encryption and is not valid for static key encryption.",
                          "nested_items": []
                        },
                        {
                          "name": "RoleArn",
                          "type": "string",
                          "description": "The ARN of the role that you created during setup (when you set up MediaConnect as a trusted entity).",
                          "nested_items": []
                        },
                        {
                          "name": "SecretArn",
                          "type": "string",
                          "description": "The ARN of the secret that you created in Secrets Manager to store the encryption key. This parameter is required for static key encryption and is not valid for SPEKE encryption.",
                          "nested_items": []
                        },
                        {
                          "name": "Url",
                          "type": "string",
                          "description": "The URL from the API Gateway proxy that you set up to talk to your key server. This parameter is required for SPEKE encryption and is not valid for static key encryption.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "EntitlementArn",
                      "type": "string",
                      "description": "The ARN of the entitlement on the originator''s flow. This value is relevant only on entitled flows.",
                      "nested_items": []
                    },
                    {
                      "name": "ListenerAddress",
                      "type": "string",
                      "description": "The IP address that the receiver requires in order to establish a connection with the flow. For public networking, the ListenerAddress is represented by the elastic IP address of the flow. For private networking, the ListenerAddress is represented by the elastic network interface IP address of the VPC. This field applies only to outputs that use the Zixi pull or SRT listener protocol.",
                      "nested_items": []
                    },
                    {
                      "name": "MediaLiveInputArn",
                      "type": "string",
                      "description": "The input ARN of the MediaLive channel. This parameter is relevant only for outputs that were added by creating a MediaLive input.",
                      "nested_items": []
                    },
                    {
                      "name": "MediaStreamOutputConfigurations",
                      "type": "list",
                      "description": "The configuration for each media stream that is associated with the output.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "DestinationConfigurations",
                              "type": "list",
                              "description": "The transport parameters that are associated with each outbound media stream.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "DestinationIp",
                                      "type": "string",
                                      "description": "The IP address where you want MediaConnect to send contents of the media stream.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "DestinationPort",
                                      "type": "integer",
                                      "description": "The port that you want MediaConnect to use when it distributes the media stream to the output.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Interface",
                                      "type": "dict",
                                      "description": "The VPC interface that you want to use for the media stream associated with the output.",
                                      "nested_items": [
                                        {
                                          "name": "Name",
                                          "type": "string",
                                          "description": "The name of the VPC interface.",
                                          "nested_items": []
                                        }
                                      ]
                                    },
                                    {
                                      "name": "OutboundIp",
                                      "type": "string",
                                      "description": "The IP address that the receiver requires in order to establish a connection with the flow. This value is represented by the elastic network interface IP address of the VPC. This field applies only to outputs that use the CDI or ST 2110 JPEG XS or protocol.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "EncodingName",
                              "type": "string",
                              "description": "The format that was used to encode the data. For ancillary data streams, set the encoding name to smpte291. For audio streams, set the encoding name to pcm. For video, 2110 streams, set the encoding name to raw. For video, JPEG XS streams, set the encoding name to jxsv.",
                              "nested_items": []
                            },
                            {
                              "name": "EncodingParameters",
                              "type": "dict",
                              "description": "A collection of parameters that determine how MediaConnect will convert the content. These fields only apply to outputs on flows that have a CDI source.",
                              "nested_items": [
                                {
                                  "name": "CompressionFactor",
                                  "type": "float",
                                  "description": "A value that is used to calculate compression for an output. The bitrate of the output is calculated as follows: Output bitrate = (1 / compressionFactor) * (source bitrate) This property only applies to outputs that use the ST 2110 JPEG XS protocol, with a flow source that uses the CDI protocol. Valid values are floating point numbers in the range of 3.0 to 10.0, inclusive.",
                                  "nested_items": []
                                },
                                {
                                  "name": "EncoderProfile",
                                  "type": "string",
                                  "description": "A setting on the encoder that drives compression settings. This property only applies to video media streams associated with outputs that use the ST 2110 JPEG XS protocol, with a flow source that uses the CDI protocol.",
                                  "nested_items": []
                                }
                              ]
                            },
                            {
                              "name": "MediaStreamName",
                              "type": "string",
                              "description": "The name of the media stream.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "Name",
                      "type": "string",
                      "description": "The name of the output. This value must be unique within the current flow.",
                      "nested_items": []
                    },
                    {
                      "name": "OutputArn",
                      "type": "string",
                      "description": "The ARN of the output.",
                      "nested_items": []
                    },
                    {
                      "name": "Port",
                      "type": "integer",
                      "description": "The port to use when content is distributed to this output.",
                      "nested_items": []
                    },
                    {
                      "name": "Transport",
                      "type": "dict",
                      "description": "Attributes related to the transport stream that are used in the output.",
                      "nested_items": [
                        {
                          "name": "CidrAllowList",
                          "type": "list",
                          "description": "The range of IP addresses that should be allowed to initiate output requests to this flow. These IP addresses should be in the form of a Classless Inter-Domain Routing (CIDR) block; for example, 10.0.0.0/16",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "MaxBitrate",
                          "type": "integer",
                          "description": "The smoothing max bitrate (in bps) for RIST, RTP, and RTP-FEC streams.",
                          "nested_items": []
                        },
                        {
                          "name": "MaxLatency",
                          "type": "integer",
                          "description": "The maximum latency in milliseconds. This parameter applies only to RIST-based and Zixi-based streams.",
                          "nested_items": []
                        },
                        {
                          "name": "MaxSyncBuffer",
                          "type": "integer",
                          "description": "The size of the buffer (in milliseconds) to use to sync incoming source data.",
                          "nested_items": []
                        },
                        {
                          "name": "MinLatency",
                          "type": "integer",
                          "description": "The minimum latency in milliseconds for SRT-based streams. In streams that use the SRT protocol, this value that you set on your MediaConnect source or output represents the minimal potential latency of that connection. The latency of the stream is set to the highest number between the sender's minimum latency and the receiver's minimum latency.",
                          "nested_items": []
                        },
                        {
                          "name": "Protocol",
                          "type": "string",
                          "description": "The protocol that is used by the source or output.",
                          "nested_items": []
                        },
                        {
                          "name": "RemoteId",
                          "type": "string",
                          "description": "The remote ID for the Zixi-pull stream.",
                          "nested_items": []
                        },
                        {
                          "name": "SenderControlPort",
                          "type": "integer",
                          "description": "The port that the flow uses to send outbound requests to initiate connection with the sender.",
                          "nested_items": []
                        },
                        {
                          "name": "SenderIpAddress",
                          "type": "string",
                          "description": "The IP address that the flow communicates with to initiate connection with the sender.",
                          "nested_items": []
                        },
                        {
                          "name": "SmoothingLatency",
                          "type": "integer",
                          "description": "The smoothing latency in milliseconds for RIST, RTP, and RTP-FEC streams.",
                          "nested_items": []
                        },
                        {
                          "name": "SourceListenerAddress",
                          "type": "string",
                          "description": "Source IP or domain name for SRT-caller protocol.",
                          "nested_items": []
                        },
                        {
                          "name": "SourceListenerPort",
                          "type": "integer",
                          "description": "Source port for SRT-caller protocol.",
                          "nested_items": []
                        },
                        {
                          "name": "StreamId",
                          "type": "string",
                          "description": "The stream ID that you want to use for this transport. This parameter applies only to Zixi and SRT caller-based streams.",
                          "nested_items": []
                        },
                        {
                          "name": "NdiSpeedHqQuality",
                          "type": "integer",
                          "description": "A quality setting for the NDI Speed HQ encoder.",
                          "nested_items": []
                        },
                        {
                          "name": "NdiProgramName",
                          "type": "string",
                          "description": "A suffix for the names of the NDI sources that the flow creates. If a custom name isn't specified, MediaConnect uses the output name.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "VpcInterfaceAttachment",
                      "type": "dict",
                      "description": "The name of the VPC interface attachment to use for this output.",
                      "nested_items": [
                        {
                          "name": "VpcInterfaceName",
                          "type": "string",
                          "description": "The name of the VPC interface to use for this resource.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "BridgeArn",
                      "type": "string",
                      "description": "The ARN of the bridge added to this output.",
                      "nested_items": []
                    },
                    {
                      "name": "BridgePorts",
                      "type": "list",
                      "description": "The bridge output ports currently in use.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "integer",
                          "description": "(integer) ---",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "OutputStatus",
                      "type": "string",
                      "description": "An indication of whether the output is transmitting data or not.",
                      "nested_items": []
                    },
                    {
                      "name": "PeerIpAddress",
                      "type": "string",
                      "description": "The IP address of the device that is currently receiving content from this output.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "",
              "type": "dict",
              "description": "",
              "nested_items": [
                {
                  "name": "DataTransferSubscriberFeePercent",
                  "type": "integer",
                  "description": "Percentage from 0-100 of the data transfer cost to be billed to the subscriber.",
                  "nested_items": []
                },
                {
                  "name": "Decryption",
                  "type": "dict",
                  "description": "The type of encryption that is used on the content ingested from this source.",
                  "nested_items": [
                    {
                      "name": "Algorithm",
                      "type": "string",
                      "description": "The type of algorithm that is used for the encryption (such as aes128, aes192, or aes256).",
                      "nested_items": []
                    },
                    {
                      "name": "ConstantInitializationVector",
                      "type": "string",
                      "description": "A 128-bit, 16-byte hex value represented by a 32-character string, to be used with the key for encrypting content. This parameter is not valid for static key encryption.",
                      "nested_items": []
                    },
                    {
                      "name": "DeviceId",
                      "type": "string",
                      "description": "The value of one of the devices that you configured with your digital rights management (DRM) platform key provider. This parameter is required for SPEKE encryption and is not valid for static key encryption.",
                      "nested_items": []
                    },
                    {
                      "name": "KeyType",
                      "type": "string",
                      "description": "The type of key that is used for the encryption. If no keyType is provided, the service will use the default setting (static-key).",
                      "nested_items": []
                    },
                    {
                      "name": "Region",
                      "type": "string",
                      "description": "The Amazon Web Services Region that the API Gateway proxy endpoint was created in. This parameter is required for SPEKE encryption and is not valid for static key encryption.",
                      "nested_items": []
                    },
                    {
                      "name": "ResourceId",
                      "type": "string",
                      "description": "An identifier for the content. The service sends this value to the key server to identify the current endpoint. The resource ID is also known as the content ID. This parameter is required for SPEKE encryption and is not valid for static key encryption.",
                      "nested_items": []
                    },
                    {
                      "name": "RoleArn",
                      "type": "string",
                      "description": "The ARN of the role that you created during setup (when you set up MediaConnect as a trusted entity).",
                      "nested_items": []
                    },
                    {
                      "name": "SecretArn",
                      "type": "string",
                      "description": "The ARN of the secret that you created in Secrets Manager to store the encryption key. This parameter is required for static key encryption and is not valid for SPEKE encryption.",
                      "nested_items": []
                    },
                    {
                      "name": "Url",
                      "type": "string",
                      "description": "The URL from the API Gateway proxy that you set up to talk to your key server. This parameter is required for SPEKE encryption and is not valid for static key encryption.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "Description",
                  "type": "string",
                  "description": "A description for the source. This value is not used or seen outside of the current MediaConnect account.",
                  "nested_items": []
                },
                {
                  "name": "EntitlementArn",
                  "type": "string",
                  "description": "The ARN of the entitlement that allows you to subscribe to content that comes from another Amazon Web Services account. The entitlement is set by the content originator and the ARN is generated as part of the originator's flow.",
                  "nested_items": []
                },
                {
                  "name": "IngestIp",
                  "type": "string",
                  "description": "The IP address that the flow will be listening on for incoming content.",
                  "nested_items": []
                },
                {
                  "name": "IngestPort",
                  "type": "integer",
                  "description": "The port that the flow will be listening on for incoming content.",
                  "nested_items": []
                },
                {
                  "name": "MediaStreamSourceConfigurations",
                  "type": "list",
                  "description": "The media streams that are associated with the source, and the parameters for those associations.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "EncodingName",
                          "type": "string",
                          "description": "The format that was used to encode the data. For ancillary data streams, set the encoding name to smpte291. For audio streams, set the encoding name to pcm. For video, 2110 streams, set the encoding name to raw. For video, JPEG XS streams, set the encoding name to jxsv.",
                          "nested_items": []
                        },
                        {
                          "name": "InputConfigurations",
                          "type": "list",
                          "description": "The media streams that you want to associate with the source.",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "dict",
                              "description": "",
                              "nested_items": [
                                {
                                  "name": "InputIp",
                                  "type": "string",
                                  "description": "The IP address that the flow listens on for incoming content for a media stream.",
                                  "nested_items": []
                                },
                                {
                                  "name": "InputPort",
                                  "type": "integer",
                                  "description": "The port that the flow listens on for an incoming media stream.",
                                  "nested_items": []
                                },
                                {
                                  "name": "Interface",
                                  "type": "dict",
                                  "description": "The VPC interface where the media stream comes in from.",
                                  "nested_items": [
                                    {
                                      "name": "Name",
                                      "type": "string",
                                      "description": "The name of the VPC interface.",
                                      "nested_items": []
                                    }
                                  ]
                                }
                              ]
                            }
                          ]
                        },
                        {
                          "name": "MediaStreamName",
                          "type": "string",
                          "description": "A name that helps you distinguish one media stream from another.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "Name",
                  "type": "string",
                  "description": "The name of the source.",
                  "nested_items": []
                },
                {
                  "name": "SenderControlPort",
                  "type": "integer",
                  "description": "The IP address that the flow communicates with to initiate connection with the sender.",
                  "nested_items": []
                },
                {
                  "name": "SenderIpAddress",
                  "type": "string",
                  "description": "The port that the flow uses to send outbound requests to initiate connection with the sender.",
                  "nested_items": []
                },
                {
                  "name": "SourceArn",
                  "type": "string",
                  "description": "The ARN of the source.",
                  "nested_items": []
                },
                {
                  "name": "Transport",
                  "type": "dict",
                  "description": "Attributes related to the transport stream that are used in the source.",
                  "nested_items": [
                    {
                      "name": "CidrAllowList",
                      "type": "list",
                      "description": "The range of IP addresses that should be allowed to initiate output requests to this flow. These IP addresses should be in the form of a Classless Inter-Domain Routing (CIDR) block; for example, 10.0.0.0/16",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "MaxBitrate",
                      "type": "integer",
                      "description": "The smoothing max bitrate (in bps) for RIST, RTP, and RTP-FEC streams.",
                      "nested_items": []
                    },
                    {
                      "name": "MaxLatency",
                      "type": "integer",
                      "description": "The maximum latency in milliseconds. This parameter applies only to RIST-based and Zixi-based streams.",
                      "nested_items": []
                    },
                    {
                      "name": "MaxSyncBuffer",
                      "type": "integer",
                      "description": "The size of the buffer (in milliseconds) to use to sync incoming source data.",
                      "nested_items": []
                    },
                    {
                      "name": "MinLatency",
                      "type": "integer",
                      "description": "The minimum latency in milliseconds for SRT-based streams. In streams that use the SRT protocol, this value that you set on your MediaConnect source or output represents the minimal potential latency of that connection. The latency of the stream is set to the highest number between the sender's minimum latency and the receiver's minimum latency.",
                      "nested_items": []
                    },
                    {
                      "name": "Protocol",
                      "type": "string",
                      "description": "The protocol that is used by the source or output.",
                      "nested_items": []
                    },
                    {
                      "name": "RemoteId",
                      "type": "string",
                      "description": "The remote ID for the Zixi-pull stream.",
                      "nested_items": []
                    },
                    {
                      "name": "SenderControlPort",
                      "type": "integer",
                      "description": "The port that the flow uses to send outbound requests to initiate connection with the sender.",
                      "nested_items": []
                    },
                    {
                      "name": "SenderIpAddress",
                      "type": "string",
                      "description": "The IP address that the flow communicates with to initiate connection with the sender.",
                      "nested_items": []
                    },
                    {
                      "name": "SmoothingLatency",
                      "type": "integer",
                      "description": "The smoothing latency in milliseconds for RIST, RTP, and RTP-FEC streams.",
                      "nested_items": []
                    },
                    {
                      "name": "SourceListenerAddress",
                      "type": "string",
                      "description": "Source IP or domain name for SRT-caller protocol.",
                      "nested_items": []
                    },
                    {
                      "name": "SourceListenerPort",
                      "type": "integer",
                      "description": "Source port for SRT-caller protocol.",
                      "nested_items": []
                    },
                    {
                      "name": "StreamId",
                      "type": "string",
                      "description": "The stream ID that you want to use for this transport. This parameter applies only to Zixi and SRT caller-based streams.",
                      "nested_items": []
                    },
                    {
                      "name": "NdiSpeedHqQuality",
                      "type": "integer",
                      "description": "A quality setting for the NDI Speed HQ encoder.",
                      "nested_items": []
                    },
                    {
                      "name": "NdiProgramName",
                      "type": "string",
                      "description": "A suffix for the names of the NDI sources that the flow creates. If a custom name isn't specified, MediaConnect uses the output name.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "VpcInterfaceName",
                  "type": "string",
                  "description": "The name of the VPC interface that is used for this source.",
                  "nested_items": []
                },
                {
                  "name": "WhitelistCidr",
                  "type": "string",
                  "description": "The range of IP addresses that should be allowed to contribute content to your source. These IP addresses should be in the form of a Classless Inter-Domain Routing (CIDR) block; for example, 10.0.0.0/16.",
                  "nested_items": []
                },
                {
                  "name": "GatewayBridgeSource",
                  "type": "dict",
                  "description": "The source configuration for cloud flows receiving a stream from a bridge.",
                  "nested_items": [
                    {
                      "name": "BridgeArn",
                      "type": "string",
                      "description": "The ARN of the bridge feeding this flow.",
                      "nested_items": []
                    },
                    {
                      "name": "VpcInterfaceAttachment",
                      "type": "dict",
                      "description": "The name of the VPC interface attachment to use for this bridge source.",
                      "nested_items": [
                        {
                          "name": "VpcInterfaceName",
                          "type": "string",
                          "description": "The name of the VPC interface to use for this resource.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "PeerIpAddress",
                  "type": "string",
                  "description": "The IP address of the device that is currently sending content to this source.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "SourceFailoverConfig",
              "type": "dict",
              "description": "The settings for the source failover.",
              "nested_items": [
                {
                  "name": "FailoverMode",
                  "type": "string",
                  "description": "The type of failover you choose for this flow. MERGE combines the source streams into a single stream, allowing graceful recovery from any single-source loss. FAILOVER allows switching between different streams.",
                  "nested_items": []
                },
                {
                  "name": "RecoveryWindow",
                  "type": "integer",
                  "description": "Search window time to look for dash-7 packets.",
                  "nested_items": []
                },
                {
                  "name": "SourcePriority",
                  "type": "dict",
                  "description": "The priority you want to assign to a source. You can have a primary stream and a backup stream or two equally prioritized streams.",
                  "nested_items": [
                    {
                      "name": "PrimarySource",
                      "type": "string",
                      "description": "The name of the source you choose as the primary source for this flow.",
                      "nested_items": []
                    }
                  ]
                },
                {
                  "name": "State",
                  "type": "string",
                  "description": "The state of source failover on the flow. If the state is inactive, the flow can have only one source. If the state is active, the flow can have one or two sources.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "Sources",
              "type": "list",
              "description": "The settings for the sources that are assigned to the flow.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "DataTransferSubscriberFeePercent",
                      "type": "integer",
                      "description": "Percentage from 0-100 of the data transfer cost to be billed to the subscriber.",
                      "nested_items": []
                    },
                    {
                      "name": "Decryption",
                      "type": "dict",
                      "description": "The type of encryption that is used on the content ingested from this source.",
                      "nested_items": [
                        {
                          "name": "Algorithm",
                          "type": "string",
                          "description": "The type of algorithm that is used for the encryption (such as aes128, aes192, or aes256).",
                          "nested_items": []
                        },
                        {
                          "name": "ConstantInitializationVector",
                          "type": "string",
                          "description": "A 128-bit, 16-byte hex value represented by a 32-character string, to be used with the key for encrypting content. This parameter is not valid for static key encryption.",
                          "nested_items": []
                        },
                        {
                          "name": "DeviceId",
                          "type": "string",
                          "description": "The value of one of the devices that you configured with your digital rights management (DRM) platform key provider. This parameter is required for SPEKE encryption and is not valid for static key encryption.",
                          "nested_items": []
                        },
                        {
                          "name": "KeyType",
                          "type": "string",
                          "description": "The type of key that is used for the encryption. If no keyType is provided, the service will use the default setting (static-key).",
                          "nested_items": []
                        },
                        {
                          "name": "Region",
                          "type": "string",
                          "description": "The Amazon Web Services Region that the API Gateway proxy endpoint was created in. This parameter is required for SPEKE encryption and is not valid for static key encryption.",
                          "nested_items": []
                        },
                        {
                          "name": "ResourceId",
                          "type": "string",
                          "description": "An identifier for the content. The service sends this value to the key server to identify the current endpoint. The resource ID is also known as the content ID. This parameter is required for SPEKE encryption and is not valid for static key encryption.",
                          "nested_items": []
                        },
                        {
                          "name": "RoleArn",
                          "type": "string",
                          "description": "The ARN of the role that you created during setup (when you set up MediaConnect as a trusted entity).",
                          "nested_items": []
                        },
                        {
                          "name": "SecretArn",
                          "type": "string",
                          "description": "The ARN of the secret that you created in Secrets Manager to store the encryption key. This parameter is required for static key encryption and is not valid for SPEKE encryption.",
                          "nested_items": []
                        },
                        {
                          "name": "Url",
                          "type": "string",
                          "description": "The URL from the API Gateway proxy that you set up to talk to your key server. This parameter is required for SPEKE encryption and is not valid for static key encryption.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "Description",
                      "type": "string",
                      "description": "A description for the source. This value is not used or seen outside of the current MediaConnect account.",
                      "nested_items": []
                    },
                    {
                      "name": "EntitlementArn",
                      "type": "string",
                      "description": "The ARN of the entitlement that allows you to subscribe to content that comes from another Amazon Web Services account. The entitlement is set by the content originator and the ARN is generated as part of the originator's flow.",
                      "nested_items": []
                    },
                    {
                      "name": "IngestIp",
                      "type": "string",
                      "description": "The IP address that the flow will be listening on for incoming content.",
                      "nested_items": []
                    },
                    {
                      "name": "IngestPort",
                      "type": "integer",
                      "description": "The port that the flow will be listening on for incoming content.",
                      "nested_items": []
                    },
                    {
                      "name": "MediaStreamSourceConfigurations",
                      "type": "list",
                      "description": "The media streams that are associated with the source, and the parameters for those associations.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "dict",
                          "description": "",
                          "nested_items": [
                            {
                              "name": "EncodingName",
                              "type": "string",
                              "description": "The format that was used to encode the data. For ancillary data streams, set the encoding name to smpte291. For audio streams, set the encoding name to pcm. For video, 2110 streams, set the encoding name to raw. For video, JPEG XS streams, set the encoding name to jxsv.",
                              "nested_items": []
                            },
                            {
                              "name": "InputConfigurations",
                              "type": "list",
                              "description": "The media streams that you want to associate with the source.",
                              "nested_items": [
                                {
                                  "name": "",
                                  "type": "dict",
                                  "description": "",
                                  "nested_items": [
                                    {
                                      "name": "InputIp",
                                      "type": "string",
                                      "description": "The IP address that the flow listens on for incoming content for a media stream.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "InputPort",
                                      "type": "integer",
                                      "description": "The port that the flow listens on for an incoming media stream.",
                                      "nested_items": []
                                    },
                                    {
                                      "name": "Interface",
                                      "type": "dict",
                                      "description": "The VPC interface where the media stream comes in from.",
                                      "nested_items": [
                                        {
                                          "name": "Name",
                                          "type": "string",
                                          "description": "The name of the VPC interface.",
                                          "nested_items": []
                                        }
                                      ]
                                    }
                                  ]
                                }
                              ]
                            },
                            {
                              "name": "MediaStreamName",
                              "type": "string",
                              "description": "A name that helps you distinguish one media stream from another.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "Name",
                      "type": "string",
                      "description": "The name of the source.",
                      "nested_items": []
                    },
                    {
                      "name": "SenderControlPort",
                      "type": "integer",
                      "description": "The IP address that the flow communicates with to initiate connection with the sender.",
                      "nested_items": []
                    },
                    {
                      "name": "SenderIpAddress",
                      "type": "string",
                      "description": "The port that the flow uses to send outbound requests to initiate connection with the sender.",
                      "nested_items": []
                    },
                    {
                      "name": "SourceArn",
                      "type": "string",
                      "description": "The ARN of the source.",
                      "nested_items": []
                    },
                    {
                      "name": "Transport",
                      "type": "dict",
                      "description": "Attributes related to the transport stream that are used in the source.",
                      "nested_items": [
                        {
                          "name": "CidrAllowList",
                          "type": "list",
                          "description": "The range of IP addresses that should be allowed to initiate output requests to this flow. These IP addresses should be in the form of a Classless Inter-Domain Routing (CIDR) block; for example, 10.0.0.0/16",
                          "nested_items": [
                            {
                              "name": "",
                              "type": "string",
                              "description": "(string) ---",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "MaxBitrate",
                          "type": "integer",
                          "description": "The smoothing max bitrate (in bps) for RIST, RTP, and RTP-FEC streams.",
                          "nested_items": []
                        },
                        {
                          "name": "MaxLatency",
                          "type": "integer",
                          "description": "The maximum latency in milliseconds. This parameter applies only to RIST-based and Zixi-based streams.",
                          "nested_items": []
                        },
                        {
                          "name": "MaxSyncBuffer",
                          "type": "integer",
                          "description": "The size of the buffer (in milliseconds) to use to sync incoming source data.",
                          "nested_items": []
                        },
                        {
                          "name": "MinLatency",
                          "type": "integer",
                          "description": "The minimum latency in milliseconds for SRT-based streams. In streams that use the SRT protocol, this value that you set on your MediaConnect source or output represents the minimal potential latency of that connection. The latency of the stream is set to the highest number between the sender's minimum latency and the receiver's minimum latency.",
                          "nested_items": []
                        },
                        {
                          "name": "Protocol",
                          "type": "string",
                          "description": "The protocol that is used by the source or output.",
                          "nested_items": []
                        },
                        {
                          "name": "RemoteId",
                          "type": "string",
                          "description": "The remote ID for the Zixi-pull stream.",
                          "nested_items": []
                        },
                        {
                          "name": "SenderControlPort",
                          "type": "integer",
                          "description": "The port that the flow uses to send outbound requests to initiate connection with the sender.",
                          "nested_items": []
                        },
                        {
                          "name": "SenderIpAddress",
                          "type": "string",
                          "description": "The IP address that the flow communicates with to initiate connection with the sender.",
                          "nested_items": []
                        },
                        {
                          "name": "SmoothingLatency",
                          "type": "integer",
                          "description": "The smoothing latency in milliseconds for RIST, RTP, and RTP-FEC streams.",
                          "nested_items": []
                        },
                        {
                          "name": "SourceListenerAddress",
                          "type": "string",
                          "description": "Source IP or domain name for SRT-caller protocol.",
                          "nested_items": []
                        },
                        {
                          "name": "SourceListenerPort",
                          "type": "integer",
                          "description": "Source port for SRT-caller protocol.",
                          "nested_items": []
                        },
                        {
                          "name": "StreamId",
                          "type": "string",
                          "description": "The stream ID that you want to use for this transport. This parameter applies only to Zixi and SRT caller-based streams.",
                          "nested_items": []
                        },
                        {
                          "name": "NdiSpeedHqQuality",
                          "type": "integer",
                          "description": "A quality setting for the NDI Speed HQ encoder.",
                          "nested_items": []
                        },
                        {
                          "name": "NdiProgramName",
                          "type": "string",
                          "description": "A suffix for the names of the NDI sources that the flow creates. If a custom name isn't specified, MediaConnect uses the output name.",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "VpcInterfaceName",
                      "type": "string",
                      "description": "The name of the VPC interface that is used for this source.",
                      "nested_items": []
                    },
                    {
                      "name": "WhitelistCidr",
                      "type": "string",
                      "description": "The range of IP addresses that should be allowed to contribute content to your source. These IP addresses should be in the form of a Classless Inter-Domain Routing (CIDR) block; for example, 10.0.0.0/16.",
                      "nested_items": []
                    },
                    {
                      "name": "GatewayBridgeSource",
                      "type": "dict",
                      "description": "The source configuration for cloud flows receiving a stream from a bridge.",
                      "nested_items": [
                        {
                          "name": "BridgeArn",
                          "type": "string",
                          "description": "The ARN of the bridge feeding this flow.",
                          "nested_items": []
                        },
                        {
                          "name": "VpcInterfaceAttachment",
                          "type": "dict",
                          "description": "The name of the VPC interface attachment to use for this bridge source.",
                          "nested_items": [
                            {
                              "name": "VpcInterfaceName",
                              "type": "string",
                              "description": "The name of the VPC interface to use for this resource.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    },
                    {
                      "name": "PeerIpAddress",
                      "type": "string",
                      "description": "The IP address of the device that is currently sending content to this source.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "Status",
              "type": "string",
              "description": "The current status of the flow.",
              "nested_items": []
            },
            {
              "name": "VpcInterfaces",
              "type": "list",
              "description": "The VPC Interfaces for this flow.",
              "nested_items": [
                {
                  "name": "",
                  "type": "dict",
                  "description": "",
                  "nested_items": [
                    {
                      "name": "Name",
                      "type": "string",
                      "description": "Immutable and has to be a unique against other VpcInterfaces in this Flow.",
                      "nested_items": []
                    },
                    {
                      "name": "NetworkInterfaceIds",
                      "type": "list",
                      "description": "IDs of the network interfaces created in customer's account by MediaConnect.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "NetworkInterfaceType",
                      "type": "string",
                      "description": "The type of network interface.",
                      "nested_items": []
                    },
                    {
                      "name": "RoleArn",
                      "type": "string",
                      "description": "A role Arn MediaConnect can assume to create ENIs in your account.",
                      "nested_items": []
                    },
                    {
                      "name": "SecurityGroupIds",
                      "type": "list",
                      "description": "Security Group IDs to be used on ENI.",
                      "nested_items": [
                        {
                          "name": "",
                          "type": "string",
                          "description": "(string) ---",
                          "nested_items": []
                        }
                      ]
                    },
                    {
                      "name": "SubnetId",
                      "type": "string",
                      "description": "Subnet must be in the AZ of the Flow.",
                      "nested_items": []
                    }
                  ]
                }
              ]
            },
            {
              "name": "Maintenance",
              "type": "dict",
              "description": "The maintenance settings for the flow.",
              "nested_items": [
                {
                  "name": "MaintenanceDay",
                  "type": "string",
                  "description": "A day of a week when the maintenance will happen. Use Monday/Tuesday/Wednesday/Thursday/Friday/Saturday/Sunday.",
                  "nested_items": []
                },
                {
                  "name": "MaintenanceDeadline",
                  "type": "string",
                  "description": "The Maintenance has to be performed before this deadline in ISO UTC format. Example: 2021-01-30T08:30:00Z.",
                  "nested_items": []
                },
                {
                  "name": "MaintenanceScheduledDate",
                  "type": "string",
                  "description": "A scheduled date in ISO UTC format when the maintenance will happen. Use YYYY-MM-DD format. Example: 2021-01-30.",
                  "nested_items": []
                },
                {
                  "name": "MaintenanceStartHour",
                  "type": "string",
                  "description": "UTC time when the maintenance will happen. Use 24-hour HH:MM format. Minutes must be 00. Example: 13:00. The default value is 02:00.",
                  "nested_items": []
                }
              ]
            },
            {
              "name": "SourceMonitoringConfig",
              "type": "dict",
              "description": "The settings for source monitoring.",
              "nested_items": [
                {
                  "name": "ThumbnailState",
                  "type": "string",
                  "description": "Indicates whether thumbnails are enabled or disabled.",
                  "nested_items": []
                },
                {
                  "name": "AudioMonitoringSettings",
                  "type": "list",
                  "description": "Contains the settings for audio stream metrics monitoring.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "SilentAudio",
                          "type": "dict",
                          "description": "Detects periods of silence.",
                          "nested_items": [
                            {
                              "name": "State",
                              "type": "string",
                              "description": "Indicates whether the SilentAudio metric is enabled or disabled.",
                              "nested_items": []
                            },
                            {
                              "name": "ThresholdSeconds",
                              "type": "integer",
                              "description": "Specifies the number of consecutive seconds of silence that triggers an event or alert.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                },
                {
                  "name": "ContentQualityAnalysisState",
                  "type": "string",
                  "description": "Indicates whether content quality analysis is enabled or disabled.",
                  "nested_items": []
                },
                {
                  "name": "VideoMonitoringSettings",
                  "type": "list",
                  "description": "Contains the settings for video stream metrics monitoring.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "BlackFrames",
                          "type": "dict",
                          "description": "Detects video frames that are black.",
                          "nested_items": [
                            {
                              "name": "State",
                              "type": "string",
                              "description": "Indicates whether the BlackFrames metric is enabled or disabled..",
                              "nested_items": []
                            },
                            {
                              "name": "ThresholdSeconds",
                              "type": "integer",
                              "description": "Specifies the number of consecutive seconds of black frames that triggers an event or alert.",
                              "nested_items": []
                            }
                          ]
                        },
                        {
                          "name": "FrozenFrames",
                          "type": "dict",
                          "description": "Detects video frames that have not changed.",
                          "nested_items": [
                            {
                              "name": "State",
                              "type": "string",
                              "description": "Indicates whether the FrozenFrames metric is enabled or disabled.",
                              "nested_items": []
                            },
                            {
                              "name": "ThresholdSeconds",
                              "type": "integer",
                              "description": "Specifies the number of consecutive seconds of a static image that triggers an event or alert.",
                              "nested_items": []
                            }
                          ]
                        }
                      ]
                    }
                  ]
                }
              ]
            },
            {
              "name": "FlowSize",
              "type": "string",
              "description": "Determines the processing capacity and feature set of the flow. Set this optional parameter to LARGE if you want to enable NDI outputs on the flow.",
              "nested_items": []
            },
            {
              "name": "NdiConfig",
              "type": "dict",
              "description": "Specifies the configuration settings for NDI outputs. Required when the flow includes NDI outputs.",
              "nested_items": [
                {
                  "name": "NdiState",
                  "type": "string",
                  "description": "A setting that controls whether NDI outputs can be used in the flow. Must be ENABLED to add NDI outputs. Default is DISABLED.",
                  "nested_items": []
                },
                {
                  "name": "MachineName",
                  "type": "string",
                  "description": "A prefix for the names of the NDI sources that the flow creates. If a custom name isn't specified, MediaConnect generates a unique 12-character ID as the prefix.",
                  "nested_items": []
                },
                {
                  "name": "NdiDiscoveryServers",
                  "type": "list",
                  "description": "A list of up to three NDI discovery server configurations. While not required by the API, this configuration is necessary for NDI functionality to work properly.",
                  "nested_items": [
                    {
                      "name": "",
                      "type": "dict",
                      "description": "",
                      "nested_items": [
                        {
                          "name": "DiscoveryServerAddress",
                          "type": "string",
                          "description": "The unique network address of the NDI discovery server.",
                          "nested_items": []
                        },
                        {
                          "name": "DiscoveryServerPort",
                          "type": "integer",
                          "description": "The port for the NDI discovery server. Defaults to 5959 if a custom port isn't specified.",
                          "nested_items": []
                        },
                        {
                          "name": "VpcInterfaceAdapter",
                          "type": "string",
                          "description": "The identifier for the Virtual Private Cloud (VPC) network interface used by the flow.",
                          "nested_items": []
                        }
                      ]
                    }
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}